{
    "username": "1maco",
    "contributions": [
        "In response to 'remember when 100k/yr seemed like it would make all your problems disappear? then you realize you can't even afford rent in a decent part of town for that.', a user said: 'There is precisely 3 counties in the United States for which that statement is remotely true.'",
        "In response to 'and those three counties are where all the good jobs are', a user said: 'That’s just not true. Like you can afford an apartment (or condo) in like Queens or Middlesex County MA (or even swaths of Boston proper) easily  on 100k income'",
        "In response to 'You can call me picky but I don't want to live in those places.', a user said: 'Middlesex County Massachusetts has literally like the 3rd richest twin in America in it.\nIf\nBoston\nand\nNew York\naren’t where the good jobs are, where are they?\nLike fine you don’t like NYC or Boston and don’t want to live there, but then Certainty 100k is a lot of money if you want to live in I don’t know, Milwaukee?'",
        "In response to '100k in LA, Seattle, San Francisco (and by extension the dozens of bay area cities) just doesn't go as far as it did even 15-20 years ago.\nThere aren't a lot of 100k-paying jobs in towns where you can still get a 2br apartment for under 1k/mo.\nYou don't even need to take my word for it:\nhttps://www.rentcafe.com/average-rent-market-trends/us/wa/seattle/\n-- so $2200/mo average for ~700sqft. 2200/mo, on the 33% rule, means a net pay of 6600/mo, which means a gross of about 8300, which is about 100k/yr. That salary literally buys you the mean housing for the general area, so it seemingly follows that the 'decent' parts of town would be more expensive, QED. And the 33% rule is too much IMO, it should be closer to 25% of take-home. Applying that math to our fictional average dwelling would be 2200*4/.8 (.8 for tax estimation purposes), *12 for yearly rate, gives us 132k/yr. There's a whole 30k of income difference based on your comfort level of housing-to-pay ratio.\nAnd this assumes it's just you, and you're cool with a tiny apartment with 1 bedroom and likely no outdoor space, parking extra, etc etc. Just in my neighborhood, there literally isn't a house on the market for under 1.4m dollars right now. Condos and townhouses, sure, but not standalone housing. The natural consequence of increased density is dramatically higher prices for owning actual land.', a user said: 'The 33% rule is not gross, it’s net, plus “decent” is like 85% of Seattle not less than half the city. And 2200 is average rent, not average 1 bedroom.\nSo yeah if you want a big apartment, in the best neighborhood, and spend a small fraction of your income yes you need to make lots of money.\nPlus\nSeattle\nand King County are not really close to coterminous.'"
    ]
}