{
    "username": "1rexas1",
    "contributions": [
        "In response to 'Original Post: Homer Simpson (1995) explaining quiet quitting 27 years before people thought quiet quitting was a new thing. [External Link]: https://www.youtube.com/watch?v=jYXzHjbfMDk', a user said: 'Except \"quiet quitting\" isn't a thing. If you're showing up to work and doing the job you're paid to do, then you aren't quitting. You're literally doing your job. It's an incredibly arrogant, upper class American notion to think that everyone who works should necessarily go above and beyond what they are paid to do and come up with a derogatory term for people who don't.'",
        "In response to 'He says \"half-assed\" which I feel like implies NOT completing all your job duties/responsibilities.\nYou're comparing \"doing your job\" vs \"going above and beyond\"\nThat's not what Homer was talking about here.', a user said: 'The term \"quiet quitting\" does not refer to people who are failing to fulfill the responsiblities of their job, it refers to people who just do that and don't go beyond it.'",
        "In response to 'lol Well the way that you define it, yeah that just sounds like going to work every day and doing your job.', a user said: 'Because that's exactly what it is, there's already terms for people who are underperforming, like \"underperforming\". This term has come in to refer to people who don't go above and beyond, as an attempt to standardise doing so and shame those who don't.'",
        "In response to 'This is moronic. Obviously “quiet quitting” refers to a deliberate reduction in effort by any individual to some level below their own normal personal standards, for their own reasons. And obviously, this phrase was coined by journalists and not by big bad greedy corporate America. Obviously.', a user said: 'It's a derogatory term aimed at shaming people who successfully do their jobs (because anything less would result in disciplinary action and termination), and encouraging a culture where it is expected of workers to go above and beyond what they are expressly paid and contracted to do as standard.'",
        "In response to 'No, it’s clearly not.', a user said: 'Okay, I'm going to give you three definitions:\n1) Wikipedia: \"Quiet quitting is an application of work-to-rule, in which employees work within defined work hours and engage solely in activities within those hours. The philosophy of quiet quitting, despite the name, is not necessarily connected to quitting a job outright, but rather doing exactly what the job requires. Proponents of quiet quitting also refer to it as acting your wage.\"\n2) Dictionary.com: \"Quiet quitting is an informal term for the practice of reducing the amount of effort one devotes to one’s job, such as by stopping the completion of any tasks not explicitly stated in the job description. The term implies that this is done secretly or without notifying one’s boss or manager.\nQuiet quitting doesn’t actually refer to quitting a job. The term is used in varying ways that refer to different methods of reducing productivity or the amount of work one performs.\nThe practice is often based on a rejection of the pressure or expectation to “go above and beyond” in one’s role as the norm (especially when not being fairly compensated for such tasks and responsibilities). It often involves abandoning ambitions for advancement.\"\n3) LinkedIn: \"In a nutshell, \"quiet quitting\" is about rejecting the notion that work has to take over one's life and that employees should go above and beyond what their job descriptions entail. According to Metro, this can take many forms – including turning down projects based on interest, refusing to answer work messages outside of working hours or simply feeling less invested in the role.\"\nAll taken from the top results on google for \"define quiet quitting\".\nPlease explain how I'm wrong?'",
        "In response to 'Well mainly you’re wrong in that you’ve asserted that the term was concocted by some corporate gremlins in order to shame people. The definitions you’ve shared reflect the opposite.', a user said: 'I don't think you understand what you've just read.'",
        "In response to 'I think it applies better to certain roles. For example I'm a software QA engineer, and while our main responsibility is to QA the work being done we also have several other responsibilities likes contributing to process improvements, writing test cases for regression, improving old test cases to help new folks.\nThe thing is that these other responsibilities only happen when we have some extra time and so there's not always as rigorous requirements to make sure people get it done, and some just forgo these responsibilities because irs harder to be held accountable.\nThat is what quite quiting is imo, which in that scenario is absolutely just someone not fufilling their duties', a user said: 'If someone isn't fulfilling their duties then there's already terminology for that, like underperforming etc. \"Quiet quitting\" is a derogatory term that's recently made it into workforce vernacular that's aimed at shaming people who do their jobs and don't go beyond that, by people who are attempting (apparently succesfully) to get their workforce to think going above and beyond their pay grade is standard.\nIf, in the scenario you describe, someone is failing to perform their duties then \"quiet quitting\" doesn't apply, because they're not actually doing the job they are paid to do.'",
        "In response to 'aimed at shaming people who do their jobs and don't go beyond that, by people who are attempting (apparently succesfully) to get their workforce to think going above and beyond their pay grade is standard.\nI got a promotion this year by effectively going above and beyond, and proving to my supervisor that I was ready for a new position. It came with a pretty nice raise, too. Obviously, going \"above and beyond\" is a bit subjective. The way I would describe it is that I took on additional responsibilities and did my best to work through things and make decisions on my own. I didn't come in on weekends, or any crap like that.\nMaybe it isn't \"standard\", but if you want to advance, that is part of it. I just don't think there is anything inherently wrong with putting forth extra effort in hopes that it will eventually turn into something worthwhile.', a user said: 'Yeah I don't disagree with you, but there's nothing wrong with not advancing (whether it's because you can't or you don't want to), and there shouldn't be a derogatory term for people that \"just\" turn up and do their jobs. That's the point I'm trying to make anyway :p'",
        "In response to 'I think the distinction is attitude, underperforming can be a result of inexperience or life factors outside of work as opposed to consciously not performing additional responsibilities because you know you can get away with it and don't care.\nEdit: I don't think you guys understand the nuances of certain professions.', a user said: 'I think so, part of what I'm contesting is that there's nothing wrong with not performing additional responsibilities. It's not necessarily a case of \"getting away with it\", it's more a case of \"that's not my job\". It's a fine line for sure, but the term is clearly derogatory and aimed at making it seem wrong to \"just\" do your job, which is literally what you are paid to do.\nI'm saying this as a manager in a large organisation who got there by going above and beyond, and is still doing so in the hopes of continuing to progress. People I work with fit the definition of this term, but I strongly disagree with the characterisation because there is absolutely nothing wrong with the work they do. I'm perfectly happy for people to be at work when they're supposed to be, do the work they're supposed to do, pass on the work they're not supposed to do to someone who is, not do overtime, not be expected to deal with work when they're not actually there etc. As long as they're not underperforming or causing issues within the team, then that's fine by me. There is a line, like deliberately only doing the easiest work, but that's a breach of protocol that can become a disciplinary offense, so doesn't seem to fit the definition of \"quiet quitting\".'",
        "In response to 'It's called quite quitting because mentally you've already quit the job.  You're treating the job like it's perpetually your last two weeks as you do the minimum on everything.', a user said: 'No, you haven't. Doing the minimum that you are paid to do is still literally doing your job. Doing the minimum on everything doesn't mean you've mentally quit the job, you are still acting within the realms of exactly what you are paid to do. If that's a problem, then the issue isn't the worker, because (I want to keep stressing this) what they are doing still complies with their job description. The issue is that their job description (and associated job title, salary, perks etc) aren't reflecting the job that you need them to do.'",
        "In response to 'Maybe it's a difference in what we do professionally, but there is definitely a difference in doing your actual job and doing the minimum to squeek buy in my field.', a user said: 'There absolutely is a difference, 100%, no disagreement on that. But that doesn't mean the person doing the minimum isn't doing their job, as long as they're still doing what they're paid to do then they aren't quitting. Back to my point about \"quiet quitting\" not being a thing. It alliterates, and I'm sure the people who thought it up feel very superior, very smug, very clever, but logically it doesn't stand up.'",
        "In response to 'To me it seems more like quiet self-sabotage.\nI’ve been with my employer for 19 years and a hiring manager for 6.\nCautionary tale:\nAn employee of mine has been there 8 years and has been using the quiet/quit, work-to-rule approach from day one.\nThey have now forwent $7/hr in wage increase by failing to meet raise expectations. Instead of making $26/hr, they are just below $19/hr.\nNew hires are now starting at a higher wage because COL has increased faster than this person’s wage increases.\n1) 8 years in, makes less than first-day employees.\n2) Will take 7 years of slightly more than bare minimum and no more write ups just to get to the wage they should already be at today.\n3) This person has a 45 minute commute one-way just to work hard at not working hard… at an employer’s discount.\n4) oof', a user said: 'Yeah this is illegal in quite a few countries and for good reason.'",
        "In response to 'Which part? The employee is making well above min wage. They have failed to meet raise requirements for the bulk of their career.', a user said: 'In many countries it's illegal to pay people a different wage for doing the same job, and if your starting salary is now more than that person's wage then we're getting into that territory and beyond the realms of performance based pay.\nSounds to me more like you're trying to quietly fire the person without actually firing them. Obviously I don't know anywhere near enough about the situation to judge properly but your comment doesn't put you in a very good light, and isn't as clever as you think it is.\nThis in particular \"This person has a 45 minute commute one-way just to work hard at not working hard… at an employer’s discount.\" sounds very entitled, very pompous, not to mention your 4th \"point\".'",
        "In response to 'No we don’t have grounds to terminate them as they haven’t reached that point in progressive discipline.\nAgain, this isn’t employer discrimination. The employee was started at the same wage scale others did 8 years ago.\nThose making more have done so be earning wage increases. This employee has chosen not to pursue those increases. That’s why I call it self-sabotage.\nDo you mean to say that if an employee in one of those countries gets a pay raise, that it’s illegal not to give those same raises to the rest of the employees?', a user said: 'That's not what you said - you said new employees are now starting at a higher wage, so the base salary for that position has gone up, and this person's salary hasn't gone up to meet it. Therefore you are hiring new people to do the same job at a significantly higher rate by your own admission, so if one of those people happened to come in with exactly the same attitude as this guy then they would still be getting paid $7 an hour more than them. This is illegal in quite a few countries.\nIt's different to performance related pay, because that comes on top of the base wage that everyone is entitled to. If that base wage goes up then yes, everyone is entitled to that wage as a minimum guarantee.\nAgain, they haven't \"quietly quit\". By your own admission they've been with you for 8 years and have successfully done their job well enough to stay above whatever metric you judge performance by. So by definition they are doing their job to a satisfactory standard.'",
        "In response to 'The starting scale is between $17-$19. Said employee is above at $18, but most new hires are offered $19/hr to retain quality candidates. Firing people is more difficult than some might assume.\nOur employer is exploring wage adjustments for those that started with the company when the entry wage scale was lower.\nThis employee may get a slight bump for that reason, but the regional manager may also point at this persons file and deny it, which would be legal and ethical in this case. It would be based on standing with the company and hours worked.', a user said: 'Now you've changed your story - your original comment says, and I quote \"New hires are now starting at a higher wage because COL has increased faster than this person’s wage increases.\" I gather that this means your base pay has increased, which the comment you've just made contradicts, so now I'm not sure what's going on :p\nAlso, I'm not saying this is necessarily illegal wherever you happen to be. In my country, if the starting salary for a job is increased and the people currently doing that same job don't get an increase to match, then that is creating a pay gap and is illegal. If other employees get a wage adjustment for inflation, which seems to be what you're describing, and you grant that to people based on performance then that would also be illegal in my country (because you've increased the base pay and selectively left people behind, so they're now earning less than base).\nFrom what you've said, this person's file would say that they have successfully done their job for 8 years. If they'd failed to do that, then they you would have cause to fire them, but you haven't so presumably you don't. So you're now saying that a regional manager would look at that and think it cause to deny them a wage increase that is being given out as standard? Morally bankrupt at best, but from what I understand that's just America.\nIt's getting away from the point of my original comment, which is that \"quiet quitting\" isn't a thing. If this guy has shown up to work on time, worked his contracted hours and in that time worked to the standards that their job description requires for eight years, then by absolutely no stretch have they in any way quit. By definition they have done their job.'"
    ]
}