{
    "username": "1UpBebopYT",
    "contributions": [
        "In response to 'It feels really weird in the corporate world right now. My company is making record profits but is cutting costs wherever they can. We had layoffs, and benefits have been reduced significantly, all while our sales have been growing exponentially.', a user said: 'Same here.  Major Fortune 500 company.  My circle of me and another 100 or so developers have constantly out performed, met insane goals, over delivered, and met every single crazy idea or switch this company has done the past year and a half. About a year and half ago the company decided to just put the pedal to metal on everything.  We handled it, expecting it to calm down...\nUpper management has been saying how great everything has been going and how impressed they are with us in the face of these radical changes, yadda yadda.  The highest productivity our software division has had ever.  Oh, we know we are under staffed, but no more hiring until mid to late 2024.  Oh, and we are restructuring, for the third time in 4 years, changing teams and responsibilities around and bringing more people back to office, because \"We are always looking for ways to improve.\"   What?  Nothing makes any sense.'",
        "In response to 'I cant speak for all depts/orgs but in mine (tech), you're VERY much carried by your top performers.  I could accept the above logic if your top performers weren't worth a 2x+ multiple of your mediocre performers.', a user said: 'Tech is 100% this.  Get one senior lead dev, who has no life and works until 1am everyday, and pair him with 5 juniors with under 3 years experience, you have an all star team.  They will outperform a group of 10+ mid developers.  Every. single. time.\nCompanies really don't like this though because that one dev has so much power, and if they take their ball and go home, it can absolutely wreck an entire department.  My company has really been pushing this \"swarm\" mentality.  Where they don't want leads or anything anymore.  They want tasks to just be worked on simultaneously by all so that knowledge is always shared so there is never a knowledge gap because they are absolutely terrified of the lead dev power dynamic.  Every task is a paired task.  It's terrible and simple tasks take entire weeks.'"
    ]
}