{
    "username": "28carslater",
    "contributions": [
        "In response to 'We can hand out lead for free if they want.\nI mean, if we are going back to gilded age mentality, then lets do it, but the working class had far more, shall we say, *spicy* ways of thinking back then as well.\nThe rich seem to have forgotten worker rights and unions were the COMPROMISE, not the problem.', a user said: 'but the working class had far more, shall we say, *spicy* ways of thinking back then as well.\nIndeed they did, imagine if the Gilded Age 1%ers had the Patriot Act or access to the Orwellian state being put in place. Hell if the\nsmart\nphone existed, imagine the amount of propaganda they could push or data they could pull from it on the proles' activities.\nTechnology is what will allow them to reimplement the 18th century (or earlier), check out Catherine Austin Fitts' body of work on the subject.'",
        "In response to 'That’s the whole point of America.\nAmerica in reality is just a breeding ground for people to be groomed to be the perfect workers to be exploited by businesses.\nThis message of worshipping “hard work” and making more $ is rammed down our throat in every facet of life the day we are born. Americans are brainwashed into this cult like mindset that all that matters in life is work.\nCorporations spend billions of dollars pumping this message into the culture, and our education system has also slowly been getting taken over by corporate control as well.\nThis is why the mentality of excessive spending is pushed, this is why Americans are loaded to debt up to their eyeballs. It makes them easily exploitable workers.\nIn America businesses have more rights and freedoms than human beings.', a user said: 'America in reality is just a breeding ground for people to be groomed to be the perfect workers to be exploited by businesses.\nBingo. I have been saying since at least 2008, the United States of America is not a real country it really\nis\na corporation likely owned by European aristocracy. Viewing the nation through that lens really helps make sense of a lot of things.'"
    ]
}