{
    "username": "28smalls",
    "contributions": [
        "In response to 'Because jobs drill the \"above and beyond\" crap\nSome don't give you a raise unless you do, some make you feel bad of you dont. At least whete I'm at now there's a big bonus for going above and beyond\nIt's so annoying, we need to normalise doing your job fully but not beyond your job.', a user said: 'What I've found is that going above and beyond will quickly shift to being part of the baseline for doing the job.  I currently work in retail, and see how making people stay late has become the new standard instead of hiring more workers on our shift.'",
        "In response to 'Answer: to add to already great answers there is another aspect of \"quiet quitting\". Employers now are crying because they used to dump more responsibilities (quite often way more than the employee contract specifies) on their workers and workers had to oblige due to fear of losing the job or being passed on the promotion if they don't.\nNow the workers fight this back by saying \"not my job\" and refuse to accept additional work without compensation. Which is fair enough, but employers are now crapping their pants because employees are not afraid of being fired if they don't take more work on their shoulders. Workers have long realized that going above and beyond does not give a single benefit. No raise, no bonus, no appreciation. So why would they \"exceed expectations\" if there is literally no reward for it? Employers are always happy when someone is doing more than they are paid for, because that's means they get more from an employee than they are paying for. It surely helps that the job market is now favouring the workers, so if a worker feels they are not appreciated or are being threatened with firing they can just quit and change job or workplace.\nIn short, the\ncake\ncarrot is a lie and the stick is broken.\nSo the employers came up with this utter nonsense called \"quiet quitting\" to basically complain that the workers are not giving the job more than they are paid for. It's propaganda to make workers feel bad for refusing to be abused.', a user said: 'The worst part of going \"above and beyond\" is that it doesn't take long for that to become the new expected minimum for a given job.  I see it in retail.  Stay late in your shift to help people finish up, then it becomes a problem when you want to leave on time.'"
    ]
}