{
    "username": "2burnt2name",
    "contributions": [
        "In response to 'Always found the expression disingenuous.\nHow is doing the agreed upon amount of work for the agreed upon amount of money \"quitting\".\nThe first time I heard about \"quiet quitting\" I thought it was people who kept coming to their job but did nothing until they where fired. But the reality is much more toxic.', a user said: 'If anything my coworkers have actually been quiet quitting since COVID by the definition corporations want to define it.\nMental health group homes, so there is a minimum expectation of how much attention you are giving clients =policy of no personal cellphone use among other things. My sub supervisor role is supposed to be to know how to do a laundry list of tasks and be a backup, and teach in and elevate a coworker to be in charge of x tasks so they can be point on those tasks so there is less on my hands so I can do the house tasks that only my role is expected and paid to do.\nInstead everyone uses any and all opportunity when our boss is away from site to be on their phones and me trying to train tasks/ prevent mistakes on tasks we all must do from occuring again is met with the \"is it incompetence or intentional malice\" when I am trying to retrain them and get a thousand yard stare and \"okay.... okay... okay...\" and do it again or not do x task I assigned them.\nWhen you are passing medications to mentally ill clients, medication errors are a pretty huge deal. I even had a coworker on night shift, whose job description is to count the medications to make sure we day shift didn't screw up figure out who made an error, call them up to confirm if it was or if a med got destroyed or something, admitted when I found a med error that they counted and they should have noticed, that they did the count, noticed it was off and did nothing because their interpretation of their job description was that they were not paid to hound others down to find out. I'm sure after I reported this to our boss their story changed because us being unionized regardless, that should have been enough to can their ass on the spot if they admitted that faulty ass logic for putting vulnerable adults at risk of over and underdosing.'"
    ]
}