{
    "username": "32InchRectum",
    "contributions": [
        "In response to 'Not just pay. Benefits have gotten much worse over time, too. Healthcare coverage used to be reasonable and actually helpful. Now the coverage itself is expensive and barely covers anything.', a user said: 'This site doesn't like to hear it, but by legally mandating people buy private insurance instead of providing a single payer option Obamacare effectively gave for-profit health insurers license to do whatever the fuck they want.  It's great that they can't charge you extra for pre-existing conditions now, but the flip side is they can just charge everyone what they would have charged for pre-existing conditions instead.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'Yeah, and that's probably reduced the benefit, but it hasn't negated it and the fact that there was a penalty allowed them to deeply entrench themselves.\nI know liberals love Obamacare and I'll cede that in a vacuum and without viewing long-term consequences it's probably better than doing absolutely nothing, but it's fucking crazy to me that anyone considers this a success.  If a major medical event would bankrupt you and destroy your life before Obamacare it'll probably still do that now.  We're still paying way too much for terrible coverage, we still have a healthcare system that prioritizes the wants of the wealthy above the needs of the masses, and for-profit health insurers have even more control over how our government is ran than they did before.\nI was working for Cigna around the time of Obamacare.  They fucking loved it - to them, this was a huge gift from the US government.  A good solution should not be seen as one of the main companies responsible for and benefitting from the problem as a gift.'",
        "In response to 'Original Post: Analysis Shows 'Quiet Fleecing' of US Workers—Not 'Quiet Quitting'—Is the Real Problem | \"Workers are more productive than ever, but their pay hasn't kept pace while top 1% wages have skyrocketed,\" says the Economic Policy Institute. [External Link]: https://www.commondreams.org/news/2022/09/09/analysis-shows-quiet-fleecing-us-workers-not-quiet-quitting-real-problem', a user said: 'This has been true for decades, though.  If wages went up with profitability we'd live in a world where all of our needs and wants are met.  Wouldn't have billionaires larping as astronauts, though, so I suppose there's that.'"
    ]
}