{
    "username": "420-firemama",
    "contributions": [
        "In response to 'Original Post: I realized I'm in the \"quiet quitting\" phase of my relationship. I watched a YouTube video last night called \"Are Women Quit Quitting Their Marriages?\" by Frankly. It's essentially a curated compilation of TikToks of women talking about themselves and others quiet quitting their relationships, the signs, and why.\nIt was very eye-opening because it made me realize that's the stage of my relationship I'm in. I'm tired of the conversations that never result in change, I'm tired of the defensiveness when bringing up a concern, I'm tired of the dismissiveness when trying to help, and tired of feeling required to react a certain way to things he says. The straw that broke the camel's back was a text conversation I had with my boyfriend a few weeks back, which I previously posted about if anyone wants to go read it. It really solidified how little he cares about my responsibilities and thinks his wants should supercede them and will never show the slightest interest in anything I care about.\nA lot of the TikToks in the video mention how men are usually \"blindsided\" when their partners just up and leave, when the reality is they didn't care to notice the signs since their partner's unhappiness wasn't directly affecting them. I've been emotionally and physically pulling back from my own relationship by being less physically and emotionally present: Not calling him in my free time, not going to his place as often, choosing to hang out with friends and family instead, not engaging with his playful banter (which I find annoying), slowly moving anything of mine out of his apartment, giving minimal effort in the conversations we do have, etc. I'm basically treating him like a friend at this point. And not even a close one.\nA lot of people will probably read this and ask \"Why not just break up?\" Well, the comments of the video explained that perfectly! Quiet quitting the relationship is an exit strategy for women so they can physically, emotionally, financially etc. prepare for the end of the relationship, then leave when it's safe and will have minimal impact on them. I feel if I broke up with him today, I would feel nothing. The only thing I would miss is our mutual friend who I met through him, and the Palworld base I built in a server he owns.\nThe relationship is already dead as far as I'm concerned. I just need to pull the trigger and make it official.', a user said: 'I did this. We were together for 13yrs, married just over 10, 3 kids together. The straw that broke my back was being told I had to abort my late term pregnancy (24wks, and stood over me to listen as I called around to be told what I already knew, it wasn't possible, and I didn't want that anyway) because he didn't want more kids. Also refused to get snipped or allow me to have the surgery. It took time to build a support system and financial backbone to support myself and 3 kids, but I did it and never looked back, only revel in my freedom'",
        "In response to 'Sorry, you're saying you were 6 months pregnant and he wanted you to have an elective (e.g. healthy pregnancy) abortion????? At 6 months????', a user said: 'Yes, that is exactly what I'm saying. We found out at 6mos, it was a surprise pregnancy following a healthy, live birth a few months earlier, and decided to inform me AFTER I told him I think I'm pregnant because I felt a KICK against my hand after holding my belly because I felt nauseous, that he only had wanted two. His \"unwanted\" child saved me in more ways than I can say, mostly in opening my eyes and lifting the veil. He'll be in Jr high in a couple years 💜'"
    ]
}