{
    "username": "7figureipo",
    "contributions": [
        "In response to 'I saw him also. Acted pretty smug. About what, I do not know.', a user said: 'Favs is the quintessential product of political privilege. His dad was a member of the NH State House, and (basically) his first job out of college was working for the Kerry campaign. He's always known a life of privilege, and grew up in a Republican household. He's emblematic of everything wrong with the Democratic Party today.'",
        "In response to 'I didn’t know any of this but it certainly matches his vibe.', a user said: 'That's one of the reasons he's so smarmy and acts like a bully. He was born on third base and thinks he hit a triple, and that because his connections got him into politics early that it means he knows anything.'",
        "In response to 'If Harris is serious about continuing her career, then she should absolutely run for Governor of California in 2026. She probably starts as a prohibitive favorite for one of the most powerful political jobs in the country. If she does well in the role, she could credibly take another shot at the White House in 2032 or 2036.\nIf she just chills out for a few years and tries to run again in 2028, I don’t see any way that she breaks through the field. Who would want to run the previous loser again when there will be a long list of new candidates to choose from?', a user said: 'Please, no. Harris demonstrated that she's just the typical democratic politician. We need someone who actually has an ideology and beliefs and who will fight for them here.'",
        "In response to 'Original Post: [Discussion] Pod Save America - \"Is Biden Quiet Quitting?\" (12/17/24) [External Link]: https://crooked.com/podcast/is-biden-quiet-quitting/', a user said: 'Oh my god, the discussion on \"cursing\" is just so....modern Democratic Party.\nFavs is playing the part of the establishment shill well during that segment: he presents a false alternative (\"act just like Republicans\") in comparison to people telling him that they don't want republican-lite\npolicy\n. There's an actual alternative that's legitimate: to stake out a position--an\nactually progressive/left populist one\n--and also show some\nfight\nfor it. That doesn't require candidates to sound like a drunken sailor or to ramble on about fictitious serial killer cannibals. Jon either knows that and is playing dumb, or else he really is that stupid.\nAlso, \"cursing\" has no moral value; it's neither good nor bad to curse or to not curse. It isn't \"better\" to not curse.'"
    ]
}