{
    "username": "90percent_crap",
    "contributions": [
        "In response to 'Original Post: I for one am grateful for APDs quiet quitting bc my vehicle tags are 3 years expired with no plans for renewal on the horizon. Living dangerously over here.', a user said: 'Lack of traffic enforcement (which has actually ticked up the past year) isn't a matter of quiet quitting. The traffic enforcement unit of APD was\ncompletely disbanded\n(along with the Park patrol unit) in 2020 following the \"defund the police\" outcries and subsequent staffing shortage. (Whether or not that was an appropriate decision by APD leadership is a different topic.)'",
        "In response to 'The traffic enforcement unit of APD was completely disbanded\nSource?\nThis\nsays \"\nsome\ntraffic enforcement units have been dismantled to shift more officers to patrol duties\" (2022)', a user said: 'Your source (KUT) makes a nebulous statement without numbers. (And frankly I think that's intentional.) Look at the data on actual enforcement in that article - 90% drop in tickets in 2021 compared to 2017. (And be aware, any LEO can write a ticket, you don't have to be on traffic patrol to write them.) Here is\nKVUE's breakdown of the cuts\nand (at the time) Chief Manley's statements on the staffing changes. And here is\nanother KVUE article\nthat explicitly states that traffic patrol was defunded. (\"The remaining $49 million in cuts will defund APD units including mounted patrol, traffic enforcement and lake patrol. That money would be put on hold as council members \"reimagine\" public safety over the course of a year.\") Now tbf, the total budget was later \"restored\" per state directive but we don't really know\nhow\nand\nwhere\nthat money was re-allocated. So regardless of the data, which I think I've supported here - any daily driver in Austin the last several years knows that traffic enforcement went to nil during the pandemic years, and that the result was a significant increase in reckless driving across the city (and the KUT crash fatality data is one data point to confirm it).'",
        "In response to 'Let me guess. They kept their quasi-military units, didn’t they?', a user said: 'Yes? I guess to be more precise, traffic enforcement was disbanded except for the Mad Max unit which required the quasi-military gear to be maintained. /s'"
    ]
}