{
    "username": "_CoachMcGuirk",
    "contributions": [
        "In response to 'I did this. We were together for 13yrs, married just over 10, 3 kids together. The straw that broke my back was being told I had to abort my late term pregnancy (24wks, and stood over me to listen as I called around to be told what I already knew, it wasn't possible, and I didn't want that anyway) because he didn't want more kids. Also refused to get snipped or allow me to have the surgery. It took time to build a support system and financial backbone to support myself and 3 kids, but I did it and never looked back, only revel in my freedom', a user said: 'Sorry, you're saying you were 6 months pregnant and he wanted you to have an elective (e.g. healthy pregnancy) abortion????? At 6 months????'",
        "In response to 'Yes, that is exactly what I'm saying. We found out at 6mos, it was a surprise pregnancy following a healthy, live birth a few months earlier, and decided to inform me AFTER I told him I think I'm pregnant because I felt a KICK against my hand after holding my belly because I felt nauseous, that he only had wanted two. His \"unwanted\" child saved me in more ways than I can say, mostly in opening my eyes and lifting the veil. He'll be in Jr high in a couple years 💜', a user said: 'I'm glad that snapped you the fuck back to reality cause that's almost the craziest thing I ever heard'",
        "In response to 'I get this concept, and definitely remember reaching this point when I was married. But there's one thing here that I don't get. It doesn't sound like you live together (you mentioned picking up your things from his apartment). Why would you not just break up? This quiet quitting, slow fading, etc, I get when there are a lot of logistical loose ends to tie up, but I'm not sure I get why it would be preferable to just breaking up in situations where everyone involved has separate addresses already.', a user said: 'She's codependent and a fixer and didn't/doesn't want him to be alone.'"
    ]
}