{
    "username": "aaabigwyattmann2",
    "contributions": [
        "The corporate owned media the last few days is losing it over \"quiet quitting\". just remember - do the absolute minimum required by your job. they cant do shit. [External Link]: https://i.redd.it/hqym09xm89j91.jpg",
        "In response to 'That term was created by corpoverlords to justify not paying a living a wage, we should stop repeating it. Act your wage.', a user said: 'Man I love it.. they wont ever call it that. It reminds people that you arent quitting - just doing as much as you are paid for.\n\"Act your wage\"'",
        "In response to 'Original Post: The corporate owned media the last few days is losing it over \"quiet quitting\". just remember - do the absolute minimum required by your job. they cant do shit. [External Link]: https://i.redd.it/hqym09xm89j91.jpg', a user said: 'Links to recent cope:\nhttps://nypost.com/2022/08/21/can-i-discipline-my-employees-who-are-quietly-quitting/\nhttps://www.bloomberg.com/news/articles/2022-08-19/what-is-quiet-quitting-is-it-a-good-idea-pros-and-cons-of-latest-tiktok-trend'",
        "In response to 'Corporate Manager here. I have found great success in ENCOURAGING \"quietly quitting\" (or simply just doing the job as described). Its allowed my team to simplify their workflow, focusing on the most important elements (including what is most important for THEM). They are more satisfied in their work, performing better across all metrics. And they're simply having more fun collaborating with one another. Do less! This is the way.', a user said: 'Agreed. If a corporate entity cannot survive with happy people it cannot survive period.'",
        "In response to 'Boss: \"If you go above and beyond then you'll get a promotion and a pay raise\"\nEmployee: \"Alright bet.\"\nGoes above and beyond for let's say, a year\nEmployee: \"Okay where's my promotion and pay raise?\"\nBoss: \"You've become too valuable to the company at your current position, so we can't afford to promote you and pay you more.\"', a user said: 'Or better yet: \"despite your hard work, which everyone acknowledges, the company did not meet the boards target of 12% revenue growth and we need to let some people go. Luckily, we have decided to keep you on!\"'"
    ]
}