{
    "username": "Acceptable_Solid_936",
    "contributions": [
        "In response to 'I work in a union shop, and when my supervisors piss me off I do\nexactly\nwhat I'm told. . . . . . . And\nONLY\nwhat I'm told.\nWorking as instructed still means you need to be instructed.\nI also regularly admonish new hires for working off the clock. They don't start paying us until exactly start time, so if you come in early, even if you punch in, they don't pay you until you were scheduled to start.\nI think this is a stupid rule, so when I get there early I sit on the conveyor belt that is required for work to happen and play on my phone. They can't turn the belt on if someone is on it, so if they want to start working they have to ask me to move.', a user said: 'I worked union for a brief period. 4 days a week no over time and a 60 mile drive one way to work. The pay seemed decent. Starting out at almost 17 an hour. Between insurance, dues, and the commute to work I was only taking home maybe 500 and some change. The company we  subcontracted for decided to give us a \"cost of living raise\" a whooping 87 cents. Right after that inflation hit so the monthly dues went up, along with insurance, gas prices etc. So basically fucked out of more money. The company tried to tell us we were taking too long of breaks and that they were doing us a \"favor\" by \"allowing\" us to take our state required two tens and a thirty. I laughed and continued to take my breaks. The whole time all of us treated like shit by some scabs that work for a fairly large anti union construction company outside of montana. One of the men who worked for said company who was not much older than myself decided to try and make everyone end their break early. I looked him dead in the face and told him, \"you know people fought and died here in kentucky for these breaks right?\" He looked at me dumbfounded and proceeded to not say a thing the rest of the break. We all proceed to harrass the union hall buisness manager, asking him why they would say they could take our breaks away etc. The following week they renegged that statement but took off the sign for the paid time off stuff off the mandatory workers rights board. Even the older members of the hall said \"the rules are different here\" \"they can do what they want\" and all sorts of excuses for the foul way we were constantly treated. I'm all for unions if they actually do union things and dont just let people get fucked over to line their pockets. ( I was part of a self governing hall of a larger international). I eventually got tired and left that shit show. After telling the buisness manager I needed some place closer or with more hours because I was falling behind on bills. He would constantly tell me that he didnt have any work, but every single fuckimg hall meeting he would talk about all the new contracts they've picked up. I know that scab company is still fucking over the hall I was in along with the even bigger company they are contracted to that requires union workers to subcontract everything. I still talk with some of the people that still work there and the people that have left. They fill me in. Yet that hall was always trying to get people and could never keep anyone but the old times waiting to collect their pension. I have stories for days on all the shit that happened. This was just one event. If I get any upvotes I'll tell more.'"
    ]
}