{
    "username": "AChubbyRaichu",
    "contributions": [
        "What I learned from quiet quitting for 2 years across different companies. Note - always evaluate your risk profile, goals and skills before quiet quitting.\nNote 2 - Quiet quitting means you deliver on the minimum expectations of the job without going above and beyond.\nI’ve (25yo) got about 4 yoe. 2 of which I have quiet quitted. This is what my experience was -\nSince I had taken a step back and delivered just the bare minimum, I was basically working 2-3 productive hours a day and additionally attending any meetings.\nI realised I can bullshit and cruise at work for a very very long time before it caught up to me. Companies actually seem to have a very high tolerance to bullshitters.\nAn alternative name for bullshitting is “creating visibility”. So many a times, I basically created a lot of visibility about things that dont matter, and cruised for months pretending about solving them. This was over and above the bare minimum requirements though\nOr I gave 10X the quote for the time required to do something. Now, I would caveat it by saying, I am pretty good at my job. Better than the people who ask for timelines. So all I needed to do was package stuff in a manner for the timelines to be plausible, or add fluff work to pad the timelines.\nWhat I understood is that almost everyone is in this bullshitting game at work. Some do it to further their career, others do it to slack off at work. And those who do honest work end up getting burdened with a crazy amount of work.\nGiven the layoffs and companies showing their true colours wrt how loyal employees are treated, it doesn’t really make any sense to be that honest guy doing everyone else’s work.\nBottom line is there wasn’t much difference between how my career progressed when I was working my ass off vs while I had quiet quit. It’s just that, to get a promotion, I am having to switch companies.\nTook me 4 years to go from software dev to senior software dev. I don’t really mind that since my income has always been decent even as a software dev. The pay per hour of work though… absolutely insane when you’re working 8-10 hours a week 😂\nIf anyone’s experiencing burnout, and toying with the idea of quiet quitting, I feel there’s a few checkboxes to tick before you take the step.\nEmergency fund of 1 year. This is a must.\nYou should be very good at your job\nYou should be comfortable switching companies as often as every 1-2 years.\nKnow that your career will have a shorter shelf life. So maintain a very high savings rate.\nYou shouldn’t have any dependents.\nI believe there’s a lot more to life than working over the bare minimum requirements of a job. I get paid for the minimum requirements, and not for the additional stuff. So why do the charity. Companies aint going above and beyond for me when I ask for a pay hike in accordance to work delivered that was well over expectations.\nI was doing it both while in WFO and WFH. Go to office, eat, chill and play video games, lol. I feel I work a lot more hours when WFH.\nAgain, quiet quitting doesn’t mean you don’t do anything. The bare minimum is a must. If I have to build a whole service myself as a bare minimum, then I will do it and have been the owner of sizeable services in my exp. it’s just that if it takes an average person 6 months, and I could do it in 2 months, then I would quote 6 months with a scoped down version, and another 3 months to flush it out with all the bells and whistles",
        "In response to 'If you are able to get away with 10x timelines then I have serious concerns about the quality of your seniors.', a user said: 'Most senior devs have a life bro. They’d rather extend a project and increase their shelf life in the company, instead of having a junior do all the work for them super quick.\nAlso, it’s a must to have good rapport with your seniors. They are the ones that will give your peer feedback. Feedbacks are just as BS as work. Work friendships are more important than the actual work to get a good feedback.\nSame goes for half decent managers. They are able to push back their higher ups effectively whenever needed.\nIf you get stuck with someone that’s way too ambitious, try to switch teams. If not possible, then time to switch companies.'",
        "In response to 'I kind of do a similar thing. We have two week sprints. I mostly slack on weekdays by just attending meetings and moving one issue to in progress every day and then sleeping. Then I sit on friday/ saturday for 6-8 hours straight, do all the five six issues and call it a week', a user said: 'Haha, same same. I sit between 7am to 9am to get work done whenever there’s work. If it doesn’t get done, then I do it through the day. I don’t do anything on weekends as a personal rule.'",
        "In response to 'Are you in MNC or startup? It's not possible in startup I guess?', a user said: 'All 4 years of my career in startups bro'",
        "In response to 'Easy to do this as an IC. Near impossible if u are a manager. I'm getting chewed out for misses from even 1 person in my team', a user said: 'Yeah, I plan on continuing on the IC route until there’s a big difference in incomes compared to being a manager.\nIn your experience, how much of a difference is there with someone with 8 years of total experience becoming a manager vs becoming a tech lead or architect or principal engineer?'",
        "In response to 'totally relatable, not having dependents is a must must have.', a user said: 'It’s just a temporary thing. You will probably be halfway to finance independence by the time you hit 30. Can have dependents at that point as there’s not much risk. The risk is mainly at the start of the career'",
        "In response to 'Doesn't your work require collaboration with others?', a user said: 'It does, sometimes. See, you gotta do what you gotta do. If someone is blocked on you and they need it cleared in the next 30 minutes, you unblock them in the next 30 minutes. If they can wait a day or a week, then you make them wait a day or a week'",
        "In response to 'Have you dealt with a-holes who either to put extra work on you or try to define your timelines for you by commenting in meetings? Another question: I think the minimum requirement to do this would be a company with decent culture. Because there are orgs where people are crazy about measuring stuff quantitatively without taking qualitative factors into account. Do you agree?', a user said: 'I have dealt with it. I had a manager that used to try. But I always politely indicated him that he should back off and stay in his lane.\nI do make sure to position myself as an expert at whatever I am working on. And till now, it has worked.'",
        "In response to 'Got it. After giving so many interviews, have you found a way to filter orgs with good culture ?', a user said: 'Oh I ask the interviewers what has their journey been like. More often than not, if a company sucks, the interviewers let you know.\nI’ve also been an interviewer for 150+ interviews. I understand what it is like to be on both sides of the table.\nAn interview goes both directions. It is your responsibility to interview them just as much as they interview you'",
        "In response to 'When switching jobs, do they not ask why you are switching so frequently', a user said: 'Oh, I just say company was down sizing due to economic downturn and laying off people. So I am pre-emptively switching 😅'",
        "In response to 'While doing background research...the company often gets in touch with the previous employer...so what if they cross question them...will your reason work then?', a user said: 'Wow, never thought of this… it’s like contacting your ex the confirm that they’ve screwed up in life and hence you’re leaving them.\nChill bro, no one cross questions the existence of layoffs in another company'",
        "In response to 'How often do you give interviews? How do you stay in touch with dsa and other things?', a user said: 'I never stop giving interviews. I joined a new company this month. And I’ve already started applying for jobs again'",
        "In response to 'Why though? Also wouldn't the company why are you interviewing if u just joined', a user said: 'Why would I show the new company on my resume though? I just interview to keep myself up to par with dsa. Having an offer all the time never hurts. Just say notice period of 2-3 months and you have layoff protection for 2-3 months. Repeat it and you’re always covered.'",
        "In response to 'But wouldn't that be a lie?\nIf you do join the new company wouldn't it create issues in the background verification', a user said: 'The resume you give while interviewing does not need to be the same as the one you give for bgv. Companies don’t mind as far as i can tell.'",
        "In response to 'No point killing yourself working hard and trying to be top dog in a workspace that would anyway be eaten up by Gen AI, LLMs and Agentic bots at the least 80% in the next 5 years. Focus on learning new subjects and topics that are of interest you you.', a user said: 'Have pivotted to genAI and LLMs recently. That will increase the shelf life of my career by a few years hopefully 🤞'",
        "In response to 'I’m my prev company, I used to work about 6/7 at the start of the sprint, commit my work on local. Complete the tasks. Then push the local commits to origin everyday slowly(you can change the date of a commit). It was an IC role, and I had to collaborate with people but not very often. It was fun!', a user said: 'That’s the right way to do it.\nWhat’s better -\nshare the PR at a time in the day where you know for sure the other person won’t review immediately.\nAssign it the the busiest but most trusted person in the team. Getting blocked by them gives you a lot of time.'",
        "In response to 'In your free time what you're learning?', a user said: 'Learnt genAI and switched to an ML role recently. A lot of the times I just use the free time to trade. If I can crack that, then I don’t have to worry about AI taking jobs lol'",
        "In response to 'Wait you switched as an ML engineer without having a PhD/Masters?\nWhere did you learn genAI in that much depth?', a user said: 'Companies cant afford them. So they’re cost cutting by hiring BTech grads to fine tune models built by phd folks in other companies, lmao\nYoutube has everything you would ever need to crack an interview'",
        "In response to 'Op has such interesting post history', a user said: 'Why, what’s in it? Lol'",
        "In response to 'Could you also share something that would in fact motivate you out of quite quitting? An increased compensation, more stock options or bonus incentive, or recognition, or officially recognised free time?', a user said: 'I do enough honest work to justify my paycheck. But I don’t go over and beyond. If my paycheque goes up, I will do enough honest work to justify that increase. But I wouldn’t do disproportionately more than what the compensation is worth.\nSo, I guess it’s just semantics. In my head I am exchanging work for an equivalent amount of money. Externally, it would be labelled as quiet quitting.\nTo me it’s about fairness. I am not ripping off the company, and I am making sure I am not getting ripped off.'",
        "In response to 'This is also called coasting.\nThis works really well at lower levels. But once you start applying for staff and principal level roles, you will fail miserably. (unless you are really really good at faking experience)', a user said: 'Fingers crossed hoping I can FIRE by then 🤞'",
        "In response to 'What is your plan for when you are supposed to 10 years of experience? \nBecause expertise that once was will fade away and if you do not work hard enough, and you will not be able to create enough value at the level expected.', a user said: 'This is exactly what I aim to answer to myself over the next 5-6 years. Right now, I don’t have an answer.\nThe industry moves way too quick. My tech skills become redundant every couple of years, or atleast their value decreases as more people learn them. Soft skills are the only ones I see compounding in value, and right now, I am working on that.'",
        "In response to 'And those who do honest work end up getting burdened with a crazy amount of work...... key point here....', a user said: 'I do my best to not let that happen. As I always own the whole project I am working on, all by myself. Me taking more time won’t put burden of that project on others.\nBut if there’s fresh work and adhocs, they definitely go to your hard workers.\nI expect each and every person to have a backbone to push back unrealistic demands. Or grow enough thick skin to ignore your manager saying mean things.\nThe people who are most affected are definitely the ones that can’t push back because they don’t have a fallback financially and have dependents.\nBut I would also argue that, if everyone works just the bare minimum, there’s going to be way more jobs, in order to support the ones who need jobs'",
        "In response to 'Bro please, you are just calling for management gurus to take this as case study and apply stricter rules to track progress and make everyone's life miserable. Since you just have 4 years of experience I doubt you know anything about project management and how sprints are planned and why there are more time allotted then required for even small tasks. This is the reason at many places it has been mandated to update effort put with time spent on every jira tasks/subtasks. So if there's a 8 story point work with 2 subtasks, each need to be allocated points, so say 4 and 4, then the task owner need to update every day exactly what they did in the task and how much hours spent, that's macro level tracking, someone like you must have spilled their guts how they fool the system in front of a client and hence more stricter tracking.\nWhy can't you just enjoy your quiet quitting, why do you have to rub it on the face of other people, especially the people who will definitely take it as personal offense and create some new standard to be implemented industry wide making everyone's life miserable 🤦', a user said: 'This is yesterday’s news bro. People were raving about it in 2021-23. There’s entire subReddits and youtube channels about it.'",
        "In response to 'Why are you doing this , just curious ? You are very young and not having any ambition is frankly very surprising .\nOrganisations are non living entities that won't be impacted by your lack of integrity , the only people who would be are your poor honest colleagues without those emergency funds who need a job .\nNot prescribing anybody should work 15-16 hours or something for the company but there is a middle path . Also keep seeing posts , why companies are forcing us to come to the office , why they don't trust us , why managers are micro managing the estimates . This is exactly why .. and who is getting impacted - not the csuites , not higher up , only people who want to do some reasonable honest work . This does happen on a very large scale.\nWill get a lot of downvotes , but it is fine .', a user said: 'I am ambitious about living life by my own terms. Working a job is a tool to achieve that. And that is exactly how I am treating it.\nI would argue it’s the organisations that lack integrity. And not me. I am working in a fair manner wrt my compensation.\nI always encourage and coach my colleagues to have a backbone and not get trodden all over. And I do believe they’re all happier today than when they were burning the midnight oil daily. Some even sleeping in the office.\nMy company was WFO. In fact just being in office used to be counterproductive and people used to feel they’ve done something because they are in office, without actually being productive.\nI am providing value to the company, just relative to my compensation. I don’t feel there’s a lack of integrity in that.'",
        "In response to 'Guys what the fuck is wrong with yall', a user said: 'Why what happened 😅'",
        "In response to 'He is the scrum master/Manager  , who is pissed off since Jira is not moving', a user said: 'That’s a good thing for his job isn’t it? If jira moves smoothly without any issues ever, then you wouldn’t need a scrum master / people manager. Might need a tech lead or SDM'",
        "In response to 'I have completed by graduation in 2020 ,got job in mid 2021 (due to covid) and resigned last year in an 2024 for competitive exams. Now since I failed the exam (just clear the cutoff) have no expectations I'm feeling lost what should I do. My dream was to get  80+ package but that dream is getting blur day by day.I have a career gap idk can I reach to that goal .I'm so stucked rn.', a user said: 'Put on your resume that you were building a company/product. Bam you’re an entrepreneur getting back into the workforce'",
        "In response to 'What company or product?', a user said: 'Think about that yourself bro🥲\nIt could be a competitor to your previous company, or some AI bs.\nYou have to create a story around it to make it seem legit'",
        "In response to 'What do you mean by dependants ?, family ?', a user said: 'I just mean that you getting fired from your job shouldn’t fk up someone else’s life.\nLike if you are in a single income household, paying for kids education and stuff, then your risk tolerance would be much lower than some bachelor that can afford to be jobless for a few months in case they get fired for not working for 10 hours a day.'",
        "In response to 'So how do you manage when you have to talk to different people from different teams to get an idea about what you need to do?\nHow do you manage when Juniors and colleagues ask for help with something that is not readily available to you?\nHow do you manage when you hit a bug on the technology you are using and there are no known work arounds and you have to figure something new yourself?', a user said: 'I do all this just like any other senior dev. I am pretty good at what I do. I just don’t enjoy doing it as much, and hence only do the bare minimum to get the needful done.\nI do enjoy interacting with juniors. So I do mentor people whenever they ask for it. Have mentored many interns and jr devs in the past.\nNew company that I joined recently- I am the junior most. So they seem to not expect much from me. So I’m just massaging their egos by playing along to their expectations. What I find funny is the senior devs here are unable to do basic stuff quick. I realised that while pair programming with them. So I can come down to their level 😛'",
        "In response to 'Under promise\nOver inflate\nOver communicate\nUnder engage', a user said: 'Amen'",
        "In response to 'Once a senior who was leading the project I had recently joined told me, \"You are good at what you do and fast as well, you must use that to your advantage.\"', a user said: 'My mentor told this to me 3 years ago🤭he was an absolute god at it. Did nothing tangible for a year while I was there, and got a good hike.'",
        "In response to 'How did you manage doing that when work is generally time sensitive and they’d expect you to also show output', a user said: 'Oh come on, we are software devs creating new features in an existing product. Not heart surgeons operating on a dying patient.\nNothing is time sensitive. It’s only made so by your management. Everything can be pushed back.\nIf there’s an urgent bug fix on production, then yes, I fix it right away.'",
        "In response to 'Overtime it kills your skills and this attitude becomes your way of life... How do you deal with this disservice to yourself? Any hack for this??', a user said: 'I am spending time in more relavent stuff to me. Made a domain change to AI/ML by upskilling, spent time with people I wanted to spend time with, spent time on other sources of income, spent some time trying out entrepreneurship, etc.\nI’m doing myself a service, and exchanging some time with the employer for a reasonable compensation. People typically do a disservice to themselves and give their employer all their time.'",
        "In response to 'Very immature work ethic. Intelligent if you want to earn money the easy way. \"Well don't you know they take advantage of us and don't pay us enough?\" The key to success is hard work no matter your pay or job. The fruit of your labor will not only bless you but your children's children.', a user said: 'What’s the success metric though?\nWe might be running the same rat race. But, we’ve started running from different starting points, and we’re probably running towards different finish lines.'",
        "In response to 'Sheer lack of professionalism is truly astounding here.', a user said: 'Well… this is exactly what I felt about companies and the work cultures they’re cultivating, before I decided to quiet quit.\n2022-23 layoffs were a trigger I guess, but also overworking, underpaid jobs wrt value provided, lack of appreciation for going above and beyond in monetary terms, predatory HR policies, etc etc\nI am sure this is a symptom, and not a cause for where the work culture is headed.'",
        "In response to 'Can’t believe that this is a whole thread with people supporting you! Why work, sit at home and be useless and save your manager the heartburn?', a user said: 'You think managers ain’t in on it and doing it too? 😅'",
        "In response to 'India is going to go places with these kind of attitude. Can’t wait for the Ai revolution and these huggers are out of work !! And on the streets', a user said: 'The more I’ve been contributing to the AI revolution, the more I am realising that it ain’t coming anytime soon. By the time it does, Id be out of the workforce voluntarily anyways.'",
        "In response to 'You are somebody that shouldn’t be emulated. You are not a daily wage labourer , for you to be given hourly rate , you are given a security of a job within limitations therefore you are bound to work more than your salary ( within reason ) for the company . It is only such attitudes that can propel the company to greatness , which in turn moves families forward and the nation too . You will never get the some amazing returns the owner of the company gets ! Why ! Because he has the capital he takes the risks , if cheque bounces he goes to jail not the employee', a user said: 'Job security? What a joke. Tell that to the thousands experiencing layoffs\nI have experienced a layoff myself. Was just lucky enough to get a new job immediately.\nSo… No thanks, I’ll pass on subscribing to your ideology. Let the owner go to jail for a bounced check. Keeping them out of jail is above my paygrade'",
        "In response to 'I work 2 hours a day as well and still everyone thinks I am best resource', a user said: 'Hehe I am currently maintaining that impression too'"
    ]
}