{
    "username": "aconsideredlife",
    "contributions": [
        "In response to '“Quiet Quitting” is the phrase the American employers came up with to shame their employees.  They call it that because they are implying that because you just do your job as it should be, rather than going above and beyond and dedicating your life to it, then you are basically a quitter without actually quitting.\nIt’s tremendously fucked up and I do hope it doesn’t catch on here.  I’ve not actually heard  it said here yet but it’s probably only a matter of time.', a user said: '“Quiet Quitting” is the phrase the American employers came up with to shame their employees.\nIt's not. It's an old union phrase used to implement silent industrial action forcing employers to reach the demands of their workforce. It's been weaponised by employers to make workers look bad for not working more for no extra money.'",
        "In response to 'Might be a bit of an unpopular opinion, but...\nIf you are doing it, absolutely fine. More power to you. It shouldn't be looked down upon to just want to come in, do your job, no more, and go home. \nI am currently doing this, myself. In fact I have asked to be taken off of some extra duties that I have been given over the last year.\nHOWEVER...\nIf you actually want to progress within your job and make it a career, don't be surprised if you do \"quiet quit\" and you get overlooked for promotion.\nTaking initiative, helping other people/departments, going above and beyond are all things your employer will tend to look for, just to make their shortlist.', a user said: 'Going \"above and beyond\" rarely gets rewarded. Workers are just exploited for doing more work and taking on more responsibilities than they're paid for in the hopes they get a pay rise or are promoted. Employers dangle this carrot with zero intention to actually reward them because they get extra work for free without having to employ more people.\nThat is literally why people end up \"quiet quitting.\"'"
    ]
}