{
    "username": "AdamZapple1",
    "contributions": [
        "In response to 'Original Post: When you quiet quit/ride it out till you get fired, it negatively affects others in this community I had a teammate who had been dropping the ball for a while and was finally let go this week. His output was so bad that my manager noticed and did some digging. Turns out he barely worked at all and was clearly just coasting till he got fired.\nWell, my manager and skip are PISSED and literally called out how they think our old teammate was working multiple jobs. In my xp, they definitely were as they had many signs.\nRegardless, it’s now coming back to bite my team and me with new policies. Yes I’m pushing back on all the BS coming our way and trying to minimize it, but I wouldn’t be surprised if activity monitoring software came up soon to flag suspicious activity as well. This gig has been great for OE for years and now it’s in jeopardy because someone couldn’t just quit when they were done… I have friends (OE and not) at multiple other companies who are dealing with fallout like this as well.\nMy point being, when you pull the anti work card and coast like this just waiting to be fired (which I see recommended here daily), it’s not an isolated event. You get your bag a bit bigger and your teammates (and fellow OEers) deal with the fallout.\nIt helps to push for more RTOs that may have not as it eliminates the possibility of many of these issues. This also affects remote offerings (wayyyy down from what I’m seeing myself in new job hunts)\nHow would you feel if others put your extra paycheck(s) in jeopardy?\nGet your bag, but don’t screw others over while you do it.', a user said: 'meh. pay me what I'm worth and I'll work harder again. if I can get my job done in a day but I have a week to do it, I'm taking the week since I'm not getting paid for my increased efficiency my experience has given me'",
        "In response to 'When you sign on to work you agree to provide a certain level of results and they agree to pay you for it. If you want that agreement to change then communicate that, (we pay decently fwiw) but don’t just stop working.\nThat’s the same as them making you work and not paying you. Unless the company is abusing that agreement, you both should honor it IMHO.', a user said: 'and I've given the results that comensurate with my pay. I've asked for a raise several times and the response I get is \"we cant do that\". well ok, then I cant work any harder. you cant pay for ad-supported Netflix and then complain you aren't getting 4-screen 4K with no ads.'"
    ]
}