{
    "username": "Additional_Mode8211",
    "contributions": [
        "When you quiet quit/ride it out till you get fired, it negatively affects others in this community I had a teammate who had been dropping the ball for a while and was finally let go this week. His output was so bad that my manager noticed and did some digging. Turns out he barely worked at all and was clearly just coasting till he got fired.\nWell, my manager and skip are PISSED and literally called out how they think our old teammate was working multiple jobs. In my xp, they definitely were as they had many signs.\nRegardless, it’s now coming back to bite my team and me with new policies. Yes I’m pushing back on all the BS coming our way and trying to minimize it, but I wouldn’t be surprised if activity monitoring software came up soon to flag suspicious activity as well. This gig has been great for OE for years and now it’s in jeopardy because someone couldn’t just quit when they were done… I have friends (OE and not) at multiple other companies who are dealing with fallout like this as well.\nMy point being, when you pull the anti work card and coast like this just waiting to be fired (which I see recommended here daily), it’s not an isolated event. You get your bag a bit bigger and your teammates (and fellow OEers) deal with the fallout.\nIt helps to push for more RTOs that may have not as it eliminates the possibility of many of these issues. This also affects remote offerings (wayyyy down from what I’m seeing myself in new job hunts)\nHow would you feel if others put your extra paycheck(s) in jeopardy?\nGet your bag, but don’t screw others over while you do it.",
        "In response to 'OE doesn’t always mean we slack it off.\nI've repeatedly gotten meets or exceeds expectations at every job since starting OE.  I hate how people think OE = slacker.  That's the opposite in my experience.  Being OE weirdly helps me focus.  When there's too much downtime my mind drifts.', a user said: 'It’s the opposite for a subset of us. The anti work subset over here who do what my coworker did bring down the optics of our subset with them'",
        "In response to 'I find this funny because it assumes only OE people do this. The most useless people I knew that got fired it wasnt realated with oe, they are just incompetent', a user said: 'Nowhere did I say only OE people do this? I just know for sure this guy was and the ride it out advise is posted here every damn day, so plenty of OE people do'",
        "In response to 'Nope it’s not a time trade at all (at least for salaried employees, which most people in here are). It’s\nresults\nbased. If I can deliver the results that the company is looking for, and the company is satisfied with those results, it doesn’t matter if I do it in 40 hours or 15 hours. It’s the company’s job to have enough work for me to do to fill up 40 hours of time. And I’m not going to volunteer more of my time for no more pay. The same people who say “they are paying you for 40 hours!” have no problem when an employer makes you work 50 or 60 hours for no extra money.\nI get up every day and do good work, and deliver exactly what my employers ask for. And I use the time I have left to do the same with multiple other employers.', a user said: '100% agree about result based and that was the whole point of my post — my teammate stopped delivering their results, and in such an egregious way, that it is now has blowback on others trying to make a living.'",
        "In response to 'You might be right, but this is the most \"Imma-get-mine\" crowd I know.\nAnd more power to 'em. Companies been gettin' theirs for years.', a user said: 'Mostly agree, but they’re not just screwing the man when they do this, they’re screwing actual people… some people have no morals and are totally fine with that until it happens to them but still.'",
        "In response to 'Misplaced frustration. Everything negative in OP's post is the behavior of the company. It's the\ncompany\nthat...\nDidn't pay enough to attract someone's full attention\nDidn't provide enough interesting challenges to keep someone fully engaged\nFailed to measure results effectively\nFailed to hold an employee accountable\nAllowed an under performing employee to remain in the org\nComplained to employees about a former employee\nMight start using activity monitoring software as a crutch for poor management capabilities', a user said: 'This company is definitely not perfect, but they do pay well, have a good stack, and have enjoyable challenges. They def could have done better to get him out earlier but he also could have just done the minimal amount? Now my extra paycheck is at risk because of their selfishness.\nHow would you feel if someone else put your OE in jeopardy?'",
        "In response to 'Some people just suck.  We had a guy who would play World of Warcraft, in office, every day.  There isn't any reason someone should just jump to \"they're OE\" just because someone isn't outputting up to standard.', a user said: 'Agreed that all slackers are not necessarily OE but I can say in this case that this guy definitely was.'",
        "In response to 'The fallacy is that only OE quiet quit and ride it out until fired. Not true at all. Companies just latch onto that to continue avoiding the fact that they create an environment where people need to quiet quit. As evidenced by the reaction to clamp down and exert more control, rather that be introspective.\nBlaming coworkers and insisting they play the game is exactly what corp america wants...and why things never change.', a user said: 'Not saying all quiet quit or ride it outers are OE, but this employee definitely was (they slipped up multiple times) and this advise is recommended here all the time.\nSo a definite subset of those instance are from OE and it affects those of us who can bring in this extra pay ethically, over the long term'",
        "In response to 'Companies just need an excuse to come up with this bullshit. What if he wasn't actually OEing but was overwhelmed, burnt out, whatever? You never know. You are assuming.\nFuck companies. Let them waste their money on this bullshit monitoring that will not work and will only hinder their employee's performance and happiness in their work.', a user said: 'Not assuming in this case, he slipped up multiple times'",
        "In response to 'The point is it doesn't matter what the reason is. A manager who is trying to find excuses for the employee's baf performance is way too invested in trying to cover their own management skills. \"Didn't deliver the required result, fired\" should be all the manager should care about.', a user said: 'Agreed, that’s how it should be, but we have many imperfect managers who just want to cover their ass if they did let that happen. And now that comes back to impact me because someone else couldn’t just quit.'",
        "In response to 'Management just needs to have less tolerance for employees who don't get work done. One of my contracts was like that. Guy was pretty slow, only got like one task done in a month. He was just gone one day and we moved on. It was refreshing.\nTech management needs to be smart enough and connected to the work enough to know when an excuse is BS. And they need to be empowered to get rid of the slow people.\nThen they wouldn't need to rely on RTO/HR/IT policies to try to make people work. It's already at will employment.', a user said: 'Couldn’t agree more'",
        "In response to 'The irony of you complaining about someone doing  what you yourself are doing. There’s no honor among thieves.', a user said: 'When we’re hired we have an agreement of delivering results (not time in seat like many think) for pay. I can deliver my results quickly and that’s how I can OE.\nMy coworker stopped delivering results, and so much so the company is trying to protect itself from it happening again. That has fallout on me. We are not even close to doing the same thing'",
        "In response to 'I care more about what I’m having for lunch than my coworkers. When you’re that disgruntled to where you do below minimum work, it’s game over. At the end, your feelings after he left, means nothing to him or your boss.', a user said: 'Yup, he gets away just fine save for the burned bridge.\nI wouldn’t expect to be prioritized over him, but when you directly act for your benefit at the expense of others (especially when it’s not necessary) that speaks to your shitty character.'",
        "In response to 'No one cares about what others think of their character because when they are done with the job, they’ll never talk to you again. Everyone working is there to support themselves and/or family. We all act for our benefit, and if it’s at the expense of others, oh well, better you than me.', a user said: 'Character is what you do when no one is looking. It’s a personal thing. If you’re fine fucking over others for your own gain when there’s no reason it has to be you or me, that’s your own moral standard to live with. I’m sure you’ll appreciate when others do it to you.'",
        "In response to 'Dude, you’re OE!\nDon’t talk about character and integrity when you’re doing OE. You’ve given up that moral high ground that day you signed your second employment contract and started your OE path.\nThe only thing different between you and the guy that got fired is the company doesn’t know that you’re doing the same thing.\nDo you think your employer(s) will smile, give you a pat on the head and say, “wow, impressive job managing X other jobs, at the same time we are paying you. We’ll let You keep doing that because you are doing a great job for us anyway”?\nNo!\nIf they find out that you also OE - you’re either going to be fired or asked to quit your other job(s)!\nSo bottom line, in the company’s eyes, there is no difference between a good OE’r and the one’s who ended up coasting to their last paycheck.', a user said: 'They don’t know because I deliver all the results they expect from me. to an outstanding degree according to all my perf reviews. My coworker pretty much stopped works and was not delivering the results they agreed to deliver for pay'",
        "In response to 'I literally don't care, I'm not friends with any of you and you're not paying my bills. Sorry', a user said: 'Don’t have to be friends to be a decent human being and not screw over other people when you don’t have to. If it’s a me vs you thing, sure, but choosing to directly act against me and risk my paycheck when not needed is an asshole move.'",
        "In response to 'I get your point, but this is the way the world works outside of just OE. It’s reality. Face it, adapt and move on.', a user said: 'Deliberately screwing people over for your own personal gain certainly happens plenty, but I’d like to think some people could recognize acting this way can screw over others and would avoid it. Obviously there will still be those who have shit character and don’t care unless they’re the ones being screwed over, but not everyone.'",
        "In response to 'don't screw others\nIf you're working OT because your teammate dropped the ball, you're doing OE wrong. Everything else should be frankly inconsequential.', a user said: 'I’m not working overtime at all, but I am dealing with fallout from management protecting themselves in direct response to his actions'",
        "In response to 'No. I want it to be inexplicably worse. You have this opinion because you were negatively impacted. The selfishness is on par with the overall selfishness of the business model at large. I can quote statistical model after statistical model that shows virtually every decision is made at the expense of the employee. Being an individual and having the audacity to suggest people disregard their well being to satisfy your own? Disgusting.', a user said: 'Not saying most corps don’t suck, but if anything you’re saying that you want to a to actively screw over others for your own gain? Talk about disgusting.\nHow is my coworker disregarding their own well being to satisfy mine in this scenario?'",
        "In response to 'I mean you’re already taking multiple jobs in an economy where there aren’t enough jobs for everyone.\nI think it’s silly to pretend you would do it for ethical reasons or concerns about other people.\nYou just don’t want to deal with this current fallout and now you’re trying to problem solve and prevent it like you would for any other problem.\nBut I very much doubt you’re concerned with what other people have to deal with due to your actions simply because you’re practicing deception on purpose and taking jobs other people need to survive just so you can retire early abs have extra.\nMy ass bro.', a user said: 'If I left either job they would not backfill me and my reqs had been out for months. I didn’t take anyone’s job, so no I don’t think it’s anywhere near the same or reasonable to say I don’t care about others based on that'",
        "In response to 'meh. pay me what I'm worth and I'll work harder again. if I can get my job done in a day but I have a week to do it, I'm taking the week since I'm not getting paid for my increased efficiency my experience has given me', a user said: 'When you sign on to work you agree to provide a certain level of results and they agree to pay you for it. If you want that agreement to change then communicate that, (we pay decently fwiw) but don’t just stop working.\nThat’s the same as them making you work and not paying you. Unless the company is abusing that agreement, you both should honor it IMHO.'",
        "In response to 'You usually also agree to not work a second full time job. Why the inconsistent treatment in what’s agreed to (I’m not anti OE)?', a user said: 'I’ve never agreed to that. There’s a stigma against it, but if you do OE responsibly, they get the work they expect and pay you for it. No more or less'",
        "In response to 'Pick one: Get your bag or Don’t screw others (who dgaf about you)\nPretty sure you won’t pay his bills.\nRTO is not happening because of this.\nI say more power to him, he used that card right even though you don’t like it.', a user said: 'Or you can get your extra paycheck and not put mine at risk\nEdit: the fact that this is a controversial ask is wild'",
        "In response to 'Yes, blame your fellow peers for the trouble your bosses put you through!!', a user said: 'Can you really not see the direct correlation to cause this action? Lol'",
        "In response to 'This is why I always recommend throwing sandbagging low performers under the bus.  If someone is \"quiet quitting\" or unable to keep up then get rid of them quickly before their incompetence / apathy becomes a problem for you and the rest of your team.\nThis isn't a team sport.  If someone sucks to the point it impacts you or brings unnecessary scrutiny/attention on to you then you shouldn't feel bad dropping a tip to management to get rid of them.', a user said: 'Totally agree. Thing that sucks is many of us did raise the flag and management kept kicking the can and making excuses… they aren’t perfect. Now they’re over correcting trying to protect themselves.'"
    ]
}