{
    "username": "AdhesivenessSafe9764",
    "contributions": [
        "In response to 'Original Post: What I learned from quiet quitting for 2 years across different companies. Note - always evaluate your risk profile, goals and skills before quiet quitting.\nNote 2 - Quiet quitting means you deliver on the minimum expectations of the job without going above and beyond.\nI’ve (25yo) got about 4 yoe. 2 of which I have quiet quitted. This is what my experience was -\nSince I had taken a step back and delivered just the bare minimum, I was basically working 2-3 productive hours a day and additionally attending any meetings.\nI realised I can bullshit and cruise at work for a very very long time before it caught up to me. Companies actually seem to have a very high tolerance to bullshitters.\nAn alternative name for bullshitting is “creating visibility”. So many a times, I basically created a lot of visibility about things that dont matter, and cruised for months pretending about solving them. This was over and above the bare minimum requirements though\nOr I gave 10X the quote for the time required to do something. Now, I would caveat it by saying, I am pretty good at my job. Better than the people who ask for timelines. So all I needed to do was package stuff in a manner for the timelines to be plausible, or add fluff work to pad the timelines.\nWhat I understood is that almost everyone is in this bullshitting game at work. Some do it to further their career, others do it to slack off at work. And those who do honest work end up getting burdened with a crazy amount of work.\nGiven the layoffs and companies showing their true colours wrt how loyal employees are treated, it doesn’t really make any sense to be that honest guy doing everyone else’s work.\nBottom line is there wasn’t much difference between how my career progressed when I was working my ass off vs while I had quiet quit. It’s just that, to get a promotion, I am having to switch companies.\nTook me 4 years to go from software dev to senior software dev. I don’t really mind that since my income has always been decent even as a software dev. The pay per hour of work though… absolutely insane when you’re working 8-10 hours a week 😂\nIf anyone’s experiencing burnout, and toying with the idea of quiet quitting, I feel there’s a few checkboxes to tick before you take the step.\nEmergency fund of 1 year. This is a must.\nYou should be very good at your job\nYou should be comfortable switching companies as often as every 1-2 years.\nKnow that your career will have a shorter shelf life. So maintain a very high savings rate.\nYou shouldn’t have any dependents.\nI believe there’s a lot more to life than working over the bare minimum requirements of a job. I get paid for the minimum requirements, and not for the additional stuff. So why do the charity. Companies aint going above and beyond for me when I ask for a pay hike in accordance to work delivered that was well over expectations.\nI was doing it both while in WFO and WFH. Go to office, eat, chill and play video games, lol. I feel I work a lot more hours when WFH.\nAgain, quiet quitting doesn’t mean you don’t do anything. The bare minimum is a must. If I have to build a whole service myself as a bare minimum, then I will do it and have been the owner of sizeable services in my exp. it’s just that if it takes an average person 6 months, and I could do it in 2 months, then I would quote 6 months with a scoped down version, and another 3 months to flush it out with all the bells and whistles', a user said: 'Can’t believe that this is a whole thread with people supporting you! Why work, sit at home and be useless and save your manager the heartburn?'"
    ]
}