{
    "username": "AdventurousYamThe2nd",
    "contributions": [
        "In response to 'My boss's boss knows my boss is a piece of work\nI wouldn't count on that meaning anything to do. Your boss's boss keeps your boss around...', a user said: 'This!!! I've recently been screwed over on this. I report to a director, and there were several people on his level who actively scoffed at the mention of my bosses name, was met with \"oh God, I'm sorry,\" when I'd introduce myself and explain who my boss is / what group I'm in, frequently asked what my boss actually does day to day, has described him as a cancer to the company, was told by a subordinate \"that really pissed me off, you can go fuck yourself,\" walked out of the building and went home\nand then was promoted\ninto a different team, was told by his boss that all levels of the organization were aware of my bosses inadequacy... and yet... we're going on six years of his poor leadership. Now we've got some new management and he says all of the right fluff to look good and now his words against me carry weight and I'm being taken off higher profile projects and reassigned to administrative duty to support the other team members that are halfway up his ass - despite cross functional teams asking for me to stay on. It's disheartening, and all this is to say that it doesn't matter what anyone thinks of your boss until your boss is fired.'",
        "In response to 'I'm a little concerned about how comfortable everyone is with badmouthing their coworker. Also, why was he not let go if he has been so terrible?', a user said: 'Yeah, I get where you're coming from. It's not normally a caddy environment... I've learned that the majority of the folks making these comments rarely have a bad thing to say of others and are usually gracious in their benefit of the doubt. He hasn't been let go because in our company, someone in a director position needs at least a year of documented citations (assuming it's only bad work ethic or incompetence) to be let go outside of eliminating the position; we've had so many re-orgs his entire tenure and each time he gets a new boss the clock resets. He was hired in as a director and says all of the right things - he's a phenomenal speaker... but there's a profound lack of action on his part. He's insanely strategic on slapping his name as a contributor to high visibility things yet never actually doing any of the work. By the time his boss catches on to this and starts documenting, we re-org and report to someone new.'",
        "In response to 'There are many corporate people who have zero management or leadership skills or any other competency - except one: ensuring their own survival. And that competency trumps all others.', a user said: 'It's unfortunate, but I've found the hard way to be true.'",
        "In response to 'Never pays to be honest in this situation.   It’s almost like a test of loyalty.    It’s like Talking about the drugged sibling (boss) is never what family does.    You are to just listen and never agree.   Just smile.\nEspecially since the person was never fired and with new leadership seems to have a change of behavior.   Go figure.', a user said: '100000% ! I try to play Switzerland whenever I hear these types of comments, and other than my husband I don't spread it around. Most of it is justified to which I'll throw a yikes and lots of shifting blame to outdated processes to no fault of a single person or department but to be totally fair to my boss, how would anyone thrive with having their manager change every 6mo-yr? It's a nightmare for me, but at least I have some stability with him.'",
        "In response to 'I don’t understand single parents. Like my brain cannot comprehend HOW you’re able to do it. You’re amazing.', a user said: 'Literally got off the phone with my best friend talking about this. We are blessed to have phenomenal hands on partners who carry half the load with our infants, and we are\nrun ragged\n. HOW you can do it alone is beyond me. I couldn't.'"
    ]
}