{
    "username": "Aggravating_Pop_5832",
    "contributions": [
        "In response to 'This is my exact situation. Our President and Sales Guy sit in an office and ping pong lofty ideas with less than zero follow through. It took over a year but now I’ve got it that we don’t fire drill Chase our tails with our hair on fire each time they have some never thought of ever brilliant idea that they’ll forget about. I ask them to submit a simple form. That’s it. Just fill it out with a summary, purpose, proposed ROI, and assign tasks. 100% of the time they’ll move on.', a user said: 'This… gives them a feeling that they are important while also managing stupidness.'",
        "In response to 'I'm optimistic this is true. I handle all the day-to-day logistics and that leaves her free to \"blue sky\" and \"imagine the future.\" In the past I've taken some of those ideas as marching orders, but at some point the actual work has to get done and she isn't contributing to that effort anymore, so I've stopped making extra work for myself just because she makes a comment. Instead I just tell her that it sounds like a great idea and a lot of fun, then don't do the work to make it happen. I definitely don't plan to highlight the \"extras\" we've done in prior years and focus on the work that I did.', a user said: 'Seems she relies on you for much.   I don’t think you have anything to worry about out.   Hype the positives. And mention some attainable goals for next year.   Go in prepared with some actual goals and you should be good.   This bozo has an idea she needs you as well give your description and you can use that to your advantage.\nAlways couch the ideas were hers and she’s right “on target” with the goals she set this year.  And based on her ideas and projections she shared you have drafted a few for her to consider since they were her idea.   Also draft goals for other new employees that you mentor since she/he used that strategy this year and we hit our targets as expected.    If she questions the “extras” perhaps suggest those were things the employees that left handled and with your new role mentoring the new employees perhaps those folks can address those goals while you continue as the mentor.  Those mentees can learn what you already know.   Your boss is a piece of shit and you are helping to manage the section.   Additionally, with the bosses pending retirement that may be an avenue for advancement for you going forward.\nWorks like a charm !     As long as you continue to endorse her ego. You (and the boss) should be good.  😂.\nIn the meantime, continue to have the work and life balance.   You have established without her knowing.    Continue to laugh at those jokes of new things and continue business as usual.\nIn the past, I wait until the boss mentions it more then twice to know that’s a legitimate direction the boss wants to go.  But also something else has to give if you don’t have the time.   Perhaps at that time suggesting another employee spearhead the project while everyone supports that person or you with the typical tasks.\nGood luck!    Chat gpt can help with goal setting if same goals worded differently as a start.  Good idea to edit those suggestions and share them as the bosses idea.   Always fail safe in my recent experience.  My goals are fiscally timed so I am at the mid point now for the year.'",
        "In response to 'This!!! I've recently been screwed over on this. I report to a director, and there were several people on his level who actively scoffed at the mention of my bosses name, was met with \"oh God, I'm sorry,\" when I'd introduce myself and explain who my boss is / what group I'm in, frequently asked what my boss actually does day to day, has described him as a cancer to the company, was told by a subordinate \"that really pissed me off, you can go fuck yourself,\" walked out of the building and went home\nand then was promoted\ninto a different team, was told by his boss that all levels of the organization were aware of my bosses inadequacy... and yet... we're going on six years of his poor leadership. Now we've got some new management and he says all of the right fluff to look good and now his words against me carry weight and I'm being taken off higher profile projects and reassigned to administrative duty to support the other team members that are halfway up his ass - despite cross functional teams asking for me to stay on. It's disheartening, and all this is to say that it doesn't matter what anyone thinks of your boss until your boss is fired.', a user said: 'Never pays to be honest in this situation.   It’s almost like a test of loyalty.    It’s like Talking about the drugged sibling (boss) is never what family does.    You are to just listen and never agree.   Just smile.\nEspecially since the person was never fired and with new leadership seems to have a change of behavior.   Go figure.'",
        "In response to 'Didn’t say it’s appropriate, this is my guess. I mean, OP also believes they were rewarded with a pay increase after telling someone they may leave.\nRegardless, I stand by what I said which is doing the bare min to hit goals is going to backfire if they think they’re taking boss’ job at some point.', a user said: 'Often if given the opportunity.   If asked about performance measures by superior.    I always state inspite of some inter office challenges we still hit targets.  If asked for specifics.   I would cite change of employees or other factors or vision of current boss (in a positive way).  Never out the boss.  Chances are they already know and it’s a test of loyalty.    Can’t buy loyalty.'"
    ]
}