{
    "username": "Aggravating_Teach_27",
    "contributions": [
        "In response to 'I think it's a mistake to call the companies \"stingy\" today, though.\nCommon stinginess isn't what got us here. It's the endless pursuit of \"record growth and profits\" that ruined these companies' compact with their workers.\nThey don't value their human resources anymore. The only thing that matters is for that arrow keeps rising upward for the shareholders.', a user said: 'Yep, once a company's stock is traded in the stock exchanges, it can only be evil and worthless as an employer and as a participant of society.\nIt's not optional, depending on the management or can be more or less evil, but being evil is compulsory as what they have to achieve  (eternal growth) is absolutely impossible by normal means.\nIt's also absolutely impossible by being nasty jerks, but it helps to keep bonuses a bit higher for a bit longer.\nWelp, there's no helping it, but as employees it should remind us loyalty to these evil entities is foolish...'",
        "In response to 'I think this “hard work” they engaged in was a myth.  They tell it to make themselves sound better.\nThose “glory days” were glory days because some things were EASY for them, they were handed to them.\nThey say they pounded the pavement, walked boldly into places asking for work. That was because you COULD do that.  Graduate high school with no skills, just walk down the street and easily get hired at the local factory.  And you’d get a decent job for good pay at a place that would be loyal to you, and you could raise a family.\nThey assume because they got those things, they MUST have worked hard to get them, right?\nAnd that attitude of working “above and beyond?”  That’s bogus too.  There was massive growth then.  You’d work a while, and someone needed to be a manager, so the guy who had been there longest was promoted.  Then the next guy, then the next.  They didn’t “burn the midnight oil,” they just stayed at the company that was happy to have them, and got promoted when it was their turn.\nThey (white males at least) were born into an unprecedented time where things for them were EASY and everything was just handed to them on a silver platter.  Then they invented the myth that all that easy stuff wasn’t easy, it was their hard work that got them where they were, and that means that the world today is lazy and soft because they can’t easily get the same things.', a user said: 'Yeah, every old foggy was the hardest worker you could imagine and had nothing handed out to him/her.\nYeah, right, doesn't pass the eye test, with the many, many entitled, useless and lazy boomers I've seen in my life.\nWho also got a much easier path in life than the following generations. One salary from an uneducated man was enough for a home, car, holidays...\nTurns out their generation wasn't a point in an uphill trend. It was the peak of human ease of life, both their parents and their kids and grandkids had/have it worse.\nAnd in many ways life got harder because the boomers used their time at the top to absolutely hoard every resource they child get their grubby hands on.'"
    ]
}