{
    "username": "Agreeable_You_3295",
    "contributions": [
        "In response to 'Some  of my fellow “teacher friends” call working to contract “acting your wage”.\nWhen I started easing up on unpaid/unacknowledged work, I was shocked at how much I had been doing. Good luck!', a user said: 'Hate that term. It ties a number to my effort and implies I'm not doing stuff because I'm not getting paid enough. No, I'm not doing extra duties because it's not in my contract, not because of money. If you tripled my salary today, I still wouldn't volunteer to chaperone the school dance if it's not in my contract.\nWork to rule is such a better term.'",
        "In response to 'I do prefer the term “work to contract,” because it’s specific and accurate. But  I actively dislike the term “quiet quitting.” Nobody’s quitting — they’re doing the job they were hired to do. They just aren’t sacrificing unpaid time and labor to perform work not in their contracts.', a user said: 'Yes, quiet quitting is worse. Both terms suck. Luckily, I only need one term to describe following the terms of my contract, and Union members smarter than me coined \"work to rule\" a long time ago.'",
        "In response to 'Just one more thing we can thank a Union for taking care of for us.', a user said: 'Yep. They fought these battles for us 150 years ago and we're still fighting today.\nI always think of the picture of that super old lady at a Roe V Wade protest holding the sign \"I cannot believe I am 97 and still fighting for this shit\"'",
        "In response to 'Original Post: Quiet quitting Update: wow, the support!  Thank you all!\nWill now only refer to this as \"Just doing my job\"\nStarting today, I quit working for free.  I won't manage the school food pantry, sew for students or school programs ( uniform alterations, letter jackets, CTE jackets, prom dresses), work the gate or track meets, cover hall duty for others, support fundraisers, sponsor or coach teams, provide snacks to students, participate in staff potluck meals.\n I will arrive 2 minutes before my designated duty time and leave 2 minutes after hours.\nI will take off every Friday to help my family, and take off every PD because I have yet to attend a worthwhile PD (I have only been teaching since 2001, a valuable PD is unlikely to occur in the next year).\nI have 80+ days of leave accrued, and I will leave as few on the table as possible. \nThere is no union power in my state, so I am on my own.', a user said: 'It's called work-to-rule, and there's nothing wrong with it. No offense, but you were kinda dumb to do all that stuff for free in the first place. I've been dodging extra work since my first teaching job in 2008.'",
        "In response to 'I can be a pretty slow learner. In my defense, I am 1/2 Canadian and being overly nice may be in my genetic code.  Overcoming that shit.', a user said: 'I was the same for the first 5+ years of my career. I almost burned out and did a bunch of therapy and now I work to rule. My wife has the issue of being too nice as well. I don't focus on being a nice person, I focus on being a decent person. Shifting my perspective on what type of person I want to be helped me a lot with professional stress. I still struggle to say no to students when they ask for extra work stuff. Admin though - pay me or bye bye.'"
    ]
}