{
    "username": "Aktor",
    "contributions": [
        "In response to 'Nothing exists in isolation, and at present we have unprecedented access, technology, information, communication, catastrophes, market upheaval, transportation disruption, and war.\nThere is no model or map for the road ahead it is completely unknown and new territory which has never been surveyed and cannot be foreseen in full by anyone, there are too many unknown variables in the equation.', a user said: 'That’s why we as the workers must engage in solidarity.'",
        "In response to 'While I agree that quiting is a thing and that is affecting tye entire workforce.\nIm so sick and tired of these champagne socialists tring to make this into something it is not.\nThis is not a collective action, it is instead millions of people making a cost/benefit analysis that working these long hours aint worth it. But it is individual choices and not a collective making a change, it is more of a wave. you cannot control a wave, but you can ride it for a while.\nThese corporations will in the end do some minor changes and consessions, and then things will return to normal', a user said: 'Unless we don’t settle for those minimal concessions. Why not organize?'",
        "In response to 'Im not saying we should not.\nIm saying this ”quiet quitting” wont be the thing that that leads to that.\nI woyld argue the railworkers union strike and starbucks stores unionizing have a far greater chance to lead to meaningful change.', a user said: 'I think they are all pieces of the mosaic. Solidarity, friend.'",
        "In response to 'Yeah.. laugh all you want but labor pressure will just put pressure on tech so the more you push, the better AI looks. Gonna be a whole lotta unemployed and redundant jobs sorry to say.', a user said: 'Good. Less work. Oh, you mean that the ownership class is going to try and maintain control over the AI means of production while we starve in the streets? That would lead to actual rebellion.'",
        "In response to 'It's a good argument and an interesting argument but I still don't think it's correct. I've been through multiple good times and more bad times and one thing the younger part of the work force hasn't seen is extended periods of high unemployment, not 5% but 8-10% for years.  When time are bad people will take whatever they can get.  When they have to choose between doing a shitty job and their family not being able to eat they will choose that shitty job nine times out of ten.  Right now times are good, there are lots of jobs and people see the value in a union, how will this change when times are bad.  Before I get shit on let me say that I was a steel worker in the 80's when all them mills got closed and saw the good and bad of unions and I still am a Teamster so I'm not throwing bombs.', a user said: 'You think that right now is a “good” time?'",
        "In response to 'yep.  If you think this is bad just wait.', a user said: 'I do think this is bad. I also think that if we, as the working class, don’t engage with one another to plan an alternative it will get worse.'",
        "In response to 'Saying that this labor 'rebelion' is completely different from the rest is not accurate at all. All 'labor rebelions' revolve around the same topic, which are working dynamics and quality of life. In Marx words, the salary for the worker will tend to be the minimum possible, just to survive and have a minimal descendency so the 'worker race' does not go extint. And when this gets extreme, the posibility of a revolution appears in the horizon.\nAlso, saying that this is the most diverse 'labor rebelion' is also not accurate at all... In this case, is afecting the USA a lot, but not completely. The working activist from the start of the SXX where more diverse and from everywhere. From Russia to Africa, with china, vietnam, middle east countries, mediterranean countries (like the valkans and rumania...), England, Europe, South America... Hell, even in the USA there were some activist that were very active and from different races and ethnics. Right now, this is not true, also the people who are quitting are not educated in working dynamics or economical phylosophy... In Spain, at the start of the SXX the most readed book was 'The Conquest of Bread' by Kropotkin. Right now nobody knows that book.', a user said: 'I believe she was referring to the economic realities of the US.'"
    ]
}