{
    "username": "allhailqueenspinoodi",
    "contributions": [
        "In response to 'Original Post: How to quiet quit without being detected after being known to be an extra-mile person at work? Firstly, I know - quiet quitting is just doing your job and nothing extra. Stop repeating the chant.\nSecond, I was known to be THAT person, who goes out of his way to help. I guess I associated my self worth with how company values me.\nIt took a couple of a years and being passed over a promotion to wake up.\nI cannot quit at the moment, or change jobs, I have been looking and nothing suitable on the horizon yet.\nThe question is how do I make the shift in attitude without getting so much attention especially that I am known to be a hard worker.\nEdit: Thank you everyone! Very useful tips! Read every single one! 🙏', a user said: 'Why do you mind if people notice? I made a sudden snap when told I was being passed over and stopped doing all the extra. People actually did notice when I stopped doing all my little things that I felt made work better for everyone. They came around and started treating me fairly and I started putting in more effort again. I also had 2 fairly blunt conversations with my manager asking what I had done wrong specifically and she had nothing.'",
        "In response to 'If I suddenly snap, my worry is that there are 2 possible scenarios, it either becomes a pity party. Or they take it personally and consider this a retaliation. If they like you enough, you might get away with the first scenario. If they don’t, I wouldn’t want to be the black sheep.', a user said: 'How is you doing your job retaliation? If anyone tries to talk to you about it, pull up your job description: \"Which of my job duties is being neglected?\"\nCan't be a pity party if you don't let it be. I don't discuss it with people besides my bosses. If you really mind being the black sheep I'm not sure what to tell you. Not being beloved by coworkers never bothered me at all. My life is outside work.'"
    ]
}