{
    "username": "Altruistic-Text3481",
    "contributions": [
        "In response to 'Probably has something to do with the rise of anti vax nut jobs.  Also US is home to a lot of religious fanatics who will refuse medical treatment and deny science.  Remember the first settlers were religious fanatics, the world today would be a marginally better place if the mayflower had sunk in the middle of the Atlantic.', a user said: 'It is ironic.  The Mayflower was full of ostracized religious zealots who fled England because they were persecuted for their witch burning activities.'",
        "In response to 'Here is the link to the underlying report, digging into it it seems to largely be a story of a long divergence in the average life expectancy beginning in the 1980s.  Then in 2020 life expectancy falling through the floor for men with a lower decline for women.\nThe ten countries we are compared to all have better public options or single provider healthcare systems.  The US isn’t rebounding because these are future projections and without massive reform to our healthcare system people will continue to die at younger ages compared to people living in countries with better healthcare coverage continuing the trend that began before Covid.\nhttps://www.healthsystemtracker.org/indicator/health-well-being/life-expectancy/', a user said: 'Yea.  We pay the most for healthcare for the worst outcomes.   It’s almost like someone is profiting off us …'",
        "In response to 'The US isn’t rebounding because these are future projections and\nwithout massive reform to our healthcare system people will continue to die at younger ages compared to people living in countries with better healthcare coverage continuing the trend that began before Covid.\nWell said - this is the key point. And it's something the media neglects to cover when covering topics like the economy & workers. And the stranglehold corporations have over our lives.\nCorporations control our healthcare & the media tends to frame things from a pro-corporate point of view. So the media doesn't shine a light on the failures of our system - instead pointing the failures on individual workers who aren't doing enough to sustain the system.\nAs an example - as healthcare systems collapse the issue is framed as nurses not working hard enough. Instead of say, looking into why the nurses are so overworked & understaffed.', a user said: 'I asked ChatGPT how to get Universal Healthcare in California.   It basically put out a set of practical guidelines but said Health Insurance Companies are the obstacle .     Insurance companies drop us so we should drop them.\nHere was two ChatGPT ideas.\n1, raise income level requirements to qualify for Medicaid/ MediCal.\n2. Lower the age for Medicare.'",
        "In response to 'And given the polling done on young people - it is clear that the majority of Gen Z are against the current economic system. The raindrops are accumulating fast.\nWe have our first Gen Z congressman, Maxwell Frost. The green shoots are there that were absent in 2013 in the wake of Occupy Wall Street.\nMillenials gave our current movement a test run in 2011 - the fight for $15 came soon after. Then Bernie's two runs brought the concerns of OWS to a mass consciousness with Bernie's empathetic & concise framing.\nGen Z has seen how unfair the economy has been to their parents & siblings. Our movement is gaining strength, the reason it seems hopeless at times is because of how batshit the wealthy have become in response to our movement.\nThey have decided its better to destroy the planet, our ecosystems, any hope that young people have. If the alternative is to pay higher taxes & not have biggest house, biggest money, bestest sports car, etc. But they've gone too far and overshot - and they've set the stage for a much farther left future.', a user said: 'Billionaires need their carbon footprints 👣 outted daily.\nWhat is Elon’s carbon footprint daily?\nTrack his jet & let’s also track his pollution.\nThe poor will inherit the earth (sayeth Jesus) while the rich leave us behind in their rockets…'",
        "In response to 'I hope there’s a pack of Bronterok’s waiting for them on their new planet.', a user said: 'Me too'",
        "In response to 'The problem isn't who they voted for, it's the elections in general. They're purposefully designed to have a literal monster (putting children in cages and sexual assault, racism etc) vs the monsters we already know (corporate overlords) and then they pretend it's a choice. You can't blame people for thinking we need to vote for the corporate overlord when most people are not awake enough to realize they're being played. The best we can do is get them to realize the game instead of being angry that they didn't realize it sooner', a user said: 'Chat GPT really points this out.   I asked how to get Universal Healthcare in California.   We already passed a ballot initiative about 4 years ago.   Chat GPT stressed it is insurance companies lobbying politicians ( like our Gov. Newsom who campaigned on Universal Healthcare, bailed on a legislative dem trying to put it in play last January.  Crickets from Newsom.  Then I read he received $1 million from health insurance companies to shelve it!). I liked Newsom but that broke my heart.\nNow if we can get past the corruption ( big ask) \nHere’s the ChapGPT synopsis.\n1.) Lower age for enrolling in Medicare.   50.\n2.) Raise the minimum income level for Medicaid/ MediCal family of 2 to at least $100,000.\n(The currently unrealistic level is around $35,000 for 2 people where anyone making minimum wage cannot even qualify.).\n3.) Have everyone pay into a Universal pool like we do in California for SDI.   Either thru payroll deduction or at tax time for self employed.\nThen our government is not paying subsidies to insurance companies but to a Universal Healthcare Exchange funded by taxpayers.\nWhy are our taxpayer dollars funding subsidies to Private Healthcare Insurance?\nChat GPT would ask us all this question.\nWhat is your answer?'",
        "In response to 'Gen Z doesnt vote or participate in local and state and federal elections.', a user said: 'You are quite mistaken.  GenZ came out for Biden.   Do you also know that the COVID death ratio is 8:1?\n8 Republicans died for every 1 democrat.\nChew on that fact.'",
        "In response to 'The best antidote to their class solidarity is to spread the good word of unionization.\nThis is how we win, and it may take us a while to gather momentum on unionization. But as the 60s showed, culture can change quickly. We have green shoots at Amazon, Starbucks, Apple, REI, etc.\nEven if there is no chance of your company unionizing, you can still point out to your coworkers the obvious hypocrisy of our current system. Like the loyalty the rich demand of us when they see us as plebs unworthy of job security or any respect whatsoever.\nWhen Bernie goes on FOX, he is doing the same thing - trying to win over a few people or at the least make them think about their views a bit. It's a long & slow game, but we have the right ideas & we must never give up.', a user said: 'Here’s the 3 point cheapest solution for corporations to stop “Quiet Quitting”…\n1.)Offer great healthcare ( not some “high deductible” scheme/ shit insurance).\n2.)Offer more than 25 cent pay raises for every year served.  Even to part time employees.\n3.)Offer Four day work week.\nPizza parties are shit.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'Keeping workers in a state of\nDesperation\nis probably in the upper management manual of corporate America.'",
        "In response to 'You forgot remote work and PTO', a user said: 'My bad.   You are correct.'"
    ]
}