{
    "username": "ama_compiler_bot",
    "contributions": [
        "In response to 'Original Post: I have Stage 4 Cancer and my wife quietly quit our marriage. AMA What the title says and add in the current climate in the US, so to move out and get a divorce would leave us both fucked.\nEdit: Wanted to tell everyone thank you for your kindness', a user said: 'Table of Questions and Answers. Original answer linked - Please upvote the original questions and answers. (I'm a bot.)\nQuestion\nAnswer\nLink\nDo you have a good support system outside of your marriage? I hope you have someone you can talk to about all your stress. 🙁\nFamily is supportive and I have some cancer support groups. Wife will chip in if I ask, but doing so makes me feel like a burden and sets my anxiety off more than it already is.\nHere\nI am so sorry for you.. no words can help but wishing you all the best! What do you want still make happen in your life? Do you have a specific wish?\nYea to beat cancer. Pretty much my only focus while knowing it will probably kill me in the next few years.\nHere\nMake sure your will is appropriately written.\nNot too worried about all that as I know she would make sure it goes to taking care of my kids.\nHere\nMy father in law has stage 3C lung cancer. It’s been tough but he finally finished chemo and now on immunotherapy! His tumor shrunk and he seems to be doing good. He was about 120lbs when he was 200lbs but is up to 140lbs now! Are u getting cancer treatments?\nI had to stop chemo as my blood tests kept coming back too low. I will be doing surgery soon to remove some tumors on my liver.\nHere\nI'm sorry man. Truly\nThanks\nHere\nWhat symptoms did you get and how bad were they before you went to the doctor ?\nStarted with loose stool and then not going at all. Doctor was going to have me just take stool loosener, but I felt something more was going on and demanded a colonoscopy and was having surgery within days.\nHere\nDamn. I'm sorry, and it's not right she did that. Has she left the house? Is she with someone else? Did she bother to explain herself, or did she just ghost you?\nWe still live in same house. She refuses to leave even for a bit as we are close to her family. I would have to quit my job and move if I had to live for sometime with a relative. Obviously with cancer I can’t quit as I need the insurance, so I am trapped or fucked so no real winning situation.\nHere\nWhat from your point of view is the reason for the marriage ending?\nNot really sure. I have tried to get an answer as the down slide began right around my cancer diagnosis. She has since claimed she was over it long before then.  We argued more, but I also felt she stopped being half a relationship and decided she wanted what she wanted and was going to do what she wanted.  Mind you I spent much of our marriage adjusting to make her happy. I have virtually no friends because she would always start a fight if I tried to hang out with friends. My only friends where her friends significant others.\nHere\nAs stage 4, what’s stopping you to say fuck it to all and live with giving in to every intrusive thought?\nI have kids\nHere\nCan you please add some context to how your wife “quietly quit” the marriage?\nStopped communicating. Silently growing apart from me without even telling me. I feel she saw how her friend treats her husband and thought it was pretty sweet deal. She would be happy if i just did whatever she asks. She wants everyone to think like her and be like her(which is how her friend always was)\nHere\nHas your cancer spread? What locations? So sorry to hear about this.\nI have it in colon, liver and lungs(very small amounts)\nHere\nHow did you get cancer?\nI have a genetic mutation that causes my body to create many polyps and if unchecked they turn into cancer. Thought I was having issues because of diet and after forcing my doctor to schedule me a colonoscopy I found I was stage 4 cancer patient and in 24 hours my life got turned upside down.\nHere\nWhen did you find out about the cancer?\nAlmost 2 years now\nHere\nReading comments it's sounds like your wife was verbally abusive  I know you said she would chip jn, I wouldn't trust her\nNot verbally abusive she just got annoyed and played the not talk game of if I didn’t just do what she wanted done and when she wanted it done.\nHere\nDo you have a bucket list of things you want to do?\nNo because that would mean I am not fighting this cancer 100%. I know it will probably end me in a few years, but I have to put all my energy in fighting and staying positive\nHere\ndo u feel betrayed, or was something expected?\nI was blindsided.\nHere\nWhat kind of cancer? (Oncology nurse here). I’m so sorry for your diagnosis and your wife.\nColorectal\nHere\nMy mom currently is receiving chemo for stage 3c colon cancer. You said your blood counts are too low to continue chemo, my mom had the same thing and they gave her a shot to increase her WBC. Has your oncologist tried that?\nThey gave me iron infusions. My platelets weren’t recovering super well.\nHere\nDo you feel neglected?\nI just feel isolated and trapped.\nHere\nHow do you come to terms that you could potentially die soon? How do you make the time left count?\nI am a realist. As far as making the time count I try to do what I can with my kids and otherwise just try to manage the crippling anxiety and mild depression\nHere\nWow that's shit mate...are you looking at deaths door.\nHard to say. Doctors haven’t mentioned much as far as timeline other than sharing with me 5 year live expectancy data. I am at this time palliative care, so I guess it could turn worse at any point as I am off any treatment waiting on surgery\nHere\nWhat’s stopping you from applying to all these credit cards and just living your best life .\nNot my style.\nHere\nhow old are you and her?\n40’s\nHere\nDo you have life insurance?\nYes as long as I have my job\nHere\nWhat are you going to do with your newfound freedom besides focusing on your health?\nFreedom is far away.\nHere\nSource'"
    ]
}