{
    "username": "ambada1234",
    "contributions": [
        "In response to 'Original Post: Quiet quitting could be the best thing for education. Everyone's definition of quiet quitting is different. Mine is not working outside of your contract ours. Work from 7am to 3pm and then you're done. No lesson planning outside of class, no chaperoning, no working gates unless it involves extra pay.\nWhen you ignore these boundaries, you overwork yourself, can't sustain the position, and you end up leaving the profession and in return your students lose a great educator.\nIf you can't do all the tasks a school asks for you to do during the day, that is not the fault of you, it is the fault of your boss requiring too much of you. If you continue doing these tasks outside of your hours you are effectively telling your admin that this is okay.\nWhen you put your value in working extra hours because it makes you feel like you are \"doing it for the kids\" you are doing the opposite long term. The precedent that teachers have to put so much time in outside of work is toxic and leads to teacher burnout. A shortage of teachers is not good for any educational system.\nI'd like to blame admin, government, or students but the easiest fix is in the teachers themselves. When we overwork ourselves, we effectively hurt education. Only work your hours and if you can't get your work done, let your admin know you don't have the time. Healthy work life balance can keep us going and bring more teachers into the profession.\nEdit: Sorry y'all. I didn't realize how problematic the term \"quiet quitting\" is. I am glad though that it brought some attention to the post which led to some good discussion. I will use a different term from here on out and I am happy a lot of you only work your hours or work your contract.', a user said: 'If you are a new teacher this would probably get you fired.\nEdit: not fired on the spot, but they could give you bad evals and replace you if you didn’t have tenure.'",
        "In response to 'False. (source: am fourth year teachers who refuses to be a martyr)', a user said: 'Different schools are different I guess. In the one I was at they would replace anyone without tenure who they didn’t like. Pretty much all the teachers told me not to slack off before I had tenure because they had seen it happen. Example: Years before I started working there there was a big math conference at the school. All the teachers in the department were in a feud with the administration. There were only three teachers without tenure, two of them ended up planning the entire conference themselves. The third one wasn’t there next year.'",
        "In response to 'why is that?', a user said: 'At the school I was at they seemed to have the expectation that newer teachers would work extra hours and volunteer for everything, to prove themselves I guess? Many of the the older teachers told me that’s just the way it is, but then once you get tenure you can do whatever you want as long as you follow the contract.\nEdit: ah sorry I didn’t really mean fired, more like not given tenure. At my school it was easy to get rid of a teacher without tenure so if they didn’t like you, you would just get bad evals and be replaced.'"
    ]
}