{
    "username": "Ambitious-Duck7078",
    "contributions": [
        "In response to 'Original Post: How’s this for quiet quitting? I’m fully remote but have to go to occasional meetings etc.\nI compressed my hours to 4 days a week.\nI start at 7, turn on computer get teams on busy 24/7 use one of my many methods to prevent teams going away.\nGo back to bed until about 10am.\nCheck emails and only reply if necessary while eating breakfast.\nScroll Reddit/social media/utube.\nLunchtime is 12-2 so go to the gym but only “take” 30mins lunch.  Take phone with teams on and go away/busy every 10-15 minutes but never actually confirm when I take my 30 minutes.\nDo chores around the house and garden 2-4.\nLast hour do some work.', a user said: 'Sounds like the typical day of a WFH person. I would go to the movies, or go shopping while on the clock. Turned Teams on on my mobile device and kept my laptop with me in the case I needed to fire up the Hotspot and respond if anything important was needed.'",
        "In response to 'Original Post: Hey guys, I was “quiet quitting” until I got fired , now what? So I just got fired and they recommended me to file for unemployment insurance. HR was surprisingly nice. She basically told me they don’t contest the claims, so I think if I use the right words in my unemployed application,\nI might be eligible for unemployment insurance.\nHas anyone successfully received unemployment insurance benefits in this situation before and lives in the state of Illinois? One of the questions is below:\nAccurately report your reason for separation from your job when you initially file your claim for benefits.\nEDIT: I  shouldn’t have used the term “quiet quitting” on my post because I used the term incorrectly, my apologies. I meant to say, I was really underperforming on my job, barely doing any work for the past year or so. I did the bare minimum. I was  then placed under an improvement plan for a little over 6 months or so. They saw some improvements, and I was doing okay, until I mislead my manager with 2 assignments. I stated that I had completed the assignment but in reality I used last year’s data to mark it completed, while I attempted to catch up over the weekend.\nI never fixed the assignments and my manager found out what I did. That’s when she went to HR for the next steps. I emailed HR for a written confirmation on why I was fired and she responded “unsatisfactory performance.”', a user said: 'You can say your position was \"dissolved.\"'"
    ]
}