{
    "username": "Analyzer9",
    "contributions": [
        "In response to 'Yep\n, the Broligachy has taken over our country. Without actually dragging these fascist fucks out, they will make life alot harder on everyone\nYou were warned America. A dumbfuck they can make sign anything has been their wet dream since Reagan and the country just allowed it.', a user said: '\"Just allowed it\" is a stretch. It takes a remarkably small number of bad actors to destroy an entire well intended group. If anything, we've merely proven many historians and economists right, in allowing a nation to proceed as the experiment in growth as the only God, all others exist only in service to profit. Those most enthralled in hoarding and wielding wealth or power are enabled endlessly in a system defined by competition for resources. So very many wise people warned of the eventual and inevitable conclusion, and it really didn't matter what shape it takes, it has come to that conclusion.\nNow, either they're genius, like we know with modern understanding is unlikely if not improbable, and Musk is currently creating the world's largest Save file, before The Donald and his Nazi youth and deplorable army of J6ers turn America into a brief and glorious Christo Fascist purging of liberalism and equity, so the core of the elite confederates can continue to manage the filthy peasant state like they used to. Yee haw, Texas law for all. Oooor, big or here. Or, they're just heinous assholes bent on making people love and worship them like their mothers did, because nobody will without being forced.'",
        "In response to 'I think it's more that the economy is so far into the gutter that people aren't feeling so confident they won't be replaced or punished', a user said: 'Not either/or, but in addition to.'",
        "In response to 'Original Post: And they wonder why we quiet quit.... Worked at a this place for about a year, did a major systems overhaul with them where I was the front runner for work completed for the project, which helped us finish on our deadline, got praised and honored for my work, then I was told I'd get a nice raise, my raise was less than a fucking dollar in software development... I got a 2% raise when inflation is absolutely ravaging the country and prices have gone up much more than 2%.. works a fucking joke...', a user said: 'Every real raise anyone had ever offered me came when I quit.'"
    ]
}