{
    "username": "Ancient-War2839",
    "contributions": [
        "In response to 'That would require them to notice that you'd been communicating in the first place. I swear with some men, we must sound like Charlie Brown's parents every time we talk about anything other than their interests.', a user said: 'Even when you make big obvious moves - I moved into spare room after another brush off, and made it clear that because both of us can not afford to move is the only reason that im still in the house, had this conversation or similar often, when ever he said something that involved a future that involved 'us'.\nBasically got a 'yeah, yeah' eyeroll every time, like im a silly little girl playing games, regardless of the obvious moves I'm making to get into a position to make splitting happen.\nHe has never cared at all.\nso imagine my confusion when he lost his shit, acting totally blindsided when a mutual friend made a comment about it, ... I've not hidden it from anyone, seperate rooms and seperate lives for a year, hundreds of conversations, poured out my heart so many times.... but he didn't get the message somehow, one guy says one tiny comment and.recognition,  cue begging, pleading and promises... and of course he has realised what a fool he's been, I have been sucked into this before, many times,  normally its a very emotionally charge situation, this time I was just like 'ok', he wanted more, crying etc, \"Im like nah, Allgood, you have realised all this sweet, there no hurry right, IF you are genuine you will of course understand the position I'm in, and you will be content to implement these changes in your life, I don't need to hear about them, I still share a house with you, so I will see it....... so funny watching his frustration, and him trying to justify why thats not going to work, I just need to hear what he's saying and get back with him now... then saying if I don't '\"it's over\"\nOh, ok then, read the room mate, or in this case the rooms, x2, its over, and I don't care\nIts a shit situation, but gotta say that was a sweet spot for me, watching him try all the tricks he's used before with great success, and be totally confused, like \"did she not hear me?\"\nI did ask him why he thought his unhappiness was relevant, when he was telling me how hurt he'd be, as he had zero interest when I tried to address what was making me unhappy, listning to him try to frame his view in a way that didn't sound like 'cause im a selfish twit\" was also amusing\nI'"
    ]
}