{
    "username": "angeliqu",
    "contributions": [
        "In response to 'Yup! Some vitamins/minerals are water soluble and some are fat soluble. You need to eat something containing some fat with them in order to absorb the fat soluble ones! Plus, actually eating the veggies with some ranch is always better than eating no veggies with no ranch. Net positive veggies!', a user said: 'Plus, little kids need calories as much as they need a variety of nutrients. A full fat dip will not hurt anything.'",
        "In response to 'My kid’s doctors recommend that he eats ranch with his veggies because he has dropped down the weight curve. I wish he’d go for it!', a user said: 'Have you tried honey? My kids often end up eating it with a spoon but 🤷🏻‍♀️ they do dip some stuff in it.'",
        "In response to 'Literally got off the phone with my best friend talking about this. We are blessed to have phenomenal hands on partners who carry half the load with our infants, and we are\nrun ragged\n. HOW you can do it alone is beyond me. I couldn't.', a user said: 'It’s the same way you look at two kids when you only have one kid and wonder how they do it. Then you have a second kid and realise one kid was actually really easy. Parents with good partners look at single parents the same way. But if you were a single parent tomorrow, you would do it no problem, but you’d look back at life with a good parent and realise how easy you really had it.'",
        "In response to 'Veggies and fruit are always a perfect addition to literally anything. And chicken nuggets are awesome. We do the same. My kid (3) has just started liking hot sauce with them so that’s an adventure.\nETA forgot to say, I also love cooking and despise/am terrible at the clean up so I save real cooking for when I have the time to treat myself to a somewhat destructive activity.', a user said: 'We’re pretty terrible for including enough veg with supper so I’m always giving my kids a side of fruit so they at least have the right amount of servings. Similarly, sometimes I’ll have pickled beets and raw carrots with dip with my otherwise cooked dinner.'",
        "In response to 'I love to cook. If that was the only chore, I would still be here for it. But then there is the clean up.\nMy personal rule is that if I cook, I am\nnot\ncleaning. My husband or my mom (who lives with us) picks that up. I could not and wouldn't not be cooking every night if I also had to clean up. Ooph.', a user said: 'Our rule is that who even does bedtime with the kids, the other one does the “closing shift” and cleans up. And we alternate every other day.'"
    ]
}