{
    "username": "Anonality5447",
    "contributions": [
        "In response to 'This is more propaganda from Management who for some reason expect that workers will go above and beyond the stated job description for zero compensation.', a user said: 'It's reasonable propaganda for them. We just need to stop overworking ourselves when said benefits don't materialize. I know boomer relatives who were shocked to see how the world really works when they had to go into the modern world and find a decent job after working the same job for decades. Companies often don't care that much.'",
        "In response to 'It's too bad employers don't understand morale and motivation. When I'm happy with a job I'll bend over backwards to make the magic happen. Because I want to. If a person I'm working for wants to be shitty or petty, well, I won't really feel invested in doing that anymore. It's too bad people really don't understand the effects of morale, or what motivates workers to go \"above and beyond.\"', a user said: 'I have always seen people who are happy with their jobs go out of their way for the company. They just always get burned out when there is no return on investment and settle back into just doing the job description. I have to say I no longer go above and beyond anymore either. I aim to just do what I need to do to go home everyday without worrying. My job doesn't pay a living wage, likely never will and the personalities I work with are difficult at best. No need to put your heart and soul into those types of jobs, imo.'",
        "In response to 'I agree with you. The idea that this is even a phrase is ridiculous. I could see it actually applying to someone who just stops working without telling the employer, basically ghosting. Quitting without verbalizing it. But for someone who stopped going above and beyond without compensation? Weird.\nAlso funny when you think of how government contracts are written.  They are very specific, and if the govt wants something that wasn't in the contract, it pays more to modify it. I guess those silly contract companies are quiet quitters by definition.', a user said: 'You're right. Some of the new terms really don't match reality. In reality people do this all the time when they start to realize their job is not going to be fulfilling in any way. They just check out. That's why all the studies say a large portion of the work force is \"not engaged\" at work.'"
    ]
}