{
    "username": "another-dave",
    "contributions": [
        "In response to 'People need to be careful repeating this narrative - a lot of contracts have wording or a clause about successful completion of duties (i.e. you ARE paid for 37.5 hours per week, but if you cannot successfully complete the required work in this time, the work takes precedent over your scheduled hours).\nEdit: not saying yours definitely says this, but as someone who has worked in HR for many years across different companies, it’s really common.', a user said: 'I always wonder how enforceable this actually is — I mean, I can see it for one off things (there's some event so you have to stay late). But if the company gets bigger/busier, when is it the company's responsibility to hire more staff vs you being told to pick up the pace?\nAs in, to put concrete numbers on it — if you could get all the work done in 39hrs people would expect that you just have to suck it up & work late / through lunch. What if it's more like 47.5hrs hours & you're doing that indefinitely?'",
        "In response to 'Then realistically you ask for more money or leave.', a user said: 'Are you saying that if there's a vague clause in your contract like the GP mentioned, you should either \"grin & bear it\" or leave, but you think work to rule isn't a reasonable option to take?\nOf course as the employee, you should push for a raise (thin on the ground) or get a better job. But my point was more from the point of view of unfair/constructive dismissal if you refused to stay late.\nIf the work is open ended, I'd argue that it's not reasonable for you to work more hours in order to get as much as possible done just because of that clause in your contract.\nThat's very different to something tangible e.g. you're the office manager & you have to stay late to lock up because the security guard called in sick.'",
        "In response to 'The law says you should only work 48 hours a week, anyhow.', a user said: '48hrs is 131% of your contracted hours if you're on a 9-5 with 30min lunch (37½hrs).\nThat's the equivalent to working until 7:20pm every day (or leaving on time but working 1½ days of the weekend too).\nThat too, it's averaged over the last 4 months so you'd have to be doing this level of overtime consistently.\nIt's a lot of free overtime before the legal protection kicks in & that's if you haven't opted out as another comment mentioned (I've never been given a contract in the UK that didn't also include a form to opt out that I was expected to sign)'",
        "In response to '[Deleted or Empty Comment]', a user said: 'well, yeah — I think if you get bored of your job/distratced in the middle of the day & decide to slack off, the least you can do is make up the hours later so you're still getting through the work expected of you.\nHave no qualms about someone getting fired for taking the piss. Feels like that's something different though to what I was replying to.'",
        "In response to 'So long as the extra hours don't interfer with other employment rights, then it's enforceable.\nWorkers are entitled to a 20 minute break in any shift longer than 6 hours, 11 hours rest between shifts and a 24 hour period without work each week. If, for example, you were being forced to work through lunch and therefore missing out on the legally required 20 minutes rest, then the employer would be breaking the rules.\nEqually, if the number of hours were such that your average wage became lower than the minimum wage, the employer would again be in breach of employment legislation.', a user said: 'What I mean is, my latest contract has this wording:\nYou may be required to work additional hours, including hours at the weekend or during public holidays, whenever this is reasonably necessary to carry out your duties properly.\nIt's certainly not illegal for them to ask you to do extra hours, but whether you're in breach of contract for just working your regular hours really hinges on \"reasonably necessary to carry out your duties properly\", which is what I'm suggesting is up for debate (though IANAL).\nFor example, in a small company there may be a single person in charge of all admin — recruitment/HR/finance/payroll altogether. In a large company these areas may be separate departments with 10s of staff each.\nIf a small company starts to grow into a larger company, you'll reach a tipping point where it's no longer practical for one person to place every job ad / run every interview / sign off every expense / etc & then that starts to go beyond what could be considered \"reasonably necessary\".'"
    ]
}