{
    "username": "anthonywayne1",
    "contributions": [
        "In response to 'I truly don’t understand the concept unless you’re feeling stuck in your life somehow/for some list of reasons…\nWhy would people\nactively\nchoose to do the bare minimum, otherwise?\nWe spend way too much precious time at work…we’re better off being proactive in trying to make our situation better than committing to “malicious compliance” just for the sake of it.', a user said: 'Quiet quitting isn’t doing the bare minimum. It’s doing what you are paid to do and only that, nothing more, nothing less.'",
        "In response to 'That’s not quitting. It’s doing your job…', a user said: 'Which is why people hate the term “quiet quitting”. It started as anti-hustle culture'",
        "In response to 'What's the difference between those 2 things (\"bare minimum\" and \"only what one is paid to do\")? They sound the same to me.\nAnd FWIW, every definition I've seen, both from websites and general discussions like this one, do classify QQ as \"bare minimum\").\nFor example', a user said: 'Yeah…again, this is why so many people don’t like the term. It leaves it open to so many different interpretations. I try to look at it from the perspective of why it even started in the first place, which is anti-hustle culture in business.'",
        "In response to 'Wouldn’t that distinction only make sense for jobs that aren’t ambiguous, and therefore wouldn’t typically qualify for remote work?', a user said: 'Uh no…'",
        "In response to 'In my case at least, there isn’t a binary method of doing my job…it’s kinda just how I interpreted the ~5 paragraphs I applied to, and how my superiors/peers feel I’m doing.\nSo, there isn’t really a way I can “do the bare minimum”, for example.', a user said: 'As I just recently commented, people typically do not like the term. It was a reactionary term against the “hustle culture”. That’s really where it comes from. So, in that regard, it can apply to any job. Do you work extra hours for no pay? Do you take on other people’s work? Those kinds of expectations from senior leadership is the impetus for “quiet quitting”.'",
        "In response to 'I interpret the term as malicious compliance…what you’re describing, I interpret as setting boundaries and creating balance with my employer and colleagues.\nI do work extra hours and help other people, but I limit how often I do it and I’ll also weigh what else is going on. If I was paid\nhourly\n, I’d only work overtime if I was paid overtime…but with salaries, it’s usually factored in.', a user said: 'I can see it being considered malicious compliance from the perspective of the employer. Even on salary, it’s typically based on a number of hours a week which is typically 40.  This term came about from expectations of employers that staff do what ever they say when they say it regardless of hourly or salary.'"
    ]
}