{
    "username": "Antique_Branch8180",
    "contributions": [
        "In response to 'stop donating!\nI agree! I stopped long ago.\nI say stop volunteering or giving your time as the quickest way to make an impact since this is immediate. A lack of willing volunteers to provide free labor would crush the Jehovah's Witness organization. A lack of volunteers (especially males) is kryptonite for JWs as they would not be able to operate congregations.\nI believe that even if 100% of donations stopped tomorrow.....the Watchtower Corporations have a large enough war chest of funds to keep things running for years.\nBut at some point....an organization with no people working.....is no longer an organization.', a user said: 'Keep running for years? What if each congregation stopped paying for KH mortgages and monthly operating costs?\nSame with assemblies and conventions?\nI doubt the Watch Tower could sustain no donations or cash inflow for years.'",
        "In response to 'Original Post: Is Quiet Quitting now a thing for Jehovah's Witnesses? So many posts here related to Memorial Season for the Jehovah's Witnesses Organization make me feel like many \"active\" JWs are simply engaging in Quiet Quitting. These JWs are not DA, DF'D or PIMO even but they are just doing less....not showing up for in-person activity....not very engaged as a JW anymore. It is great to see this and the growth of this EXJW Sub too.\nReally the most effective thing that can be done to damage the harmful Jehovah's Witness Organization is to simply stop supporting it with your time or energy. Stop volunteering, stop showing up at as many meetings, stop participating if you can.', a user said: 'The Watch Tower corporate religion is on the decline: how fast or slow depends on the level of participation and support they can squeeze and browbeat from their members.\nTheir religious business model is outdated, tired, burdensome and unappealing. The JWs have gotten a taste of a lighter load during Covid-19 and like it.\nIt’s been 109 years since 1914 and the overlapping generations teaching is too stupid for anyone to really believe.\nThe WT is done; don’t give them your money, time or allegiance.'"
    ]
}