{
    "username": "Any_Ad_6857",
    "contributions": [
        "In response to 'Im wondering if someone my age even has a chance to work up in amazon. I’m a rehire but before I asked to do a lot of things, like problem solver. I’m 41 and I didn’t see anyone above probably 30 working in higher positions and most of the problem solvers were like 19. One of the kids on the AR floor looked 12. My AM was most likely 20 years old..\nI was always in the top 15 for stowing in the building, I had good work ethic but they passed me up for problem solving twice. I didn’t bring attention to myself and didn’t cause drama. I even got a shoutout during stand up in pack while I was cross training for doing such a good job my 3rd day. Still.. nothing. I signed up for every thing but was never picked. I’m going into outbound this time so hopefully it’ll be different.', a user said: 'I am 51 and have been there almost 3 years, but I am flex. I know I couldn't do the job full time. My joints would straight up stop working'",
        "In response to 'I’m 56 and been here a year and a half, my second time with Amazon, and I feel this! I’m thankful for the pto and upt and vto. Without it, I’d have been let go long ago. Thank goodness I’m on an OP.', a user said: 'I have a full-time job that I can retire from in less than 2 years and I kid myself and think oh I will go ahead and retire and work full time. I don't know about other FCs, but we have a lot of \"older people,\" and I will say they are the ones that stay.. I think it's a great place to work with all the benefits, which far exceed the benefits that I have as a government employee.'",
        "In response to 'I have a full-time job that I can retire from in less than 2 years and I kid myself and think oh I will go ahead and retire and work full time. I don't know about other FCs, but we have a lot of \"older people,\" and I will say they are the ones that stay.. I think it's a great place to work with all the benefits, which far exceed the benefits that I have as a government employee.', a user said: 'We are exactly the same, lol, government employee, over 25 years. I say all the time I am going to go full time when I retire. Amazon have far better benefits and pay than I ever had as a state employee.'"
    ]
}