{
    "username": "ap1msch",
    "contributions": [
        "In response to 'Original Post: What is the difference between \"quiet quitting\" and working exactly/only according to your contract? [External Link]: /r/TooAfraidToAsk/comments/yr6tin/what_is_the_difference_between_quiet_quitting_and/', a user said: 'Just like other things in life, there are labels given to behaviors that have existed for centuries. The perspective of the individual giving the label, and knowledge of the past, is what changes.\nIf I'm a manager and an employee is not disruptive and just does their job, I might see that person as a good employee, if I am used to dealing with difficult people who don't even do the bare minimum. If I have high expectations, and see someone ONLY doing the bare minimum, I might view them as unambitious, or even lazy.\nIf I'm the employee, and I do what I'm paid to do, then you might see yourself as a good employee. You do what needs to be done and no more. If folks around you fail to do the bare minimum, you might even be perceived as a great employee. If the culture around you is full of ambition, then you might feel pressured to do more than necessary, and therefore doing the minimum now seems like you're slacking off.\nAnd then, if I'm an employee that was ambitious at first, and then disenfranchised, I may simply go back to doing the minimum, because I'm frustrated at the current environment or lack of compensation/recognition. This is what's currently being labeled as quiet quitting by the individuals that are doing (or not doing) the work.\nTLDR: The culture of the workplace, the expectations of the workers, and the individual applying the label, determines if the behavior is seen as normal versus abnormal, and negative or positive in nature.\nThe general consensus is that it is weird that technology and productivity has increased substantially over the centuries, but the expected investment in work has increased, rather than decreased, along with the wage gap between leadership and the workers. As a result, more people are wondering whether this is appropriate/fair, while still trying to keep food on their table.'"
    ]
}