{
    "username": "appmapper",
    "contributions": [
        "In response to 'Many people here would scoff at paying more for a Jeep Grand Cherokee than a fully loaded Lexus SUV. But somehow they're okay with over-inflated home values.\nMaybe you haven't been paying attention to car prices, but FYI they've gone the same way as homes.\nAs an anecdote, my friend was going to upgrade her Acura SUV last summer. A few years ago, we could have got a certified one with low milage for around $30k.\nNot only were certified just not available anywhere, but the only new ones in stock  were maxed out models with all the bells and whistles (many that we didn't want). After all the fees, taxes, dealer increases, etc, we were looking at $70k+.\nOf course they didn't even mention the price - just a lot of magic financing tricks to limit monthly payment with a loan of 7 years or more.\nRegardless, after\nalmost\nbeing convinced into signing the deal, we realized that just 3 years ago, we would have been joking about buying a\n$70k car\ne.g.\nIf I won the lottery, I'd go buy a Porsche 911 or high end Mercedes...\nBut we've been slowly conditioned to just accept this new clown world reality - where a decent \"middle class\" car is now $70k dollars, to be financed over a decade. And a junky, 1500 ft square townhome in some treeless,suburban hellhole with 3 hour commute and no yard is all you can expect to ever own, even if you earn top 10% and have worked your ass off for 20 years. If you're not top 10%, live with your parents or roommates in an apartment well into middle age.\nF*ck all this. American deal was always kind of bullshit - you work your days away with no real work-life balance, few vacations, 0 pension or safety net, but at least you get tons of consumer goods like a house with a yard, a big car, open roads and cheap gas, and lots of cheap food.\nWell now those rewards are all being scaled back, one by one, while we're still expected to slave away for big megacorps.\nNo thanks. I'm out, dawg.', a user said: 'Regardless, after almost being convinced into signing the deal, we realized that just 3 years ago, we would have been joking about buying a $70k car e.g.\nIf I won the lottery, I'd go buy a Porsche 911 or high end Mercedes...\nIts wild that the average new car sales price is nearly $50k. I cannot believe how easily some people roll over negative equity from vehicle to vehicle. That's a lot of bad debt if the borrower ever stops paying.'"
    ]
}