{
    "username": "Apprehensive_File",
    "contributions": [
        "In response to 'You cited a a study by a wealth consultancy company about the perils of what might happen if you don't hire them to manage your wealth, a study which I addressed in my comment stating that a case of someone starting 2 new businesses and selling the old one counts for failure. A far cry from \"a fortune being lost\". You then concluded that \"The idea that someone being wealthy means that you family is set for life is a poor one.\"\nIn reality, the wealth of parents is a huge predictor of the wealth of their children.\nWhich is not generational wealth.\nI am struggling to see why you think that generational wealth is something different than wealth being concentrated in the same families, generation after generation. The table I linked is showing how many of the people at the top made it there on from rags to riches (very few) and how many started from the top (the majority).\nThe table you linked is a measure of how successful children are, not how much money their parents gave them.\nAnd now you're moving the goalposts. Who cares about how much of the money the parents invest in their children is directly inherited. A lot of that wealth comes in play indirectly, through education, support (housing and expenses), networking opportunities, internships, influence, etc. But if generational wealth was not a thing and it didn't matter who your parents are, then we wouldn't have the majority of wealthy people being children of wealthy people.', a user said: 'I am struggling to see why you think that generational wealth is something different than wealth being concentrated in the same families, generation after generation.\nThat's not the typical definition. Generational weath typically refers to the actual weath inherited by the next generation.\nIt's fine if you think other factors are worth discussing, but sticking to common definitions for terms helps communication stay clear. Otherwise you're just talking past eachother.'"
    ]
}