{
    "username": "argjwel",
    "contributions": [
        "In response to 'For honest and kind hearted  JWs:\nStop donating with your hard earned money as well.\nWatchtower will survive for a long time even without your donation. They have investments like stocks, bonds, real estate properties. As you can see they have hundreds of millions of projects after projects around the globe. They use free labors and benefits from tax exemptions which they leverage for more profits when they sell these properties that they developed.', a user said: 'As you can see they have hundreds of millions of projects after projects around the globe.\nYep, starve them out of their income and let they sell their wealthy investments.'",
        "In response to 'I think you may be right. As an example, the circuit assembly for my old congregation was just last weekend. I didn’t attend but my wife did. She said the amount of guys with beards was abnormally high. People just don’t care anymore. And if everyone just starts growing beards because they don’t care, the masses can’t be stopped and eventually it will become the norm. I realize this is a relatively insignificant example but it proves the point on a small scale.\nI’ve said before that pimos may not realize how much power they have collectively. If they all just stopped going at the same time, it would be like kicking the leg out from under a chair. The chair may not fall immediately but it’s very unstable.', a user said: 'In mine they just showed with a mustache, but they were with a full beard some weeks ago, now they are growing it again. haha'",
        "In response to 'What I don’t understand is that they say they are growing. But in my area they are shutting down and combining kingdom halls, because congregations are so small.', a user said: 'What I don’t understand is that they say they are growing.\nBecause they are in nominal terms. They just hide the fact they are barely meeting population growth.'",
        "In response to 'They’ve never kept up with population growth. 6 mil when I was a kid. At least that’s what my parents said. They claim 8 mil now. They’re lying, always have been. I’m 56.', a user said: 'Yep, but in your time the developed countries had good relative growth, while the population boom happenned in emerging countries where the preaching work was small or new.\nNow the growth stagnation is almost a fate worldwide. Africa is the JW last resort to gain some significative growth. But I don't thing the young Africans will bite.'",
        "In response to 'The pandemic kill many but on the other hand seemed to have saved many.', a user said: 'Yep, I used it to get a 'spiritual enlightenment', and now I'm here...'",
        "In response to 'I dont want to say biblical prophecy but, hear me out, (I get it is probably bs) but this is what i keeping thinking and cant shake entirely yet\nWe were taught(I saw that with a very fucking great understanding we were taught lies mixed with truth)\nBabylon the great the world empire of false religion(which probably represents rome- prophectically maybe could make a point its the whole world, commerance, religions, and everything else) was supposed to parrlel the fall of babylon.\nThat is river drying up, we were taught it was the people leaving the churches…excluded witnesses. But honestly what if all religions have served their purpose for nations to keep people docile and now that they have the upper hand there is no need for it. Similarly what if the waters are drying up and people are leaving included from the false religion Jws', a user said: 'Yep. Atheism is on the rise and the trend is hurting JWs hard.'"
    ]
}