{
    "username": "arkofjoy",
    "contributions": [
        "In response to 'Original Post: Where Are the Workers? From Great Resignation to Quiet Quitting [External Link]: https://research.stlouisfed.org/publications/review/2023/09/27/where-are-the-workers-from-great-resignation-to-quiet-quitting', a user said: 'We are traveling around upstate new York right now and it seems like every business has a help wanted sign in the window. Went into a \"Marshalls\" and they didn't have any winter shirts on the racks because \"they couldn't get the people\"\nMaybe having all the housing in a tourist area booking at tourist prices is a part of the problem.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'They were offering 17 an hour and still getting no takers.\nThe highway department, which is usually a steady, well paid job, also had signs out.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'The locals are clearly telling the employers that, because they are offering 17 an hour and still getting no takers.'",
        "In response to 'The highway department might not be so well paying if the local government hasn't kept up with inflation. Steady doesn't mean much of it doesn't pay the rent.', a user said: 'I was Making assumptions. It used to be that those were one of the few year round, good paying jobs up here, where most everything else was seasonal. But that may no longer be the case.'",
        "In response to 'I see the same thing living in northern VT.\nThe rise of VRBO/Airbnb has had a huge impact on housing here.\nDuring Covid, upstate-NY and northern-vt were labeled as highly desirable places to get out of the city. The portion of remote workers in these areas has gone way up. Those people contribute to housing and service demand, but do not contribute to the local workforce. Likewise with retirees. They don't contribute to the workforce but do increase demand for services locally.\nLast thing I'll mention is that the start of school took many part-time workers out of their jobs and back to campus.', a user said: 'Back to school is a big point. People who were getting summer jobs are back at school, but Columbus day weekend we were told was the busiest weekend of the year.\nFunny thing about the remote workers.. We met up with a family friend up here. They built at yurt on an empty lot. During covid they got fiber installed, so now they have fiber to the yurt.'",
        "In response to 'Do they offer health insurance?', a user said: 'Good question. I would hope so.'",
        "In response to 'A lot of these companies just don't want to pay health insurance so they don't offer enough hours.', a user said: 'That is likely. Foolish, but the usual thing of corporate making decisions down on the flatlands and not realizing that the situation is different up here. The woman I spoke with said that she would do more hours if they would let her. I was assuming that she was referring to getting time and a half, but you are likely correct, and was wanting to get up to full-time.\nAll the while, customers are walking out of the shop empty handed, because the stock is not on the floor.'"
    ]
}