{
    "username": "Arschgeige96",
    "contributions": [
        "In response to 'This is exactly what I do on longer trips. So many itineraries I see on here are people moving to a new city or country every three days, and that would totally burn me out. I’ll usually pick a few places where I stay for a couple weeks (sometimes a month or two), and then add the quick city breaks between those longer stays. Some people put a lot of pressure on themselves to see everything, and I understand some people have limited time, but I love getting to know a new place, relaxing, exploring at a leisurely pace.', a user said: 'Big on this! I had to say no to a couple trips with my friend because she always wants to fly to a place on a Friday night then back home on the Sunday to be ready for work. It’s way too exhausting for me and I end up having anxiety issues'",
        "In response to 'Oh god I love and hate such trips at the same time.', a user said: 'I don’t mind it if it’s a really small city with nothing going on around it but I like to take it a lot slower for most trips. I like to get a proper feel for a place rather than rushing around ticking things off a list. However I do appreciate that I’m in a privileged position where my job allows me the time off to go for a little bit longer. Not everybody has that so I do understand it a bit'",
        "In response to 'Original Post: Anyone Ever Quiet Quit a Trip? This has happened probably three times where I get close to the end of a trip and just become over it all and just end to get back home (the US). I don’t want to visit another church/palace/museum, I don’t want to wander anymore (my feet hurt). I’m tired of eating out and just done with it all. Doesn’t mean I’ve had a bad time, but I’m ready to be back in my comfort zone and bed. So when this feeling hits. I sort of find myself shutting down.\nThen, I feel guilty because I’ve flown across the world to be in a city people dream of visiting and I’m not soaking in every moment. I will say when my social connections are low, this quiet quitting happens faster. But despite 100 museums and sites. I have no energy to see anymore.\nHas anyone else experienced this?\nEdit: I’m trying to read all of these responses, on touchy airplane WiFi. But thank you for your responses!', a user said: 'I did this in Slovenia for that reason. I was shattered as it was the end of my trip and it kinda ruined it a bit for me. Beautiful place, would love to try it again'"
    ]
}