{
    "username": "artificialavocado",
    "contributions": [
        "In response to 'If it's a reduction in force, (layoff) that's also valid. If the company won't contest it, it shouldn't be a problem.', a user said: 'Hopefully HR sticks to their word. This happened to me once a long time ago and they contested it. I was there 7 years and promoted twice called off enough times to count on one hand and they basically said “golly gee, we don’t know what happened he just stopped showing up.” I had to have a hearing about it and everything. My history there and I think the fact that several people from there filed in a short timeframe it was obvious what happened. This was before zoom was common I had to drive like an hour to the hearing it was a huge pain in the ass.'",
        "In response to 'when i used to work in payroll departments any time an employee filed for unemployment i'd get a notice giving us the option to contest and i'd just throw em out every time lol.', a user said: 'A lot of places aren’t like that they contest it out of spite. Even if someone did fuck up (within reason) a few hundred bucks a week so they don’t literally starve or end up homeless isn’t much especially in my state where we pay into the UC system as a separate tax.'",
        "In response to 'I’ve heard of employers that will, by policy, contest every single one but almost never show up to the hearing.\nSimply because, on the off chance that the claimant also doesn’t show up, a lot of places will throw out the claim entirely.', a user said: 'It just doesn’t seem fair that in a “he said, she said” they take the side of the company all else being equal.'",
        "In response to 'That's not been my experience. And unfortunately I've been there a few more times than I deserved.\nAny time I got demoted, pay was cut or laid off i got UI.\nI have a track record of working for companies that over reach and end up cutting people. Usually they either get sold or close down within a year.', a user said: 'I did once it was 2016 I think and it was a nightmare. It took almost 3 months to finally get sorted out. I’ve only ever worked for scumbag organizations though that like hire illegals immigrants so they can pay them crumbs and treat them like they aren’t even people.'"
    ]
}