{
    "username": "AslandusTheLaster",
    "contributions": [
        "In response to 'i still think it is bullshit- \"you're the boss, you give me tasks to do.  if you want me to do something else, we can renegotiate.\"\nacting your wage is just another cutesy bullshit term to once again place blame on the worker, as if they aren't trying hard enough to maximize their owner's wealth.  you wanna be the boss, be the boss.  don't blame somebody else because you're not a good enough leader.', a user said: 'I think the bigger implication with \"acting your wage\" is \"You pay me next to nothing, I do next to nothing\", or to replace it with another cutesy term \"slacking will continue until wages improve\". Not just changing the term, but putting the onus on the business for not giving proper compensation instead of acting like it's the employees choosing to step out of line.\nI don't think it necessarily works from this angle of \"the company is falsely advertising by making me do work they didn't put in the job listing\", but I don't think it was intended to.'",
        "In response to 'to me it seems like a very clear way to blame the employee while maintaining the status quo.\nactually quit, get a higher paying job, and all employers are pissed off.', a user said: 'actually quit, get a higher paying job, and all employers are pissed off.\nTo me, that sounds like much more like putting the blame on the employee than any term for doing less work on the job.\n\"If you don't like it, just leave and find a better job\"? Well what if those jobs don't exist? What if every company is paying garbage and overworking their employees? What if the boss just has such a large pool of potential workers that they don't care if you quit? What if you're in a specialized industry and it's hard to find another job that uses the same skills as your current one?\nIn the real world, one that's not a capitalist fantasy land, that's the reason Unions exist. It's why picketing, strikes, and slowdowns (the actual term for \"quiet quitting\" that didn't come from TikTok) are a thing: because sometimes workers need to be able to directly hit their boss in the wallet to make change happen and get the compensation and treatment they deserve.'",
        "In response to 'for sure- work to the rules or work slow downs are fine.  i think \"quiet quitting\" has nefarious intentions and i dont think we should endorse using that term.', a user said: 'On that we're in agreement, though I'd also point out that it's extremely misleading as a term. \"Quiet quitting\" sounds like a term for deserting your post, not doing less work while on the clock, so I wouldn't be surprised if this is part of an effort to paint this as a new \"labor shortage\" crisis so companies can widen their recruiting pool and/or slash wages and thus lower labor costs.'"
    ]
}