{
    "username": "Astyryx",
    "contributions": [
        "In response to 'Are you a woman? Because oftentimes “fun” or morale building activities- party and event planning logistics, holiday events are pushed off onto women in the office with little thought or awareness into how much effort it takes (think Jim and Dwight when they finally have to plan a birthday party on the Office) and usually cause we enjoy doing it and have a knack for it because it’s what we do in our personal lives as well.\nVenting to each other is a natural stress relief amongst coworkers and honestly part of “managing up” if you are senior on your team, it takes a lot off of the bosses to let people vent to you. He’s an idiot for not understanding that.\nSo no, NTA and keep just doing excellent work with a positive attitude and being “too busy” for extras', a user said: 'usually cause\nwe enjoy doing it\nit's one of the few workplace things women can reliably get positive recognition for\nand have\na knack for it\nbeen intensively socially trained to do all our lives\nFixed it.'",
        "In response to 'Thank you. I did try to explain it to him when he was marking me down. The real irony is he was sitting there calling me a potential negative toxic presence that was going to ruin team morale the day after I had just handed out hand made Valentine's to my other teammates.', a user said: 'I think there's something larger at play here. You've taken on a large, unpaid, unrecognized burden of happiness manager in the office. He benefitted by that, but you actually were propping up a distortion: work is not family in any positive sense, work is not community. Unless it's an S- or C-corp, work is intrinsically an exploitation where you are more productive than you are paid to be.\nI, too, used to think that venting was healthy. I don't anymore. What I realize is that while venting allows us to offload some of the unbearable pressure of a workplace, it is a sign that we feel powerless, and it goes nowhere.\nInstead of venting, we need to reclaim our power both as individuals and as a collective.'"
    ]
}