{
    "username": "Atschmid",
    "contributions": [
        "In response to 'Not really sure. I have tried to get an answer as the down slide began right around my cancer diagnosis. She has since claimed she was over it long before then.\nWe argued more, but I also felt she stopped being half a relationship and decided she wanted what she wanted and was going to do what she wanted.\nMind you I spent much of our marriage adjusting to make her happy. I have virtually no friends because she would always start a fight if I tried to hang out with friends. My only friends where her friends significant others.', a user said: 'Sorry, not buying it.  No one doesn't know why their marriage failed.'",
        "In response to 'People have been known to leave marriages before because they couldn't handle dealing with a spouse's devastating diagnosis. It adds emotional insult when support is needed most from loved ones on top of the injury of a possibly terminal disease, but it's unfortunately more common than you may think. It's cowardly and selfish, but it sometimes truly is a nasty development that the ailing spouse never saw coming. Often, the reasons given are after-the-fact self-rationalizations that make them feel better about their abandonment of their spouse rather than owning up to the fact that they are just scared and couldn't handle being a caregiver to a very sick partner.', a user said: 'Ok.  But then both partners know.'",
        "In response to 'Not too worried about all that as I know she would make sure it goes to taking care of my kids.', a user said: 'Kids?  How many, how old?'",
        "In response to 'Original Post: I have Stage 4 Cancer and my wife quietly quit our marriage. AMA What the title says and add in the current climate in the US, so to move out and get a divorce would leave us both fucked.\nEdit: Wanted to tell everyone thank you for your kindness', a user said: 'What does the political climate in the US have to do with anything?'",
        "In response to 'Everything is 10x more expensive.', a user said: 'That's always true.'"
    ]
}