{
    "username": "attackofthetominator",
    "contributions": [
        "In response to 'i just was going to quit but they gave me a counter for higher pay and full time remote. i accepted.', a user said: 'Yeah OP needs to start looking for new jobs so 1) they can switch to a better company or 2) show the offer letter to scare their boss into giving them a raise. The latter is very useful for negotiating, when I switched to my current job, I got my starting pay bumped up by 15% when I showed them how much another other company's offer was.'",
        "In response to 'But this is the new trend they call rage applying which companies are also upset about.\nhttps://www.forbes.com/sites/jackkelly/2023/01/09/rage-applying-to-jobs-is-the-newest-tiktok-trend/', a user said: 'Lmao, is \"rage-applying\" the new buzzword now? It's pretty simple, treat your employees well and pay them their fair share, and they'll stay. Slapping on the \"quiet quitting\" \"no one want to work anymore\" or \"rage applying\" label won't stop workers leaving your shit company for a much better job.'",
        "In response to 'Original Post: It’s Down to Managers to Stop Quiet Quitting, Davos Leaders Say [External Link]: https://www.bloomberg.com/news/articles/2023-01-17/it-s-down-to-managers-to-stop-quiet-quitting-davos-leaders-say?srnd=premium', a user said: 'That many companies conducted exit interviews with employees leaving during that time was a good idea, Grant said, but “I would much rather see employers conducting entry interviews or stay interviews.”\nThis reminds me of when I took a Human Resources class in college and the course was going on about how apparently more pay isn’t a priority for employees in the workplace. The past few years proved that concept to be bunk.'",
        "In response to 'Seriously, it’s very evident where the priorities of that class lie. It’s obviously much cheaper for the company to buy a $500 ping pong table and balls and claim it as a fun thing for employees to take a break with than admit they need to bump employee pay by $5k/person to keep people. Lowest cost wins, always.', a user said: 'You're giving them too much credit.\nThey're buying the ping pong table from the clearance section,\nthe $500 one is for their vacation home.'"
    ]
}