{
    "username": "Augustus_B_McFee",
    "contributions": [
        "In response to 'Original Post: How many of you have \"quiet quit\" and when did it start for you? I got to say for me I quiet quit my last job 5-6 years into it after realizing I didn't have a future with that company, but I never left because I was at least getting paid and now have a decent savings account because of it. I legit started my new job early this year and I've already quiet quitted. I hardly do the bare minimum since I gave them a whole summer of hard work and not a single fucking praise. Or even any kind of \"hey keep it up you've been doing an awesome job\". The moment I make a mistake I feel like it destroys everything i worked hard for so what's the point anymore? I'm just going to keep working enough so I don't get fired, but if I do I doubt I'll be upset over it. It also just seems the way 2023 has went if the economy and housing market continues to stay awful next year I can already see people quiet quitting for 2024 and it hasn't even started yet!', a user said: 'I started quiet quitting years ago back when it was called ‘doing only what you’re paid to do’\nI’ve never been interested in promotion. I like my job too much, but whenever I’d see some paperwork head my way that’s designed for a position above me, I slide it back.\nWas once told, when I pointed out ‘I can’t sign this, it requires someone in X position or otherwise authorised’. Was told ‘well I’m authorising you’. \nI made a point of being crystal clear that I’m not looking to expand my role above the current remuneration package, and thanked them for their consideration\nThen slid the form back across the table.'",
        "In response to 'Yeah we are supposed to meet a quota at work which first of all is really high. Then you want to get mad at us for making a mistake? Like hello of course we will make a mistake. You're asking us to get a lot done each and every day. I'm not even talking about like a \"reasonable\" amount of work. Like literally glued to your computer for 7.5 hours and still try to hit quota without making a mistake.', a user said: 'Not being a computer user for work, and barely at home, all I’d say is every single shortcut should be implemented \nAnything that makes it easier, while at the same time making it look like you’re working at maximum efficiency and unable to take on any other work.\nAnnoyingly they remember the mistakes, and instantly forget the successes. \nIf all else fails, point out to them how one of their mistakes impacted your efficiency, but that you’ve up till now ignored it because you recognise their workload is likewise high. \nIf however they prefer the workplace culture to focused on mistakes, you can focus on their managerial mistakes.\nOr they can leave you alone.'"
    ]
}