{
    "username": "auschemguy",
    "contributions": [
        "In response to 'This is a bs buzz term being used by business, media, and social media.\nThere is a formal term for this in industrial relations. It’s a form of covert conflict known as ‘work to rule’. As time goes on people are more educated and don’t accept unfair trade offs. The digital nature of society has also exposed the lie that “you should be grateful you have a job at all” (if you have desirable skills you can get a new job quickly).\nTo answer your question - i’m not actively doing it, but I am operating to the terms of my employment contract. If they want more I expect to be appropriately compensated', a user said: 'work to rule\nQuiet quitters are under-performers, typically underperforming enough to be a problem, but not outwardly enough to bother with formal HR processes. Most quiet quitters are going to end up having suitability conversations to nudge them towards another role, or otherwise end up on performance management pathways. It's typically a motivational issue.\nWorking to rule, typically used in relation to industrial action, is a form of protest where you refuse to do activities that are typical of your work, but not explicitly required in your job description or prpcess responsibilities. The impact on productivity is much more pronounced. You could extend this sentiment (of protest and refusal to do tasks that are not formally documented in the role description) to an everyday situation, but it's likely to quickly result in performance management without the framework protections resulting as part of planned industrial action.\nFinally, there's doing your job, which is not work to rule, nor quiet quitting. This involves doing your job in the allocated time, within a satisfactory band of productivity/performance. This sounds like what you are describing.'",
        "In response to 'That’s not been the definition of quiet quitting that has been publicly spread. The crux of it is “not doing what you’re not paid for” (doing the bare minimum of your iob requirements). The employer argues it’s not going above and beyond, and only doing the bare minimum. The employee argues they’re doing what they’re paid to do, and only what they are paid to do.\nWork to rule is defined as industrial action where employees do the minimum they are required to do in their employment contract. Employers consider it the bare minimum, employees consider it doing what they’re paid to do, and only what they’re laid to do.\nBoth quiet quitting and work to rule can be subject to the exact same performance management processes. In all honesty you’ve said what I’ve said… (and said again here) just using different words.\nTangibly they are the same and result in the same outcomes. Reduced productivity, output, and efficiency and are detrimental to a unitarist or pluralist social structure (assuming we’re talking about the ‘west’).\nAs an example - my employment contract stipulates my working hours are 38/wk. i do no overtime, and do not take overtime when offered. I work exactly 38 hours and leave (do mot stay back, do not come in early). I take my breaks when scheduled and don’t work through them to help during busy periods. Am I quiet quitting, working to rule, or am I doing my job?\nThe answer ultimately depends on the perception of the person looking at my actions, but it could be seen as industrial action, quiet quitting, or doing my job no matter what way you look at it.', a user said: 'As an example - my employment contract stipulates my working hours are 38/wk. i do no overtime, and do not take overtime when offered. I work exactly 38 hours and leave (do mot stay back, do not come in early). I take my breaks when scheduled and don’t work through them to help during busy periods. Am I quiet quitting, working to rule, or am I doing my job?\nDoing your job.\nYou're quiet quitting when, instead of working 38hrs, you're joining a meeting with yourself to look \"busy\" and watching TV or doing the housework.'",
        "In response to 'You're quiet quitting when, instead of working 38hrs, you're joining a meeting with yourself to look \"busy\" and watching TV or doing the housework.\nthat's not quiet quitting, that's essentially fraudulent behaviour (you are intentionally undertaking wrongful behaviour for financial gain). The fact that you're doing it for an employer and not a paying customer or client does not give flexibility on the actions being performed.\nI'm not sure how much more simple I can make this or compare it to, it may just be an 'agree to disagree'. You're welcome to google the terms and explore the corporate powerpoints, and the definitions. I'm happy to give you multiple:\ndoing the tasks involved with your assigned role at work, no more, no less; doing your job without your job taking over your entire life.\nWorkers only do the minimum work required by their supervisors. They give more priority to life outside of work than to promotion and fame and do not want to focus all of their lives at work.\nDoing the minimum requirements of one's job and putting in no more time, effort, or enthusiasm than absolutely necessary.\nAll 3 of those are definitions provided for Quiet Quitting. See how they all align with \"doing the the bare minimum of your duties\" which is 'doing exactly what your job says, no more no less'? There are ops roles that do not have the opportunity to WFH to manipulate it the way you're stating. Doing 'only the bare minimum' but doing the job is still considered quiet quitting in these roles.\nThere is no definitive difference between quiet quitting, work to rule, and doing your job, other than the perception of the person who is making the statement.\nIn my personal opinion if you are academically inclined you will use the term work to rule. If you have extensive experience in the workforce (but no academic background) it will be 'doing your job'. If you are Gen Z or new to the workforce (or heavily into social media) it will be quiet quitting. They are all the same thing. Unfortunately how people perceive it changes greatly depending on the terminology you opt for.', a user said: 'that's not quiet quitting, that's essentially fraudulent behaviour (you are intentionally undertaking wrongful behaviour for financial gain). The fact that you're doing it for an employer and not a paying customer or client does not give flexibility on the actions being performed.\nThat's exactly why it's quiet\nquitting\n- because you aren't working, you are doing something else.\nBTW, I'd say I am pretty\nacademically inclined\nand I'm not adopting terminology based on industrial action to describe doing your job as agreed, and using both in place of quiet quitting - an act of microagression towards an employer arising from a lack of motivation or interest.\nIn an office environment, quiet quitting is doing things like:\n- organising/attending excessive meetings to avoid doing work\n- away from desk/ prioritising duties non-essential to your role\n- otherwise fucking around outside of designated agreed break times instead of doing the work required, but in a way that you can\njustify\nQuiet quitters will tend to do the work they\nwant to do\nand not the work they don't want to. As I said, it's a motivational issue, and if you are quiet quitting correctly, you'll be a pain in the butt, but an employable one for the most part.'",
        "In response to 'I don’t think so.  Underperformers don’t (initially) know they’re underperforming and not meeting a benchmark. Quiet quitters are consciously playing a game where they try to just hit that benchmark and do no more.', a user said: 'That's underperforming. You are performing below expectations, just not to such a level that it's worth pulling you up on it. You are expected to\ndo your job\n, that is do what is reasonably required in the allotted time.\nWorking more or extra is performing\nwell\nand doing your job (at least the\nbare minimum\n) is performing satisfactorily. If you don't think quiet quitters are not on management radar, you're deluding yourself. As I said, most quiet quitters will get quietly pushed into another role that better suits them/the employer (I.e. something the employee actually wants to engage with). It doesn't typically require HR nor onerous process to meet unfair dismissal obligations.'",
        "In response to 'I didn't suggest \"\nquiet quitters are not on management radar\",\nso I don't think I'm deluded.  I'm just saying that underperformers are a different breed to Quiet Quitters.  If you don't agree that's fine.  But if you're in an organisation where under-performers aren't actively managed to try and improve their performance that's a rarity, in my experience.', a user said: 'I didn't suggest \"\nquiet quitters are not on management radar\",\nso I don't think I'm deluded.\n... but you suggest that they aren't underperforming? Which is it?\nI'm just saying that underperformers are a different breed to Quiet Quitters.\nHow so? Both underperform. The latter is just harder to sack.\nBut if you're in an organisation where under-performers aren't actively managed to try and improve their performance that's a rarity, in my experience.\nQuiet quitters are still managed, they just aren't\nofficially\nmanaged through a PIP or intensive HR process because they do\nenough\nthat it draws out that process and the productivity cost of pursuing that path is higher than the productivity cost of the poor performance.'"
    ]
}