{
    "username": "Aussieflipping",
    "contributions": [
        "In response to 'Original Post: What happened with quiet quitting? I'm definitively going to start quiet quitting this next month. I'm not proud to work at my current company (quite the opposite) and my boss thinks he's paying to make me his slave.\nBut I was looking for tips on how to start quiet quitting here on Reddit and I could only find old posts. It seems like it's not a thing anymore. Is quiet quitting dead? What have I missed?', a user said: 'Been quiet quitting for 4 years now. Down to 1 office day a week and 3, 1hour meetings per week, rest of my days are quite empty without any real oversight.\nHonestly might need to start working a bit more, I’ve run out of shit to do, renovated pretty much the whole house, set up a little side hustle that no longer requires much input, run out of shit to watch  on the streaming services. Open to any ideas on how to fill the day haha'",
        "In response to 'Sounds like you need to take up veggie gardening! Then you can literally \"eat up\" all your spare time!', a user said: 'Haha one of the first things I tried. Turns out I’m the grim reaper to plants'",
        "In response to 'What type of job allows this?', a user said: 'Very technical role, my “people” manager doesn’t know shit about the tech. I say a task takes 20 hours that only takes 15 minutes and she takes it as gospel. God help me if I ever get a manager that is even remotely knowledgeable in the field'",
        "In response to 'Tech field or no it has been my experience that supervisors rarely know how to do your jobs b or even what your job is. Heck my supervisor keeps telling me I need to improve my metrics and when I ask what they are she says “ I don’t really know” and then I would ask how can I improve them and she says, “I’m not really sure” and I say what are these measures based on and she says, “ well I need to jump off this call, I have another meeting.” I didn’t hear from her for another year when she called to discuss why her turnaround survey was bad and I said”I dont know” and then she asked how she can improve to get a better survey and I said “ I’m not sure”….', a user said: 'I 100% agree with this. Having people managers is stupid, your manager should at the very least have a basic knowledge of your role.\nHowever I’m not going to complain, due to the incompetence of my company I have the time to actually enjoy my life'",
        "In response to 'Where I live you'd run the risk of having to pay back all your salary or a large part of it.', a user said: 'Not worried about that. My yearly performance reports have all been in the highest band. Even if they figured it out, no company will admit they where clueless that a staff member was barley being utilised. The worst case scenario is they figure it out and make me redundant. I’ve been there for so long now that would be a payout of about 80 weeks of pay.\nHard to say your a shit employee when they praise you every year with good performance reports and bonuses'"
    ]
}