{
    "username": "Available-Captain-35",
    "contributions": [
        "In response to 'I couldn’t believe it when I reduced my workload last year to the bare minimum while still making sure my SPED students were supervised during school hours and their IEPs were prepared with meetings held within the compliance timeline… and I was STILL doing 12 hours of unpaid labor per week. I then decided to do “for real quitting” lol. I won’t be returning to education.', a user said: 'What are u doing now? I’d love to for real quit'",
        "In response to 'I’m in the Learning and Development space in a corporate job. I upskilled for 5 months (including summer break) and quit mid year when I got a good offer. There are lots of quitting teaching podcasts, TikTok accounts, and Facebook groups that helped me jumpstart the transition.', a user said: 'If you don’t mind, can you please share which groups helped jumpstart your transition and how you up skilled.'",
        "In response to 'Sure!\nTransitioning resources: \n[Facebook Groups]\n- Life After Teaching - Exit the Classroom and Thrive\n- Leave Teaching.. and Smile \n- Teachers in Transition\n- Life After Teaching: Educator Options Beyond the Classroom\n[Podcasts]\n- The Teacher Career Coach\n- Teachers in Transition\n- Future Former Teachers\nI started writing a journal in my phone notes app to document how I was feeling during my lunch break every day. I wrote things like “brain is spinning,” “I sit in my car 30 mins before going into house,” “I’m nasty to my partner”, “heart rate was in 80s all day at work”, “dizzy spells”, “forgetful”, “abused”, “cognitive overload”. I did this so if the “you’re doing this for the kids!” gaslighting got to me, I could remember the reality of my situation.\nHow I upskilled:\n1. Wrote down all of the biggest accomplishments throughout my career. Also wrote down my favorite eras of my career. \n2. Pondered “What was it about those tasks that demonstrated my skills? What brought me joy?” \n*I learned that I was happiest in the early pandemic when I was teaching 20% of the week, networking and developing tech skills 10%, designing & creating new materials 60%, assessing/evaluating 10%. I’m an introvert and I way prefer being behind-the-scenes creating programs than being “on” all day. \n3. Revamped my LinkedIn account and looked through endless amount of profiles, job openings (not to apply yet— just to explore), connect with people. LinkedIn became my go-to media during any down time. \n4. I started recognizing that L&D seemed to be perfect for me. I found YouTube people (Devlin Peck, Cara North) who have great free resources on upskilling in the field. \n5. Rewrote my resume to include all of the accomplishments in #1 that could align with L&D skill requirements. Learned corporate jargon and used it in my resume. \n6. Learned common L&D tools (using free trials of software). Made an instructional design portfolio during my free trials.\n7. Read many L&D job descriptions on LinkedIn, followed well known L&D people, scheduled coffee chats with people in the field. \n8. After narrowing down the specific niche of the field I wanted to be part of, started applying to jobs. \n9. Customized my resume and cover letter for every single job I applied to. \n10. Applied to 70+ jobs in 2.5 months.\nBeing in corporate, I am so proud of how many of my teacher skills have transferred over. Also, I can’t believe how many different types of jobs there are out there! Teachers are so skilled and so capable of sooo many jobs outside of education. This is not meant to influence anyone. Just sharing my story and what worked for me!', a user said: 'Thank you so so so much! This year although it’s just begun is especially taking a toll on me. Everyday I ask myself how many more days can I do this. And I don’t think it’s many more.  I truly appreciate your response.'"
    ]
}