{
    "username": "AverageHobnailer",
    "contributions": [
        "In response to 'Original Post: Japan's historic work ethic is declining—45% of workers admit they're quiet quitting [External Link]: https://fortune.com/article/japan-work-ethic-declining-45-percent-of-workers-quiet-quitting/', a user said: 'The \"work ethic\" that didn't really exist? My observations living in Japan have been that there are two types of \"Japanese work ethic.\" One is the master craftsman who dedicates their life to their trade in pursuit of perfection, sometimes to a toxic level which more or less abandons their family responsibilities. The other is appearing to be busy without accomplishing anything, as is typical in the corporate world, which isn't really a work ethic at all.'",
        "In response to 'I really can't agree because the service level you see for wait staff is an excellent example of a great work ethic. Whenever I compare Denmark to Japan at this specific point, I really hate the lazy Danish service', a user said: 'Service industry is not corporate.'",
        "In response to 'The other is appearing to be busy without accomplishing anything, as is typical in the corporate world, which isn't really a work ethic at all.\nMore accurately, it’s a survival instinct.', a user said: 'If it is I don't identify with it at all. My survival instinct is to clock out as soon as possible and gorge myself on hobbies so I don't have a mental breakdown.'",
        "In response to 'The term quiet quitting is so dumb. I know, in the states, it was used to basically used to describe doing what was outlined in your job(s) contract & not going over and beyond.\nThat's not \"\nquiet quitting\n\" that's doing your job. Workers shouldn't feel pressured to do an ounce more than the job they signed up to do.\nEdit:\nWorkers said they do the basics required for their jobs for various reasons, but cite wanting a better work-life balance or feeling indifferent about their career path as prime reasons for losing motivation at work.\nIt seems it's being applied similarly here too. If employers want more work. Let them pay more money & put it in the contracts & let employees know up front when they sign up for the job.', a user said: 'The term is dumb because anyone who read 1984 in high school can recognize it as doublespeak.'"
    ]
}