{
    "username": "awsomeX5triker",
    "contributions": [
        "In response to 'This is how I use it too. But then I see a lot of people, maybe just as many, using it like OP who obviously isn’t just an unreasonably demanding manager — and then managers who take advantage of the confusion and ambiguity to frame people not going above and beyond as people who aren’t doing their job, acting like both definitions mean the same thing (maybe in their world it does). So the terminology has become a bit of a mess imo', a user said: 'As you mentioned above, there is definitely some deliberate muddying of the water regarding the term “quiet quitting”.\nGroup A:\nSome people, like you and me, understand that quiet quitting is just setting healthy work boundaries and doing the job you were hired to do without going above and beyond for no reason.\nGroup B:\nSome people, understand the above description of quiet quitting, but deliberately muddy the waters around it’s usage. Usually conflating it with slacking or performing well below acceptable levels. They do this because of group C.\nGroup C:\nIs made up of people who don’t actually know what “quiet quitting” means. The muddied water makes them hear multiple conflicting descriptions and it becomes too confusing for them to actually care enough to figure it out. It may become a meaningless phase to them or they may even outright misunderstand the phase. \nThese are the people that make you question whether or not the phrase is being deliberately misused and provide cover for group B to hide within.'",
        "In response to 'I think there's a group A 1 - which is where quiet quitting and having healthy boundaries is combined with a kind of malicious compliance. I think that's mainly where the waters get muddied - because I don't think a lot of people have a problem with Group A - but there is a part of it where  some folks take it a bit far.\nFor example, if you're working a call center and there's an outage. The phones start ringing off the hook. Technically, you're allowed to take two minutes between each call to write notes, but most people will speed up their wrap up time to try and help with the queue. The person who takes all two minutes, even if they've finished faster (say, twiddling their thumbs for 30 seconds) is within their right to do so, but it's kind of a drag for everyone else.', a user said: 'I’d say that if it is a rare and unusual circumstance, then I see no issue with going a little above and beyond to help deal with it.\nIt gets problematic when the “above and beyond” scenario is common or reasonably predictable.\nIn your call center example, I would say that power outages and the flood of phone calls is a predictable scenario that will happen occasionally. We don’t know when, but we do know that it will happen eventually.\nIf, as a business, you want your employees to work extra hard during this high call volume time, then why not incentivize them to do so?\nI imagine there’s data that tracks however many calls each employee takes. Just have calls taken during peak call volume times be worth a little more. Like a commission. Doesn’t even need to be a lot. If a motivated employee can earn an extra $20-$30 over the span of an outage as opposed to someone taking the full 2 min between calls, then you will find a lot less employee’s using the full 2 min.'"
    ]
}