{
    "username": "ayaangwaamizi",
    "contributions": [
        "In response to 'Answer: It's corporate propaganda.\nThe job market was really strong for workers, and workers were re-evaluating their priorities in light of the shift to ubiquitous work from home.  They realized that they weren't under the thumb of their employer, and started taking \"work-life balance\" seriously.\nOn the other hand, their corporate overlords had a bunch of legacy real estate they were having a hard time justifying maintaining.  While their bottom lines continued to be as strong as ever, middle management started to feel more and more useless.\nIT infrastructure had a do-or-die moment, and with 2 continuous years of business running remotely, those who survived have proven (sometimes to their own dismay) that their business doesn't require brick and mortar to house their workers.\nAnd because of this, remote work has been normalized.  Before, you kind of had to live within driving distance of your workplace.  Now, not so much.  So the job applicant pool has gotten much larger.  Good for companies because the talent doesn't have to be colocated.  Good for workers, because more jobs are available, especially outside of cities.\nThis perfect storm has taken the power away from the corporations.  Workers are making lateral moves for more money because more jobs are available and inflation has outpaced normative corporate cost of living raises.  It's all because of remote work, and that's why they want to stop it.\nSo now they talk about people \"doing the bare minimum to get by\" and needing more oversight to improve output.  What they really want is you back under their thumb and powerless.  They want you to go back to being a toady, sucking up to them and freely giving of your precious time in the hopes of a raise.\nBut they're not the only game in town anymore.', a user said: 'This breakdown is so important, thank you for explaining it so succinctly.\nThe expectation to go above and beyond in the service of your employer while they simultaneously minimize your importance and suggest you’re replaceable at any moment is so degrading.\nThe dynamic they cultivate is one that is commonly seen in abusive relationships.\nHigh value of the person in the beginning. As the honeymoon phase ends and people start to get comfortable and confident in the security of the dynamic, the person with power attempts to push the person off-balance, with degradation, humiliation, threats, coercion, and manipulation. They move quickly into devaluation, keeping you in a position of deep insecurity and fear that prevents you from gaining the confidence to leave. We end up accepting much less than we deserve for more work to appease an unrelenting, critical and unforgiving power.\nWe are expected to be grateful for their kindness and deference when it is given, yet it becomes increasingly fleeting, with more and more strings attached.\nThe pandemic flipped the power dynamic and everyone got to collectively witness this shift and gain a clearer understanding of their value in this society beyond just their labour contribution to some insatiable machine. I just wish we maintained more pressure on these exploitative systems to prevent it from moving back so quickly to the abusive relationship that was normalized.'",
        "In response to 'Reading your post suddenly brought me back to why I quit working for a corporate franchise and started working at a privately owned small business. You are absolutely correct with your description: It was GREAT, at first. By the time I walked out, I had been so beaten down, I didn't even realize it was making me miserable until after I left.', a user said: 'It’s crazy what our brain does to help us cope with that experience - we don’t see it until we can leave. Glad you’re out of there!'",
        "In response to 'Yes, and economically speaking - Soaring production and growth, stagnant wages. They’ve been squeezing every last drop of labor out of us without proper compensation. By the numbers this is what created a level of inequality that’s eclipsing pre-revolutionary France.', a user said: 'Wow, when you put it in that perspective we are so past due on a labour revolution.'",
        "In response to 'You have a beautiful way with words', a user said: 'Aw thank you.'",
        "In response to 'Love the wholesomeness in this labor empowerment thread. Love for all my fellow proletariat!', a user said: '🤝'",
        "In response to '[Deleted or Empty Comment]', a user said: 'I know, it’s so unbelievably twisted the way we are exploited.'",
        "In response to 'simultaneously minimize your importance and suggest you’re replaceable at any moment is so degrading. The dynamic they cultivate is one that is commonly seen in abusive relationships.\nMy very first job out of college was for a small business in the front office. I didn't realize it until the very end, but my employer had a pretty consistent routine with how he treated his front office employees. The following is my experience, but experienced almost exactly by the previous employee and the one who came after me.\nStep 1: Hire them\nStep 2: Joke with them, invite them to family holidays (bonus if their family and friends are on the other side of the country), invite them to your church, introduce them to people their age to gain a sense of community\n(during this step, perform the following steps to their coworker so you always have 1 employee you like and 1 employee you hate)\nStep 3: Subtly start to undermine their confidence by blaming them for things out of their control\nStep 4: Outright undermine their confidence by yelling at them in front of everyone and threaten their job and livelihood daily\nStep 5: Overhear their plans to quit once their lease is up, so you now fire them more than a month before their lease is up to teach them a lesson\n...\nStep 1: Hire them', a user said: 'Yes, I always notice this - I have experienced this on a team. My supervisor would have a different staff member who she becomes snide with, undermines their knowledge and experience, is petty about HR claims, and is just generally rude to or ignores. It moves from person to person, it’s just mood-based. I’ve been on the receiving end. It’s so difficult because it creates tension amongst the team, such obvious favouritism - there is solidarity to a point but everyone eventually leaves/left.'"
    ]
}