{
    "username": "B0ssDrivesMeCrazy",
    "contributions": [
        "In response to '[Deleted or Empty Comment]', a user said: 'Yep, I swear this is a thing. Happened to me. I had bosses that scapegoated me for other people’s failing and/or others’ failings were just ignored. There is one incident that I still haven’t fully gotten over because it was just so ridiculous.\nI think they were actually legit trying to gaslight me into thinking I was a problem worker so they one) had an excuse not promote their good little worker bee who rocked the role; and two) I would feel grateful to them for being so kind to a charity case like me, and not look for other work. The other thing is they knew I didn’t have a safety net, making me a great target for bullying. The thing is… I had\neyes\nand self-respect, and it just got especially egregious. I had work experience before them, so I already knew I was a good worker by most accounts.\nOne day I got in the earliest like always do, only for my one colleague to be especially late even by her standards (already often 2-2.5 late). Her reason? She had a side mission of a party for one of the bosses to brown-nose. Which would be fine if she gave the others like me credit for helping with it (we helped with the entire process and gift) and gave us credit for picking up her slack, but no she took sole credit for the party ofc.\nAnyway, the party happened at the end of the day and brown-noser had to stay late because she drank more than a little champagne with the boss the party was for. Meanwhile, I was actually working our role and had to stay an extra hour. I decide to upload the last of my notes taken at home, something that policy explicitly allows and is common, standard office behavior. The server to save it was being slow and I had a bus to catch.\nWell, I preceded to get written up. Why? Boss says I kept the brown-noser late. Apparently, brown-noser stayed late because she saw that I had failed to complete my notes, and her late stay had nothing to do with all that alcohol she had, nor was it related to her love of milking the clock. Additionally, she was kind enough to “clean up my mess” and do it for me.\nMeanwhile, the system showed I completed the notes. Not her. Also, she texted me about it long after she should’ve gone home and broke industry regulation by texting me client data instead of using Teams (didn’t want work stuff on her person phone, too stubborn). Nothing in the policy said I had to do it before I left office, there was no reason to presume I hadn’t. Nothing about the policy said she had to stay until I did. She wasn’t my boss. And to contact me hours after the work day ended about it is crazy… even it had kept her late, why wait to speak?\nBut bosses said the whole incident was me making “your lack of a car our problem,” because heaven forbid a young woman taking transit wants to get home safe and perform her duties the same way others do. Yeah my bad next time I’ll stay another five minutes and get home another 50 minutes later.\nThat was the real “oh wow these people are borderline psychopathic” wake up call for me. I started job-hunting even harder.\nJokes on them though, corporate made them lay me off when they didn’t have adequate numbers for the number of staff on my team; I looked like a good target thanks to their falsified write-ups and they got to go into busy season short-staffed.\nHope your friend is searching for an out, because I don’t think managing that kind of stress long-term is sustainable. It certainly wasn’t for me.'"
    ]
}