{
    "username": "Bacon-80",
    "contributions": [
        "In response to 'Original Post: Has anyone \"Quiet Quit\" as a response to RTO? I'm not in this position, so I don't need advice, but I'm curious to hear everyone's thoughts on this.\nI work remotely, which is why I follow this sub. I've seen a lot of people in this sub who are being asked to RTO. I've been thinking about this the past few days as the sub has been full of people discussing how to respond to RTO mandates.\nLots of people, including myself, are speculating that the recent push for RTO is force people to quit their jobs. If they don't fire you then they don't have to pay out unemployment. And, you have to have significant savings to go without a job.\nWhat do you think about about returning to the office and quiet quitting so you can still draw unemployment? Anyone done this?', a user said: 'What about quiet quit in response to an offshore rollout? My company has had whispers of offshoring some work trickle down to my level & a bunch of us are contemplating leaving because of it but we’ll just ride out our time till we get a hard push. Might as well get a paycheck out of it right? 😂'",
        "In response to 'Original Post: Quiet Quitting: What is it Really? Quiet quitting is a confusing term to me, but maybe I just don’t understand it. I have rarely ever given 120% to a job… maybe when I was fresh out of college when I had that mindset. But the years have jaded me. What people call “quiet quitting” (doing the minimum) is what I just call doing my job lol. It’s not like I refuse when they ask me to do more work (tho rarely do they ask), but I don’t SEEK more work out unless I’m just bored. For example, in my work, we work in Sprints and get assigned stories to do for those sprints. I just do those stories — not more or less — unless I’m just bored and have finished my stories weeks in advance, then I may grab a story for the next Sprint. I get paid by the hour so no work means no pay. But it’s not like I can ADD more stories to the current Sprint because someone else still needs to test them and THEY may not have capacity. So, a lot of times I just do things around the house since there always seems to be something to do at home. Have I been quiet quitting for years and just didn’t know it or is doing the minimum not really what quiet quitting is all about?', a user said: 'I think quiet quitting is less of a big deal when you work remotely. It’s just like you don’t go out of your way to help colleagues or chitchat with coworkers. People tend to slowly take on more work when they want to get promoted (ass kissing, brown nosing) and when you quiet quit you simply…don’t do that stuff.\nYour work kinda sounds like you’re basically already doing that. I’m jaded to my work too but I’m constantly working towards a bigger promotion year over year ◡̈ if I did the bare minimum I’d be fine but then I would get smaller pay raises each year…so I work a twinge harder cuz I want more $$$.'"
    ]
}