{
    "username": "ballsohaahd",
    "contributions": [
        "In response to 'This is your gentle reminder that quiet quitting isn’t actually quitting, it’s simply “completing one's minimum work requirements without going above and beyond”.', a user said: 'Yes we need to normalize jobs getting dumped endless work with no change in compensation.'",
        "In response to 'Older millennial here.  During The Great Recession companies prioritized letting off workers who were more junior, so the millennial's got let go while the Gen Xer's got to continue working.  Millennials didn't job hop because they wanted to, they did it because they had to.  Not for a pay raise, but because layoffs would hit them instead of everyone else.  Meanwhile Gen X got to buy into the cheapest stock market in 40 years, and a couple of years later buy into the cheapest housing market in 50 years.  Banks will not let you get a mortgage if you do not have 2 years of consistent income, so even if you saved up for a down payment on a cheap house, you couldn't get it.  Once you could work a stable 2 years housing prices rocketed up then similar to today.\nGen X loves to bitch about their hardship, but their entire life they've made as much as the Boomers (only 2 percent behind), and they missed all of the hardships Boomers went through.  In many ways Gen X had it quite a bit better than the Boomers did.\nToday there are a record number of homeless people, the high majority of them Boomers.  Likewise, there are a record number of people retiring early right now, all of them Gen X.', a user said: 'Yea even older millennials were in a nice spot, but middle to younger were screwed along with everyone else below them.\nThe whole 2010s was a mess of underreported inflation and too quickly increasing property prices.\nYounger millennials watched properties go up so much faster than their shit wages, while they’d go home and parents tell them their wages are good and they should be thankful to watch prices rise faster than their wages.'",
        "In response to 'It feels really weird in the corporate world right now. My company is making record profits but is cutting costs wherever they can. We had layoffs, and benefits have been reduced significantly, all while our sales have been growing exponentially.', a user said: 'Profit figures and exec / higher up bonuses.  That’s all that is, they hit a new tier if they’re more shitheads'"
    ]
}