{
    "username": "Ballbag94",
    "contributions": [
        "In response to 'This \"quiet quitting\" thing has such a weird name. It's literally \"Doing your job.\"\nYou don't pay the price of a 97' hyundai and expect the performance of a F1. If you want you car to run at that speed, well... it will certainly cost you.\nI really hate how this corporate hustle culture eventually became a scam to have workers give their 100% while giving them a 20% salary. What was the point of that in the first place? Why did we allow ourselves to be used like that? I remember people shitting on the french for being on strike all the time, supposedly being \"lazy\" and demanding their rights. Guess what? They are correct and we were the suckers.\nPaying X and getting X\n10\ndoes not apply anywhere else in the market, (certainly not profesional services) why are employees any different?', a user said: 'Paying X and getting X10 does not apply anywhere else in the market\nThis is what I don't understand about employers who expect their employees to \"go above and beyond\" like, if someone hired a contractor to lay some turf no one would expect them to also replace a broken fence, so why do they expect it from a regular employee?'",
        "In response to 'There are jobs that when you do more and you’re getting involved in projects, working with more senior ppl, you boost your cv so much, it’s worth to get that and either get chunky pay-rise after 6-12 months, or sometimes even longer,  or change job for 50-100% more on the spot with foot in the door and good prospects for future career.\nNot always possible, but that’s what I did and never regretted going well beyond my tasks just to use my brainpower and get experience I could use in my CV. What I do is purely industry/company \n“know how” so nothing anyone can get anywhere else. Since I don’t have UK degree, all I have is proven track of achievements that carried me all the way up.', a user said: 'These are all good points, but this should be seen as going above and beyond rather than being expected as the bare minimum and what you were hired to do being seen as not doing enough\nIn an environment like this there should also be give and take, if your employer constantly expects you to do more than you were hired to but never lets you leave early for an appointment or shuffle your hours around for a personal commitment then it's just exploitation\nIt's also worth being mindful of how doing extra affects others, if doing more slowly changes the expectations of management so that others are seen as not doing enough for simply doing their jobs then the extra work is going to actively harm your colleagues'"
    ]
}