{
    "username": "BantaySalakay21",
    "contributions": [
        "In response to 'If you are paid minimum wage, you should do minimum effort. Di na uso loyal (I hate love your job BS) the momment na tumagilid ang company tanggal ka. It doesnt matter who are you', a user said: 'You can actually get employee loyalty by treating them right. And by that I mean a decent wage, job security, and good benefits.\nAs an example, let me tell you a story. I once was having coffee at a coffeshop with a green logo back in 2010/2011. While I was there the security guard came out, apparently on his break, and we got to chatting. He tells me how as part of their employee benefits, all of them get a number of free drinks throughout the day. I forgot the exact number but he jokes how he can never avail of all the free drinks. He goes on to tell how the mother corporation of the coffee shop treats all the employees across all their subsidiaries. All are direct employees, including the housekeeping and security staff that are often outsourced or contractuals only in other companies. And how when there’s a round of bonuses, everyone including the housekeepers and guards, get bonuses. The SG then ends his story about how he’ll never do anything foolish to get fired from his job like what another SG he knew did, because no security agency he’s worked for, or knows of, ever gave him such a cozy treatment.\nNow I’m not sure if the “mother” corporation of that coffee shop still does that, but the SG’s story shows how a company can get an employee that won’t do anything to harm the business, and maybe even help it grow.'",
        "In response to 'You can actually get employee loyalty by treating them right. And by that I mean a decent wage, job security, and good benefits.\nAround 2016 there was an interview with a guy named Simon Sinek that talked about how millennials have no sense of job loyalty, that they keep hopping from one job to another, and that\nthey were SO ENTITLED\n. And this video went\nviral\n- millions and millions of views, and it kept getting reposted on Facebook, LinkedIn, and even here.\nAnd I always found the argument specious because it came from a place where supposedly all of these traits came from things like \"culture\" and \"parenting\" and \"participation medals\", and NOT because...\npeople will switch jobs if they're not being paid enough\n.\nThere's this entire media infrastructure designed to make people believe that workers demanding more is actually a bad thing, and this reframing of \"work-life balance\", a practice that HR used to brag about letting their employees practice, into now something harmful called \"quiet quitting\", is another manifestation of that.', a user said: 'I agree with everything with what you said. It really is a corporate culture on how they treat their employees, and whether or not they value people or just see them as disposable tools.\nThe story I shared is just an example how you can get an employee to care about their jobs enough not to do bad things that can potentially harm the company by simply going beyond the minimum mandated requirements.'",
        "In response to 'Quiet quitting is such a corpo bs term. When you buy 1kg of rice, you pay 1kg peso worth of money. If the vendor decides to give you extra kg, then that's called a promo. Now when employees give services for what they're paid for, they call it quiet quitting?\nEh, just call it \"quielty doing your job\". Any extra is just a promo and should not be expected as a norm.', a user said: 'A former manager of mine once said, “huwag nang mag-sobra sa trabaho, hindi ka patatayuan ng rebulto ng kumpanya”.'"
    ]
}