{
    "username": "BarroomBard",
    "contributions": [
        "In response to 'Thank you for your response! So i didnt get a termination letter or signed anything so that’s good. I emailed HR yesterday to clarify their decision and they responded I should state on the application their decision for firing me was due to unsatisfactory performance. In the eyes of the state, is this considered misconduct? I wonder if I go your route or just say a long the lines “employer no longer thought i was a good fir for the role”', a user said: 'In Illinois, misconduct means violating an explicit rule or law. Doing your job badly is not misconduct.\nDon’t lie on official forms.'",
        "In response to 'Original Post: Hey guys, I was “quiet quitting” until I got fired , now what? So I just got fired and they recommended me to file for unemployment insurance. HR was surprisingly nice. She basically told me they don’t contest the claims, so I think if I use the right words in my unemployed application,\nI might be eligible for unemployment insurance.\nHas anyone successfully received unemployment insurance benefits in this situation before and lives in the state of Illinois? One of the questions is below:\nAccurately report your reason for separation from your job when you initially file your claim for benefits.\nEDIT: I  shouldn’t have used the term “quiet quitting” on my post because I used the term incorrectly, my apologies. I meant to say, I was really underperforming on my job, barely doing any work for the past year or so. I did the bare minimum. I was  then placed under an improvement plan for a little over 6 months or so. They saw some improvements, and I was doing okay, until I mislead my manager with 2 assignments. I stated that I had completed the assignment but in reality I used last year’s data to mark it completed, while I attempted to catch up over the weekend.\nI never fixed the assignments and my manager found out what I did. That’s when she went to HR for the next steps. I emailed HR for a written confirmation on why I was fired and she responded “unsatisfactory performance.”', a user said: 'You can just write “unsatisfactory performance”. Illinois doesn’t really care unless you are fired for misconduct, I.e., actual breach of the law or deliberate violations of company rules. They may call you to conduct a phone interview to confirm, but it sounds like you’re in the clear.\nBeing fired because you suck at your job doesn’t disqualify you.\nSource: literally just did this myself.'"
    ]
}