{
    "username": "Bearcat9948",
    "contributions": [
        "In response to 'Original Post: [Discussion] Pod Save America - \"Is Biden Quiet Quitting?\" (12/17/24) [External Link]: https://crooked.com/podcast/is-biden-quiet-quitting/', a user said: 'Idk what you can call that opening segment other than 25 minutes of pure cope:\nLamenting (again) the capitulation of Zuck and Facebook to Trump (why are we pretending that billionaires and corporations are our friends?)\nFavs pining for Joe Biden to have some sort of event about protecting political institutions while also acknowledging how unpopular of a platform that is right now\nTommy’s pretty absurd ideas that Biden could, or will, stop armaments to Israel or try to pressure Bibi to stop bombing Syria, would lift sanctions on Syria or normalize relations with Cuba and close Gitmo. All of these are antithetical to who Joe Biden is as a person and president\nThese boys need to wake up'",
        "In response to 'Democrats have always been fervent supporters of institutions, what on earth are you talking about.', a user said: 'Its a losing message right now. Without COVID it probably would’ve been a losing message in 2020, given it was a losing message in 2016'",
        "In response to 'i mean zuckerberg did the right thing baning those fake hunter laptop stories prior to the election', a user said: 'Did he do the right thing for moral reasons or because it looked highly likely Joe Biden was going to win the election, thus ingratiating himself to the incoming president?\nThere’s a quote by Charles de Gaulle that goes “No nation has friends, only interests”. People need to substitute nations for corporations in this instance.'",
        "In response to 'Favs saying that people would view Democrats as the same as the GOP if the Democrats adopted some of the GOP's more blunt and aggressive style made absolutely no sense. He just doesn't get it', a user said: 'Americans want fighters and champions, not scared weenies who roll over and take the moral high ground just to lose anyways'",
        "In response to 'I've seen it happen time after time. When the Democratic candidate allows himself to be put on the defensive and starts apologizing for the New Deal and the fair Deal, and says he really doesn't believe in them, he is sure to lose. The people don't want a phony Democrat. If it's a choice between a genuine Republican, and a Republican in Democratic clothing, the people will choose the genuine article, every time; that is, they will take a Republican before they will a phony Democrat, and I don't want any phony Democratic candidates in this campaign. Harry Truman\nWith every episode they seem phonier and phonier. Truman warned us about this and he went unheeded.', a user said: 'Kind of ironic mods removed that post yesterday given Ro and Favs convo on today’s pod haha. Maybe worth a repost'",
        "In response to 'They can’t be serious, defending the time change.\nLOL \nLiterally, nobody wants that.\nAlso, it’s not practical for some states to observe it and other states not widely across the board as they suggest. Very strange argument. I know there’s a couple of examples right now, such as Arizona, but imagine the US were half the states observed the time change and half don’t. It makes no sense.', a user said: 'I don’t know that I have strong feelings in permanent DST vs permanent Standard, but I absolutely do want them to just pick one and be done with the switching back and forth'"
    ]
}