{
    "username": "beastkara",
    "contributions": [
        "In response to 'Not assuming in this case, he slipped up multiple times', a user said: 'The point is it doesn't matter what the reason is. A manager who is trying to find excuses for the employee's baf performance is way too invested in trying to cover their own management skills. \"Didn't deliver the required result, fired\" should be all the manager should care about.'",
        "In response to 'Original Post: When you quiet quit/ride it out till you get fired, it negatively affects others in this community I had a teammate who had been dropping the ball for a while and was finally let go this week. His output was so bad that my manager noticed and did some digging. Turns out he barely worked at all and was clearly just coasting till he got fired.\nWell, my manager and skip are PISSED and literally called out how they think our old teammate was working multiple jobs. In my xp, they definitely were as they had many signs.\nRegardless, it’s now coming back to bite my team and me with new policies. Yes I’m pushing back on all the BS coming our way and trying to minimize it, but I wouldn’t be surprised if activity monitoring software came up soon to flag suspicious activity as well. This gig has been great for OE for years and now it’s in jeopardy because someone couldn’t just quit when they were done… I have friends (OE and not) at multiple other companies who are dealing with fallout like this as well.\nMy point being, when you pull the anti work card and coast like this just waiting to be fired (which I see recommended here daily), it’s not an isolated event. You get your bag a bit bigger and your teammates (and fellow OEers) deal with the fallout.\nIt helps to push for more RTOs that may have not as it eliminates the possibility of many of these issues. This also affects remote offerings (wayyyy down from what I’m seeing myself in new job hunts)\nHow would you feel if others put your extra paycheck(s) in jeopardy?\nGet your bag, but don’t screw others over while you do it.', a user said: 'If your manager and skip are pissed that a low performer has to be fired, they are taking their jobs too seriously. Low performers exist everywhere and the manager's main job is to fire them. He's mad that he has to do his job?\nApplying nuisance policies to the regular team is bad management. Trying to come up with extraneous reasons for a poor performer, when none were needed, is a sign of a defensive manager who doesn't want to reflect on the possibility their own management skills may have contributed to it.'",
        "In response to 'Deliberately screwing people over for your own personal gain certainly happens plenty, but I’d like to think some people could recognize acting this way can screw over others and would avoid it. Obviously there will still be those who have shit character and don’t care unless they’re the ones being screwed over, but not everyone.', a user said: 'It's a job, they aren't going to see those people ever again, and they don't care. You may take a lesson from this. When we die, I'd hope no one is going to regret \"screwing over\" their 205th coworker at Taco Bell, that they interacted with for a total of 3 hours, at that one job 23 years ago. Some stuff really doesn't matter like people think it does.'",
        "In response to 'This is why I always recommend throwing sandbagging low performers under the bus.  If someone is \"quiet quitting\" or unable to keep up then get rid of them quickly before their incompetence / apathy becomes a problem for you and the rest of your team.\nThis isn't a team sport.  If someone sucks to the point it impacts you or brings unnecessary scrutiny/attention on to you then you shouldn't feel bad dropping a tip to management to get rid of them.', a user said: 'Bad advice.\nLow performers are literally there to make you look good and be layoff fodder. Imagine a team that gets rid of all it's low performers and then has to layoff 20% across the board. That's insanity.\nLearn to not pick up their work for them, EVER, and refer to your own performance metrics against theirs. You'll never have an issue. I've not once had a situation where getting a teammate fired would help me in any way, even if they are incapable of doing anything. They are human shields.'"
    ]
}