{
    "username": "BedrockFarmer",
    "contributions": [
        "In response to 'Answer: It's corporate propaganda.\nThe job market was really strong for workers, and workers were re-evaluating their priorities in light of the shift to ubiquitous work from home.  They realized that they weren't under the thumb of their employer, and started taking \"work-life balance\" seriously.\nOn the other hand, their corporate overlords had a bunch of legacy real estate they were having a hard time justifying maintaining.  While their bottom lines continued to be as strong as ever, middle management started to feel more and more useless.\nIT infrastructure had a do-or-die moment, and with 2 continuous years of business running remotely, those who survived have proven (sometimes to their own dismay) that their business doesn't require brick and mortar to house their workers.\nAnd because of this, remote work has been normalized.  Before, you kind of had to live within driving distance of your workplace.  Now, not so much.  So the job applicant pool has gotten much larger.  Good for companies because the talent doesn't have to be colocated.  Good for workers, because more jobs are available, especially outside of cities.\nThis perfect storm has taken the power away from the corporations.  Workers are making lateral moves for more money because more jobs are available and inflation has outpaced normative corporate cost of living raises.  It's all because of remote work, and that's why they want to stop it.\nSo now they talk about people \"doing the bare minimum to get by\" and needing more oversight to improve output.  What they really want is you back under their thumb and powerless.  They want you to go back to being a toady, sucking up to them and freely giving of your precious time in the hopes of a raise.\nBut they're not the only game in town anymore.', a user said: 'Too much of Reddit are younger IT folks with blinders, ignorance, and a massive sense of hubris. While what you posted is a summary for a subset of mostly white collar corporate workers, it is untrue for the vast majority of the economy.\nWhere are your remote merchant marines, ER doctors and nurses, paramedics, plumbers, chefs, Lyft drivers, and basically every other job that isn’t staring at a computer screen all day?'"
    ]
}