{
    "username": "bequietbekind",
    "contributions": [
        "In response to 'I believe that the reason this manipulation works so well is because the Puritan work ethic is still such an obsession for Americans. I definitely struggle to this day to try to untangle the brain programming that equates \"hard work\" with virtue, and asserts that not wanting to do hard work is evil. That shit runs DEEP throughout most of our childhoods, especially in the public education system.\nThat the actual truth is far more nuanced than that is not something anyone bothers to talk about.\nCorporations have an easy time manipulating us because of that childish understanding that we still have of what \"work\" should be. The Corporation only has to tell you that if you refuse to work for peanuts, it's not because it's not enough money. It's because you're LAZY.\nThat's about all it boils down to.', a user said: 'That shit runs DEEP throughout most of our childhoods, especially in the public education system.\nThis is such an important aspect of it. From a really, really young age we are indoctrinated to accept the status quo. To sit still, be quiet, follow orders without question; raise your hand, answer when called on. Be productive, even if you hate the topic, even if you're bored silly or your skillset is beyond what's being taught. You're left to drown or figure it out on your own most of the time if you're struggling with something beyond your understanding--which is your own defect in that case, so buckle down. We're taught these patriotic fables that aren't even true, about what a great country America is and how we're so lucky to live in the \"best country in the world\" blah, blah, blah. We're given work beyond what is done during class time to complete at home.\nGod forbid you refuse to do any sort of schoolwork. Then you're really in trouble and told something is wrong with you. You'd better do it anyway and not complain and not cause a distraction to the other students or you'll be punished. This shit is normalized from before we can even read language.\nIt's not like we're even learning anything particularly useful 75% of the time. It's just to prepare us to enter the labor force, not question authority, and do as we're told even when we're miserable doing it (\nespecially\nwhen we're miserable). We're taught to be literate and to have some mathematical and language skills--your mileage may vary LOL--but the rest of it? Up until you can get into a good college to start learning more sophisticated, specialized things? it's rote drone training.\nWhat we're\nnot\ntaught is the truth about the fucked up history of this country or how exploitative warmongering, globalization, or capitalism in general are. We're not taught or encouraged to have any sort of common sense or think independently. We're not taught deductive reasoning skills or creative problem solving and IDK about any of your coworkers, but with most of mine... it shows.\nWe're asked, from childhood, \"What's your dream job?\" and they get us all worked up about it. I was an adult before I realized how fucked up that is. I always felt deficient, lacking, broken because I\ndon't dream of working\nand I have no desire to monetize my hobbies. I never knew what I wanted to do when I grew up. Still don't. I spent many years thinking something was wrong with me.\nIt's the system that is wrong.'"
    ]
}