{
    "username": "BernieDharma",
    "contributions": [
        "In response to 'Original Post: What is 'quiet quitting,' and how it may be a misnomer for setting boundaries at work [External Link]: https://www.npr.org/2022/08/19/1117753535/quiet-quitting-work-tiktok', a user said: 'This isn't new. I've seen this in every toxic work environment I've been in the past 30 years. Boss wants to be a jerk? Everyone just starts slowing down work and not doing anything extra until the boss gets fired.\nGot hired at one job and knew within 3 months that the place was shit and already planned my exit. I didn't want to quit early because I was afraid that job hopping would look terrible on my resume, so I stuck it out counting down every day. After 9 months, I updated my resume and started looking for outside opportunities. Most of my coworkers were in the same boat, and the only people with seniority who had been there for years were the idiots that couldn't get hired anywhere else.\nI didn't do any meaningful work for the last 3 months, just went to meetings with a smile on my face like nothing was wrong. Management implemented a system where we had to account for our time in 15 minute increments, but there was no provision for multitasking. So I did all of my actual work during meetings, created a bunch of scripts to automate my work without telling anyone, and then padded my time log with those tasks. Spent the better part of each day walking around the corporate campus carrying my laptop from building to building looking like I was busy, while enjoying the sunshine.\nWhen I finally turned in my two weeks notice, they panicked and try to assign someone who I could train. The person they picked was already interviewing externally as well, so we spent the last week trading stories about how we've been avoiding work for the last few months. That was 1998, and I'm still friends with that guy.'",
        "In response to 'Where are people doing these jobs that can be done with scripts (and are you hiring?).', a user said: 'LOL. This was mid to late 90's, and they were scripts that automated a lot of server maintenance tasks, reporting, proactive troubleshooting. As a consequence of \"not having the right people on the bus\", many of my peers were inexperienced and wouldn't take a moment to learn anything new unless it was spoon fed to them. I get tired of doing repetitive tasks, as well as just reacting to whatever blew up that day. My scripts just made my job easier day to day, and created automated reports that my manager thought were gold.\nI also can't emphasize enough how absurdly stupid most of the other employees were, because the business thought they were clever by paying the minimum possible salary. I was a bit more experience and hired at a higher salary, but it was constantly held over my head. I as pressured to work off hours, be on call, take on \"stretch assignments\", etc.\nPro tip: If you can do a little scripting, your peers and managers who don't know how to script will think it's magic. (Same for strong Excel or PowerBI kung fu.) This is especially valuable in environments where non-technical managers are overseeing technical people.'"
    ]
}