{
    "username": "Best_Caterpillar_673",
    "contributions": [
        "In response to 'Quiet quitting is a bs moniker made up by the capitalistic bootlickers. Doing your job within the scope of your job duties and not going beyond that is in no way an act of quitting. The capitalists are just so used to being in a power imbalance with the workforce that they now expect everyone to devote all of their life energy to the betterment of their shareholders profits. Sounds like the capitalists have a major case of entitlement disease. Whomever still uses this terminology is perpetuating a myth.', a user said: 'Doing the bare minimum isn’t a great way to advance your career prospects though. Would you rather hire someone who’s enthusiastic and willing to work hard, or someone who just shows up and only does the absolute minimum and sometimes not even that? Who are you hiring?'",
        "In response to 'Not everyone wants to advance. I know folks who’ve had the same job title for 15+ years. They like what they do and have no desire to move up the chain.', a user said: 'Just saying there are a lot of people who show up and do the bare minimum (or less) and expect to be promoted to higher and higher levels just because they stay there.'",
        "In response to 'why do you need “higher and higher levels” to be paid a living wage? some people aren’t meant to be managers and shouldn’t have to chase a position they’re bad at just to earn enough to live. A person who’s a great cashier  should stay a cashier because it’s the best role for them and the company, but why do we look at that as a bad thing undeserving of a quality life?', a user said: 'I’m just saying there’s people who expect to be promoted every year or every few years without really doing anything to deserve it. And you’re right, they probably aren’t meant to be managers.\nAnd if you just want to continuously give people significant raises for staying in the same position without promoting them, eventually you get to a point where you look at your staffing and go, “hmm my junior staff accountant makes $130k but I can get a new hire for $75k. Why am I paying this?”'",
        "In response to '“i’m willing to throw away all of this experience and company knowledge to save myself some money and exploit a younger person” is not the great managerial decision you’re making it out to be.', a user said: 'If someone isn’t willing to take on more but wants more and more money, its a sensible decision. You said it yourself basically. You’re advocating for people staying in the same role doing the same work and nothing else…all while getting big pay bumps to stay. You could hire a new person and get them up to speed within a year doing the same work for significantly less.'",
        "In response to 'are they asking for more and more for a higher standard of living or just to keep up with inflation? imagine looking down on that person but thinking a business should get the same labor for less and less money. don’t drink the corporate kool aid buddy, capitalism is destroying the world right now in multiple ways and you’re supporting the rationalization', a user said: 'Yeah what we need is global communism, that should fix it. Right?'",
        "In response to 'I don’t know where the idea of management as a promotion along a continuum started. Managing is a different job entirely than (whatever job). Just because you are great at (job) does not mean for a moment that you are good at managing (ether/all of time, budget, humans)', a user said: 'I sort of get it. I’m a manager now in my field. Eventually you become so good at what you do that the next step is to manage and train people to do your role. Being a manager is sort of like being a preparer still, you’re training people to do the work for you and then reviewing it. In many cases things are wrong, but thats what you’re there for as a manager. You know what needs to be done so you’re the next/last step of the workflow. Its sort of like you preparing work through other people, if that makes sense. And you need to build those people up so they can eventually do the same as you. And then you move up and become a VP or something and manage divisions of managers who manage staff.'",
        "In response to 'we all understand how promotions work. it’s you that’s not getting the point', a user said: 'So show you’re worth the increase in pay and you’ll get it. Otherwise you’ll get inflation adjustments and not much else. And if you complain too much you are replaceable.'"
    ]
}