{
    "username": "Big-Abbreviations-50",
    "contributions": [
        "In response to 'I'm sorry I'm just totally flabberghasted that there exist people who extol the virtues of office culture as superior to from-home.  I mean I know they're out there I met one at work when I spent a week helping an undermanned department and just kinda stared blankely at her too cuz. .. what the honest to goodness fuck is even miss-\nable\nabout commuting to a space where you're around a ton of people and the guaranteed subset of assholes thereof, where environs are distinctly (at times intentionally) uncomfortable, decisions are made in the most infuriatingly inefficient or shortsighted or plain-old-stupid fucking ways but you're not the decision maker so you gotta do it anyways, where your lunch is\nguaranteed\nnot to be as good as it could be if you had access to your entire kitchen (obviously), where you are statistically\nsignificantly\nless safe\nwhile\nthere and to\nget\nthere you engage in the 8th leading cause of death twice, going there costs money eating there costs money, being there\ncan\ncost money for some, where people show up sick and spread their sneezle coughy bullshit, where some barbarians don't utilize toilet etiquette or wash their hands, where there exists a minimum of one petty tyrant in the building at all times that will busy themselves policing your shit from a place of authority, and then at least one additional petty tyrant who does the same but from a place of \"superior\" morals, politics, religion or intelligence.  Some offices are freezing in winter and scalding in summer and others are exactly the opposite: equally uncomfortable but now for $$$$.  The entire set-up is mindnumbingly infuriating and\nespecially\nwhen the work-to-be-done in question does receive significant benefits from being done at a central location, or god help those that rely upon it, I just...\nWHY\nThe one and only thing I can sorta see that it's got going for it is: socializing.  lmfao text your friends and get together or go to a place that people congregate at like a bar or a beach or\nfuck\nthis is so trivial\nand\ntrivially easily accomplished any thousands of other ways that no it doesn't, it's disqualified from the pros-cons list we're buiilding for office spaces.  If that is actually an argument someone was thinking while reading this, then that would actually constitute a successful illustration of one of those facets of office space life that is mind-numbingly infuriating. We all can do this all the time when not here, many of us can't (job-dependent) or don't want to do it while we are here, and if that's one of the arguments for\nbeing\nhere = example achieved.\nEdit: so yeah that stopped being about or really even too you sometime rather quickly on.  Just meaning to say please dont read this as a declaration of rhetorical or argumentative war it's not it's a rant and a request for a single response summing up why oh why do you miss that how can you miss that', a user said: 'We’re mostly extroverts.\nI LOATHED working from home. It was a complete and total nightmare! No faces all day; only initials pulsating on a computer screen.\nYes, I missed my coworkers. I also missed the in-person interactions during meetings (after which I do go back to my desk to complete the task alone; I’m not a through-and-through extrovert) and being able to pop my head in to have conversations with my colleagues.\nI can’t even do headphones! For me, that and WFH feels disengaging and the opposite of motivation. My performance tanked when I had to WFH, my mental health suffered greatly, and I was ecstatic to return to the office. After that, my performance skyrocketed. But I am not knocking those who feel or work differently at all! I’m only saying that there is a very broad spectrum of what works best for each individual.'"
    ]
}