{
    "username": "bigbura",
    "contributions": [
        "In response to 'Original Post: The Flipside of \"quiet quitting\" is quiet paying. Don't forget this. Somebody older I know asked me why young people are \"quiet quitting\" their jobs and not trying to work hard. I told them that quiet quitting is a bullshit term that describes doing what was outlined in your contract, and not more. He started to tell me how you need to hustle and do more than the minimum if you want to succeed. I told him that the difference compared to many years ago is that now hard work is not met with commensurate rewards or opportunities. Then I asked him the following question:\nIf it is culturally acceptable to push people to go above and beyond what is outlined in their contract, why does the company always only pays what was agreed upon? Why doesn't payroll ever go above and beyond what was agreed? Shouldn't it also be culturally acceptable to expect extra salary in this case? Aren't my company quiet paying me?\nHe had nothing to say and just looked uncomfortable. He didn't really agree but he has no good answer either.', a user said: 'He had nothing to say and just looked uncomfortable. He didn't really agree but he has no good answer either.\nBecause humans aren't fans of admitting they were wrong or have been dupped, gotten over on, etc.\nThis 'provide free labor, without extra pay, so you might, just might, get promoted at some future date and time' is so much a raw, one-sided, deal. The youth of our society has called BS and are refusing to participate in this lopsided deal. Good on them.'",
        "In response to 'Everybody is insensitive until it’s them or their kids that’s getting fucked. Funny how that works.', a user said: 'Lack of empathy for others outside their circle.\nWhy are humans like this? To the point where the major religions stress we should be empathetic to others and yet that still fails across the broader ranges of society. Are we just incapable of being empathetic on the grand stage? Too focused on the few percent of society that will sit down and not help out, being leeches, and oh too willing to cast aside the far larger percentage of people that are helped?\nYeah, the pandemic has erased my patience for people that treat others so poorly.'",
        "In response to 'Somehow refusing to answer emails/phones outside of work hours is a trend and my parents think it’s just us being lazy.\nMy parents didn't answer cell phones or emails after work hours.\nThen again, cell phone and emails didn't exist until the 90s, so work invading their private time wasn't a problem for them. Until the 90s rolled around.', a user said: 'When did pagers become a thing?\nhttps://en.wikipedia.org/wiki/Pager\nPayphones were a thing as well.\nI type the above as I have memories of the look on Dad's face when he came home with his newly-assigned pager in the 1970s. Couple that with the sour face he made at the local pool when his pager went off and he had to use the payphone to call in and see what was the emergency. While trying to hear over the screaming kids enjoying a nice summer day at the pool.\nSo this work-creep into our off time has been going on for much longer than the 1990s' innovations.\nI'm not saying this isn't a fight worth fighting by any means, just saying we've been slowly losing this battle for a very long time. ;)'"
    ]
}