{
    "username": "BigfootSF68",
    "contributions": [
        "In response to 'Yeah, I am a Gen-X'er who got my first job in 92, then first full time job in 1996, started @ $5.50 per hour.\nI applied for financing, but credit was so new it was impossible to get approved for a car loan without having a 50% down payment, and with that in mind, I could not afford a car, so I had to bicycle commute everywhere. It is truly something from a science fiction book that cars are so easily financed these days\nI was bringing home $172 per week after taxes, 1 bedroom apartments were $500 and up, if I looked 10+ miles from work, I had to live with roommates and not have a bedroom and paid $75 per week.\nAfter 6 years in the steel industry, I eventually worked my way up to $12.25 per hour, by then the cost for the same 1 bedroom apartment had doubled, so still had to rent from others.\nI got by because I only had to feed & clothe myself, but seriously, if you think Gen-X earned livable wages, you are seriously deluding yourself.', a user said: 'Gen X has been in the massive wake of the Baby Boomer generation.\nYou know how some offices work is completed and then just \"tossed\" over the proverbial cubicle wall? That is how the Baby Boomes have run the planet.'",
        "In response to 'Original Post: Office Space Proves Gen X believed in quiet quitting too - it was called “mailing it in” I don’t want to hear any Gen Xer talk about Millennials or Gen Z “quiet quitting” when they 100% did the same thing. They just called it “mailing it in” and the movie Office Space is a commentary on this.', a user said: 'I am Gen X.\n\"Quiet quitting\" is a bullshit marketing blitz to make the workers feel bad.\n\"Your job is what I say it is.\" Is a lie.\nWe have an agreed upon list of work that I perform for an agreed upon amount of money. Any change in that agreement is subject to renegotiation.\nI just worked a 17 hour day got up at 12:30 to arrive at lab at 1:30 am to be at the job by 3:00 am then when the concrete pour is done 12 hours later, drive around for 3 more hours pucking up samples. Dispatch called me as I was driving back to the office with samples from the field.\nThe job for the next day? A repeat of the day I wasn't even done with yet.\nMy answer? NOPE. Not going, I refuse to put my health in danger by not getting enough sleep to even function.\nHere is another thing, alot of \"managers\" I use that term loosely, only know how to push. Their failure for proper planning and hiring is not my problem. I am only paid to do a task. You can't afford to pay me to save your company.'"
    ]
}