{
    "username": "BillyQz",
    "contributions": [
        "In response to 'Original Post: \"quiet quitting\" is apparently a trend now Basically means you do what you were hired to do and nothing more. The \"bare minimum\" as it were. Gen Z adopted the term and its a tik tok thing now.\nI always thought it was called \"not being taken advantage of\"', a user said: 'Then bitch you are not being paid enough or don't get a rise or don't advance in the company. You need managers who watch and say hey do this hey do that. I had an employee who did have an learning issue. He worked for me was a great person but he was one of those that like a machine you had to keep your finger on the button to make it work. I was once at a location and they asked me how do you get him to work. I said Puttith foot Uppith ass but in a nice way. That is how you get it done. Your hired to do a job and it's up to the managers to manage at that point roll up their sleeves and get the most out of your employees some need the foot some need the atta boy/girl (please don't ad letters not in the mood) and some are great and do extra. Those will be mangers the rest well never. I have no respect for slackers who have their phones out or walking around looking useless. I worked hard when I ran my business and businesses for others and I expect no less it's called work ethic and if you don't have one and I have to keep circling back to make you do things well if you are just slow and I know you will do it then you'll stay and get treated like family if your just lazy I'd fire you and try someone else. They could be handicapped and want a job trust me it's the job and company and the family that works there not the laze folks who whine'",
        "In response to 'Original Post: Quiet Quitting going around the store. We are done running around like slaves on cocaine (that we paid for). It's spreading. Bare minimum for what I'm paid for is what they get now. The store is melting from within & we will win the war. Workers unite. Power to the people. 💪', a user said: 'Well, I'd quit first. I remember working for a very large transit company state run of course. Union of course. I came from my own business where I had to work. So here at this transit company no one did. They lied on time sheets, they promoted the liars to managers and it was then called the culture. So little ole me could walk around slowly not in a hurry and do the jobs listed to be done. I mean normal walk in no hurry doing things on the list I saw on the computer. I did them all and was done by well lunch. So nothing to do I just walked around and fiddled on my laptop. Monday I got called into the Supervisors office and got chewed out for doing a weeks worth of work and i was making them look bad. Trust me I was well paid....so sorry i don't believe in the do nothing work. You don't have to run or be crazy but do the job you are paid for. If you think your worth more money or want to be paid more money get a better education or job or both. No one wants a slacker and if you don't like the job you have then go somewhere else'"
    ]
}