{
    "username": "BlademasterFlash",
    "contributions": [
        "In response to 'If \"Quiet firing\" catches on, a lot of people are going to forget that there are rules aroundconstructive dismissal.', a user said: 'Seems to happen a lot anyways from my (admittedly limited) experience'",
        "In response to 'I am a middle manager and when I am hiring young people and they ask me for advice I straight up tell them \"don't expect to work here forever, always do what is best for you\" and most of them have this shocked look on their face.\nListen up kids, I have been at this company for 15+ years, they will fuck you over just like everyone else here.   Stay as long as you are getting the bag otherwise look elsewhere\nIn reality this is just late stage capitalism taking hold.  For years companies have pushed the envelope to hold hand over employees.   Uncertain hours, low wages, no benefits etc and employees are pushing back.  A lot of status quo companies (banks in particular) are hemorrhaging talent to the tech giants and not just in the dev space, but also HR, finance etc.  Companies don't know how to react to employees holding power since it is such a foreign concept to them', a user said: 'I work in manufacturing and same thing, we are a stepping stone for hourly employees to go get better paying jobs elsewhere. We have a wealth of experience in the long term employees but we can’t keep anyone new who’s good for more than a couple years. Many of the long term employees are nearing retirement and once they are gone I don’t think we’ll have enough competent people to keep the place running unless things drastically change soon'",
        "In response to 'Yes constructive dismissal.', a user said: 'Constructive dismissal is a little different than the above comment, which is more just lack of job growth other than added responsibility'",
        "In response to 'Why do we keep making up new words for regular things', a user said: 'Because the Capitalists need to try and shame workers for sticking up for themselves'"
    ]
}