{
    "username": "BlameTag",
    "contributions": [
        "Guys, did you realize quiet quitting was over?! [External Link]: https://i.redd.it/6357ek17i7w91.png",
        "In response to '[Deleted or Empty Comment]', a user said: 'I tried to start my own satire site, and I always say it's hard to keep up with Insider because everything they post seems like satire. They have, however, been a neverending source of parody material though.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'You wanna see bootlicking, you should see their coverage of Amazon Prime Days and Elon Musk!'",
        "In response to 'I didn't realize it was a real thing? You pay me for a job I will do that job. You want extra then you pay me for it.', a user said: 'The expectation is to exceed expectations.'",
        "In response to 'There's a literal gas lighter on the picture!', a user said: 'Thanks! I stole that and posted it with my Twitter post about this article!'",
        "In response to 'really?', a user said: 'According to this article I can't read because of the paywall. Honestly, I never thought it was real to begin with so I guess this might be accurate?\nReally just more trash from Inciter. Last week they posted an article about how the media legitimizing quiet quitting was harmful to workplaces after posting hundreds of articles on it.'",
        "In response to 'Original Post: Guys, did you realize quiet quitting was over?! [External Link]: https://i.redd.it/6357ek17i7w91.png', a user said: 'This actually made me think of Brad Hamilton from Fast Times at Ridgemont High.\n\"Over? Man, I'm still waiting for the quiet quitting to start!\"'",
        "In response to 'I don't think these guys know what words mean anymore. Era? Really?', a user said: 'Words meaning stuff. lol, okay grandpa.'",
        "In response to 'How do they even know? What measurements could you even take?', a user said: 'In my experience with Inciter, if you just barely scratch the surface of their stories the sources are often bullshitty, anecdotal, and only backed by the thinnest of logic.'",
        "New dumbshit media buzzword just dropped! (Spoiler: It's just a combination of quiet quitting and rage applying). [External Link]: https://i.redd.it/shqpdu0ns7qd1.png",
        "In response to '\"Teturn?\"  Can't they fire these human editors and get a competent AI??', a user said: 'Oh wow, I didn't even catch that!'"
    ]
}