{
    "username": "BlatantConservative",
    "contributions": [
        "In response to 'It’s an odd value system when what should be standard is called out in amazement. But the capitalists have had it good for long, embedded theft based on fear, driven by greed. Seems to be a North American disease, although spreading elsewhere as economic growth is limited by a maturing economic system to controlling costs.\nThe system will push back though, a recession with wide job losses and increasing unemployment will teach the unwashed to work better. The beatings will continue until morale improves.', a user said: 'You're not wrong per se, but I'd say Asia has been cornering this particular market since the 1980s.\nIn Japan you're seen as not a team player if you don't do voluntary unpaid overtime in some companies.'",
        "In response to 'Lmao your username made me smile. I haven’t thought about that or that damn song in AGES.', a user said: 'Harlem Shake was the best of the internet.  Literally just people clowining around for no reason.'",
        "In response to 'to them\nQueit quitting is corporate-speak for that-which-must-not-be-named: \"work to rule.\"\nAnd they want to expansively define it so that the term can be weaponized against workers. All very clever stuff, of course, and fairly straightforward media theory reading of the piece.\nOnly work-to-rule is a very specific thing with regard to organized labor, while quiet quitting also means other things. In this concept, it's used to refer to people who refuse to do unpaid labor, especially if that means working outside their scheduled times.', a user said: 'For a specific example of what \"work to rule\" means, Uber and other gig economy apps will pay a premium for drivers who usually \"clock off\" at a certain time.\nLike, a dude who usually stops taking fares at 7 o clock so he can go home to his girlfriend might see an extremely lucrative fare to be taken at 7 01, because Uber will value breaking his schedule repeatedly so he'll be available more, and they'll be willing to take the hit for four or five fares they'd lose money on to do that.\nBecause he was working to rule and they want to maximize availability.'"
    ]
}