{
    "username": "bloopitybloopbloop2",
    "contributions": [
        "In response to 'Accountants at my org still use excel and pdfs to manually reconcile information. Some still print pdfs to look at them.\nEntire management team is made up of dinosaurs so in first hour of my work day using Tableau i am able to do more than others take a week to finish.\nIn some cases older managers take months and still don't turn anything productive as they continue to \"ctrl c+v\" data in Excel while my work automatically reconciles even their books.\nI do nothing 80% of the time outside of that.\nUnfortunately no advancement opportunities, management is mostly an \"old friends club\" flipping burgers.\nI could automate everyone's job but 90% of people are not willing to change or learn new applications. \nI've come to accept that and became happy to occupy 80% of my time doing non-work related tasks. Having hobbies is what keeps me going.', a user said: 'What is this magic you speak of? I know all of the tasks I do are incredibly repetitive but I don’t know how to do it more automatically. I’m building spreadsheets of reports bc the software we account on doesn’t give reports how we want to. How can I learn to automate stuff?'",
        "In response to 'Get/learn better tools, Tableau, Power BI, connect to your data source, create a job that can extract what you need periodically. If you cant use any of the certified data connectors or have shitty IT, learn to extract data using python or if you have a license, power automate. There is a tool for every job, just like in trades, you just need an appetite to learn them, many provide free trials which you can showcase.', a user said: 'Thanks! I have the appetite, just hadn’t heard of any of these before. I’ve been working in small companies. I appreciate the recommendations. I’ve started trying to learn Python. Do you have any suggestions on subreddits to follow or resources to start learning automation tools without a coding background? I’ll take any and all guidance!'"
    ]
}