{
    "username": "blosphere",
    "contributions": [
        "In response to 'Technically every job that’s full time is a steel rice bowl since they can’t fire you outright. I’m quiet quitting and loving every minute of it.', a user said: 'Yeah they can, within the reasons written in the contract, if you have one. If not then it's in the \"work rules\" book.\nThose reasons are pretty much always ambiguous and give the company the right to fire you on the spot (paying 30 days of salary in lieu of 30 days dismissal period) for pretty much any reason.\nWhy good companies don't do that, is because it's difficult to keep you fired if you decide to exercise your rights and sue them.\nThat, unfortunately for the employee, is a civil contract breach case and it costs money and time to reach a settlement.\nFortunately for the employee, you can work another job while this resolves and in the end, usually get 100% of salary for the months you were unemployed and 60% of salary for those you were already working for a new employer. Also the settlement doesn't affect unemployment benefits.\nI've been on the receiving end a few times, always had to threaten to sue via my lawyer, always brought in 1+ years worth of salary as settlement (and then paid income taxes...).'",
        "In response to 'I mean it really depends where you are in the world. In EU we have strong worker protection, so it's 30 days only if you've been employed for a short time, otherwise it can be 3+ months that they have to keep paying you even after letting you go.\nThe other thing is, you can only be a probation worker for 6 months. After that you're considered a \"long term employee\" and can't really be fired unless you're caught stealing or doing something else that's illegal or really damaging to the company, and then they need documentation to show you breached the law.\nThere are no \"terms\" that can be written into the contract because the law trumps any contract, and the law says you can't be fired.\nThere's 2 ways a long term employee can be fired: illegal activity, or if a company can show they're doing badly financially. But in that case after they fire you, they're not allowed to hire another person in your place for at least 6 months.', a user said: 'Hi so I'm not going elaborate much more, please re-read my post and you can see I'm making a difference between \"can\" and \"should\".\nYou absolutely can be dismissed on the spot with bogus reason. There's no magic work police that comes out of nowhere and forces the company to continue paying you. This is a CIVIL case, not CRIMINAL case.\nYou should not be dismissed with a bogus reason but it happens a lot. Good companies will not dismiss you pretty much ever. But they could...\nYour only recourse in that case after you've been served your dismissal letter is to sue, all other avenues rarely get you your work back.\nThis costs minimum 200-250k and hence, makes it unappealing to a lot of families. And that's what the companies bet on.\nSome companies handle this better, some worse. Especially some small/mid gaishikei. I've been dismissed this way, yes I've almost went to court but all wanted to settle before that. I've had long discussions with lawyers and the law is clear.\nHence the part, if you have the money and the will, the dismissal was illegal and you get a nice settlement. But the ball is in your court, not the company's, and they already stopped paying for you.\nbtw if you go to court, you will most likely not get your job back, but instead company pays you a settlement. Only like a fraction of a percentage was re-instated by their companies.'",
        "In response to '250k yen or dollars?', a user said: 'JPY, that's the biggest retainer I've paid for a labour case, 200k been the lowest.'"
    ]
}