{
    "username": "Blue-Phoenix23",
    "contributions": [
        "In response to 'You hit the nail on the head.\nSomeone else in a separate subreddit said something similar: “When women\naren’t\ncommunicating, that’s when you should be really worried.”', a user said: 'That would require them to notice that you'd been communicating in the first place. I swear with some men, we must sound like Charlie Brown's parents every time we talk about anything other than their interests.'",
        "In response to 'Didn't camera - but\ndid\nbreak up with a few year boyfriend in my early 30's because he was insistent that I needed to CLEAN HIS HOUSE even though I owned my own house and needed to keep that clean, what the fuck.\nSo I broke up with him. And then about five years later I realized he had photographs that we had taken on film and asked him if I could come get copies because they were of myself and my child and he said sure!\nLadies. I walked into this house that I broke up with him over to retrieve the photos, an overall pleasant transaction. And he had the exact same piles of shit on top of his shit from the day I broke up with him. Maddening if it weren't so ridiculous', a user said: 'Lmao my stbxh came over to what used to be our house, recently because I was filing our taxes, and asked me if we had cleaned up. He clearly thought I had tidied because he was coming over. Ladies I did not. It just looked better because it didn't have all his piles of shit around, that he always insisted were not why the house was messy. Maddening is a good word for it.\nI wrote a whole post actually about this when I started packing up his shit. I genuinely and sincerely thought I had too much stuff and spent years trying to declutter. I was so wrong'",
        "In response to 'Dude that text convo was exhausting and OP is a saint for engaging the entire time calmly and trying to explain her point but it was like talking to a fucking brick wall lol.', a user said: 'Of course he's a chess bro lol.'"
    ]
}