{
    "username": "bluebushboogie",
    "contributions": [
        "In response to '\"f친 deg ein skikkeleg jobb\" er ei s칝rs ignorant ytring, tykkjer du ikkje?', a user said: 'Hvorfor kommer det alltid en nynorsksosialist inn fra sidelinjen og kaller folk ignorante?'",
        "In response to 'Bro hvordan kan du kalle noen 춺nynorsksosialist췉 uironisk游', a user said: 'Jeg er ikke en bro, mann.'",
        "In response to 'Jeg er ikke din mann, kompis.', a user said: 'Ingen kompis her brutter'",
        "In response to 'Dette er helt kontekstuelt. Det er stor forskjell p친 친 jobbe for familiebedriften eller en nystartet gr칲nderbedrift, som kan gi deg elleville karrieremuligheter om man lykkes ved 친 st친 p친 ekstra, og det 친 jobbe for McDonald's, hvor du kan byttes ut med hvem som helst og livet suges ut av sjelen din.\nHvis man velger den sistnevnte jobben, og tar en jobb for Espresso House etter 친 ha lest om hvordan de behandler sine ansatte, ja, da f친r du som fortjent. Ikke kom her og fortell meg om \"quiet quitting\" i etterkant, for jeg vil le av hvor ignorant du var i utgangspunktet.\nTL;DR\nSkaff deg en skikkelig jobb til 친 begynne med, og st칮tt ikke drittselskaper som f칮rer til at du utvikler en d친rlig holdning til arbeidslivet', a user said: 'Enig med deg men f친r bare gitt en upvote.'",
        "In response to 'Har h칮rt en del boomers som tror at quiet quitting g친r ut p친 at man ikke 칮nsker 친 gj칮re en innsats p친 jobben lenger. Quiet quitting er jo bare at man setter en sunn grense mellom jobb og fritid, og at man ikke jobber gratis. Man kan fremdeles gj칮re en utmerket innsats n친r man er p친 jobb.', a user said: 'Da har jeg totalt misforst친tt begrepet. Elendig ordbruk og veldig lite beskrivende.'",
        "In response to 'Tittelen p친 begrepet er jo satt av arbeidsgiversiden i USA. De som er imot at folk ikke skal jobbe gratis for bedriften utenfor normal arbeidstid. Legg ogs친 til et par PR-stunt om 친 f친 det begrepet til 친 feste seg i samfunnet fremfor et bedre passende begrep som \"act your wage\".\nDet at det er misvisende er jo hele poenget. For da tar folk som ikke vet hva det er 친 reagerer p친 navnet, ikke hva som faktisk skjer. Og dermed er det f칝rre som vil st칮tte \"aksjonen\".', a user said: 'Ahaaaaa. D칝ven. En fornuftig og gjennomtenkt kommentar p친 reddit. Inponerende.'"
    ]
}