{
    "username": "BobDope",
    "contributions": [
        "In response to 'Nope. It’s super common. I know a couple dozen guys like this just from my everyday life.', a user said: 'It would explain his white hot obvious hatred of women'",
        "In response to 'I worked with a guy like this… he told basically that entire story while I groggily waited for the coffee to brew…. Like, bro, at least give me a chance to caffeinate before being an open misogynist at work.\nHe was only in his late-20’s. This attitude still exists in younger people. It’s the worst.', a user said: 'Yeah I knew a guy like that in my 20s, he was divorced, total fucking rain cloud but one of my loser coworkers insisted on inviting him to lunch. Eventually I noped out of not just the lunch but the company'",
        "In response to 'I think you mean “bitches be crazy.”', a user said: 'Women be shopping get that grind on bro'",
        "In response to 'Professional Services Manager', a user said: 'Body Shop Pimp'",
        "In response to 'do you really imagine those men wanted to hunt woolly mammoths\nI'm pretty sure they wanted to hunt the mammoths.', a user said: 'Probably the most fun to be had in those days. Not like anybody had an XBox'",
        "In response to 'We used to hunt mammoths when we worked as a team and had well built and fed bodies; both are denied by overworking.', a user said: 'So true we developed our long distance running skills to cover ground on the hunt. He denies his manhood getting soft and turning into a marshmallow man at the office'",
        "In response to 'You see that's why you don't make comments like that with your real name.  \"Peter Jones\" sounds kinda generic, but this guy is just let everyone know he's a major HR liability.', a user said: 'His next post is probably ‘the gays should just keep it to themselves’'",
        "In response to 'Original Post: Absolutely unhinged response to a post supporting employees that do \"quiet quitting\" [External Link]: https://i.redd.it/934fs89cs1o91.png', a user said: 'This guy really HATES THE LADIES. He got taken to the cleaners by at least one ex wife. Likely ruined the relationship by overworking. Also hunting woolly mammoths with sticks is fun Dafuq he on about?'",
        "In response to 'He is. Running the household in a pre industrial era was brutal and thankless, especially with zero to nil Healthcare, constant pregnancies and taking care of multiple kids.', a user said: 'Plus if your dopey husband died you were extra fucked'",
        "In response to 'best guy on our team constantly gets slammed with more and more requests, and i have encouraged him -- as much as i would miss having him on the team -- to job hunt.\nso last year he gets an offer, he fumbled the negotiation but whatever, he gets an offer -- i say counter, and take it. 'no no i gotta tell the bosses first' -- ugh\nhe tells them, they match, promote him  [way, way later than they should have] and he just gets slammed with way more work for not much more pay.', a user said: 'Taking the current job’s offer is never a good idea'",
        "In response to 'I’ve done balls to the wall, overtime in a salaried position to little or no notice from management, and definitely no compensation; eventually learned to pace myself and stop work when 8 hours is up. 🤷‍♀️', a user said: 'I think many have had this experience'",
        "In response to 'Anecdote:\nI am in a lead/senior role after 7 years, and I do my 40 and bail.\nI also job hop every year or so, so my pay has doubled, as well.\nI see the loyal kids still sitting at level 2 or 3, and only getting those 2-3% merit raises.', a user said: 'That and sometimes people who, let’s not mince words, suck try to offset it be putting in crazy hours (often making others work additional hours to fix what they hose up, ha)'"
    ]
}