{
    "username": "branewalker",
    "contributions": [
        "In response to 'Basically if you’re not willing to fight for and sacrifice everything, including your life, for a company that doesn’t give a shit about you then you’re quiet quitting. Regardless if you do great work or not, if it’s just the bare minimum and you’re not doing literally everything for the company, then you’re quiet quitting.', a user said: 'to them\nQueit quitting is corporate-speak for that-which-must-not-be-named: \"work to rule.\"\nAnd they want to expansively define it so that the term can be weaponized against workers. All very clever stuff, of course, and fairly straightforward media theory reading of the piece.\nOnly work-to-rule is a very specific thing with regard to organized labor, while quiet quitting also means other things. In this concept, it's used to refer to people who refuse to do unpaid labor, especially if that means working outside their scheduled times.'",
        "In response to 'For a specific example of what \"work to rule\" means, Uber and other gig economy apps will pay a premium for drivers who usually \"clock off\" at a certain time.\nLike, a dude who usually stops taking fares at 7 o clock so he can go home to his girlfriend might see an extremely lucrative fare to be taken at 7 01, because Uber will value breaking his schedule repeatedly so he'll be available more, and they'll be willing to take the hit for four or five fares they'd lose money on to do that.\nBecause he was working to rule and they want to maximize availability.', a user said: 'I see what you're saying about Uber trying to break schedules, but that situation is also nothing about work-to-rule.\nWork to rule is\ncollective\naction to force a slowdown. Basically, your workplace will have some set of rules to protect you. Except the boss wants you to NOT do those things so you can get more done. And if you get hurt, well, your fault, right? Because they had rules! Well,\neveryone\ndecides that they will not only follow the rules, but meticulously follow them, you cause a slowdown and force a change in expectations from leadership to some more tenable middle-ground.\nWork to rule in your case, would be\nall\nUber drivers refusing to work outside their availability, or after a certain time, no matter HOW high the fares.'"
    ]
}