{
    "username": "Broad_Respond_2205",
    "contributions": [
        "In response to 'Original Post: It’s now “quiet quitting” to not go beyond your job responsibilities [External Link]: https://i.redd.it/rb5pth0h04i91.jpg', a user said: 'Okay but it's astonishing that companies actually plan on workers doing more then what they were hired for. \nThere is no labor shortage, there is Buncha scrooges that think workers will keep taking more work just so they can pocket more money'",
        "In response to 'Where will these people hide when the revolution comes?', a user said: 'Behind bs phrase like \"community supporters\"'",
        "In response to 'Original Post: What to do if my counterpart has \"quiet quit\"? One of my coworkers has been quiet quitting for a long time. But we're basically in a workplace where people are unfireable (government job). His boss does not seem to want to confront him about slacking, so instead, she gives his work to me and makes everything about \"we\" and \"us\" instead of \"him\".\nInstead of telling him directly, for example, \"hey PERSON X, why aren't you responding to my e-mails?\" She'll e-mail both of us and say \"Hey Team, why aren't you guys responding to my e-mails?\" (When it's very obviously him, not me.)\nWhen he decides not to do his work, she just gives his work to me.\nHonestly, I don't care if he quiet quits -- that's his business. But when his refusal to do work is falling on my table, that's where I start to see things getting problematic. How would you deal with this situation? Telling on him is not a good option, we are equals in the workplace and he considers me a friend.\nEDIT: Wow, so many responses! Yes perhaps my use of \"quiet quitting\" wasn't the right choice of words. My coworker came into my office on Friday and told me he doesn't \"give a f***\" about this job but he feels powerful because he feels \"unfireable\". He spends the entire day working on his own stuff (he has a few side jobs that he does). Our boss seems to be intimidated by him and takes the easy way out - instead of giving work to someone who's going to push back, she'll dump it on others instead. Firing someone is an extremely complicated and long process here, and probably not something she wants to go through. The boss is in her third trimester of pregnancy and getting ready to go on maternity leave. My coworker and I have similar job descriptions so it's easy to give his work to me. Addressing the \"friend\" issue: yeah, I don't really know if \"friend\" was the right word here either. But we're equals and I guess you could say \"friendly\" to each other. Coworker brings me baked goods sometimes, has invited me to get-togethers, things like that. Situation really sucks.', a user said: 'Nothing because quit quitting is a bullshit term that was invented to try and guilt workers about doing what they were hired to and nothing more.\nP.s: if you meant slacking then you should use slacking.'",
        "In response to 'Not to OP, to everyone else. “Quiet quitting” as sometimes described as “acting your wage”, which is to say, working no harder than necessary, shouldn’t just be a milquetoast self protest for the lazy. Properly realized, this kind of withholding of labor is called “work to rule”, and it should be done as a concerted direct action with your fellow workers.\nThe world doesn’t just belong to the ruling class. It’s supposed to belong to us all.\nTalk to one another. Organize. Revolt. NG;NM.', a user said: 'I still don't get why it's a form of protest,it literally should be the default'",
        "In response to 'If you’re working so little that you get fired, as OP did, I sure hope it’s some kind of protest. On the other hand, if you have a bunch of fellow workers start doing that with you, it’s a strategy to seize power at the work place by withholding productivity.', a user said: 'But it's literally what they wanted'",
        "In response to 'He basically said he wasn’t performing in his job. How is that without cause?', a user said: 'Where did he said that?'",
        "In response to 'Original Post: Hey guys, I was “quiet quitting” until I got fired , now what? So I just got fired and they recommended me to file for unemployment insurance. HR was surprisingly nice. She basically told me they don’t contest the claims, so I think if I use the right words in my unemployed application,\nI might be eligible for unemployment insurance.\nHas anyone successfully received unemployment insurance benefits in this situation before and lives in the state of Illinois? One of the questions is below:\nAccurately report your reason for separation from your job when you initially file your claim for benefits.\nEDIT: I  shouldn’t have used the term “quiet quitting” on my post because I used the term incorrectly, my apologies. I meant to say, I was really underperforming on my job, barely doing any work for the past year or so. I did the bare minimum. I was  then placed under an improvement plan for a little over 6 months or so. They saw some improvements, and I was doing okay, until I mislead my manager with 2 assignments. I stated that I had completed the assignment but in reality I used last year’s data to mark it completed, while I attempted to catch up over the weekend.\nI never fixed the assignments and my manager found out what I did. That’s when she went to HR for the next steps. I emailed HR for a written confirmation on why I was fired and she responded “unsatisfactory performance.”', a user said: 'Quit quitting is bullshit prhase. You were fired for doing your job.'"
    ]
}