{
    "username": "bronzelifematter",
    "contributions": [
        "In response to 'Original Post: What to do if my counterpart has \"quiet quit\"? One of my coworkers has been quiet quitting for a long time. But we're basically in a workplace where people are unfireable (government job). His boss does not seem to want to confront him about slacking, so instead, she gives his work to me and makes everything about \"we\" and \"us\" instead of \"him\".\nInstead of telling him directly, for example, \"hey PERSON X, why aren't you responding to my e-mails?\" She'll e-mail both of us and say \"Hey Team, why aren't you guys responding to my e-mails?\" (When it's very obviously him, not me.)\nWhen he decides not to do his work, she just gives his work to me.\nHonestly, I don't care if he quiet quits -- that's his business. But when his refusal to do work is falling on my table, that's where I start to see things getting problematic. How would you deal with this situation? Telling on him is not a good option, we are equals in the workplace and he considers me a friend.\nEDIT: Wow, so many responses! Yes perhaps my use of \"quiet quitting\" wasn't the right choice of words. My coworker came into my office on Friday and told me he doesn't \"give a f***\" about this job but he feels powerful because he feels \"unfireable\". He spends the entire day working on his own stuff (he has a few side jobs that he does). Our boss seems to be intimidated by him and takes the easy way out - instead of giving work to someone who's going to push back, she'll dump it on others instead. Firing someone is an extremely complicated and long process here, and probably not something she wants to go through. The boss is in her third trimester of pregnancy and getting ready to go on maternity leave. My coworker and I have similar job descriptions so it's easy to give his work to me. Addressing the \"friend\" issue: yeah, I don't really know if \"friend\" was the right word here either. But we're equals and I guess you could say \"friendly\" to each other. Coworker brings me baked goods sometimes, has invited me to get-togethers, things like that. Situation really sucks.', a user said: 'You could just do the same. The only people who benefit from this is your boss. Just do your work and take it slow.'",
        "In response to 'You could just do the same. The only people who benefit from this is your boss. Just do your work and take it slow.', a user said: 'Also if your boss is giving you more work load, ask for a raise. Don't be a sucker and let them take advantage of you. Make sure you get compensated for the workload you get. If they don't give you a raise, stop doing more work than him.\nEdit: Btw, I'm like 99% sure this post is made up by the boss or a corporate shill trying to sell the idea how \"quiet quitting\" hurt your colleagues and using that to guilt trip people to do more than what they are paid for. I notice how the blame is directed towards the colleague instead of the boss who is too much of a coward to confront him but have the gall to dumped the work load on you instead. And the solution is pretty obvious that you could have just asked for more money or stop doing more work load, but you decide to blame the colleague instead. I see you. You ain't slick.'",
        "In response to 'Not sure about state jobs, and I worked for the federal government a long time ago, but when I was a civilian you couldn't really \"ask for a raise\" the way you would any other job.  I was on the GS scale.  You got paid a certain amount.  Steps in pay were automatically given at prescribed times.  You could possibly get a merit increase but they were done in the normal review cycle.  You couldn't just go in and ask for a 5% increase or whatever.  It didn't work that way.', a user said: 'If you can't ask for a raise, then stop doing more than what you are paid for. If they can't fire the slacker, what are they gonna do? Fire you for not doing the slacker's work? Now they would get even less work done.'"
    ]
}