{
    "username": "BryanMcgee",
    "contributions": [
        "In response to 'No, those wage assessments are based on the job description and the individual’s ability to perform them. It’s not a punitive act by the employer as increases are contingent upon the employees performance. Their wage doesn’t go down.\nYou’re close though because they’re ripping themselves off and the employer gets a discount.', a user said: 'But new hires are making more. That implies that the bare minimum is seen as worth more pay to the employers, no? The new hires haven't done anything to earn that extra pay yet. They haven't proven themselves any more than the one doing the minimum. But they get paid more. You are ripping them off by paying them less than what the company believes the bare minimum of that job deserves to be payed, only because they didn't jump through your hoops like a trained dolphin. You're exploiting them via loophole and feel superior about it. Congrats. I guess you win at capitalism today.'",
        "In response to 'The company raised their starting wage during the 8 years of this person’s employment (from $15-$16 in 2014 to $17-$19 currently)\nThis employee is situated in between the high and low starting wage ($18)\nMost new employees are started at $19 to maintain good candidates. Firing bad ones is not as easy as some may think.\nThe company is looking into wage adjustments for long time employees that started at $10/hr back in the early 2000’s so this person may see a slight increase due to the fact they started at $16, 8 years ago.\nPoint remains that those that started same time and same wage that weren’t using the work-to-rule approach are at $26/hr now.', a user said: 'As someone in management, I do know it's hard to fire someone. But it's not impossible. If you want someone gone, you take some time and document them not meeting expectations over time. The fact that you haven't makes me think you just need a body there.\nMy point remains, that it sounds like you're using the loophole of them technically meeting within the starting pay range to justify paying them less than starting workers.\nI'm not saying you should be paying them $26/hr. I'm saying it still sounds like you're ripping them off and coming up with excuses so you don't have to feel like the bad guy.\nI also think you just sound judgy overall. You're calling this self sabotage because you, like the people who call it \"quiet quitting\" did that to take the onus off themselves for paying people a living wage.\nAccording to the\nEconomic Policy Institute\n, Workers are more productive than ever, but their pay hasn’t kept pace while top 1% wages have skyrocketed. So some people are getting those raises, but not enough people. Productivity has continued to rise, while pay for 99% of workers has stagnated. And that pay for the 1% far exceeds productivity. Someone is getting paid far too much while everyone else is not being paid in relation to the work output.\nCan you blame them for no longer believing in a system that demonstrably does not equally or fairly compensate workers for the work they are doing?'",
        "In response to 'We have plenty of documentation. That’s what demonstrated to me personally how difficult it is.\nLast year, myself and another manager submitted a write-up for this person to HR for them to sign off on it. It was for improper mask wearing and disrespecting both of us after repeated attempts to get him to comply.\nWe drafted it and submitted, but HR ripped it up and told us to have yet another documented conversation about it.\nThat would’ve been their 4th consecutive 6-mo period of not meeting expectations which would’ve resulted in immediate termination.\nHR, from a remote location, saved this person’s job.', a user said: 'So not a problem with their productivity then?\nHey man, it's alright.  I'm here for you. They're taking advantage of you as well. If you're still putting manager in your title, you're still on the side being taken screwed over. You know they're not paying you what you're worth. What the work you do should cost them. You don't have to go to bat for this company. Fuck them. They don't care about you. If you left today, mid shift, they wouldn't flinch. The folks you work with might. But that company? Nah man. They don't like you or care. Don't let a  lifetime of being fed nonsense about work ethic convince you to give your life to those people.\nAs a manager,  I do my job every day. A big part of that is holding people accountable for doing their job. But I also tell these people - when in an appropriate environment - that all companies don't care about them and not to let corporate pressure overwork them. I don't overwork them. I do my best to shelter them from those pressures so we can all get paid and go home without hating ourselves too much. With the current system, that's all most of us can do to make things better.\nBut we should still push for and expect better from the people running things. Kowtowing to their whims because they sprinkle crumbs and expect our lives does no one any good. Don't look down on someone who has figured out that their own life is worth more than the company. Look at how the company shows it's appreciation for your hard work and ask yourself if you think it's fair. And if not, ask yourself why you should work harder for a company that sees you as disposable and\nneeds\npeople to do your job for them to operate.'"
    ]
}