{
    "username": "bubblegumshrimp",
    "contributions": [
        "In response to 'I thought\nAdam Conover's recent interview with Rho Khanna\nwas pretty good.', a user said: 'Thanks for linking that, that was a good watch.'",
        "In response to '“I’m just like you, listener! My dad was a plumber teacher steelworker nurse and I once had a loan!” Nobody is challenged, much is proposed but there is no follow through\nI mean this was Trump's strategy in podcast trail. Not getting too deep, no challenges, just shooting the shit for the most part. The problem is most of these people don't have the chiasma to hold people's attention.', a user said: 'I agree on the \"not too deep no challenges\" part. But the real key difference is in the \"just shooting the shit\" part. Trump can \"just shoot the shit\" with people that makes him seem human and relatable even though he's pretty much neither of those things. He just doesn't sound like a politician, he sounds like a dude having a conversation. And that actually plays into his \"weave\" rambling bullshit because none of it is polished, and that works to his advantage and works to his image of an outsider who will shake up the system or whatever.\nIt seems like PSA interviews are just a chance for politicians to come and recite their list of talking points, rather than have a conversation. They're CNN or MSNBC talking head pieces, just happening on a podcast instead.'",
        "In response to 'tbf trump's podcast were non-political podcast, where PSA is specifically a politics podcast. So a little advantage there. Idk if you can switch up the interviews into more a freeform and still be PSA? But I do agree that Dem politicians need more freedom to be more passionate about topics. BUT that means dem voters need to be more tolerant on things that don't match up 1:1 with their personal topics.', a user said: 'Oh I agree. That's why I like the times when a guest is a guest\nhost\nand not just an interview subject. Like get guests and politicians to just talk about things that are happening in the news, not necessarily in an interview format.\nI'm not saying I know the answer to the problem, just that it seems to me like the problem is definitely always \"this feels like a scripted interview with canned responses.\"'",
        "In response to 'Because Ro Khanna is an incredibly boring politician. Another elite school educated lawyer who is trying to engage in kay fabe populism but has no cred to do it. Akin to when Mitt Romney rapped ‘who let the dogs out’', a user said: 'Akin to when Mitt Romney rapped ‘who let the dogs out’\nThat was pretty fire though. I had it as one of my ringtones for a while.'",
        "In response to 'I don’t know that I have strong feelings in permanent DST vs permanent Standard, but I absolutely do want them to just pick one and be done with the switching back and forth', a user said: 'I thought the same thing for a long time until I really started thinking about it. I'm gonna go out on a limb and say I've actually really come around on preferring the switching back and forth because you really do get the best of both worlds with an admitted tradeoff a couple times a year (but really like once a year, I'll never complain about an extra hour in a day).\nThis is one of those issues where I feel like most people probably do think that just picking one would be nicer, but then if we were to do that it would actually kinda make at least one month worse than what we're used to, particularly if you live in the northern half of the country.\nNot that I'll die on this hill but I'm tired of hiding in the shadows haha'",
        "In response to 'I’m with you. I used to be stridently pro permanent DST but then started realizing how late that would make the sunrise in northern and western parts of each time zone in the winter. And I’ve kind of come around to the shift being the best of a bunch of non-ideal options.', a user said: 'the best of a bunch of non-ideal options\nThat's pretty much how I've come to see it. There are going to be shitty parts of every option. I think the switch allows for a decent compromise at the cost of one single night with one less hour of sleep every year.'",
        "In response to 'Is it weird that my strongest feeling on the issue is that I’m too lazy to want to change the time on my microwave and oven😭', a user said: 'Lol I think that's fair. Just do what I do and turn the clock off on both haha'"
    ]
}