{
    "username": "buffalo_Fart",
    "contributions": [
        "In response to 'Original Post: Anyone Ever Quiet Quit a Trip? This has happened probably three times where I get close to the end of a trip and just become over it all and just end to get back home (the US). I don’t want to visit another church/palace/museum, I don’t want to wander anymore (my feet hurt). I’m tired of eating out and just done with it all. Doesn’t mean I’ve had a bad time, but I’m ready to be back in my comfort zone and bed. So when this feeling hits. I sort of find myself shutting down.\nThen, I feel guilty because I’ve flown across the world to be in a city people dream of visiting and I’m not soaking in every moment. I will say when my social connections are low, this quiet quitting happens faster. But despite 100 museums and sites. I have no energy to see anymore.\nHas anyone else experienced this?\nEdit: I’m trying to read all of these responses, on touchy airplane WiFi. But thank you for your responses!', a user said: 'Absolutely. I was just in Jordan and in Egypt and quite quit in Egypt. I was on a tour with my father and we used a company that pretty much held our hands the entire time. Jordan was the first 8 days which was more or less fine because we had enough down time to just kick back. The Egypt trip was very busy and we combined three other tours together into one gigantic tour group. Also our tour guide was insane and had a reputation to uphold. We were overseas for 28 days and after day 12 I was done. At day 25 I literally stopped going on tours and just stayed in the hotel and went to the beach. I didn't even go to dinner with anyone anymore. I was just completely over the group.'",
        "In response to 'I can't even imagine 10 days with a tour group & guide. Like, after a guided tour through a museum I'm already glad it ended. How did your father find it? Did he do the full 28 days?', a user said: 'His brother is big into group tours like this from the same company and takes three or four a year. It was non-stop the whole time, I just wanted to sit around and do nothing and occasionally maybe go somewhere. My father only missed one afternoon. He did every tour and went on every excursion they offered.'",
        "In response to 'Wow, goes to show how different people can be! One person's dream vacation is another's nightmare :-)', a user said: 'Oh, there was no misunderstanding that I was his plus one. I pretty much sacrificed myself for the month so he could go with someone and not feel awkward being by himself. It turned out there were a lot of single people on the tour, so he probably would have done okay. But my father can be a little abrasive, so I think he was worried that he'd end up just completely by himself.'"
    ]
}