{
    "username": "bunnyswan",
    "contributions": [
        "In response to 'Spent the last 20 plus years working really hard, putting in loads of effort, having no lunch break consistently, doing loads of overtime and got bugger all appreciation. Just watched whilst young lads got promoted and given pay rises and I’ve not had one since 2017. Couple weeks ago, worked until 10.30pm and I’m only paid til 5. They won’t pay overtime either.\nSo fuck them.\nI’ve handed in my notice and going to another place who i have a feeling are going to treat me better.\nI don’t mind working hard, IF you’re appreciated and it gets you somewhere but I’m sick of putting in loads of effort and getting nothing back, getting so stressed I’ve not slept properly in months. It’s just not worth it.', a user said: 'In your next place please give them 60% of the effort you have given the pace you are leaving as standard, you must after 20 years already be so good at what you do and if you need to impress you can push to 80% please never give them your 100% if you do they will expect it and you will burn your self out.\nHave lunch, leave on time do your job. It's not worth wasting your life at work.'",
        "In response to 'Original Post: What are your thoughts on “quiet quitting”? Is it something you’ve been doing for a while or something you’ve recently started implementing? For those who don’t know, quiet quitting refers to not over extending yourself and going above and beyond at work such as taking on more responsibilities or staying late. You do what’s asked of you then go home on time.', a user said: 'I'm honestly a bit suprized people have been working so far outside of the boundaries of their role. I always thought if you where doing lots of extra hours it was a sign you where an in efficient worker as you couldn't do what was expected in the time the employer thought it was feasible to do it in. Or that you are in efficient because you have taken on more than you can do rather than communicating effectively with management so that they can do their job properly.\nI now work in the care industry so occasionally will work on something outside of my role when an extenuating circumstance happens with a paitent but that is because I know the impact on them. But it would only be like 1 extra hour.'"
    ]
}