{
    "username": "burtsbeesfartmachine",
    "contributions": [
        "In response to 'Original Post: I think my remote team mate is quiet quitting And it's ticking me off. Need advice if I should say something?\nMy team is fully remote,  spread  across the US. Our individual and team metrics are tracked by the amount of tickets we process on a weekly basis. This is a FULL time job and I've found that a member of our team is only logging about 4 hours a day - if that! Meanwhile, the rest of the team is putting in 9 hr days just to keep up with the volume.  We've also had to log in and work the last two Saturdays just to clear the backlog.  If this person would just work a normal day,  it would lighten the load on each of us. Our manager hasn't seemed to notice that this  person's \"numbers\" are half of what the other team members are producing. Do I speak up or keep my trap shut,  silently seething all day?\n**Thank you everyone for your input! I'm not going to do my managers job for them,  if they don't care,  I won't care either.  I'll hit my targets and focus on my career advancement in 2025.', a user said: 'I've had similar frustrations in the past with coworkers, and several of them I later (organically) found out had necessary accommodations or FMLA. A manager shouldn't and isn't going to legally be able to tell you if there is an accommodation or FMLA (half the time they don't even know what it is for because of laws) in place. Commenting on someone else's underperfomance is more likely than not to put a target on your back for several reasons - bad for team dynamics, bad for your manager's appearance during skip levels.\nIf you came by the info on your teammates' work hours by snooping, you may not have the whole picture. If it was discussed by leadership, they're likely already aware. I would watch your back with any leadership team willing to discuss lateral colleagues with you, though, as they likely are doing the same to you with others.\nWhat will help make your team better overall is speaking up about feeling overwhelmed. This is the only thing that has helped me in the past in a similar situation, and I've definitely gone multiple routes.\nA good leadership team will look at labor cost and make a decision, especially if several people picking up the slack speak up about feeling overwhelmed. They won't risk losing those people over one. If this person doesn't have an arrangement that protects that, any corp is going to see them as a departmental budget drain. Be wary, though, that if this person is fired or shifted to a different position, you may very well end up taking on their work in addition to yours. Especially if the workload is determined to be less than would necessitate hiring someone to replace them.\nRemember in the meantime to set good work life balance boundaries and protect your mental health - if you're salaried and expected to work overtime, it should come with some degree of schedule flexibility for lower volume days. Otherwise I'd follow your teammate's lead and do the bare minimum.'"
    ]
}