{
    "username": "Business-Box-253",
    "contributions": [
        "I realized today, I quiet quit grocery shopping! So about a year ago I had a breakdown emotionally. Nothing really changed. I kept my terrible job. Our chores didn’t immediately change.\nBut I stopped cooking as often, so I didn’t have to dishes as often, didn’t have to clean up the kitchen as often. Kids still eat, less healthy than I like, but they love sandwiches and the random crappy frozen food, with a fruit and veg. I cooked less so I shopped somewhat less. Then I shopped less and less. And my husband was offering to grab what we needed more. So I just keep doing less.\nToday I realized I couldn’t remember the last time I did a big grocery haul. And today I found shrimp in my freezer. That my husband bought. That I didn’t ask for. Like oh cool I will plan something for this. \nMy mental health is somewhat better. Wondering what else I can quiet quit.",
        "In response to 'I love cooking but sliced cucumbers are a vegetable and so are cherry tomatoes if I had to work till 6:30 again.', a user said: 'Saw a dietitian say that ranch doesn’t take the nutrients away from the vegetables. Wow what a game changer! A vegetable with ranch is better than no vegetable at all (I hope)!'",
        "In response to 'That’s how I feel about cooking dinner. Good for you.', a user said: 'Ya. I love to cook. If that was the only chore, I would still be here for it. But then there is the clean up. So draining after a day of work. Plus all the extra groceries when your going to make a real meal. Like 10 plus ingredients. Now it’s like. Some chicken nuggets tonight for them, cucumber slices and ranch, a fruit. It’s not awesome but they don’t whine the whole meal either.'",
        "In response to 'My husband has taken on ordering groceries delivered, and we get Factor premade meals. I love to cook but all the cooking, cleaning and planning time just doesn't fit my priorities any more. I'd rather work out or do something for myself 🤷', a user said: 'I also love to cook. But the kids hate everything and the complaining drove me mad. Literally almost.'",
        "In response to 'Oh my god, I've done this unconsciously and your post just made me realize it.', a user said: 'What do you think triggered it for you?\nBefore we had kids and before I was overwhelmed by everything, I think I was super anal so unconsciously got all the chores. Things changed though. They really changed. Lol'",
        "In response to 'My mom died, so I stopped functioning entirely. My husband never noticed the work of cooking, despite being a person who really does his share of home and parenting responsibilities. And he LOVES Costco, so it seems to've worked out well. We get a surprise bag of veggies once a week and we pick up odds and ends as needed.', a user said: 'I’m so sorry about your mom. I don’t want to even imagine. I called mine twice today already. I really hope that your ok and doing better now.'",
        "In response to 'I like cooking but what the fuck is planning. Like I look at my NYT cooking app and I’m like “nope nah no”.\nUgh.\nSo like baked chicken or pasta or tacos forever? Is that my fate? I often cook for my mom who can’t eat garlic, onions, wheat, and like 70% of all vegetables and fruits and that makes it so much harder and I just am so uninspired.', a user said: 'Why is planning new meals everyday the worst part of adulting. I guess anxiety exists too. Soo that a bit more. Really fun to add them together'",
        "In response to 'We’ve eaten sandwiches and “fridge tapas” almost every night this week. Work project is nuts and I have nothing left to give at home other than to be present for my kid.', a user said: 'I think being present is the most important! My family loves sandwiches. I like fancy sandwiches. And I like no dishes better than all the rest. Sooooo here we are! Feeding our family’s and providing. Let’s go moms!'",
        "In response to 'A few years ago I straight up gave my husband the chore of grocery shopping/menu planning. This was pre baby. My argument was that he has more time during the week when the store is less busy to shop (3/12 schedule) and he often wants to make at least one fussy meal so he could just do the shopping. If there is something I want to make specifically I’ll stop by the store or request the ingredients so I can make it when he’s working. But generally I’ve accepted that we will eat whatever he wants to make and not complain. That’s the price I pay by not doing food duty.\nI still probably do the same amount of dishes, but I rarely have to waste part of my weekend standing in line at Kroger. Also, unless I’m making some thing super special for a holiday or something I just simply don’t cook. It’s marvelous.\nTomorrow I am planning on throwing a meal in the crockpot since my husband will be working Friday, Saturday, and Sunday. But, at least me and the toddler will have leftovers to get us through the weekend without turning on the stove again.', a user said: 'Genius! I used to care about food. My husband doesn’t. So that’s how meal planning and grocery shopping ended up on my list. Now I don’t care. My love language was beat out of me. Lol.'"
    ]
}