{
    "username": "Busterlimes",
    "contributions": [
        "In response to '\"Quiet quitting\" is not a thing. It's called \"working to rule\" or \"acting your wage\". The sheer level of entitlement to treat workers doing exactly what they agreed to do as \"quitting\".', a user said: 'Capitalists will do anything to shift blame on the labor for their shortcomings as a \"business owner\"'",
        "In response to 'The labor shortage is here for one reason—and it’s quiet quitting\nTo the question “Where are all the workers?” new research has an answer: They’re improving their work-life balance.\nOne question has hovered over the post-pandemic economy for the better part of three years: Where are all the workers? Businesses’ difficulty hiring has been blamed on a gamut of ills: Too-generous unemployment benefits; too many stimulus checks; not enough immigration; too many workers with long COVID, and, finally, simple laziness.\nNow, a recent study suggests a different answer: Workers are still there—they’re just not working as hard.\nThree researchers at Washington University in St. Louis crunched federal data from the Census Bureau’s Current Population Survey and found that most of the drop in hours worked came from people who stayed employed, but worked fewer hours. Their results were published recently in a working paper by the Federal Reserve Bank of St. Louis.\n“It’s not that fewer people are willing to work—if anything, more people are willing to work than before the pandemic,” co-author Yongseok Shin, a Washington University professor, told Fortune. “But it’s that some people are cutting back their hours.”\nShin and his co-authors, PhD candidates Dain Lee and Jinhyeok Park, found that 55% of the drop in labor supply since the pandemic was due to a decline in hours, while the rest came from people dropping out of the labor force. And it’s not early retirees who are cutting back, either: Most of the reduction came from highly educated men working intensive jobs of 50 hours a week or more, Shin said.\nQuiet quitting and “no-work Fridays” \nThe data helps explain why, even with the labor participation rate near its pre-pandemic level, job openings remain near record highs and hundreds of thousands more jobs are created every month. Meanwhile, the unemployment rate is at a mere 3.8%, a rate that was considered unbelievably low a few short years ago.\nShin believes the pandemic, which pushed millions of Americans to reevaluate what was important to them in life, also set off an epidemic of “quiet quitting,” perhaps better described as salaried workers declining to work excessive hours or hustle quite so much.\n“Everyone reevaluated their work-life balance, and maybe they said, ‘I don’t have to work 55 hours, I’d like to spend more time with family,’” Shin said.\nIn other words, “quiet quitting,” which has previously been blamed for costing the global economy billions, has also successfully supported the tightest job market in a generation and an increasingly emboldened workforce.\nCrucially, while many of these quiet quitters may have wished for less work pre-pandemic, the advent of hybrid or remote work in white-collar fields has given them the leeway to make it a reality. Even in some offices that are calling back their workforces, “no-work Fridays” have become a phenomenon, with empty offices, few meetings and significantly fewer emails—something Shin said he’s seen among his own friends.\n“That’s the technological dimension that allows [workers] to do this,” Shin said. “Say you’ve done all your work for Friday in the morning, and you know your colleagues are not in front of the computer either — this allows people to shift back a little bit and not work when the work is not there.”\nLess frequently, the cutback in work comes from above—as when Shopify earlier this year eliminated unnecessary meetings from its workers’ calendars. “No one schedules meetings for a Friday afternoon, or hardly any Friday at all. We all agree, ‘Let’s get everything done by early afternoon,’” one worker at an advertising agency told the lifestyle publication InsideHook.\nPlenty of corporations are now trying to claw back some of their workers’ newfound free time, whether it’s mandating three days a week in the office, rewarding workers who put in more face time, or simply telling adamant remote workers they can go elsewhere, as Amazon CEO Andy Jassy memorably did this summer.\nBut if the “new normal” is hybrid work, Shin is hopeful that white-collar employees won’t go back to their overworked ways.\nHe doesn’t see the trend as shirking, but as a realignment of people’s workdays with the vagaries of knowledge jobs. “Sometimes you’re just sitting in your office for no obvious reason — it’s not like a production line, where the workflow is constant,” he said.\nIndeed, “quiet quitting” is a good thing for all parties involved, Shin argued, since it brings famously overworked American professionals more closely in line with their peers in Europe and other developed nations who take longer vacations and work fewer hours than Americans. It’s good for the employer, too, since workers who aren’t burned out can work later in life, if they want to.\nWhile Shin’s study only goes through 2022, data from this year shows the trend is sticking, he said. The share of Americans who are working has exceeded its pre-pandemic high, but the number of hours worked per person hasn’t budged.\n“It seems like this is a collective decision,” he said. “People seem to like it. If this is the new normal, hopefully it can stay.”\nhttps://fortune.com/2023/10/14/labor-shortage-quiet-quitting-study/', a user said: 'This is such blatant corporate propaganda to leverage public view against labor.  The shortage is from boomers doing a mass retirement during covid and the rest of us have moved up to the available positions.  Unemployment is low, stop sipping corporate kool-aid'",
        "In response to 'Both are long term trends, over time people are working fewer hours and the number of workers in the workforce is declining.', a user said: 'Office jobs maybe, but anyone working on the floor or doing the hands on labor is absolutely not.'"
    ]
}