{
    "username": "buubrit",
    "contributions": [
        "In response to 'Not even suicide, just dropping dead.', a user said: 'Thankfully things have changed massively for Japan.\nWork hours\nand\nsuicide rate\nare along the European average. Including paid and unpaid overtime, and verified by independent surveys and organizations. Look at the data — like Germany it used to be high in the 80s, these days not so much.\nMedian wealth\nin Japan is double that of Germany, and higher than that of Sweden.\nJapan is also one of the wealthiest countries in the world by\nnet investment position\n. Japan’s\ngovernment pension fund\nhas more assets than the Bank of England.\nWealth equality\nis amongst the best in the world.\nIn fact, Japan’s\nquality of life\nis higher than that of Sweden.'",
        "In response to 'I mean they also have some of the oldest population so that probably helps most of those statistics.', a user said: 'Many of these statistics (such as suicide rate) are age-adjusted already, which is essential when comparing countries with vastly different demographics.\nJapan indeed does have the highest life expectancy in the world, but many European countries also have comparatively old populations, such as Spain and Italy.'",
        "In response to 'There are \"black companies\" that keep the tradition alive of working people to the point of suicide.', a user said: '“Black companies” are incredibly uncommon these days, not to mention illegal.\nIn fact the crackdown in the 90s and 00s contributed significantly to the decrease in work hours and suicide rates.'",
        "In response to 'They even have a word for it: Karoshi (overwork death)', a user said: 'So does Sweden. Arbetssjukdom.\nThe Swedish work environment authority in 2019 concluded that 720 workers in Sweden already die every year due to stress from engaging in wage labour.\nCompared to less than a dozen per year in Japan.'",
        "In response to 'Yep, it's objectively not a good thing to require people to be at work when they aren't being productive.\nIdeally, leaders should want their workers spending as little time in the office as possible while still getting their work accomplished at the quality they need. Anything beyond that is wasting your employees time and bad for the companies culture.', a user said: 'Nordic countries like Finland have similarly low fertility rates to Japan. Same goes for other European countries like Spain and Italy which have fertility rates even lower than Japan.\nThis is a developed country issue worldwide, not specific to Japan by any means.'",
        "In response to 'I mean is it surprising? Employees don't get paid enough to afford to live and have ever increasing pressure to output more and more to drive value and stock prices higher, but despite that end up further and further from a good quality of life. This doesn't seem surprising. I would argue you see similar trends all around the world.', a user said: 'Thankfully things have been massively changing for the better.\nWork hours\nand\nsuicide rate\nare along the European average. Including paid and unpaid overtime, and verified by independent surveys and organizations. Look at the data — like Germany it used to be high in the 80s, these days not so much.\nMedian wealth\nin Japan is double that of Germany, and higher than that of Sweden.\nJapan is also one of the wealthiest countries in the world by\nnet investment position\n. Japan’s\ngovernment pension fund\nhas more assets than the Bank of England.\nWealth equality\nis amongst the best in the world.\nIn fact, Japan’s\nquality of life\nis higher than that of Sweden.'",
        "In response to 'German median wealth is below the EU average, and at the end of the day it's mostly cultural: Germans don't own their homes at the same rate as those in other countries, and that plays a key role in wealth for most people.\nAnd regarding the quality of life index... dunno what to tell you about it considering that according to it quality of life in Spain is higher than in Sweden, or quality of life in Portugal is higher than in France.', a user said: 'Someone owns the homes. Not being able to afford housing is a very real issue in Germany.\nHere’s another quality of life ranking with similar rankings. Feel free to adjust the sliders yourself as you see fit.\nhttps://www.worlddata.info/quality-of-life.php'"
    ]
}