{
    "username": "calisai",
    "contributions": [
        "In response to 'When did pagers become a thing?\nhttps://en.wikipedia.org/wiki/Pager\nPayphones were a thing as well.\nI type the above as I have memories of the look on Dad's face when he came home with his newly-assigned pager in the 1970s. Couple that with the sour face he made at the local pool when his pager went off and he had to use the payphone to call in and see what was the emergency. While trying to hear over the screaming kids enjoying a nice summer day at the pool.\nSo this work-creep into our off time has been going on for much longer than the 1990s' innovations.\nI'm not saying this isn't a fight worth fighting by any means, just saying we've been slowly losing this battle for a very long time. ;)', a user said: 'It's not a technological problem, it's a societal one.  So the advances in tech didn't cause it, the expectations that you should put the job/company first did.  The tech just made it easier for those expectations to be met.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'This is partially where the wage gape for women is coming from as well.  Both via overtime as well as \"doing the extra hours\" and getting promoted.  Historically guys were trading time at home for advancement at work.  Is it healthy?  Not in the slightest.  Does it explain a portion of the difference?  Yup.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'It's not the sole 100% reason of course.  Another large reason is professions in the humanities are significantly underpaid compared to STEM, etc.  And another is that very dangerous jobs and dirty jobs being better compensated overall than office work, education, childcare, etc.  Both of which men outnumber women in large numbers.  Add onto that the forced break in career for maternity leave, etc.\nThere is no 100% answer, it's a large combination of societal factors that impact wages.  Historically men have been expected to do those types of jobs and women haven't either had the opportunity or frankly wouldn't want to do them.'",
        "In response to 'That's not what quiet quitting is. Quiet quitting is showing up to work, doing as little as you can get away with. Then going home. Basically doing as close to no work as possible and still collecting a check.', a user said: 'Exactly, this article and others like it are trying to apply it to normal balanced workers to shame them into working above and beyond.\nQuiet quiting is something even beyond that.  It's basically going on a silent strike or protesting in silence, etc.   It can also be one of the final stages of complete burnout.'"
    ]
}