{
    "username": "cam94509",
    "contributions": [
        "In response to 'its the truth though. also, more woman in the workspace equals higher supply which drives wages down as its more competitive.  Corporations love it, more cheaper, more better.', a user said: 'The end result of women entering the workforce is the privatization of women's labor, not merely the creation of some massive new block of laborers. Stay at home mothers do administrative work, reproductive labor (by which we mean the work of producing future labor broadly, not the narrow idea of literally producing children. Cooking dinner so you can eat is every bit as much 'reproductive labor' as literally having children - literally, the primary job of a stay at home mother is to raise children. Insodoing, she produces a new batch of laborers to be fed into the gristmill), and sometimes work like mending and other physical maintenance labor. This kind of work is replaced by administrators, teachers, restaurant workers, etc inside the private sphere of the economy, as the labor must still be done - it ceases to take place in the cottage industry of the home and instead takes place in the industrial economic sphere. This results in this labor being industrialized, increasing efficiency. Thus, a teacher watches and teaches 30 students where a stay at home parent might be able to manage 6 children (In larger families, older children often take on significant responsibilities in raising their younger siblings - These children are instead freed up to learn and develop into more productive laborers (and maybe happier people)), and the teacher is much better at producing productive laborers than the stay at home mother ever was, since the teacher is a specialist in their field. Insofar as industrialization drives increased efficiency, however, what this does is increase specialization elsewhere in the system, or alternatively it drives new growth. It may also decrease the total number of labor hours that need to be worked - it may, that is, directly drive a decrease in overworking.\nIn general, these kinds of increases in economic efficiency drive UP wages instead of driving them down, and results in shorter hours for everyone.'",
        "In response to 'No, if productivity has increased 3, 5, 10 times as much as pay, thats a not increase in wages due to increased efficiencies as wages would have increased by the same margin. so again, increase in efficiencies does not translate to increase in wages.\n​\na mother, housewife, or whatever titles you want to give to the person is not a job.  There are no news reports of major lay-offs to mothers and housewives due to the economic downturn lol.  last reccesion, there were no reports on housewives lost jobs.  the reason being......\nyou guessed it, its not a job lol.\nlabor that needs to get *done* is a task, it is not a job in the sense of being employed in a JOB. boy you dense.  also, send me a link to the last news report on major lay-offs to housewaife and mothers on their jobs, thanks.', a user said: 'No, if productivity has increased 3, 5, 10 times as much as pay, thats a not increase in wages due to increased efficiencies as wages would have increased by the same margin. so again, increase in efficiencies does not translate to increase in wages.\nThat's cute, but it's the opposite of what your actual article says.\na mother, housewife, or whatever titles you want to give to the person is not a job. There are no news reports of major lay-offs to mothers and housewives due to the economic downturn lol. last reccesion, there were no reports on housewives lost jobs. the reason being......\nIs \"Peasant Farmer\" a job? Because \"Housewife\" is like \"Peasant farmer\" in that it is not a part of the formal economy but it is productive labor.\nlabor that needs to get\ndone\nis a task, it is not a job in the sense of being employed in a JOB. boy you dense. also, send me a link to the last news report on major lay-offs to housewaife and mothers on their jobs, thanks.\nWhether you call it a \"task\" or a \"job\", the formalization of it provides the demand that draws the new \"supply\" of labor to the formal economy, which was the point.'",
        "In response to 'No, cost of living adjustments, aka COLA is a thing and contributes to gradual increases in wages.  increased in efficienies does not translate to increase in wages, especially across the board.\nSo is washing my car, or cutting my grass,  it is productive labor, yet agian is not a job. it is a TASK.  a peasant farmer isnt doing a job, unless he is selling his produce. and if he is, he best report anything greater than $600, Biden hiring revenue agents for that $$$', a user said: 'The wage growth is measured against COL in EPIs data, so mere COLA would result in 0% wage growth.\nWhat you call or don't call a job, lucky, is completely irrelevant, because the concession that it is informal labor also concedes that, were such labor formalized, it would increase demand in the formal economy for labor.'"
    ]
}