{
    "username": "caniki",
    "contributions": [
        "In response to 'Original Post: I didn't get the promotion. Should I quit or quiet quit? A few months ago everyone in my team was let go apart from me. I was then told I could apply for my old manager's role. I applied but have now been told I didn't get the role and they are going with an external candidate.\nFor these past few months I have basically been doing this promotion role (and have received really good feedback from lots of senior people). I have not gotten a payrise to do all this extra work.\nI want to leave before this candidate starts because I'm tired of giving them essentially cheap labour. I was told if I didn't get this promotion, another role would be made available for me (in the same team), so I would probably have lots of leverage to negotiate a payrise. But I really don't want to have to essentially train this new external candidate who will be making more than double what I earn in the role I didn't get.\nShould I hand in my notice now, do a shitty handover and let the new person flounder? Or should I stay in my role with more money, but be looking for jobs on the side (it could be months and months before I find a good job). If I do immediately quit, I do have savings I could live on for 6+ months (took me years to save this amount).\nWhat would you do? Any advice?', a user said: 'This happened to me once. I sat down with the newly hired person, who was now my boss, and said “I just want to be transparent; I applied for the job that you just got.  So, I’d like you to help me close the gap in my skills so that I can do your job”. It was probably the best and most influential 5 minutes of my career.  They took me under their wing and together we made some big changes to the company.  We both ended up leaving the company for other opportunities, but still stay in contact. Great manager and mentor.'",
        "In response to 'Being candid here; I don't think I can do that. I've had the most stressful 5 months doing the role of 7 other people,  no payrise with a promotion being dangled in front of me, and then snatched away. I don't want to make any big, positive changes for the company. I feel pretty bitter right now.', a user said: 'Oh I didn’t do this for the company. I was pissed I didn’t get the job, but I realized that the company hired this person because they had a skill set I didn’t have. So that was my goal, to acquire that skill set, and who better to teach me than the person who was just hired for having it.'"
    ]
}