{
    "username": "Cardie1303",
    "contributions": [
        "In response to 'Indeed, Negative results that prove a hypothesis wrong are also valuable results (assuming not a failure in execution).', a user said: 'Sure it is valuable but from the view point of the PI it is usually not a good idea to publish negative results of an ongoing project. There is a good chance that this will result in your funding being wasted for the benefit of another research group.'",
        "In response to 'Original Post: I’m quiet quitting my PhD I’m over stressing about it. None of this matters anyway. My experiment failed? It’s on my advisor to think about what I can do to still get this degree. I’m done overachieving and stressing literally ruining my health over this stupid degree that doesn’t matter anyway. Fuck it and fuck academia! I want to do something that makes me happy in the future and it’s clear academia is NOT IT!\nEdit: wow this post popped off. And I feel the need to address some things.\n1. I am not going to sit back and do nothing for the rest of my PhD. I’m going to do the reasonable minimum amount of work necessary to finish my dissertation and no more. Others in my lab are not applying for as many grants or extracurricular positions as I am, and I’m tired of trying to go the extra mile to “look good”. It’s too much.\n2. Some of yall don’t understand what a failed fieldwork experiment looks like. A ton of physical work, far away from home and everyone you know for months, and at the end of the day you get no data. No data cannot be published. And then if you want to try repeating it you need to wait another YEAR for the next season.\n3. Yes I do have some mental and physical health issues that have been exacerbated by doing this PhD, which is why I want to finish it and never look back. I am absolutely burnt out.', a user said: 'I agree with \"Fuck it and fuck academia\"  and that you should not ruin your health but this:\nMy experiment failed? It’s on my advisor to think about what I can do to still get this degree.\nIs simply wrong. A PhD is supposed to show that you are capable of independent research. Your advisor should not be responsible \"to think about what [you] can do to still get this degree\". That is not their job. Have you thought about quitting your PhD and just leave academia now?'"
    ]
}