{
    "username": "CascadianCorvid",
    "contributions": [
        "In response to 'Original Post: Quiet quitting is happening at my school You all have heard it around the world. Quiet quitting or \"simply doing your job and nothing else\" is going around. Anyway the Fall Fling dance rolls around and teachers are \"required\" to chaperone. Basically we are given a google form to sign up for a shift to chaperone the dance. No this isnt paid, yes its on a Friday night after a long work day and week, and no food is not provided to teachers. Total suckfest all around. Well get this, the day before the dance we get a frantic email from Admin. No one signed up to chaperone. NOT A SINGLE teacher signed up to chaperone. We get some messages about how this is mandatory, teachers must be there for the event, we can choose which shift we work but must be there. No one signs up. Cue Admin start walking door to door with a sheet asking people to sign up. Get this, the teachers stand their ground and say no. Of course a few caved, 1 or 2, but overwhelmingly the teachers say no.\n​\nGuess what happened, well they had the dance, the admin chaperoned, the few people that signed up, basically a skeleton crew. The next week nothing, no messages, no angry faculty meeting, nothing. They know that they cant do anything to the teachers because its not one or two, its everyone. Listen I understand that kids need fun stuff to do, but maybe don't make teachers do it, or if they have to be there pay them??', a user said: 'Working your contract is not quiet quitting, it's resisting labor exploitation. We're professionals, not volunteers.'",
        "In response to 'Serious question though, (and totally sorry if my newness shows—only 1 year under my belt) but if our contract contains the statement “and other duties as assigned” under the job responsibilities portion, do we have a choice in this sort of thing?', a user said: 'If your contract has a defined start and end time, the assigned duties need to happen in those times. If the contract specifies that you can be assigned duties outside of those hours, what is the point of an end time?'",
        "In response to 'I got into a debate with someone on here a while back on this very subject. They tried to argue that our contract hours are just the hours that we’re expected to be at the school- not the finite cutoff hours for doing work. I said the same thing as you. What’s the point of contract hours if we’re expected to work beyond them? They might as well not even include them in our contracts if that’s the case.', a user said: 'Duties and hours are 2 different things. I'm not sure why that's mysterious to some people. In my district they pay us, or trade us time when they need us outside of contract hours.'"
    ]
}