{
    "username": "casskittycat",
    "contributions": [
        "In response to 'Original Post: How to Approach Annual Review After I Quiet Quit Almost a year ago, my boss pulled some power move BS and I made two changes as a result: I took work email off my phone and stopped working more than the expected hours. No more extra from me - if an opportunity for a conference proposal comes and she doesn't mention it at the weekly meeting, neither do I. If she has a \"good idea fairy\" moment of something she's really like to see happen I just...don't.\nMy boss's boss knows my boss is a piece of work and after I confided in a colleague that I was thinking about leaving, I was rewarded with a raise.\nSo now we're at the year-end and I put together the end-of-quarter metrics. To do so, I pulled from last year's annual report, and holy hell while we've hit our metrics most of the \"extra\" stuff has fallen away.\nIt will be time soon for my annual review and next year's goal-setting. I'm wondering if anyone has any advice for the discussion. I'm thinking that no good comes of telling her that I'm done doing more than what's required, but I have to think it will be fairly obvious. Anyone have any good advice?\nFWIW we are a team of three, and we replaced the other team member last year, had someone for a little over a month who didn't work out, so I think I can play it off like some of my time was spent mentoring? I also want to stay in this job at least 5 more years because of some specific benefits and the hopes that my retirement-aged boss will quit in the next two years. Thanks!!', a user said: 'Effective quiet quitting in its essence is about meeting basic job expectations and while holding firm boundaries around your hours and requirements outside of the scope of your job.\nInstead of thinking of having to address your actions as \"quiet quitting\" it would be better to focus on what barriers you feel  there are between their expectations and your ability to perform well while maintain work life balance and boundaries.\nExample: I personally am feeling in my currently role that i am not being set up for success. I have found it difficult to meet the expectations of my job within the hours of a reasonable work week and would like to know what can ve done to remedy that.  I assume you feel i COULD be getting all this work done in an average work week so I would like for you to provide guidance as my manager as to how one can achieve the work expectations. Specifically ask them how many hours a week they think it takes to meet expectations? Discuss time killing barriers and what can be done to remove them.\nPut the ownership on the manager to either admit you're set up for failure or they expect you to work beyond a typical work week.\nIf they make mention of it taking more time then youre contracted to work, say that if that is the case you want to revisit the terms of your contract and make ammendments to it so that hour are reflected accuratelt and then \"obviously\" the change in compensation to account for these extended expectations.\nIf the tasks required are outside the scope of your role, say that you would like to get an updated job describe with the responsibilities that will be removed from your day to day to accommodate these new responsibilities considering you're already at capacity. You \"want to make sure\" if you're taking on these new responsibilities that your quality of work doesn't suffer and while you believe that everyone has a common goal of success and work life balance you need to see big picture the plans to achieve this. And while you appreciate the opportunity to broaden your skill set, you want to protect your professional reputation as you pride yourself in quality work and want to know your employer is commitment to ensuring you aren't spread too thin.'"
    ]
}