{
    "username": "CasualBrit5",
    "contributions": [
        "In response to 'Original Post: Quiet quitting: Employees suffering pandemic burnout say they've just stopped working as hard [External Link]: https://www.usatoday.com/story/money/2022/08/14/what-is-quiet-quitting/10304956002/', a user said: 'To be fair, limiting your work to 9-5 is an extremely outdated way of doing things. It worked a hundred years ago when all work was very physical and we had no computers. But nowadays you aren’t paid to work 9-5, you’re paid to get the job done. You have the freedom to work whenever and wherever you like, whether it’s midday in the office or 2am on the loo, so you should be willing to complete all your tasks regardless of when it happens.\nBesides, not working hard just means you won’t advance your career.\nThis guy\nsums it up. Working harder means you’ll be more likely to get promoted, you’re more likely to get a raise, you get a good reference on your CV and you learn important skills for if you want to take your work into your own hands and become an entrepreneur. Besides, when the next round of layoffs comes around, do you think they’ll fire the hard worker or the worker who does the bare minimum?\nOn top of this (because we are in\nr/economy\n) putting in the bare minimum will be very harmful to the economy. Infrastructure will get worse, there’ll be less tax money for services, employers won’t be able to afford raises and sick pay, and your job will probably get outsourced or automated. It’s the same with unions. We need a good economy to enjoy the advantages we have and stay on top.\nBut if you really have a problem with your job, you can of course just leave and find a better one. The good thing about our society is that you’re free to do that.'",
        "In response to '\"Closing your laptop at 5 p.m. Doing only your assigned tasks. Spending more time with family\" What's wrong?', a user said: 'But what if you don’t have a family? You’d have much less reason to not work. I reckon it’s better for single childless workers to work harder so they can improve their position.'",
        "In response to 'I'll do extra things for my employer when my employer does extra things for me. Other than that, you get what you pay for. I don't see a problem.', a user said: 'They give you sick pay, and holiday pay, and pay raises, and probably countless amenities around the office. Considering the current state of the economy, it’s probably good to pay them back with your labour, isn’t it?'"
    ]
}