{
    "username": "CatCatCatCubed",
    "contributions": [
        "In response to 'Original Post: What's your opinion on quiet quitting? Been doing it for almost a fortnight now, and it's changed my life (for the better).\nInterested to hear others' thoughts.', a user said: 'I completely support it but personally it’s hard for me not to do things because every office I’ve been to is ridiculously avoidant at basic shit.\nLike giving us new folks a bunch of desks that were completely covered in dust and having us clean them but when I spilled coffee on the floor a few months later, I was told not to bother trying to do even basic mopping up with paper towels because it was the cleaners’ job; the flooring ended up permanently stained. But they couldn’t get the cleaners to prep our desks???\nOr making it my responsibility to manage a tech storage room where literally nothing was organised so I had to start from scratch and clean, test, and write down the make, model, etc of hundreds of monitors, keyboards, mice, cables, printers, printer ink, laptops, phones, tablets, etc. by myself. I even found mouldy laptop bags in there. They literally hemmed and hawed about using the Excel spreadsheet catalogue I made, like “well who is going to maintain this after you’re gone???” Okay, sure, whatever, just drop the spreadsheet after I leave - tossing it in the room and being unable to find it later was totally better.\nAnd that storage room thing has happened at 3 separate locations. I can’t help myself. I walk in to see the room looking like a hoarder house used to breed dust bunnies and even cockroaches and I’m like “(Seriously, again?) Stop, wait on my next tasks - if I’m partly responsible for this crap, then this is unacceptable” and they always bitch and moan that it’ll take too long. At most it takes a week, and then everyone loves it of course.\nEvery single goddamn place. “Why can’t you just use the room and stuff as is?” Because it’s disgusting? Because I don’t want to touch cables with dust caked on them? Because I don’t wanna have to untangle cables every time I need one? Because you made me bring a printer across campus only for me to find out it didn’t work and then I returned with it to find out that it hasn’t worked for over a year because of an exclusive part you never ordered? I swear to god, when I get hired as an IT these situations are bound to happen and then I end up muscling my way into storage management every time because they won’t do it themselves and I refuse to listen to any more “we don’t have that; guess you need to wait for #weeks/months for us to order it next quarter” only for me to sigh and reply “yeah, you mean the three brand new ones sitting on the shelf in there, for some reason under the pile of old mice?”'"
    ]
}