{
    "username": "CATCAM01",
    "contributions": [
        "In response to 'Remember, You're paid by the hour, not by how hard you work.', a user said: 'Right but time drags standing around'",
        "In response to 'Original Post: Quiet quitting Amazon There's a movement not really just Amazon but work in general since inflation is going so high, people are just giving up trying extra or doing more hard work than what's necessary. Just do the bare minimum and go home happy and healthy since work doesn't really care about workers really.', a user said: 'Personally I would rather be busy if I'm there'",
        "In response to 'I made the mistake of working hard when I first started at Amazon and then they expected it everyday.  Switched to a new facility and I just stay out of the bottom 5%, it's so much better now.', a user said: 'Seems like you would have to do zero tobe in bottom 5%'",
        "In response to 'Facts. Honestly after 3 years I'm thinking about quitting for real. I work way to hard while the others in the same position as me aren't held to the same standard bc they are young and I'm not so more is expected of me.', a user said: 'I'm surprised sort centers you can See on the scanner what your doing?!'",
        "In response to 'True but there looking to only promote the youth it seems', a user said: 'I think they prefer the new woke mindset'",
        "In response to 'Work ethic does not correlate with inflation. Inflation is a national issue, your work ethic is a singular issue. You can quiet quit amazon, no one cares. There are 10 people waiting for your job.', a user said: 'False this my second job I'm ONLY working because of inflation'",
        "In response to 'I work hard and have fast rates because it makes the time go by faster.\nExactly, literally the only reason I'm in the top 3.  I could care less about anything else.  I just watch videos and pack. All the while on my days off searching frantically for another job.', a user said: 'How do you watch videos'",
        "In response to 'That should be all anyone does at any typical job. Only case to work hard is if it's actually something fun or meaningful.\n1) You are not being compensated based on performance.\n2) The company is extremely diligent in trying to get as much out of you as possible while giving as little compensation as it can in return. That's business.', a user said: 'At least in the South Amazon pays well'",
        "In response to 'What?\nI don't get any of your logic. Here's what I can tell you, though: you shouldn't be working your ass off as a T1 employee regardless of what you think inflation is.\nEvery day, you should be working your ass off to make sure that you are not only employable at places like Amazon. Doing T1 work.\nDo you want to move boxes for the rest of your life? No? Learn how to fix a car or a computer. Look into joining a union. Go to school.\nNone of my friends who developed job skills in their 20s are worried about inflation now.\nI'm telling you, you do not want to know how people look at you when you are in your 40s and say you work for Amazon.', a user said: 'Yes and a lot of positions will eventually be robots'"
    ]
}