{
    "username": "CatWithAHat_",
    "contributions": [
        "In response to 'People are romanticising the past and making excuses for why they have it so much harder than everyone else, and why it's DEFINITELY nothing to do with them.\nLogic and facts have no place in the conversation.\nIf the job is so bad, and they're genuinely as good as they claim, they would leave for a better company.\nThey either haven't been working that long, aren't actually as good as they think, or simply don't know how to guage a company.', a user said: 'If you want boil down people just trying to make a living, we can.\nBusiness's need to make money. That's how they operate, hardly a shocker to anyone. You make money by selling a product or a service. The running costs (whatever it costs to actually run the business) must be balanced by the money you bring in to break even, and exceeded to make a profit, which is the goal. One such cost is labour - you can't run a business without staff. Even if you automate everything, someone needs to make the robots or fix them when they break. Labour is probably one of the biggest costs and people need to make enough, at the very least, to afford a basic living (rent, bills, food).\nThe past is irrelevant. We don't live in the past, we live now. It doesn't matter if you had to live out of your car on tin beans and stale bread for 15 years. That's the past, this is now and we'd rather no one had to live like that. I assume we can agree on that.\nSo let's apply some reality to the situation. You don't need excel at your job, you don't even need to be that good, as long as the job gets done and the company makes a profit, thats good enough for a lot of businesses. Even if you are very good, you're still expendable and can be replaced if you cause more trouble than you're worth. Let's say you run a service that allows people to travel vast distances in hours. Let's say your staff are unhappy with the working conditions and pay and they end up striking because you don't want to treat them fairly. Automate the system, the technology exists and you remove a problem and reduce costs. Let's say at least half those people don't have the qualifications to get a good enough job before they need to start worrying about rent, bills and food. That's probably why they didn't leave in the first place, maybe they even liked their job but didn't like the way they're treated. Guess they should've just shut up and dealt with unfair treatment, eh?\nYou're not going to change your mind I'm fully aware. But at the very least you'll actually think about the reality of the situation rather than reducing people to machines that always make the best decision or are capable of doing so. Your situation is not everyone else's, people have their own reasons for the things they do or do not do.'"
    ]
}