{
    "username": "CaTz_EyE",
    "contributions": [
        "In response to 'Original Post: My last paycheck didn’t deposit. Hey yall!! I posted last week about how my boss blew a hissy fit when I called in once because I was grieving the loss of my dad.\nNow my last paycheck didn’t deposit this morning!! I texted my coworkers and I know at least one of them got paid. But this is a common occurrence, she always seems to fuck up payroll somehow. (This is the 7th time payroll has been fucked in the year I worked there). I’m pissed because now I have to reach out to her and I “quietly quit” so I was hoping I wouldn’t have to do that.\nSpeaking of which, I approached her about the text hoping to have a productive conversation. I took accountability for calling in after having so much time off for his hospital stay, death and funeral. She started going on about how she’s been looking for her “fourth token” meaning she has had 3 employees that work for her who are all subpar human beings, and she’s looking for a 4th person to help her run the shop/support her/be a normal human being… well I don’t feel like I’m her fourth token and I don’t want to be. So I left this letter and my key, packed my shit and didn’t go back.', a user said: 'Sometimes employers suck when it comes to how they handle an employee losing a close family member… I worked for a company (over three years in) when my husband suddenly died in front of my eyes at home. It was horrific. I took bereavement & on my third & final day allowed, my boss said, “I don’t understand why you need three days off because your husband died.” I was worried because I was in no condition to return to work & that response made me so angry & scared about what to do. I reached out to my previous boss there & they were livid. They told me to take FMLA. I went to my doctor with the paperwork, started crying & saying what happened & what my current boss said. They immediately took the paperwork out of my hand before I could finish & started filling it out.\nI ended up taking three months leave before returning. I still had the same boss; however, I was demoted but kept the same pay. My boss said, “You’ve been gone so long & things have changed so we need to move you to another position.” Eventually they fired me because my internet has gone out (100% remote worker) on the day the internet company was coming to fix it. I had only missed a few days due to it & never had other attendance issues. I always assumed it was because they resented me taking medical leave.\nI filed for unemployment & was awarded it. The person at the phone hearing was very empathetic & I also explained how they violated company policy in not tying an outage together as a single day.\nThis was a big company (over 100,000 employees) that treated me that way. People can be such assholes.'"
    ]
}