{
    "username": "CelestialKingdom",
    "contributions": [
        "In response to 'Yup, it’s “working to rule”. Always has been, always will be. “Quiet quitting” is just bullshit to demonise those who have enough self respect to not give away their free time.', a user said: ''Work to rule' has connotations of vulgar lefty working proles shouting slogans while standing around a brazier. Wouldn't fit with middle class sensibilities.\n'Quiet quitting' as a phrase  fits better into dinner party conversation about retreats, mindfullness, yoga, pensions and house prices.'",
        "In response to 'So basically it’s a middle class rebrand', a user said: 'Yes, the slogan done good, started mixing with the\nchampagne\nprosecco socialists and forgot its roots.'",
        "In response to 'One form of quiet quitting is to rehash an article that thousands of bored opinion writers have already published.', a user said: 'Another form of quiet quitting is to rehash an article that thousands of bored redditors  have already stated.\n​\n;)'",
        "In response to 'What about \"quiet firing\". Where an employee does everything asked of them for years and doesn't get a payrise or promotion.', a user said: 'This is exactly it, plus making the employee's life more and more unbearable to the point they might as well be unemployed'",
        "In response to 'I've been doing this for years ever since I was awarded 4 out of 5 on my yearly appraisal.\nI'd been coming in early every day to help open up, stayed late a few times a week to help get everything ready, had done some extra curricular stuff the company had suggested to help me develop and even won a regional award for 'excellence'.\nWhen I asked why I wasn't a 5, I was told 'well if we give you 5, what would you have to aspire to?'. Funnily enough, not giving me a five also made me not want aspire to anything as well...', a user said: 'Next year I'm going to aim for a 1 out of 5 so that I'll have even more to aspire to since that is what you indicated you want.'",
        "In response to 'You want to know the best example of quiet quitting. Boris Johnson.\nThis can fuck off, it's just a war against work from home because fat cats are losing our on their office rent. Trying to scare employers into bringing people back to the office.', a user said: 'True,  he's done fuck all for the last 3 months and nobody's noticed because they're still going on about his past misdemenours and who is going to take over.\nBoris is actually our leader, mentor  and pathfinder when it comes to qq. Who knew?'",
        "In response to 'I don't understand why it's called 'quitting'. Doing exactly what your job tells you to do and nothing more is in no way shape or form quitting.', a user said: 'I think quiet quitting also envelops doing as close to bugger all  as is possible because I'm owed.'"
    ]
}