{
    "username": "CentralAdmin",
    "contributions": [
        "In response to 'When I first started working I would do all the overtime and anything they asked me. I was very naive because school and college taught me that I have to do extra work and do extra overtime. Pretty much worked my ass off for the company and when I needed just 1 week off (I had 28 days off saved) things went sideways pretty quick.\nIt really opened my eyes how a workplace actually works and how the teachers got it so wrong. That attitude of “always be loyal and work hard for your company” or “you should be grateful that you got this job”, if you’re job is terrible there’s plenty of other jobs out there and you don’t have to be stuck in the same hateful place, that’s what I learned years ago', a user said: 'It really opened my eyes how a workplace actually works and how the teachers got it so wrong. That attitude of “always be loyal and work hard for your company” or “you should be grateful that you got this job”, if you’re job is terrible there’s plenty of other jobs out there and you don’t have to be stuck in the same hateful place, that’s what I learned years ago\nA lot of people grew up poor or had poor family back in the day (think Boomers generation). So getting a job so you don't have to labour in the field or go hungry was a blessing. It meant a huge step up in terms of the quality of life you could lead.\nTheir kids (Gen X) were at the tail end of this fortune and parroted what they were told because dad and grandpa could afford a home, a car, 4 kids and a vacation on one salary. Things were changing even before the millennials came along but the philosophy of hard work and loyalty stuck with the older generation. They influenced the youth and didn't adequately prepare them.\nAnd how could they? They haven't had to experience growing up again, student debt, low paying entry level jobs they require experience and a master's degree...they are looking forward to retirement after 40 years at the same company.\nTeachers also want their students to succeed by working hard. But at school you work hard for you. At work it's for the company. At school you got an A and maybe dad bought you a toy. At work you get more work. You needed to be born in the right family with the right connections to not have to worry about money or success.\nA better analogy would be if every A you got, the teacher would get a raise. You would just get more work to maintain that A grade, and maybe some praise. But like instead of a weekly quiz it would be daily in every class so the teacher could get rich from all the A grades.'"
    ]
}