{
    "username": "cera432",
    "contributions": [
        "In response to 'Original Post: I realized today, I quiet quit grocery shopping! So about a year ago I had a breakdown emotionally. Nothing really changed. I kept my terrible job. Our chores didn’t immediately change.\nBut I stopped cooking as often, so I didn’t have to dishes as often, didn’t have to clean up the kitchen as often. Kids still eat, less healthy than I like, but they love sandwiches and the random crappy frozen food, with a fruit and veg. I cooked less so I shopped somewhat less. Then I shopped less and less. And my husband was offering to grab what we needed more. So I just keep doing less.\nToday I realized I couldn’t remember the last time I did a big grocery haul. And today I found shrimp in my freezer. That my husband bought. That I didn’t ask for. Like oh cool I will plan something for this. \nMy mental health is somewhat better. Wondering what else I can quiet quit.', a user said: 'I quietly quit dinner about 6 mo ago. And it has been a whirlwind.\nIt started with a failed demand that dh needed to be responsible for dinner 2 times a week; which were not my leftovers. Because he kept failing to meet that; I dug my heals in firm and mentally assigned him 2 nights a week (yes, horrible communication; I know. But I had tried before); where I just kept throwing up my hands and saying idk and being busy with other (real) crap.\nThat somehow turned into him being the primary cook. Yet, he didn't want to tell me what to buy in my weekly grocery pickup (because he had no daily plan). This led to him picking up groceries for himself to make dinner.\n3 months ago, he became essentially solely responsible for dinner.\nHe blew up about the stress of dinner 7 days a week (🙄 duh) and bargained that he would handle laundry  if I handled dinner 3x per week. Dude... deal.\nI still pick up groceries weekly. 9F has learned she doesn't get it if it isn't on the list. 6M has learned that mom doesn't know where he left his shoes.\nAnd we will see where this story makes it in 2 weeks when my dh realizes that laundry doesn't magically get washed on Fridays. And yes, those baskets have been sitting there for 3 weeks because you (the person responsible for laundry) hasn't put them away. 😁'"
    ]
}