{
    "username": "CerddwrRhyddid",
    "contributions": [
        "In response to 'Original Post: Quiet quitting is happening at my school You all have heard it around the world. Quiet quitting or \"simply doing your job and nothing else\" is going around. Anyway the Fall Fling dance rolls around and teachers are \"required\" to chaperone. Basically we are given a google form to sign up for a shift to chaperone the dance. No this isnt paid, yes its on a Friday night after a long work day and week, and no food is not provided to teachers. Total suckfest all around. Well get this, the day before the dance we get a frantic email from Admin. No one signed up to chaperone. NOT A SINGLE teacher signed up to chaperone. We get some messages about how this is mandatory, teachers must be there for the event, we can choose which shift we work but must be there. No one signs up. Cue Admin start walking door to door with a sheet asking people to sign up. Get this, the teachers stand their ground and say no. Of course a few caved, 1 or 2, but overwhelmingly the teachers say no.\n​\nGuess what happened, well they had the dance, the admin chaperoned, the few people that signed up, basically a skeleton crew. The next week nothing, no messages, no angry faculty meeting, nothing. They know that they cant do anything to the teachers because its not one or two, its everyone. Listen I understand that kids need fun stuff to do, but maybe don't make teachers do it, or if they have to be there pay them??', a user said: 'This is called 'working to rule' and had a long history and proud tradition.  Please don't sully it with the media weasel words 'quiet quitting' no one is quitting, and it isn't quiet.\nThis is how things get done.  This is how real workers unions form'",
        "In response to 'Quiet quiting is a propaganda campaign by PR departments to make people who work a normal amount seem lazy.', a user said: 'Exactly.  This is by design, to change the powerful and historical term of 'working to rule' which is based on the power of workers, especially together.\nQuiet quitting adds a connotation that it's the worker who is doing something that could mean the loss of their job, rather than an employer expecting more than what is paid for.\nThis is the type of weaselly word play that occurs in the management speak of Late Stage Capitalism.\nIts blatant propaganda and should be challenged forcefully.  Hopefully by groups of people working to rule.'",
        "In response to 'While I understand your points, I am just not understanding why some people are so very triggered by this phrasing?', a user said: 'Because the correct term for working to contract is 'working to rule' and has a history steeped in workers rights.\nPeople that use 'quiet quitting' are trying to forgo that history and add a connotation that a worker working their contract is doing something wrong that will end with the loss of their job - meaning that doing whatever you are told, and working whatever hours are required are expected if your not want to lose your job.'"
    ]
}