{
    "username": "cfgy78mk",
    "contributions": [
        "In response to 'Original Post: Gen Z isn’t quiet quitting. They’re rejecting outdated leadership I tend to agree. How about you ?\nhttps://www.fastcompany.com/91281732/gen-z-isnt-quiet-quitting-theyre-rejecting-outdated-leadership', a user said: 'I have 40'ish employees and since 2020 I have only lost 2 of them.  Both because they had health issues and took leaves of absence and didn't come back and retired.\nThey aren't paid the BEST, between 16-24/hour, but that's decent enough to the point where my management style makes sure nobody leaves.'",
        "In response to 'Thanks for your insight. May I ask what your management style is that motivates your employees to stay ?', a user said: 'for one it is understanding the frustrations they deal with on a daily basis, and at least letting them know I am aware of them, and trying to work on ways to make their jobs easier even if I won't always be able to do so, I will always try.\nanother is leaving people the FUCK ALONE if they are doing their job.  no news is good news.  you don't need to have a 1-on-1 with me every week if you're an introvert and doing a good job consistently.  I just leave you alone to keep doing your thing.\nBut when someone starts to go off the rails, they may need a bit of a correction.  After giving them so much flexibility this is where I cash in and let them know \"Ok, I've been as flexible so far as I can, but at some point HR and/or my boss is going to get a whiff of this and once they get involved, there's nothing I can do\".\ntheres your super short answer.'",
        "In response to 'Amazing . So it sounds like a little bit of empathy and letting them know that you are listening goes a long way. Second, micro managing is a big no no. I was a top performer and I remember my “leader” as he liked to call himself watch me from his office when I would go to the washroom. I’m sure when you provide them with what they need, and build that trust, it’s much easier to have conversations around things that need correction. I’m glad you have found a good balance.', a user said: 'Yes, it is extremely important that employees know that their bosses understand what they deal with and either fix it or at least explain why it can't be fixed. \"No\" is not an answer. They deserve explanation when the answer is no.\nAnd micro-managing is also bullshit.\nFor people who do their jobs independently\n.  These people just need occasional contact letting them know that you see they are doing a good job. Mostly just need to know that someone is paying attention so they aren't tempted to fuck off.\nThere are some people who NEED micro-management, especially leadership positions like Leads and Supervisors because their productivity is not tracked statistically the same way, so its easy for them to fuck off when not being watched.  Some people keep themselves busy and focused, others fuck off whenever they don't know EXACTLY what to work on.  (not self-starters)\nWhen someone makes it into a leadership position and needs to be micro-managed then they likely get fired after a few consecutive bad performance reviews because leadership should not be needed to be micro-managed.  They wouldn't be fired if they had never applied for the promotion.  This is super rare.\nthis is mostly because I was a Sr Manager when my Director got fired, I got promoted to Director but not allowed to replace the Manager position, so I have Supervisors reporting directly to me even though any other department there would be a level in between.  I can't micro-manage them, I don't have the bandwidth or desire to do so, so if they can't stay productive on their own they're getting tossed (which is actually HR's decision, not mine).'"
    ]
}