{
    "username": "Charvel420",
    "contributions": [
        "In response to 'Original Post: The corporate owned media the last few days is losing it over \"quiet quitting\". just remember - do the absolute minimum required by your job. they cant do shit. [External Link]: https://i.redd.it/hqym09xm89j91.jpg', a user said: 'So let me get this straight. We just went through \"The Great Resignation,\" where people were leaving jobs at an unprecedented rate and many companies were unable to adequately staff their businesses, to the point where they were forced to cut hours and (in some cases) close entirely.\nNow, instead of saying \"hmm we should probably treat our workers better,\" Capitalists have decided to bitch and moan about people who do their jobs but... don't go above and beyond? And they're labeling it as quitting?\nKeep thinking that waging war against the Worker is a good idea. I'm sure it won't blow up in your face again'",
        "In response to 'Original Post: Why is “quiet quitting” even a thing? Quiet quitting is defined as someone only doing what’s in their job description and nothing more. My question is: why the fuck is there even a term for this, and why does said term involve “quitting?” Why is it apparently an expectation that someone should do more than what they have been hired to do? This is something that has always appalled me, ever since my very first job.\nIn one of my first jobs, my boss would give serious side eye whenever I refused to do something that pretty clearly wasn’t part of the job I was hired to do. I wasn’t particularly successful in that job and quickly realized that part of doing the corporate dance is doing whatever people ask you to do at all times no matter what.\nThe thing is, doesn’t the term “quiet quitting” imply that you’re inherently not doing part of your job? Shouldn’t that be the proper definition? Not “not doing things that already aren’t part of your job?” What the fuck is happening lol', a user said: 'It's called \"coasting\" and it's a totally natural response to having zero incentive to do more. Why would I bust my ass for a company that isn't going to compensate me for the extra effort?'"
    ]
}