{
    "username": "CharlieandtheRed",
    "contributions": [
        "In response to 'Biden was a strong supporter of the bankruptcy law of 2005. He’s on the side of the lenders.', a user said: 'To be fair, that Biden and this Biden are different people. That Biden was when Democrats really were just as shitty as Republicans, when he was against same sex marriage, and was more of a high tier politician than someone concerned about the legacy of his Presidency. Not excusing him, but he's changed a lot in the last twenty years.'",
        "In response to 'psst… democrats are just as bad if not worse now… they just learned to show fake support, about the same honesty as Target during pride month', a user said: 'Seriously, how old are you or when did you start paying attention to politics? Were you an adult in the 90's-00's? If you think the Democrats now are bad, you would have shit seeing the Clinton and post-Clinton Democrats. Their upper ranks haven't improved a lot, but their lower ranking members that came in the last two blue waves are WAY more progessive. Not even close.'",
        "In response to 'Immediately pulling the age card is pretty telling lol. I’m aware of the Clinton’s, hard to forget when I went to the same high school as Hillary. They’re awful and are still awful. Upper ranks is all that matters, lower level is just for show, they don’t actually want any of those people holding any type of power', a user said: 'Age card? I don't care what age you are, I'm asking if you were alive and cognizant in the 90's and 00's to support what you're saying. I was and it doesn't jive with what I've seen. The Democrats have moved fairly leftward and the Republicans have swung incredibly hard right since then.'",
        "In response to 'Wtf? Democrats have moved so far right they're barely indistinguishable from republicans at this point. Even Obama admitted a decade ago that he was basically an 80's republican.', a user said: 'lol Jesus man, that's just not true. Are there still a ton of corporatist Democrats? Absolutely. Did they move to the right? Absolutely not. Talking about Medicare-for-All or affordable college or gay marriage or trans rights or lessening drug penalties and prison population would have been absolutely scorned just twenty years ago. Now, those are very popular positions in the party. Have Republicans moved more to the right than Democrats have to the left? Of course.'"
    ]
}