{
    "username": "chasmccl",
    "contributions": [
        "In response to 'You can say that, but there really is a worker shortage.\nOld people died or retired during Covid. We basically shut down our borders to refugees for four years. People suffer from long Covid. And we created lots of additional jobs with the gig economy without taking away a ton of corresponding jobs from other industries.\nBut people are underpaid, too.', a user said: 'Anyone who says there isn’t a worker shortage hasn’t tried filling a req recently. For some reason people on Reddit always frame this topic in terms of unskilled labor and about how companies just don’t want to pay. I’m working in a highly skilled environment and have req’s we are trying to fill with comp ranges from 200K+ and we still really struggle to hire. Our comp isn’t the issue, a shortage of skilled labor is.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'Yeah, well I work in tech and not hiring college hires isn’t the problem…. It’s shortages of skilled labor that is. You know, just like the point of my original comment. There isn’t some sort of grand conspiracy going on. There is just not enough people available to hire as what we need.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'Yeah dude, I don’t know. I’m a remote worker for FAANG so this isn’t really an issue I see personally.\nAlso, you pretty much laid out your company’s problem. If  you are starting off college hires at 45K you are wildly under comping. It’s no wonder your company can’t compete with mine for college hires.\nTo be clear, I’m not a corporate drink the kool-aid guy either. I interview at least once a year and intentionally switch company’s at least once every 5 years to make sure I’m getting paid market. Working for FAANG has its down sides as well. The pressure and expectations are certainly higher, But we do comp people fairly, and our struggles to hire are 100% not because we low ball people on pay. It’s cause our hiring bar is high, and we have more req’s than candidates that meet that bar.'",
        "In response to 'Are the jobs fully remote and flexible? Because I'm highly skilled and choosing not to even look at in person jobs that aren't flexible.', a user said: 'Yeah, I work for FAANG and our team is 100% remote.'",
        "In response to 'But they are not willing to train …', a user said: 'What are you talking about? Who is “they”?. I am the one trying to fill req’s, so are you accusing me of being unwilling train and on-board people? That’s a rather bold accusation for a job you know nothing about…'"
    ]
}