{
    "username": "cheesecake_squared",
    "contributions": [
        "In response to 'Original Post: What do you think of \"Quiet quitting\"? This is a term thats been making the rounds on social media recently. Basically doing the bare minimum at work to not get fired.\nReminds me of the old Homer Simpson quote: \"If you hate your job you dont strike, you just go in every day and do it really half assed\".', a user said: 'If you are doing the minimum required to do your job you are, by definition, doing your job. Seems like common sense to me - why sign a contract to do X then do X + Y?'",
        "In response to 'My job is brutal. However going above and beyond has meant I’ve gotten a 30% increase in my salary over two years. I have worked for every last penny of that but I would guess this is why other people as well do more than what is expected. I think this only works for some jobs however. If I was in a job where I knew progression was never going to happen then I wouldn’t put in as much effort.', a user said: 'Fair enough if there is a direct relationship between more work and higher pay but I have seen many people work too hard for no gain - it's not sustainable and they end up stressed and resentful.'",
        "In response to 'Teachers have entered the chat.\nMy wife works two days a week as a teacher and has to work every evening, un paid, for a few hours just to keep on top of admin and prep.\nIt's mad', a user said: 'My sister is a teacher and does the same. It is mad, but the only way to stop it is to not do it and work towards system change. By continuing to overwork you are sustaining this system. I do appreciate it is hard in some jobs to make that stand.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'I never said you should do a bad job. My point was that you should do what you've agreed to do in a contract. I do a technical/managerial role and I give work my full attention when I'm there and none of my attention when I'm not.'",
        "In response to 'Yup, it’s “working to rule”. Always has been, always will be. “Quiet quitting” is just bullshit to demonise those who have enough self respect to not give away their free time.', a user said: 'It's not even that, it's \"doing your job\".'"
    ]
}