{
    "username": "Chemical-Jello-3353",
    "contributions": [
        "In response to 'Original Post: I think my remote team mate is quiet quitting And it's ticking me off. Need advice if I should say something?\nMy team is fully remote,  spread  across the US. Our individual and team metrics are tracked by the amount of tickets we process on a weekly basis. This is a FULL time job and I've found that a member of our team is only logging about 4 hours a day - if that! Meanwhile, the rest of the team is putting in 9 hr days just to keep up with the volume.  We've also had to log in and work the last two Saturdays just to clear the backlog.  If this person would just work a normal day,  it would lighten the load on each of us. Our manager hasn't seemed to notice that this  person's \"numbers\" are half of what the other team members are producing. Do I speak up or keep my trap shut,  silently seething all day?\n**Thank you everyone for your input! I'm not going to do my managers job for them,  if they don't care,  I won't care either.  I'll hit my targets and focus on my career advancement in 2025.', a user said: 'Pull a report with counts and names/logins that shows what has been done. Send it to the whole team, including manager. “WAY TO GO EVERYONE LOOK WHAT WE ALL DID!”\nManager might ask how you did that.\nManager can then clearly see counts.\nI’m all in for passive aggression. lol'",
        "In response to 'You’re getting downvoted, but I definitely do this, too. lol', a user said: 'Yeah, not sure why.\nBut if I were with OP and their team members…having our personal time being forcefully taken  due to the lack of full commitment during working hours by another…you bet your ass I’m gonna….”help”. But also within parameters and proper channels.'",
        "In response to 'u/Chemical-Jello-3353\n....you're being downvoted because you are suggesting OP do something that is NOT his/her job. What you are describing is the MANAGER'S job, or a supervisor. Sticking your nose where it doesn't belong AND doing something that is outside of your paygrade is frowned upon by most companies.', a user said: 'Different approaches.'"
    ]
}