{
    "username": "Chibi_Rat",
    "contributions": [
        "In response to 'Has anyone here ever worked somewhere, had a supervisor quit, then had to do the supervisor's job, but while being told they can't actually make you officially the supervisor yet, just so they don't have to give you a pay rise? I've known several people who have had this happen to them, and they get strung along with the promise that\neventually\nthey will have the title and pay rise. No one should fall for it.\nEdit to avoid angry mods: Yes. I wholeheartedly support Silent Quitting and Acting Your Wage.', a user said: 'Yes!\nNo one\nshould condone this treatment.\nThey transferred the manager at my office, made a very new hire take on the role (without even training her to do the position she applied and was hired for mind you) and forced me to train and support the new manager for nearly a year while not paying me for the overtime necessary to train/help her do her job.\nThey never said it outright but heavily implied that they couldn't promote me because of my nationality (as a foreign passport holder).'",
        "In response to 'My wife used to worked at a lab and she was great at the job well enough that they had her train a few people. All the people she trained was promoted up but her and they still came to her for help as she knew what to do. When she asked about getting a raise and getting the promotion they told her they couldn’t because  she wasn’t qualified even though she was apparently qualified enough to train the new managers. It sucks.', a user said: 'Management/companies like this truly make my blood boil.\nAre they blind? Do you not see the experienced employee you already have? Why would you not want to promote that person but instead bring in more people who don't know what they're doing to complicate things?'",
        "In response to 'I resent the term \"quiet quitting\", as a person who is protective of their time outside office hours. This doesn't make me a bad employee, it makes me a better one. I'm very good at my job, and am able to do it better than some in fewer hours, and I don't suffer from burn out because I make sure I get time to switch off. Measure my performance on the work I do, not the time I'm available.\nThis term really is corporations responding to the mass realisation that they can't bully and trick 1 person into doing 2 people's jobs any more.', a user said: 'This term really is corporations responding to the mass realisation that they can't bully and trick 1 person into doing 2 people's jobs any more.\nMore like 5 these days but yeah.\nI hope that this expectation that 1 employee must do more than the work of 1 worker for just above minimum wage in order to be hired/keep their position will die sooner rather than later.'",
        "In response to 'I hope so, too.  At my last job I tried sticking up for myself and it fell on deaf ears.  It was definitely a two person job but I tried working late to get things done only to get in trouble for \"working outside of assigned hours\" by boss 1.  This is after boss 2 chewed me out for not being on call 24 hours a day while they traveled, despite the fact that everything travel related\nhad\nto go through our travel department which wasn't going to spontaneously open at 3 am for boss 2.  So when I explained that the job was really work for two people I got the classic \"your predecessor didn't have a problem.\"  Predecessor was promoted after\nsix years\nof doing work and responding to emails, texts, and calls at 5:45 am or 11 pm and every time in between.  But boss 2 adored the predecessor for being on call 24/7 so I couldn't state the obvious flaw in both bosses  combined demands.', a user said: 'Totally unreasonable.\nIf you want someone to be on call 24/7 then you cannot complain about them \"working outside hours\" and actually pay them to do so.\nIf they think your predecessor could do it better they are more than free to demote that predecessor back to your current position and see how much of problem that person doesn't have with the situation.'"
    ]
}