{
    "username": "ChildOf1970",
    "contributions": [
        "In response to 'Original Post: Office Space Proves Gen X believed in quiet quitting too - it was called “mailing it in” I don’t want to hear any Gen Xer talk about Millennials or Gen Z “quiet quitting” when they 100% did the same thing. They just called it “mailing it in” and the movie Office Space is a commentary on this.', a user said: 'Neither term is correct.\nIt is simply doing your job.'",
        "In response to 'Original Post: I've been \"quiet quitting \" for a week and have never been more relaxed. I work in a high stress medical setting and have been for 8 years now. I've always been talk to go above and beyond for work. Over the last 4  years I've been increasingly burnt out and my paychecks do not seem to match my effort.\nHowever this past week, after a particularly nasty mental breakdown a few weeks ago, I've been doing the bare job requirements and it's been lovely. I now feel like I have more energy for my life outside of work, and more energy to further myself personally.\nRemember it's only a job, do what you have to and clock out.\n***edit: as many have said it's \"acting my wage\" I was using \"quiet quitting \" ironically', a user said: 'Can we stop calling doing the job you are paid to do \"Quiet Quitting\"?  That is just marketing capitalists are doing to make it out to be something bad.\nYou are just doing exactly what they are paying you to do.'",
        "In response to 'I’ve heard it called “acting your wage”', a user said: 'It again makes it sound like something different.  We need to normalise doing what you are paid to do, and not doing what you are not paid to do.'",
        "In response to 'That's not doing exactly what they are paying you to do.\nThe company expects from you to meet certain productivity, doing things fast.\nIn the \"quiet quitting\" you decide to stop stressing yourself and work like a human being, not a machine.', a user said: 'They can expect whatever they want, they are paying for X and they expect Y is their problem.'",
        "In response to 'Original Post: Why is “quiet quitting” even a thing? Quiet quitting is defined as someone only doing what’s in their job description and nothing more. My question is: why the fuck is there even a term for this, and why does said term involve “quitting?” Why is it apparently an expectation that someone should do more than what they have been hired to do? This is something that has always appalled me, ever since my very first job.\nIn one of my first jobs, my boss would give serious side eye whenever I refused to do something that pretty clearly wasn’t part of the job I was hired to do. I wasn’t particularly successful in that job and quickly realized that part of doing the corporate dance is doing whatever people ask you to do at all times no matter what.\nThe thing is, doesn’t the term “quiet quitting” imply that you’re inherently not doing part of your job? Shouldn’t that be the proper definition? Not “not doing things that already aren’t part of your job?” What the fuck is happening lol', a user said: 'It used to be called Work to Rule and was a union tactic where strikes were blocked'",
        "In response to 'Original Post: It's not called \"quiet quitting\" That little term is a rebrand of working to rule. It's a labor action been around for a long time where employees work exactly to the terms of their contract and that's why it's getting rebranded. Working to rule is a much harder term to criticize. \nAnytime \"quiet quitting\" is brought up, shut that shit down immediately. We need to undo this particular rebrand as best we can. Doing more than what you're hired for needs to stop, and it can't while people working to rule are being vilified.', a user said: 'Glad to see others are starting to say that it is simply work to rule and has been around for a hell of a long time.'",
        "In response to 'Here's where I'm confused, I don't think this is even working to rule- I think it's literally just doing your job. I don't think they're complaining that we're only doing exactly what was given to us in our handbooks and not doing more for similar roles, but rather that fast food workers aren't stepping up in to supervisory roles without additional compensation and related situations.\nThat's not even working to rule, it is just\ndoing your job\nand I find it bizarre how blatant this propaganda is.', a user said: 'Work to rule is just doing your job'"
    ]
}