{
    "username": "cicy35",
    "contributions": [
        "In response to 'Original Post: I think my remote team mate is quiet quitting And it's ticking me off. Need advice if I should say something?\nMy team is fully remote,  spread  across the US. Our individual and team metrics are tracked by the amount of tickets we process on a weekly basis. This is a FULL time job and I've found that a member of our team is only logging about 4 hours a day - if that! Meanwhile, the rest of the team is putting in 9 hr days just to keep up with the volume.  We've also had to log in and work the last two Saturdays just to clear the backlog.  If this person would just work a normal day,  it would lighten the load on each of us. Our manager hasn't seemed to notice that this  person's \"numbers\" are half of what the other team members are producing. Do I speak up or keep my trap shut,  silently seething all day?\n**Thank you everyone for your input! I'm not going to do my managers job for them,  if they don't care,  I won't care either.  I'll hit my targets and focus on my career advancement in 2025.', a user said: 'I would say that unless your salary is really good I would be looking elsewhere because it sounds like your workload is more than what general work days allow.  Even is the other guy was putting in an 8 hour day it wouldn't be enough based upon what you have said.  So your company is getting a lot of work for very little pay it sounds like.  From what I am reading you are working an average of 9 hours a day plus Saturdays.  That is an easy 50-55 hour week.  I would take those numbers and check to see what your hourly wage really is.  I bet it is not great.  I am thinking you might be due a raise!\nAs far as the other guy honestly for all you know they might be dealing with someone being sick or they are sick or who knows.  But agreed let the manager handle that.'",
        "In response to 'Quiet quitting is still doing the job, just nothing else. Work your wage and all that. \nIo this all has nothing to do with working from home', a user said: 'I don't think so.  doing your job is exactly that.  doing your job.  When did we start shaming people for just doing their job?  quiet quitting is more when they do less and hope they get away with it or they are sending out resumes without saying anything.'",
        "In response to 'why did we allow quiet quitting to become a real term we use against people', a user said: 'I agree, I really hate that term.  People use it for everything, EXCEPT, what for what it really is.  Someone doing their job in their 8 hour day and then going home... quiet quitting, someone not going above and beyond,... quiet quitting.  lordy.  I think that they have no idea what quiet quitting really is.'",
        "In response to 'Quiet quitting is just people working only within their expected hours, like 9-5, and no more than that.   OP is not using the term correctly', a user said: 'That is not quiet quitting.  That is doing their job.  We need to stop penalizing people for just doing their job.  Most people work a set shift.  most companies do not allow overtime.  So are all those people quiet quitting?? of course not, they are doing their job.  And some people have no interest in becoming a manager or anything higher so they do their job happily without the stress of pushing for more.\nQuiet quitting is when people barely squeak by on their job or do as little as possible for as long as possible until they are fired or they quit.  Quiet quitting can also be someone who is quietly sending out resumes while still working.'",
        "In response to 'Or you could have been nice, one time, and just answered the dang question.', a user said: 'Quiet quitting is when people barely squeak by on their job or do as little as possible for as long as possible until they are fired or they quit. Quiet quitting can also be someone who is quietly sending out resumes while still working.  Doing their job as required whether bare min or not is not quiet quitting.  it is simply doing their job.'",
        "In response to 'Thank you for explaining. I appreciate that.', a user said: 'no problem.  I just cringe everytime  I hear someone say that people are quiet quitting just because they are doing their job.  drives me crazy!  lol'",
        "In response to 'He has it wrong, quiet quitting is when you do the bare minimum in a job. Like if your job is to pack 100 widgets into a box and you only do that, but everyone goes above and beyond to pack 200. The company likes the unpaid extra work but people in general are tired of propping up companies with free labor for almost no return.\nThe guy in the story is lazy if he is not netting the minimum metric.  However I would like to know how OP knows the person is only logging in half the time, maybe he logs in does the minimum and leaves.', a user said: 'I disagree, the quy that is putting the 100 in a box is what the company asks for.  They are just doing their work.  That is not quiet quitting.  otherwise half of people working would be doing that.  quiet quitting gets involved when they are slacking but doing just enough to not get fired.  Sometimes they get put on probation or \"steps\" etc.  I think the ones the go above and beyond are trying to get ahead.  they are not getting paid but they are trying to look good to the company so they might get that promotion or raise.'"
    ]
}