{
    "username": "Cigar-Scotch-Coating",
    "contributions": [
        "In response to 'Original Post: New type of quitting discovered \"Quiet quitting is easy to identify; employees who are quiet quitters visibly reduce their effort and avoid going the extra mile. Soft quitting, on the other hand, happens quietly over time. Employees don’t necessarily reduce their work output, but their enthusiasm fades, their curiosity dwindles, and their emotional connection to their work diminishes.\"\nThe cure is to lick the boot harder.', a user said: 'From the article definition it seems being productive and fulfilling the requirements of the job without enthusiasm is now a new form of quitting?  These article writers have completely lost credibility.   It's almost as if business owners and the financial writers don't actually know anyone who has a job.'",
        "In response to 'Its literally Forbes. Listen to the UrCapitalist mouthpiece get a steaming load of capitalist propaganda - it's what you signed up for.', a user said: 'The next article will be about success quitting.   You get promoted at your job and the writers shame you for leaving your position that you excelled at.  None of these quitting phrases are anything more than: person decided that they wanted a different job because...(reason).'",
        "In response to 'So this article is not what it looks like.\nIt's a guest piece by a consultant who focuses on workplace curiosity. She is trying to use the popularity of the \"quiet quitting\" concept to coin a similar verb for \"soft quitting\", ie employees getting demotivated, so that people will hire her to tell them how to motivate employees.\nThis is NOT an admonition that people have to work with full motivation all the time to count as working. It's a\nmarketing play\nto scare companies into paying the author for better motivated employees.\nNow what motivated employees?\nShe cites:\n1 - purposeful work\n2 - good communication \n3 - and also says professional development opportunities are the single most important thing.\n1 is what it is.\n2 translates to, managers need to have managing skill.  This is actually fantastic and would improve a good third of complaints on this sub\n3 is actually business code for \"you have to promote people\"-- but she can't say this out loud because her clients are business.\nShe is somebody who is trying to get companies to pay her to tell them that managing employees well actually\nmatters\n.\nBut in order to make businesses buy into that, she is telling the story that demotivation is a threat and that it affects the bottom line.\n(Edit: why did my text become huge?)', a user said: 'Welp, I will trust your insights here.  That is preferable to me rather than assume that the writer is completely stupid and out of touch with reality (or even worse a part of a propaganda machine).  Thanks for the thoughtful reply!'"
    ]
}