{
    "username": "CivilLeadership9093",
    "contributions": [
        "In response to 'Original Post: What is 'quiet quitting,' and how it may be a misnomer for setting boundaries at work [External Link]: https://www.npr.org/2022/08/19/1117753535/quiet-quitting-work-tiktok', a user said: 'I agree with Quiet Quitting. The media or CEOs are so high up that they got disconnected from the hard working staff. I'm in law enforcement. And people work extra hard to get a promotion only to see another person get promoted based on Nepotism.  Furthermore you work above and beyond and companies don't match salary increases based on the economic inflation and worst case companies don't put in pension plans in your contracts. Law Enforcement, Education and Health care systems are all usually good jobs that are recession proof but people don't want to work. Look how they treated the nurse during covid. 1 minute youre a hero the next minute if you dont take youre vaccination youre a zero. The private sector....just be glad they renewed your contract on a yearly basis. People are working hard to obtain the American dream or was raised in the American dream which can be a simple bungalow with a backyard now being forced into a shoe box condo or Rent life just to still work overtime to maintain that life. My mom was a single mom who had a house and we went everywhere regarding trips. Gen Z and Millennials cant afford to take their kids to disney without missing another bill. Finally quit quieting is pretty much a night shifter.  Why am I doing more work on the day shift and the night shifter does barely 20 percent of what a day staff does but companies are willing to pay them an extra premium. So who's the real idiot. Life isnt a movie for most. Few is getting promoted for hard work. Its all networking and politics within the job field. And media wants to interview ppl thats not straight forward or act like this isnt a thing or shocked by the retaliation of Gen Z and Gen Y.'"
    ]
}