{
    "username": "ckglle3lle",
    "contributions": [
        "In response to 'I'm very suspicious of this, but I've read several times over that east Asian companies will sometimes hire white people to essentially be a jester.  The 'otherness' affords a level of grace; the rudeness of saying something like \"why would we waste everybody's time by staying late when we won't be meaningfully working\" is balanced by the utility of having someone call out terrible management practices.\nI have no idea if this is true or not; it reeks of orientalism.  But at the same time, I sure do see a lot of discourse about toxic work culture.....', a user said: 'I've heard similar but more in the context of it being like a dancing bear/ringer/novelty to show off that the company is global minded or \"poached\" a \"top talent\" from Europe or the US.\nSeems basically plausible, anyone who has worked at a large enough org knows that there is a certain % of essentially bullshit jobs floating around. Somewhat related but there is also a concept of hiring people because you don't want them to go to a competitor more so than because you actually need them'",
        "In response to 'I'm Korean - the work culture in East Asia is toxic as hell. Dunno if it's the same in Japan, but in Korea it's generally seen as unprofessional/disrespectful to leave the office before your boss. Consider the layers of management in a conglomerate like Samsung, and you start understanding why the birth rates are the lowest in the world. Additionally, long hours ≠ productivity, oftentimes is counterproductive if you have people just doing random shit to look busy to fill their hours because they finished their work 3 hours ago. And that's not even all - Korea also has an intense drinking culture, where work colleagues generally drink after a long day in the office.\nIt's very little surprise to me that the younger generations are snapping and revolting against this structure.', a user said: 'There is a core rottenness to the promise of efficiency improving our lives and work/life balance and the realities of being put upon by demands to appear busy and justify a full workday. We're effectively punished for doing better jobs and there is no real incentive structure to do anything\nbut\nthe bare minimum to not get fired, and yet, we're also still pressured at every juncture to behave as though we have to give 110% always.\nBasically creates a worst of all worlds scenario all the while the actual answer \"should\" just be that everyone gets to be paid a living wage while working commiseratively to the tasks at hand with some reasonable amount of overhead and flexibility on all sides. That should be the goal of all of it all the time but we can't seem to escape dominance hierarchies and productivity scams and zero-sum thinking that bakes in all of these toxic ideas.'"
    ]
}