{
    "username": "Classof1988",
    "contributions": [
        "In response to 'Original Post: Quietly quitting When I first heard the term 'quiet quitting' I needed to understand more of what that meant. Now that I know, I think that's me right now.\nI've been working the same job for 10 years at a major global electronics company, a name all of you would know instantly. It's a good job, it pays well, it's low stress with great benefits. I am good at what I do and my co workers are cool.\nAnd I don't give a fuck anymore.\nI stopped trying to advance. I stopped going the extra mile. I stopped being the one offering input at the weekly meetings. It just doesn't get me anywhere after all these promises of working your way up the ladder.\nI realized I hit a peak a few years ago and no matter what I do, or how hard I work, it doesn't matter. Upper management are mostly ambitious borderline sociopath MBA career climbers who are all young enough to be my children. They all give a creepy vibe almost like a politician who acts like they care about you, then they talk shit behind your back.\nSo I still do my job but I do the minimum amount required not to be noticed. I don't report errors on our website, I don't correct people when they are wrong. I just don't, period. The biggest thing that put a target on your back here is attendance, like even clocking in 1 minute late gets you on the tardy report that goes out once a week but I never have a problem with that, and quite honestly it blows me away how many co-workers just can't seem to get here on time because we aren't in a giant metropolis with lots of traffic. Usually the younger co-workers are the late one.\nI am in my early 50s and I've spoken with my immediate supervisor who is two years older than me about this, and we're both in agreement that we're too old and lazy to want to start over, so we'll just coast here as long as we can.\nAnyone else feeling this?', a user said: 'Also Gen x.(54)...been driving semi truck almost exclusively locally for 25 years. Really enjoy it. NOBODY bugging  me all day. Could NEVER work in a confined office. Not really quiet quitting..but I take my sweet time driving across our state each day. I'm paid hourly w OT after 40. I'm always at least 10 minutes early every day and never call in sick. I'm very safe and do the best job possible. If I want lunch I stop for 20-25 minutes. I drive under the speed limit. Safety 1st!! If I stretch out the day a bit..oh well. The owner just bought an expensive foreign car and is loaded.. I'm struggling to pay for a household of people who have moved back home. I'm model employee..a few extra hours of OT in think I deserve. Gonna hopefully partially retire in 12-13 years.'"
    ]
}