{
    "username": "cleepboywonder",
    "contributions": [
        "In response to 'Original Post: Where Are the Workers? From Great Resignation to Quiet Quitting [External Link]: https://research.stlouisfed.org/publications/review/2023/09/27/where-are-the-workers-from-great-resignation-to-quiet-quitting', a user said: 'whaah whaah... I'm a capitalist who can't get low paid workers to put in an extra 10 hrs every week with minimal extra pay.... whaah whaah... I was promised good obidiant workers who helped me out without real support. whaah whaah. I have to increase my wage offerings, its unfair to me, why should a worker get paid a fair market wage.... We need an intervention in the market. Induce a recession please. Whaah whaah.\nSo, now that I'm done imitating every mf in blackrock who has been pushing for the last year and half to induce a recession because their profitability might decrease I can talk a bit more to make sure automod stays out my hair. The notion quiet quitting is an actual phenomena of any real significance to anyone but the investors who benefit from cheap labor is amazingly nonsensical. Like haven't we been saying there is no such thing as loyalty for companies when they cut workers loose with no parachute, yet they expect loyalty come the other way? How entitled are they? And quiet quitting should not be considered by the FED which only has its two mandates. What is interesting is the great resignation where millions of older workers were done with the whole thing and had enough savings to retire. Its no wonder we have a \"labor shortage\" when our labor participation dropped a percentage point vs. 2019. But its also nonsensical to talk about this labor shortage as if there isn't an easy solution that is constantly a shadow over every wage worker's existence (AUTOMATION) as well as increases in pay which could potentially draw out more workers or idk, fill the positions you want to fill. I'm so done with this talk about how \"i can't find anybody who wants to work anymore.\" Fuck you, pay us. This dick ain't free.'"
    ]
}