{
    "username": "Clouds_and_lemonade",
    "contributions": [
        "In response to '[Deleted or Empty Comment]', a user said: 'That's a fallacy spread to keep us fighting with each other. I'm a Gen x dropout whose parents abandoned me at 16, worked the service industry for 25 years then worked in a mailroom, then reception, then a support Admin. I'm 53 and have no retirement, live paycheck to paycheck and never had kids bc I can't afford it. I'm a lifelong renter who has never owned a house, and the majority of my peers are in the same boat. Don't believe the hype.'",
        "In response to 'I am sorry that you went through all of that. I hope that you are able to find some space to heal. From one Gen x female to another, sending love..........', a user said: 'Thank you my fellow Gen x friend, sending love right back'",
        "In response to 'Left home at 19.  Lived with grandparents for a bit then moved in with boyfriend and got pregnant at 20.  Left after 13 years of domestic abuse.  For 13 years worked more than my fair share of dead end jobs sometimes 2 or 3 at the same time because he hardly ever worked.  And now almost 20 years later and another shitty long term relationship and finally landed a decent job as a bookkeeper.  Which after record breaking inflation it might as well be a welfare check.  All I can say is FML. And FTW!', a user said: 'Yes, I lived with my Gram too! I feel your pain'",
        "In response to 'I miss them.  I was young and naive and thought I had the world by the ass!\nI have to laugh at that saying.  I remember a conversation with my grandpa and he was telling me about the first job he had when he left home.  He worked on a farm and made ten bucks a month.  He laughed and said, \"I thought I had the world by the ass.\"', a user said: 'Same. I was so fired up to change the world and make a difference somehow, now I just feel jaded & like nothing we do matters. I was a professional singer in SF for 17 years & thought we'd make it big, that we'd be famous & I could do it as my career. Jaded.'",
        "In response to 'No Gen-Xers are talking about quiet quitting, we did and still do the same thing.  The media is trying to continue this bullshit line.  Quiet Quitting isn't a thing, its' called \"doing what you hired and pay me to do, no more, no less\".   MSM wants to make not going above and beyond without compensation or for intangible compensation back to being the standard.  Shit, Office Space wasn't the only Gen X movie to show that off (probably the best one though lol).', a user said: 'Yeah, and cameras in the workplace weren't a thing back then, so...they paid us in other ways lol'",
        "In response to 'Gen Xers were the first gen to get screwed by boomers. In the 90s, the term \"Gen X\" was synonymous with being a POS. When we were kids, they had us raise ourselves & when we came of age, they undermined, gaslit, & swindled us.\nAlso, we had phones, lol', a user said: 'And since our elders never retired, we Gen X crew knew we would never climbed the ladder & just went out to party instead lol'",
        "In response to 'I watched my dad go into work sick and go above and beyond without anything in return his entire career with Ford Motor co. He worked 80+ hr weeks for years and never took vacations. When he died at the age of 54, I decided right then and there that I will never give my life away for a job.', a user said: 'Yeah, mine tried to push me into college, but I didn't want to go into crushing debt so got into the service industry instead & my brother went into the marines. A lot of our parents were teenage moms too, so we didn't have money. Vietnam destroyed my Dad & he left when I was 6 months old & my mom left when I was 16 & said I was on my own.'"
    ]
}