{
    "username": "CobaltMonkey",
    "contributions": [
        "In response to 'That's precisely the point.  Many companies would pay maybe okay money if a 7 hour chill work day was expected.\nBut instead, you'd be expected to work like your pants were on fire the entire time, and then go home and catch up on work, and be available 24/7 on evenings and weekends.\nThat's the working culture in many, many companies (personally worked in a few of them as well).\nSo, employees had a choice - do the same thing but for way more money, or say \"fuck it\" and work to rule and only do what's written in their work contract.\nBecause the labour market is tight, companies like this lost many of their high performers who jumped in short order to significantly better paying jobs.  So, they were left with \"average\" workers who either weren't the brightest to begin with, or were generally good but just didn't want to do more work than strictly required and cover for company issues (losing huge chunks of their more talented workers) by putting in more hours.\nEnd result - the whole drama about \"quiet quitting.\"', a user said: 'were generally good but just didn't want to do more work than strictly required and cover for company issues (losing huge chunks of their more talented workers) by putting in more hours.\nPeople not wanting to work or work extra isn't even the cause. It's still the companies themselves. I can't speak for all of them, but many are simply still refusing to allow non-salaried workers any real amount of hours. Working for a major chain, I can tell you they do their best to keep any non-full time worker down to 5-10 hours a week, and consistently cut the amount of hours available to each location per week (to the point of not even allowing them to be fully staffed all day).\nThen they lean on the salaried employees to get them to make up the difference, and complain and whine about \"quiet quitting\" and other nonsense when the things they insist be done aren't. And this is\nwith\nthe salaried employee(s) working 70+ hours while getting paid for 40.\nIt's the same all over. The companies want more and more and they don't want to pay for it. It has to stop.'"
    ]
}