{
    "username": "cochtl",
    "contributions": [
        "In response to 'I'm speaking for American corp culture, so take this with a grain of salt if you are from another country.  I spent a good portion of my adult life in the military, it gave me a different perspective coming in to the corp side, allowing me to see through the bullshit, so to speak.\nYou should be spending the minimum effort to get your job done, the rest (most) of the time is spent on you and your career. This includes networking and \"schmoozing\" for lack of a better term.  As someone who tends to be more on the introverted side, this was difficult for me at first, but like anything else it comes with practice.\nI am also radically transparent with my peers and those I supervise.  My goal being for my team members to succeed not only at work, but in their individual careers as well.  This ensures those that work with me are as loyal as I am with them.', a user said: 'A (at the time) junior game designer friend of mine (let's call him Dan) would stay late fixing shoddy level design and broken gameplay scripts for another junior designer (who I'll call Bert) that started with the team a few months after him. Dan is a great designer despite his inexperience and you can tell he cares about what he doing. Bert is just flat out terrible, but he is a likeable guy. Eventually Dan gets the short end of the stick when their senior designer/mentor leaves and he is left managing the level for both himself and Bert.\nBert has a habit of leaving on time, putting in his 8 hours which is fine, except that his work is terrible and isn't functional and holds up other people down the pipe. So Dan is stuck working 10 hours or more for weeks and most weekends for 3 months because at the end of the day, the publisher doesn't care who does the work, as long as the end product fulfils the contract stipulation, and since Dan was the person assigned responsibility for the task he will get shit on regardless of Bert's lack of care/incompetence.\nAnyway the milestone is approved and Dan talks to the project directors about the workload situation and how much time he spent fixing Bert's low quality work and they tell him that they 'will look into it'. Problem is, the whole time he was working late to fix Bert's shitty broken level designs and scripting, Bert was out \"schmoozing\" with the directors and owners at the local bars and enjoying weekend BBQ's at their homes. Bert, who is now at friend status with the higher ups, was never informed of his poor workmanship. Meanwhile Dan is now seen as negative, offensive and a person of 'poor spirits'.\nMore than a year has passed and it's already been a few months after the team's annual performance reviews. On my way out the door one day I find Dan in his office looking angry and frustrated. Dan and Bert now share an office together and this particular day Bert left his pay stub on his desk and Dan couldn't help but see how much he makes. It was just right there for everyone to see, so he looks and finds that Bert makes 15k more than he does. Not only did he start after Dan, and he does awful work, but he gets paid more than him, and Dan was asked by the directors to help mentor Bert to be a better designer. The idea was that this would help the directors guage whether or not they should promote Dan from a junior to mid-level designer position, but Dan now knows that Bert is making a senior designer's base salary despite being a junior designer. Dan got a raise just high enough to exceed inflation rates.\nThis is dragging out but the short of it is, Dan confronted the owners about the salary disparity compared to work output and quality with his coworker and demanded a pay raise above what Bert is making. He was countered by HR with invasion of privacy violations (even though everything was opened by Bert and in public view where he left things on his desk). In the end, Dan was offered an immediate 5k merit bonus with a promise to reevaluate his work contributions and provide a more than generous wage increase commensurate upon continued work output and improving quality with an option for retroactive pay. And he would get that promise of better pay fulfilled....when the next annual performance review comes around...in 10 months. Dan waited for the next pay period to see if they would actually give him 5k which the owners did surprisingly, and then he packed his things and left when lunch time rolled around. We were all notified, including Bert, at a company meeting that he quit. Bert didn't even notice he was gone until the meeting happened even though they shared the same office.\nDan's Linkedin hasn't been updated since he left years ago now. As for Bert, well he STILL works at that studio to this fucking day\nI can't speak for the studio now, but at that time a lot of people weren't paid fairly at that place and anyone worth their salt left when the reality hit them. It's a fairly common thing to get jaded and burnt out in the games industry, and many many passionate people become victims of their own success where the only option to move up is to leave, but never was the phrase 'it's not what you know, it's who you know' so egregious when it came to work, responsibility and pay\nI think most people will fall on either side of the fence tho. You'll have one side being filled with those that care about the merits of quality work and love of the craft, and the other side being fill with people wondering how much ass kissing it will take to be promoted to a position and manage those hard working idiots\nBtw I'm a dumbass'"
    ]
}