{
    "username": "coffeeconverter",
    "contributions": [
        "In response to 'Something I love about doing the One Bag thing of carrying only enough clothes for maybe 3-4 days is that it\nforces\nme to do laundry every 3-4 days. Some find it to be a downside, but for me is a big plus, budgeting a couple lazy hours to find a laundromat, wash, dry, fold, get back to the hotel... it's a great way to slow down and find some sense of normalcy, kind of a zen routine. You mingle with the locals, maybe read a book while you wait, maybe pop into some grocery store nearby and grab a byte, and you don't get that \"I should be using this time to go see that thing\" feeling, bc you're\nknow\nyou're doing something you\nneed\nto do, you don't get a choice.\nAdmittedly, I only take trips on the shorter side of this sub's standards, a week, maybe two, at a time, and it'll probably get old if you have to do it a couple times a week for a month or more, but for\nmy\nneeds, it's a great fit.', a user said: 'It's still similar for longer travels though. I spent 3 months in a city in a hostel, and most of us were \"one-bag\"-ing it. Huge bag, but still ;-)\nEvery Friday a bunch of us went to the laundromat together, it was a nice relaxing thing to do, got to know people that I didn't usually hang out with as well. Like, not everybody has the same drinking habits, but everybody does need clean clothes every now and then.'",
        "In response to 'Re the churches! Nothing I love more than going into churches to see how elaborate they are! Usually the more random the more surprised i get! I love those little surprises. Recently went to France and felt like Notre Dame was a let down compared to others i’ve seen', a user said: 'Hot tip next time you're in Paris: go to random non-central parts of Paris, and ask people on the street for directions to the Notre Dame. You'll get to see a lot of different churches! (Discovered this \"trick\" by accident back in the eighties, by not knowing that the famous Notre Dame is not the only one, and asking for directions while in the wrong parts of the city :-))'",
        "In response to 'sounds like the most perfect way to get lost. Love it!', a user said: 'Lost, we were! :-)\nThe good old days of no internet, no mobile phone, only a paper map, and our broken French to ask people in the street. And sending post cards that would arrive home after we did.'",
        "In response to 'Absolutely. I was just in Jordan and in Egypt and quite quit in Egypt. I was on a tour with my father and we used a company that pretty much held our hands the entire time. Jordan was the first 8 days which was more or less fine because we had enough down time to just kick back. The Egypt trip was very busy and we combined three other tours together into one gigantic tour group. Also our tour guide was insane and had a reputation to uphold. We were overseas for 28 days and after day 12 I was done. At day 25 I literally stopped going on tours and just stayed in the hotel and went to the beach. I didn't even go to dinner with anyone anymore. I was just completely over the group.', a user said: 'I can't even imagine 10 days with a tour group & guide. Like, after a guided tour through a museum I'm already glad it ended. How did your father find it? Did he do the full 28 days?'",
        "In response to 'His brother is big into group tours like this from the same company and takes three or four a year. It was non-stop the whole time, I just wanted to sit around and do nothing and occasionally maybe go somewhere. My father only missed one afternoon. He did every tour and went on every excursion they offered.', a user said: 'Wow, goes to show how different people can be! One person's dream vacation is another's nightmare :-)'"
    ]
}