{
    "username": "colei_canis",
    "contributions": [
        "In response to 'I feel like it is an overloaded term that leads to a lot of confusion.\nAs a software engineer I can technically do enough work to not be fired working from home by logging in, keeping the laptop awake, and doing about 1 hour of coding so I have something I can say I did in tomorrows meeting, and claim I was dealing some some gnarly bug if questioned. If I decided that this is how I wanted to work then I would absolutely call this \"quiet quitting\", I might as well have quit but I'm going to silently stop trying and keep the pay check coming in.  This is obviously toxic behaviour, and employers will not be very fond of you.\nAlternatively these days the term is abused to mean saying \"No\" to extra responsibilities when you're already doing your job at a pretty good level. If I'm working 8 hours a day writing good code to the best of my abilities and my manager asks if I want to give a talk to the other engineers on a recent project, or can stay after work to consult on some new projects then I am completely within my rights to say no. It won't get me fired, but it won't advance my career and will stunt my potential pay growth.\nThis latter form of quiet quitting is much more acceptable to a reasonable employer and infuriating to a bad one who horribly overworks employees instead of hiring sufficient headcount.', a user said: 'Fellow programmer here, can confirm. I managed to figure out that redundancies were inevitable and everyone at my level would likely be in line months before it actually happened and it’s totally possible to ‘quiet quit’ in the sense of your productivity plunging without actually getting in any kind of trouble for it. The codebase I dealt with was so buggy it was completely plausible a supposedly trivial change would take multiple days if it touched certain parts of the system.\nI’d argue the latter kind doesn’t necessarily limit pay growth that much in the grand scheme of things because you generally get a better raise moving companies than getting promoted.'"
    ]
}