{
    "username": "CombProfessional434",
    "contributions": [
        "How many of you have \"quiet quit\" and when did it start for you? I got to say for me I quiet quit my last job 5-6 years into it after realizing I didn't have a future with that company, but I never left because I was at least getting paid and now have a decent savings account because of it. I legit started my new job early this year and I've already quiet quitted. I hardly do the bare minimum since I gave them a whole summer of hard work and not a single fucking praise. Or even any kind of \"hey keep it up you've been doing an awesome job\". The moment I make a mistake I feel like it destroys everything i worked hard for so what's the point anymore? I'm just going to keep working enough so I don't get fired, but if I do I doubt I'll be upset over it. It also just seems the way 2023 has went if the economy and housing market continues to stay awful next year I can already see people quiet quitting for 2024 and it hasn't even started yet!",
        "In response to 'I started quiet quitting years ago back when it was called ‘doing only what you’re paid to do’\nI’ve never been interested in promotion. I like my job too much, but whenever I’d see some paperwork head my way that’s designed for a position above me, I slide it back.\nWas once told, when I pointed out ‘I can’t sign this, it requires someone in X position or otherwise authorised’. Was told ‘well I’m authorising you’. \nI made a point of being crystal clear that I’m not looking to expand my role above the current remuneration package, and thanked them for their consideration\nThen slid the form back across the table.', a user said: 'Yeah we are supposed to meet a quota at work which first of all is really high. Then you want to get mad at us for making a mistake? Like hello of course we will make a mistake. You're asking us to get a lot done each and every day. I'm not even talking about like a \"reasonable\" amount of work. Like literally glued to your computer for 7.5 hours and still try to hit quota without making a mistake.'",
        "In response to 'I never get this level of micro management. If your performance is doing well and all your tasks are getting done, what's the fucking issue?\nAlthough at the same time, I see bad management everywhere. Constantly watching for mistakes and anything they can complain about, to \"keep you in check\" I imagine. Never any praise or concern for their employees.', a user said: 'See I quiet quit because I don't even know when my performance is well. They set such a high quota and expect accuracy and if I meet both its likely to just be \"meets expectations\". There's no way for me to go \"exceeds expectations\" at my job. Even when I push past the quota its to make up for the days I dont.'",
        "In response to 'What was your reasoning based on the speech? Not picking at you just curious where your head was at. Was it like, “oh geeze I do all this work and we lose money? Not worth it.”', a user said: 'Yeah I can see that speech being demoralizing. You figure you bust your ass only for them to come back with the \"well this store still sucks\" because its not giving them money. Then if a store is losing money will they give employees promotions or raises?'",
        "In response to 'Stop using their stupid pejorative expressions. You're working to rule, or acting your wage. When you go above and beyond do they pay you more than what you would have earned in overtime? No, so stop giving them free labour, give them exactly what they pay for.\nThere's nothing wrong with doing that, stop buying into the bs idea that you are doing something naughty.', a user said: 'I'm not that's just the term people use for it nowadays.'"
    ]
}