{
    "username": "commitme",
    "contributions": [
        "In response to 'I am with you as a GenX’er . We need change and I hope Gen Z will usher in this change', a user said: 'We all must. X, Y, and Z together. And shout-out to the rad boomers out there too!'",
        "In response to 'I think long gone are the days where people have to work in a traditional organization. If someone wants to take a break from work, they can just pick up random gigs. Doesn’t always work for everyone but I have seen a lot of people go from super rigid to working for themselves (much more flexibility)', a user said: 'Can that scale? You're looking at virtually an entire generation doing nothing but gig work. Won't that depress wages?'",
        "In response to 'Will it though ? What happens when MOST people get out of the corporate world and the corporate world CAN’T find employees who want to work for them or be managers? That should drive wages up? There are a lot of variables at play here. It will be interesting to see how it shakes out', a user said: 'Okay but by then the zoomers will have resumes of only gig work. Employers would have to overcome their prejudice against gen Z and against several years of no relevant experience since their graduation dates.'",
        "In response to 'But gig work IS work. It’s all how you can apply and communicate that your skills are transferable. For instance, I do gig and partnered and started my own company. That’s entrepreneurialism. People have to become really good at identifying their hard and soft skills and explain it to potential employers. Employers are going to have to accept this because if most people start doing this, they won’t have a choice quite frankly', a user said: 'Alright, good points. I concede.'",
        "In response to 'Except when they start their own business they’re 100x more boomer than the worst boomers\nhttps://www.foxbusiness.com/fox-news-tech/scale-ai-ceo-explains-why-his-company-hire-mei-not-dei-merit-excellence-intelligence.amp', a user said: 'Lemme guess, rich parents who indoctrinated them with far-right ideology?'"
    ]
}