{
    "username": "Commercial-Ad-852",
    "contributions": [
        "In response to ''Quiet quitting'\n!= quitting. It's simply acting your wage.\nThey fired you, ergo you should be entitled to unemployment benefits.\nQuiet quitting is irrelevant in this context.', a user said: '100%. I don't expect anybody to do more than the bare minimum, because I'm not going to give anybody more than the bare minimum, either. You pay for what you get! It's called capitalism!'",
        "In response to 'if ur in america you can be fired fot no reason', a user said: '100%. You can be fired for any reason as long as it's not discrimination.\nYou can be fired for having brown hair or wearing an ugly shirt or just cuz the boss doesn't feel like having you in front of him.\nAmerica has virtually no protection for workers and the American public has been brainwashed by high priced marketing companies to get people to vote against their own self-interest when it comes to unions.\nCapitalism is pretty simple. You want me to do something, you pay me. If there's a bunch of us, we can get together and decide what we are worth because we are selling our labor.\nTo be honest, instead of a labor union, they should form employment agencies that are employee owned. A union is almost an anti-capitalist form of capitalism.'",
        "In response to 'This seems like aggressive advice.', a user said: 'What's your point?'",
        "In response to 'Who are you again?', a user said: 'Definitely not somebody who points out the obvious, more like the person who points out the person who points out the obvious cuz I think it's funny when pseudo intellectuals just rephrase a discussion and other people go along with it cuz they don't want to look stupid.\nUnfortunately, it doesn't work well when you're in a business meeting. You know the kind, somebody will say something just to say something, but won't add anything new but yet, they still suck up to the boss and get participation points.\nDo you know someone like that?'"
    ]
}