{
    "username": "CormoranNeoTropical",
    "contributions": [
        "In response to 'Original Post: Anyone Ever Quiet Quit a Trip? This has happened probably three times where I get close to the end of a trip and just become over it all and just end to get back home (the US). I don’t want to visit another church/palace/museum, I don’t want to wander anymore (my feet hurt). I’m tired of eating out and just done with it all. Doesn’t mean I’ve had a bad time, but I’m ready to be back in my comfort zone and bed. So when this feeling hits. I sort of find myself shutting down.\nThen, I feel guilty because I’ve flown across the world to be in a city people dream of visiting and I’m not soaking in every moment. I will say when my social connections are low, this quiet quitting happens faster. But despite 100 museums and sites. I have no energy to see anymore.\nHas anyone else experienced this?\nEdit: I’m trying to read all of these responses, on touchy airplane WiFi. But thank you for your responses!', a user said: 'I think that a lot of first-world / developed country residents, in particular Americans but not only Americans, have in recent decades been sucked into a weird maximization/optimization trap. Like, everything you do in life needs to be optimized in some sense, without attention to exactly what is being optimized overall. Specifically, over-tuning for efficiency means reducing resiliency to the point of non-existence.\nIn practical terms, this means we end up in situations where we optimize for things like seeing as many sights / having as many unique experiences as possible while traveling, at the expense of stuff like just vacationing or hanging out in a different place. I have always been by nature opposed to this kind of life so I guess I can see it from the outside.\n(OP, note that in no way am I criticizing you: I’m just reflecting on the larger context that seems to be producing so many experiences like yours!)\nIf we leave where we live and also leave behind our optimization mentality, we may find ourselves not only having more interesting experiences while traveling, but coming home refreshed and potentially with new habits we can continue in our home life.\nA lot of other people have made great suggestions, like stay in one place for a while, do day trips rather than changing your lodging too often, etc etc.\nI want to add one thought: when you’re staying somewhere for several days or longer, prioritize becoming a “regular” rather than trying every restaurant. Once you find a place you like, just eat there for the rest of your trip.\nI honestly think, too, that people who go back to the same place year after year have experiences that are worthwhile in ways that those of us who only chase novelty don’t experience.\nSo maybe pick one place you absolutely love, and put that on your list of travel destinations every year. In particular, stay in the same hotel every year, better still, book your next stay when you’re on your way out. I’ve never been in a position to do this, but I do cherish the experiences I’ve had of revisiting the same places repeatedly over the years.'",
        "In response to 'So much of reddit trends toward novice questions and basic takes. I wish there were a way (beyond upvotes) to filter for novelty.', a user said: 'Skip the posts that don’t interest you and keep scrolling?\nBut the real issue is what the algorithm surfaces for us. I sometimes wonder if we’re missing interesting stuff that doesn’t get traction.\nWhen I look at my “Latest” tab it’s usually even more repetitious than the “Home” tab. But I still wonder.'",
        "In response to 'Are you saying you left early or you got burnt out? Americans like to go go go but a lot of other people like to relax on their vacations, even if they’re to a far off destination. There’s nothing saying you have to do 100 things every day or in every place. If you’re burnt out, rest for a day or a week. Relax.', a user said: 'I so agree with this (and I’m American).'"
    ]
}