{
    "username": "Corvidsforhire",
    "contributions": [
        "In response to 'Has anyone here ever worked somewhere, had a supervisor quit, then had to do the supervisor's job, but while being told they can't actually make you officially the supervisor yet, just so they don't have to give you a pay rise? I've known several people who have had this happen to them, and they get strung along with the promise that\neventually\nthey will have the title and pay rise. No one should fall for it.\nEdit to avoid angry mods: Yes. I wholeheartedly support Silent Quitting and Acting Your Wage.', a user said: 'That happened to me on multiple occasions. I quit as soon as they wanted me to train the person they actually hired. Most of those places don't exist anymore cause they couldn't run without me. I was the only one that knew how to do a lot of important stuff.\nMy fiance had it one step worse. He was promised ownership of his location. Previous owner quit and as a shift manager, my fiance stepped up and took extra shifts and figured out how to do the tasks of the owner. He didn't want the location to tank, as it was a small town, and most people who worked there would not be able to find another job very easily. The franchise owners told him to give them 3 months to sort out the paperwork, and the location would legally become his. 3 months came and went and nothing was happening. By month 5, some guy came in and said he was the new owner. My fiance quit, and that guy had tanked the business within 6 months. Franchise owner begged him to come back. He demanded the paperwork for ownership before he started. They refused.\nMakes me mad every time I think about it because we could be living our dream right now. Small home in the countryside with ample time for backpacking and road trips. Instead now we live in my hometown in a shitty apartment in a crime dense neighborhood with barely enough to scrape by. We've been trying, but when every place hates it's employees like this, it's really hard to get a leg up.'"
    ]
}