{
    "username": "CorwinOctober",
    "contributions": [
        "In response to 'There’s a special place in hell for teachers who do that extra work for free', a user said: 'I'm not going to call out a teacher for any way that they do their job.  I'm sure you would be livid if a teacher did that to you.'",
        "In response to 'If they called me out for not spending hours of my free time for a job that already screws me with a horse shit salary, I wouldn’t be livid - I would laugh in their face', a user said: 'You understand the point. It's ridiculous and egotistical to get mad at a colleague for performing their job duties in a different way from you.'",
        "In response to 'Which is why I have never told anyone to do their job differently…', a user said: 'Okay good.  I thought you were criticizing colleagues for working harder than you because they might make you look bad. Glad we cleared that up.'",
        "In response to 'I’m just pointing out that teachers who choose to work for free screw over the profession in general are are shit humans', a user said: 'Oh so I was right. What a weird circular argument.  Just admit you do the thing and are actually proud of it.  Also it seems to me that people who throw rocks at coworkers to justify their shitty attitude are the actual problem and should find a different job.'",
        "In response to 'I agree those teachers who set the standard that it’s ok to expect 50+ hours of labor a week from teachers should get out', a user said: 'Come on. How many people are we talking about?  It would have to be a decent percentage to \"set the standard\".  I don't know anyone who is working 50+ hours at teaching just out of the goodness of their heart.  If they do exist this would be extraordinary and not anything like setting a standard.\nI do know people that put in extra time because the school I'm at has a high poverty level and too many people on fixed income to raise taxes. No one expects people to do extra, everyone does what they can.  But also no other teacher would ever get pissed at someone for working hard. That would be some weird antisocial behavior.\nBut yeah next time the band teacher gives an extra lesson to a poor kid who doesn't have an instrument at home I'll let him know he's an asshole.  Wouldn't want someone expecting me to stay for a few extra minutes and cut into my Netflix time.  Jesus Christ.  If you are that bitter please get out for the sake of your colleagues if you don't care about your students.'"
    ]
}