{
    "username": "Coucoumcfly",
    "contributions": [
        "In response to 'This is what it is.\nI went to a top undergrad program. I went to law school. I graduated\njust\nas the housing boom and inflation started.\nI’m a lawyer and I’m struggling to pay rent each month. I did everything I was told and it was all a lie.\nWhy kill myself with 60 hour work weeks when I can barely afford a video game here or there for entertainment?', a user said: 'Have a friend with a MASTER’s degree in a law field. 70k student debt….. got job offers at 14-15$/h'",
        "In response to 'Previous generations saw that dealing with this bullshit afforded them a house and a vacation every year. That’s not the reality anymore, so what’s the point? Companies cannot remove all incentives and then expect their workers output to surpass 100%. They are very very lucky to get 100% right now.', a user said: 'You make a very good point!!\nMy grand parents with their 3 grade « diplomas » managed to buy a house, have 2 cars, raise 2 kids, travel and enjoy early retirement.\nI have a master’s degree, no kid and no house cause I « missed the housing market timing »'",
        "In response to 'Sounds like insanity to me.', a user said: 'It is insanity!!\nThen people wonder why Mental Distress is so high in society'",
        "In response to 'i'm just happy that people seem to be rejecting this idea of your workplace as your \"family\" so openly now. it's ridiculous.\nwe are all here because you pay us for the work that we do. that's it, plain and simple.', a user said: 'Workplaces are families…… have you ever known a functional family? Every family I know have disfunctions at certain levels and people « staying there » cause they « can’t leave »\nThat does sound\nLike the corporate world\nSadly'",
        "In response to 'I'm happy we've finally moved past the whole leaning in, rise-and-grind, productivity porn church of corporate profits. The crushing majority of work is not for emotional fulfilment, it's transactional and always has been. CEOs claim to love what they do yet won't roll out of bed for less than millions of dollars. Funny how that works.', a user said: 'Its sad and true what you are saying.\nBecause if all our basic needs were guaranteed to be met, the human nature is to thrive for meaning. Can you imagine how wonderful life would be.\nas a consultant I saw Non-Profit organizations that literally change peoples lives (working with families who have child with handicaps) Managers have Master’s degree and very expansive certifications and they barely make 60k$\nAnd freshly undergrad in Finance will get 60k+ bonus as entry level.\nIt shows as a society we have our priorities upside down when an undergrad in finance makes more money than people changing lives on a day to day base and helping fellow humans.'",
        "In response to 'Bloomberg is pushing it for some reason. I seem to remember an economic concept about people valuing their free time more as their pay rises, which could explain the phenomenon to the extent it might be real.\nEdit: it looks like it started on tiktok in Australia', a user said: 'A paper studied in harvard business review mentionned that people\nMaking more money can actually afford to « off shore » more boring tasks (such as cleaning the house or doing laundry) which gives them more free time and more happiness.\nIts just that « normal people » are too busy struggling to make ends meet to afford these luxuries'"
    ]
}