{
    "username": "counterlock",
    "contributions": [
        "In response to 'Maybe David Wallace wants that, but we're not all David Wallaces.  Those of us who are Dwights who come in on weekends with a rule breaking key copy and constantly over achieve and suck up to management end up just like he did, only getting one measly promotion in over 9 years.  It's better to be a Stanley and sit back and try to enjoy life.', a user said: 'It's better to be a Stanley and sit back and try to enjoy life.\nPREACH'",
        "In response to '[Deleted or Empty Comment]', a user said: 'If productivity increases in a society where productivity is the key goal then does it not make sense it is like this?\nProductivity isn't the goal of life moron, man you've been sippin' the koolaid a little too hard. Take a vacation, find a hobby, go do some living holy shit... enjoying life =/= ignoring responsibilities either.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'TheFrenchFryWarrior is so happy to bow down to corporate McDonald's overlord's and probably thinks 15$/hr is too much for their meager productivity driven ass, should have to pay them just to work there!!! It's such an honor to be part of the PRODUCTIVITY.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'Better than being defeatist about the whole situation like you are.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'Unless you're a boss, and you recognize and reward the behavior with reasonable pay/bonuses/benefits.... Fuck off. Doing extra work to \"increase productivity\" or \"encourage aspiration\" is just corporate talk for do extra work for free.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'And I'm telling you, unless it's within contract obligations, I'm only doing my work and nothing more. That doesn't make me or anyone else a bad worker. Hell that's what I do, and I'm one of the better designers at my work. I never work late, I always take my lunch, and I don't take on extra responsibility unless there's compensation.\nExpecting the general populous to stay late on their own time, take on extra work, is fucking stupid. If companies wanted that they'd create rewards or pay benefits to facilitate that. Work isn't a passion project for 90% of the world... corp. America would like us to think it is though.\nWe already have an EXTREMELY accelerated rate of fabrication/development in the world, do we really fucking need the next iPhone 2months sooner?'",
        "In response to '[Deleted or Empty Comment]', a user said: 'The fuck did you make it for then lol, to convince us all that productivity is the end goal of life?'",
        "In response to '[Deleted or Empty Comment]', a user said: 'None of that means that we should all solely focus on productivity, dumb dumb. That's why jobs have minimum requirements. You meet the minimum job requirements, you've met productivity goals. That's all anyone should give a shit about and the rest should be focus on having a good life.\nEnjoy working to death mate, we're not an ant colony.'"
    ]
}