{
    "username": "counterboud",
    "contributions": [
        "In response to 'You also bring up a great point that bosses think work is \"fun.\" Because they're in a dominant position where everyone has to be at least slightly deferential to them; I've been in several more toxic work environments where we had to do light hero worship of the boss.  Bosses like the ego trip of being in the office.\nI personally have also worked at three different companies that were losing money or just breaking even, and the independently boss kept the company afloat with his own wealth. (Both times, the office environments were extremely depressing-- zero perks) But the bosses made way less money than they could at an actual job/ lost money, because they wanted to play \"executive drag\" and we had to play along with them.  One of those three companies was extremely anti WFH during Omicron, because the boss wanted to see his worker bees and we had to \"play agency\" with him.', a user said: 'Yeah, your first point reminds me of when I first got hired as an assistant to a mid level manager, and he told me how nice and friendly everyone was here and if I needed help, to just ask and others would be happy to teach me how to do something. Meanwhile, when I went to email someone else to ask for help or direction, either they usually didn’t respond, or else they said “oh that’s not my job” and basically blew me off. Yeah, I’m sure everyone is friendly and nice when you’re the big boss and everyone is eager to please you by doing what you say. It’s a little different when you’re brand new, in the lowest paying position imaginable, and no one gives a shit if you succeed or not.'",
        "In response to 'Nothing because quit quitting is a bullshit term that was invented to try and guilt workers about doing what they were hired to and nothing more.\nP.s: if you meant slacking then you should use slacking.', a user said: 'Agreed. And it’s possible this work environment consistently piles more work on employees they they can feasibly do in their work week and this person is choosing to limit their work to what their hours and pay justify. In which case the extra work needs to be communicated to management that they need to hire more people to cover the workload they have. I don’t really see an issue with saying “sorry I’m already at capacity, unless this should be prioritized over all the other work I’m doing, it will have to wait” when they try to dump more work. It’s a lazy manger who instead of directly addressing the employee that is causing issues or the fundamental problems with workload instead just tries to trick a passive coworker into working two jobs.'"
    ]
}