{
    "username": "Covert-Wordsmith",
    "contributions": [
        "I realized I'm in the \"quiet quitting\" phase of my relationship. I watched a YouTube video last night called \"Are Women Quit Quitting Their Marriages?\" by Frankly. It's essentially a curated compilation of TikToks of women talking about themselves and others quiet quitting their relationships, the signs, and why.\nIt was very eye-opening because it made me realize that's the stage of my relationship I'm in. I'm tired of the conversations that never result in change, I'm tired of the defensiveness when bringing up a concern, I'm tired of the dismissiveness when trying to help, and tired of feeling required to react a certain way to things he says. The straw that broke the camel's back was a text conversation I had with my boyfriend a few weeks back, which I previously posted about if anyone wants to go read it. It really solidified how little he cares about my responsibilities and thinks his wants should supercede them and will never show the slightest interest in anything I care about.\nA lot of the TikToks in the video mention how men are usually \"blindsided\" when their partners just up and leave, when the reality is they didn't care to notice the signs since their partner's unhappiness wasn't directly affecting them. I've been emotionally and physically pulling back from my own relationship by being less physically and emotionally present: Not calling him in my free time, not going to his place as often, choosing to hang out with friends and family instead, not engaging with his playful banter (which I find annoying), slowly moving anything of mine out of his apartment, giving minimal effort in the conversations we do have, etc. I'm basically treating him like a friend at this point. And not even a close one.\nA lot of people will probably read this and ask \"Why not just break up?\" Well, the comments of the video explained that perfectly! Quiet quitting the relationship is an exit strategy for women so they can physically, emotionally, financially etc. prepare for the end of the relationship, then leave when it's safe and will have minimal impact on them. I feel if I broke up with him today, I would feel nothing. The only thing I would miss is our mutual friend who I met through him, and the Palworld base I built in a server he owns.\nThe relationship is already dead as far as I'm concerned. I just need to pull the trigger and make it official.",
        "In response to 'Girl your post history with this man makes me want to vomit. He's literally a entitled child. You need to go as soon as possible. There's so much emotional abuse and so much nonsense. Passive aggressiveness too. Like the man literally had a fit over you getting sterilised and instead of him just leaving over the prospect of no kids like an adult should to move on, he instead berates you over it and your reproductive autonomy.\nYeah, this guy is a bag of rotten nuts. I am glad you are leaving.\nBut please leave safely and stay with someone. He's abusive and victims leaving abusive relationships is the most dangerous time of the relationship. If you have parents or people you trust, keep in contact, keep them close.\nBe safe.', a user said: 'No problem there. We live apart and our finances are separate. He wants me to move in with him, but I keep giving excuses as to why I can't.'",
        "In response to 'A lot of the TikToks in the video mention how men are usually \"blindsided\" when their partners just up and leave, when the reality is they didn't care to notice the signs since their partner's unhappiness wasn't directly affecting them.\nThere was a good post about how men think there is a tolerable level of permanent unhappiness that women are cool with staying in. They are fine with our suffering because they still get to do the things they want and not do the things women want them to do. When hetero women start to pull away, a lot of men are actually happy because they think they won. No longer are you \"nagging\" or telling them you are unhappy. Then when you dump them, they are shocked because to them, the relationship has never been better!', a user said: 'That is maddening! One person or the other should not have to stay unhappy to make the relationship work.'",
        "In response to 'I did this. We were together for 13yrs, married just over 10, 3 kids together. The straw that broke my back was being told I had to abort my late term pregnancy (24wks, and stood over me to listen as I called around to be told what I already knew, it wasn't possible, and I didn't want that anyway) because he didn't want more kids. Also refused to get snipped or allow me to have the surgery. It took time to build a support system and financial backbone to support myself and 3 kids, but I did it and never looked back, only revel in my freedom', a user said: 'That is so disgusting. I'm so sorry you had to go through that. I don't understand what his logic was. Don't take steps to protect yourself, but also doesn't want any more kids? Anyways, I'm glad you're out of that situation and living a free life!'",
        "In response to 'I get this concept, and definitely remember reaching this point when I was married. But there's one thing here that I don't get. It doesn't sound like you live together (you mentioned picking up your things from his apartment). Why would you not just break up? This quiet quitting, slow fading, etc, I get when there are a lot of logistical loose ends to tie up, but I'm not sure I get why it would be preferable to just breaking up in situations where everyone involved has separate addresses already.', a user said: 'I suppose it's more so for his benefit than it is mine. I was ready to pull the trigger on it 2 weeks ago, but then he told me that day happened to be a negative anniversary, and that the whole month of February was a sore spot for him. So here it is March, I'm planning on doing it within the next couple of weeks.'",
        "In response to 'Who gives a shit? Would he be that considerate of you?', a user said: 'Lmao, no. The first time he broke up with me, he called me at 2 in the morning while I was playing a game with a friend.'",
        "In response to 'I did this, too, and when I was met with surprised Pikachu upon breakup, I said, “I told you so many times that I was unhappy.”\nAnd he said..\n“Well, yeah, but I didn’t think you were going to\nbreak up\nwith me.”', a user said: 'That is so abhorrent! I'm so sorry. He acknowledged your unhappiness, he just didn't care. 😢'",
        "In response to 'I’m with you on this. I actually tried to end our relationship a week or so ago, but saw some nasty SH marks which threw me into self doubt? I don’t feel right just leaving immediately after seeing that either, but I’m not taking no for an answer with asking him to go to therapy about it and to improve MH in general. \nIt’s just the same conversations again and again, and no change. I’m tired of it and just feel like I’m being used. I’m kind of hoping he gets put off of me at this point without being toxic, just putting in the same level of effort… \nIt’s the crappiest thing and the thought of just being alone is weirdly good to me. Good luck to you, I don’t really have advice but solidarity I guess!', a user said: 'My boyfriend is also depressed and has to call suicide prevention on a regular basis. I've had to tell myself that whatever he does after leaving the relationship is not my fault, nor my problem. I've tried to help him with his mental health the entire relationship, but he refuses to make an effort and expects me to sit there and listen to him complain while pretending everything is going to be ok. This is a big part of the emotional disconnect I've had to train myself for.'",
        "In response to 'Pretty much everyone I know who has gotten divorced had a lightbulb moment a good while before things ended. You realize that this isn't going to last forever, nothing's going to change, you just fall into total cynicism about the whole thing.\nGetting out of the marriage is something you'll have to do one of these days. And even when my wife ended it, I was still arguing for her to stay even though I have my lightbulb moment almost a year before she had hers. It took like three sessions in therapy to get to the heart of why I did.\nOh, and if someone confronts you about an affair and you're not having one, don't laugh.', a user said: 'Don't laugh? Because it can be considered nervous laughter?\nI had that light bulb moment a while ago, I think. It just kept getting worse and worse, and now I'm here.'",
        "In response to 'This is off topic but - isn’t Palworld so freaking fun? I’m obsessed.\nDon’t worry, you get the fun of starting over! I bet there’s a fun server just waiting for you.\nAnd I’m glad you recognized your worth and are getting out before the relationship gets more entangled.', a user said: 'Yes! I have another server with another friend group, I'm just particularly proud of the base in my bf's server because I was able to consolidate space with the farming corral and the breeding farm. Base-building survival games have never appealed to me before, so that's a personal win. I also bred two really good battle Anubis for us. Still working on a base Anubis. And I just hit level 40. I can always do it again in the other server.'",
        "In response to 'Men think women are fine with a “tolerable level of permanent unhappiness” until they leave. Original comment for context\nhttps://www.reddit.com/r/BestofRedditorUpdates/s/PQ6Ac0AEcs', a user said: 'That is mindblowing. He knew she was unhappy, but didn't think there was anything wrong? It's so heinous.'",
        "In response to 'This guy explains that they think nothing is wrong when the woman stops trying\nhttps://youtube.com/shorts/xqjr47EEsUM?si=XboTVjVi2u5Jb651', a user said: 'This is a good shortened version. I like this guy's energy.'",
        "In response to 'Well done, OP. I wish I had done quiet quitting. I can’t stand not being happy so I leave right away, but then struggle a lot after the break up. I wish I’d stayed a bit longer just to accept the end of the relationship and so I could move on more easily.', a user said: 'It seems to be the difference between ripping a band-aid off a fresh wound or letting it fall off after it's already mostly healed. I'm not going to say that one is better than the other. Everyone is different. For me, I didn't intentionally \"quiet quit,\" it just happened, and the video made me realize it.'",
        "In response to 'This is how I'd behave, only if my partner was lying, abusing or cheating. You must not have much respect for him to quiet quit, from other comments it sounds like your soon to be ex deserves it. Do what is safe and convenient for you.', a user said: 'From what other people have said, he has been emotionally and sexually abusive. He has also cheated in the past and lied about cutting her off. That's three for three!'",
        "In response to 'You better have a party once the breakup is officially done then!', a user said: 'I may actually ask all my friends to get together. It's been a while since we've all hung out.'",
        "In response to 'Oh, the Uber girl, yeah, no wonder.\nYou'll find someone else to play Palworld with.', a user said: 'Uber girl. 🤣\nI already have another server with other friends. I mostly put that in there to drive home the point that there's really nothing keeping me in the relationship, and everything I have to lose isn't worth keeping anyways.'"
    ]
}