{
    "username": "cowgrly",
    "contributions": [
        "In response to 'OP got a raise that probably only happened due to boss's boss.\nFrom the big boss's standpoint, they are meeting their metrics so what's their answer going to be when the boss asks why they are being let go? OP mentioned a three person team. Is it just OP that doesn't get along? Boss might frame it that way, even if not true. Also, replacing them doesn't mean that they'll find someone who's better. There's always that risk. Big boss may be waiting for the boss to retire. I wouldn't put a lot of blame on them. They may even be looking to promote OP when the boss retires.', a user said: 'I’d have still kept exceeding if I was OP- reducing to hitting only the goals is technically ok but will not get OP an advancement when Boss retires.\nMy opinion: Big boss knows there are issues and is watching to see if OP excels or phones it in because they hate the boss. Assuming big boss will accept on target (but not exceeding) goals is a risk I would not take if I was OP.\nI think OP is realizing that, which is why they want to craft a review that sounds better than “I did what was asked, not a bit more”.'",
        "In response to 'My opinion: Big boss knows there are issues and is watching to see if OP excels or phones it in because they hate the boss. Assuming big boss will accept on target (but not exceeding) goals is a risk I would not take if I was OP.\nUgh, such toxic bullshit.\nI know there are issues but, instead of working to  solve them as the BB, I'm going to let you twist in the wind and see if you excel regardless. If you do, who knows? Your boss may or may not retire in a few years, and you may or may not get a promotion!\nIsn't the uncertainty\nexciting?\nIt's like buying a lottery ticket, only much harder and more soul-sucking!', a user said: 'Didn’t say it’s appropriate, this is my guess. I mean, OP also believes they were rewarded with a pay increase after telling someone they may leave.\nRegardless, I stand by what I said which is doing the bare min to hit goals is going to backfire if they think they’re taking boss’ job at some point.'",
        "In response to 'I think you’re assuming that the boss’ boss has waaaay too much time on their hands to know all of this is going on. They “know” what their direct reports tell them. Kinda.', a user said: 'Maybe boss’ boss doesn’t know all that is going on, but I stand by my opinion that:\n1) OP was unwise to only meet goals if they want to stay and advance at this company.\n2) They should not use performance to make a point, that always backfires.\n3) They need to tread carefully in this review because it will be obvious they stopped going above and beyond.\nWhether or not boss’ boss has time is less relevant than those points.'"
    ]
}