{
    "username": "craftsman10",
    "contributions": [
        "In response to 'Yup, “service with a smile” is absolute torture if management isn’t dealing with difficult costumers. I was lucky enough in my service jobs that it was understood that if a customer had a complaint we’d immediately get them a manager and we’d move on to the next customer. Not only did the managers get paid more to deal with difficult customers they were in a much better position to solve the problem if at all possible. Made my job really easy because I only dealt with regular/happy customers who appreciated my “service with a smile” which made my day feel better.\nNow that I’m in somewhat of a management position, I take all the blame and deflect all the credit. It’s relatively easy for me to make my teams life easier (making sure we have adequate budget, negotiating for realistic deadlines, being lax with schedules when we’re slow, getting buy in from the team before I commit on deliverables), this means the team can do their best work which makes my life easier. If everyone on my team does what their supposed, we’re all good. Don’t need them to go above and beyond. If they want to, great, hopefully puts that person in a good position for their career be it with us or somewhere else, but it’s not a requirement for team success.', a user said: 'Management with a smile (or integrity) seems to be a fairy tale'",
        "In response to 'A lot of people grew up poor or had poor family back in the day (think Boomers generation). So getting a job so you don't have to labour in the field or go hungry was a blessing.\nAlso, it used to legitimately be the case that if you got a good job, you could have that job for a long time. The economy was much less in flux, and companies were much less rigid about shaving every possible dime.\nThat way pretty much disappeared around the 1980s, but a lot of people still think it's the case somehow.', a user said: 'The gap between workers union wages and management was much. Much MUCH smaller.  We can’t pay McD’s employees a living wage because it will destroy the business to pay then $3/more per hour.   The CEO’s $6million dollar salary and $19milkion dollar bonus miraculously don’t seem to have any effect at all some how.  Maybe the CEO is quiet quitting'"
    ]
}