{
    "username": "CrystalSplice",
    "contributions": [
        "In response to 'Once upon a time management schools were flooded with metrics, stack ranking, best in class work environments, and original thoughts all to increase motivation. Through motivation it a business can increased efficiency.\nNow (post pandemic) the game has changed. Workers know they are exploited instantly and have been trained by their parents to avoid being harvested. Other workers don't know and are still in the machine. But all workers have learned the 30 year employee with a gold watch is long gone. Once knowledge caught up to expectations the Gen Alpha vs Millennial work shift was complete. Except instead of learning how to motivate (manipulate) the workers like eras past, the only tactic is brute force authority. Which is why \"quiet quitting\" is so effective. I'm not exactly passive so quiet quitting is fucking difficult for me. And yet I recognized it as the best strategy against bad faith actors.\nIt doesn't matter who is best? Quiet Quit. Don't be a sucker.\nIt doesn't matter who is worst? Quiet Quit. Why not?\nIt doesn't matter what you do because you'll never be promoted if you don't fit expectations. Quiet Quit.\nThere are no promotions, the company is firing everyone but cannot report to wall street. Quiet Quit until you get RIFF'd with 2weeks per year or more. Never quit because payday is coming, that's why they treat you like absolute shit. They want you to quit before payday.\nAll of these problems are easily addressed by competent managers. Those don't generally exist anymore. Modern weak passive managers are like mental children given a supervisor hat to hand out permission slips.', a user said: 'In the realm of technology work (software development and the work that supports it), I think one of the largest contributors to shitty management is inappropriate promotions. If someone can’t get a promotion as an\nengineer\n, then they may try to snag a PM position or just get promoted to manager level due to seniority.\nManagement skills are not taken into consideration.\nThere are so, so many middle and even upper level managers in tech who are\nengineers\nand that’s the job they should be doing because they don’t have a clue how to manage people. I saw a director voluntarily step down at a previous job and go back to an individual contributor role because he had the humility to admit that he was out of his depth and I was absolutely awestruck by it.\nUnfortunately, this continues. Lack of promotion opportunities and raises makes people in tech think they should go for management pay, but they don’t stop to think if they should be a manager.'"
    ]
}