{
    "username": "Curry_courier",
    "contributions": [
        "In response to 'Yeah, my coworkers on the line were always less annoyed at the order coming in 15 minutes before close, but the fact that we worked at a sit down restaurant, and that table will now be here an hour past close.\nAnd the kitchen gets none of the tips despite doing all the work.\nAnd we can't leave until the check is dropped off, in case they want to order more food/dessert.\nAnd we now have to reclean all of the equipment we already shut down and had to fire back up for the table that\nhad\nto come in 15 minutes before close.\nAnd then tomorrow we're going to be bitched out by management/the owners for going into overtime and costing them more than they made from the table, but only the kitchen gets yelled at, the wait staff are praised for taking on that final table, we should\nnever\nturn a table away.\nThis Karen-level \"wElL iT's ThEiR jOb\" mentality needs to fucking die. We're human beings, not robots, we deserve common courtesy and respect just like customers expect from us. And we deserve a livable wage for our labor too, but we don't get that either, all while being told our jobs aren't \"skilled\" in any way.\nY'all are paying the absolute cheapest amount you can for literally every service, a cost that is borne by the underpaid and overworked employees, and then expect white glove personal service.\nIt's never fucking enough for y'all. I had a guy when I worked for USPS who lived less than 1/4 mile from the Post Office, had three cars, and worked from home. His front porch was a revolving door of packages every day: I'd drop 20 off, he'd have 20 sitting there for me to take. Every. Fucking. Day. Never a thank you, never an offer of water on a hot day, absolutely\nnothing\ndespite USPS not charging him (or anyone) for us to pick up their packages like that.\nThen a bin appeared: he wanted the packages put in the bin, to make it easier for him to carry them all inside... Then a sign telling me if it's raining, I need to bring the packages from the covered front porch to the covered back porch where there was more room... When I refused to do that, he added another sign telling me I need to put them all under the plastic bin if it's raining or going to rain... All while he's sitting on his ass inside in his pajama pants doing fuck all, or walking by the door eating potato chips while I'm unloading 40 fucking packages and picking up 40 more.\nWe're not your personal fucking servants, you want Express level delivery service, then pay Express shipping prices. You don't get Express service for Ground pricing, and y'all shouldn't be shaming delivery drivers for not going above and beyond when they're not being paid to.\nI constantly see posts on Reddit about people saying you should only give 80% or less at a job so you don't burn out, etc, and it's\nalways\nabout office jobs and how unreasonable it is for boss A to expect B for the pay, and so malicious compliance is warranted and you should slow down your work and blah blah blah, and everyone on Reddit praises them for not just rolling over and taking it.\nBut blue collar workers have enough and start to phone it in, well that's just unacceptable. Fucking hypocrites, all of you, you only care because it affects\nyou.', a user said: 'He paid taxes for that service. Gotta get his money's worth.'"
    ]
}