{
    "username": "CXR_AXR",
    "contributions": [
        "In response to 'Original Post: What to do if my counterpart has \"quiet quit\"? One of my coworkers has been quiet quitting for a long time. But we're basically in a workplace where people are unfireable (government job). His boss does not seem to want to confront him about slacking, so instead, she gives his work to me and makes everything about \"we\" and \"us\" instead of \"him\".\nInstead of telling him directly, for example, \"hey PERSON X, why aren't you responding to my e-mails?\" She'll e-mail both of us and say \"Hey Team, why aren't you guys responding to my e-mails?\" (When it's very obviously him, not me.)\nWhen he decides not to do his work, she just gives his work to me.\nHonestly, I don't care if he quiet quits -- that's his business. But when his refusal to do work is falling on my table, that's where I start to see things getting problematic. How would you deal with this situation? Telling on him is not a good option, we are equals in the workplace and he considers me a friend.\nEDIT: Wow, so many responses! Yes perhaps my use of \"quiet quitting\" wasn't the right choice of words. My coworker came into my office on Friday and told me he doesn't \"give a f***\" about this job but he feels powerful because he feels \"unfireable\". He spends the entire day working on his own stuff (he has a few side jobs that he does). Our boss seems to be intimidated by him and takes the easy way out - instead of giving work to someone who's going to push back, she'll dump it on others instead. Firing someone is an extremely complicated and long process here, and probably not something she wants to go through. The boss is in her third trimester of pregnancy and getting ready to go on maternity leave. My coworker and I have similar job descriptions so it's easy to give his work to me. Addressing the \"friend\" issue: yeah, I don't really know if \"friend\" was the right word here either. But we're equals and I guess you could say \"friendly\" to each other. Coworker brings me baked goods sometimes, has invited me to get-togethers, things like that. Situation really sucks.', a user said: 'That's why government sometime have very low efficiency.\nYou can try to communicate with him first, but i guess you won't get a good feedback, and i wouldn't expect he will changy his attitude, but at least you should try.\nThen, the remaining option will be\n1. Communicate with your boss about the situation\n2. Quiet quitting yourself (if you can't beat them, join them)\n3. Request an internal transfer\n4. Find another job'",
        "In response to 'You have the right idea. Any time I take on a new job, I go and get myself a new Google voice number. When the job ends, I stop using the number. I also don’t add coworkers on social media. Maybe if I really like someone I will add them after I leave, but never while I’m still there. It’s worked pretty well so far.', a user said: 'That is good practice, although some boss still consider this as \"irresponsible\", they especially like to point their fingers to younger generation'",
        "In response to 'This is why when I made the switch to freelancing I got a virtual phone number for my business and set it up to go straight to voicemail outside of my office hours. If it comes in outside of regular business hours, it can wait. I also close the tab with my work email when I quit for the day. I might occasionally still check things outside those hours if I feel like it, but I never\nrespond\noutside of regular business hours.\nAll that being said, at my last salaried job I did entrust my cell number to my boss because she was a reasonable person and I trusted her. In my eight years there, she only called me after-hours once and it was when the building literally flooded and it was all hands on deck to carry out our emergency plan (it was a museum, so...kind of important). That's how it should be; after-hours contact should only happen if you're being paid to be on-call (and have time when you're not) or if it's a true emergency.', a user said: 'I agree, epscially if it is something that can be solved without calling you.\nFor example, sometime, machine failure / problems can be solved by following steps and reboot the system (even if you called the engineer, they probably just followed the same steps, of course, they should analyse the log in the next day). \nIf this is the case, instead of calling the engineers out of office hour, the senior management should already have a manual ready for their empolyees and make sure everyone knows its existence.'",
        "In response to 'If my work provided an actual living wage, I'd be more inclined to answer my phone for work related matters in my \"free time\".\nAs they do not, I do not.\nThe older generation doesn't grasp that the the fucking guy who mows their yard likely has a second job, while the oldschool milkman could raise a fucking family, house, automobile, and even including vacations.', a user said: 'Nowadays, getting a second job is not as easy, sometime the empolyer expected you to work overtime'",
        "In response to 'I work with some of those types except they also complain about work all day. They come in way before their scheduled time, in an hourly pay position so they aren’t being paid until their scheduled time. Then complain that other people are only here for the time they’re being paid for. Meanwhile they do less work than the people that just do their scheduled time.\nIt’s really sad honestly. Work is the only thing they know but they’re also bitter and jaded and hate work but won’t retire because it’s all they have. Vicious cycle of miserableness that spreads to others around them.', a user said: 'Life is difficult sometimes, staying in the office can sometimes be more relax than staying at home.\nThis is sad, but with family duty and child care, it is like working a second shift when you return home'"
    ]
}