{
    "username": "Daggonedit",
    "contributions": [
        "Quiet quitting my nearly decade long marriage. As the title says  I'm considering quiet quitting my marriage. I AM NOT ready to have the divorce discussion. He seems truly oblivious to the strife either that or has me questioning reality enough that I think he is.  We got a pet this weekend, I've wanted one for quite some time but resisted getting one for years because my plate was too full being a remote worker and a primary parent (my job is flexible) and I accurately felt Id be the one doing all the work. .\nI've been doing the night wake ups for the young puppy, and he stated I should get some rest when he gets up for work. I infered that he would be taking the dog outside while I rested the one remaining dog bathroom trip of the overnight. Not enough to be a 50/50... But sure I'll take it. I recognize that my point of view may be different than his and that I may truly be \"playing the victim\" as he so kindly put it.  I did infer it and assumed it was the case, but did also \"just spring it on him\". I agree I did spring it on him. At 3 AM I scheduled a text to him with the time of the next bathroom break, the location and flavor of the dog treat, as well as loose instructions to positively reinforce. I get a call asking for the location of the dog treat and he says it just looks like a cookie. My kid loves cookies but I had put them all away because well... Chocolate and dogs is no good.  Annoyed, I get up and check the packaging to confirm, yes this is the dog treat and I indicate the brand on the package shows a brand name that refers to tails and wagging. I go back upstairs and get another call 5 minutes later because surprise dog won't go to the bathroom and this is inconvenient to his routine .... In the 5 minutes since I was last present. Treat... Was left inside by the door so pup motive was not there. I take over, clearly annoyed. Dog uses the bathroom immediately. I'm pretty icy while he gets ready for work and takes a shower that is pretty long or it at least is to me because a long luxurious shower for me is 15 minutes, not 30+.\nHe comes out, I state that if he isn't able to fit in any bathroom breaks into his schedule then I would like to know because then I can set my expectations instead of assuming I will get a break. This turns into an argument about me springing it on him and how he no longer has time to do his morning schedule now because of this and the fires through the things he does in the mornings; workout, shower, dressed, breakfast, leave. Note: at least 40 minutes of this is shower. I ask when it will ever be my turn to not do the bathroom breaks. And get told I'm playing the victim and he will get up even more early so he has time.\nI just can't do it any more. I literally just wanted the opportunity to sleep 3 hours straight instead of 2 and I couldn't even have that. I try to be considerate because I've always thought that's what a person should do? I only buy groceries the entire house approves, buy foods specific to his tastes, do things like clean out the coffee maker when I'm done using it so it's not a nasty surprise at 4 am, let him sleep in on weekends unprompted despite parent of early riser, hell every now and then I'll even purchase a video game console accessory or game just because. But I'm not doing it any more. I've decided I'm no longer going to make an effort to be considerate or accommodating which will be very very difficult for me, If I'm going to do everything anyways why go out of my way even more for someone who so very clearly does not even consider me or my feelings?\nSorry for the wall of text and formatting. If I am TA please do let me know because I do agree springing the bathroom break on someone was a lousy thing to do, however I did think that a break was me not doing that bathroom trip.\nEdit: Bad formatting and grammar are bad.",
        "In response to 'It sucks living with someone who is so inconsiderate.  When he inevitably complains about you not buying the things he specifically likes, tell him to stop playing the victim.', a user said: 'I love this.'",
        "In response to 'I'm sorry to say this, but OP did you REALLY expect this to go any differently, I mean really??  Because just by this one post, I didn't.  You know he is a Just No.  You know they go out of their way to make things difficult.  You KNOW THIS, which is why you didn't get a pet for so long.\nThis is never going to change.  You are now stuck with ALL the duties of a new pet.  He will only ever participate if it inconveniences you or he can pick a fight with you.  This is who he is.', a user said: 'I did until the week prior  puppy pickup because I expressed the amount of work that goes into puppies , he had went shopping with me with the list of puppy supplies and made a few suggestions and even seemed very excited. The day after I had already saved a bunch of resources on puppy training, psychology, etc to help us get on the same page.l for consistency . I offered them to him since he's never had a dog before, I had had many dogs  but mostly duties were shared with my siblings and I as kids and I definitely needed a non-farm dog in the south refresher. He declined and said he'd figure it out. As they say in the memes \"It was then that I knew I had fucked up\".'",
        "In response to 'Oh man. I feel like your current experience is acting as my ghost of Christmas future.\nMy hubby grew up in a cat family, which nothing wrong with that I LOVE cats! He met me when my youngest pup was 2.5 y/o. \nRecently he tried to convince me to get a kitten from his friend whose cat recently had a litter. I told him no. Absolutely not.\nWe currently have 2 big dogs. one is very much getting closer to crossing the rainbow bridge (which will absolutely shatter me) and the other just turned 11 and has always been super needy/demanding. I told him no I don't want the added responsibility of cleaning litter, keeping track of cat food/treats, plus another basket of problems if cat doesn't have perfect health. He says he will take care of all the cat's needs. I know thats a load of shit since I currently take care of EVERYTHING related to our dogs. Food, health, grooming, ect. He is good at making sure the younger gets walked (ya know, the fun parts!) whether it be by walking him himself only on the weekends or guilting me into it because he works full time and I'm currently home during the week. Doesn't matter that I have terrible insomnia and may have only fallen asleep like 2 hours prior... I should still get up (and stay up) literally before dawn (summer in AZ so morning is the only time where pup won't burn his paws) to ensure pup gets his walk. PS pup doesn't go crazy if he's not walked everyday so it's not a crisis if he skips a day.\nI told him if he wants to get a baby pet we are getting another dog. He has NO IDEA of the amount of work that goes into raising a puppy into a well behaved dog. It's like training for a human baby and if he can't deal with everything that comes with raising a puppy then raising children with him may be off the table. He already thinks he's too old for a human baby (hes only 37 btw) and I know for a fact it didn't even cross his mind that maybe his idea of being too old for kids at 37 is insulting to me because my parents were 39 and 40 when I came into the picture, until I told him that...\nSorry for the rant.\nOP- How old are your kid(s) and how did infancy go with someone like your husband?', a user said: 'My kid is 5, it did not go well. It went fairly similarly to how the dog is going and has continued to go that way especially medically. There is some cultural issues, his family emigrated from another country and used medicine that fit their cultural customs growing up and as a result there's a lot of skepticism between their children and modern medicine. This does not jive well with a small child that has a lung medical condition and allergies. It is also a large part of why I am not ready to pursue divorce just yet. There have been multiple requests for another kid from him in which I have answered  in no uncertain terms absolutely not. I love my kid more than anything, but I am not willing to sacrifice what is left of me to go through another newborn or infant almost completely alone.'",
        "In response to 'We even share the spousal doctor distrust from immigrant parents.\nOut of curiosity, what breed of dog did you get?\nI'm sorry your child has medical issues. That has to be so tough. ☹️', a user said: 'It is so fun, right? 🙄 I got a Golden Retriever,  they're very sweet and friendly. I even spoke with a few of my kids doctors to come up with a plan to reduce dust in his playroom and bedroom to reduce allergy impact to him. I hate that my kid has the medical stuff going on for him, it really breaks my heart.'",
        "In response to 'Soooo fun...\nI LOVE Goldens! They can be so sweet and patient. I grew up with a gorgeous red golden. Mine had a real bad case (for his whole life not just puppy phase) of jumping on people when excited but then again he wasn't trained at all or disciplined by my parents so 🤷‍♀️.\nCharlie, you are missed big boy.\nGood luck with all your future endeavors, both puppy and people related.', a user said: 'Thank you, you as well. Keep fightin' the good fight!'",
        "In response to 'You wouldn’t even be alone through another infant/child - because you’d have your first kiddo also. Definitely don’t have another with this guy.', a user said: 'Right, but it isn't my first kids responsibility to take care of any additional kid and I just do not have the emotional and mental fortitude to take on another potential child with the chance of asthma and allergies.'",
        "In response to 'Oh no I didn’t think you meant that you’d have your first kiddo take care of new kiddo. I just meant you wouldn’t be alone with just new kiddo because you’d also be taking care of first kiddo. Sorry I wasn’t clear!', a user said: 'Ah ok, I see. Yes. That would be worse. Ha.'",
        "In response to 'Out of curiosity, why are you the primary parent? You both have jobs.', a user said: 'I'm the primary parent because I personally sought out a different career that allowed me to care for my kid when he's sick and work remote. When my kid was an infant he seemed to get sicker than other kids, so I pivoted changed my job, picked up some certifications and that's all she wrote.'",
        "In response to 'There are weaponized incompetence songs. I’d play them a lot around him. Sing them to the top of my lungs.', a user said: 'I have forgotten how to do laundry, that makes shirts shrink, right?'",
        "In response to 'At least the puppy will bond with OP and not him. I bought a puppy for my ex who promised to do all the care. That puppy is now my dog and is OBSESSED with me.', a user said: 'Right, it's been less than a week and the puppy is already very attached to me and will wait by the door for me.'",
        "In response to 'Go ahead and quiet quit with the indentured servitude. I did, and honestly? It's fucking amazing. Let him manage all his own very specific shit.\nEdit to add: I returned to work after staying home with the kids for a decade. I'm burnt out on home making, mental managing, and meal planning to everyones specific desires. Husband started filling in those gaps.', a user said: 'Are you still married? Sometimes even happily? My kiddo starts full time school this year and I am beyond excited.'",
        "In response to 'I am still married and happily so ☺️', a user said: 'I'm very happy for you. Was your experience similar to mine?'",
        "In response to 'Your husband is an ass and your expectations of added responsibility would be equally or at least partial shared is not unreasonable. Schedules change. A puppy was brought into the family....this wasn't sprung on him. It's not a surprise. He just wants the fun parts without all the work. I'm curious as to how long it take him to notice you have clocked out.', a user said: 'Probably a while, I'm kinda the type of person that brings meals to people if I found out they had a baby so it will take some time for me to truly be selfish.'",
        "In response to 'I wouldn't call it being selfish, you should think of it as being \"normal\". Take care of your child, the dog, and yourself, that's a full plate right there. Stop setting yourself on fire to keep your husband warm.', a user said: 'Thank you. I have already done some work on myself but I definitely have a ways to go. I've intentionally lost a lot of weight -and definitely have gotten some looks and door openings from the opposite sex as of late (as if I would want to touch another male with a ten foot pole), gotten more active, and got treatment for my anxiety. Once people started telling me how pleasant I was after the anxiety treatment it started to put into perspective that maybe I'm not so awful. I'm going to start doing even more of the things I want to do like puppy training class, attend  community events, etc.'",
        "In response to 'Return the dog.\nAction will speak volumes where your words are ignored.', a user said: 'I will not be returning the dog. I do genuinely want the dog, but if this did happen I wanted to wait until my kid was school age. Which he is.'",
        "In response to 'There is something called the 180 technique which might be interesting for you to read (easy to Google), it is essentially describing 'rules' of reversing the people pleasing tendencies. May be super useful to read and reaffirm you are doing the right thing', a user said: 'Thank you, I did just look this up and it does align with what I'm going for. The irony of a lot of the things it's saying to do are the opposite of the things I align to my own value, but I suppose you don't receive consideration as a human rug so there is that.'",
        "In response to 'What he is doing to you is torture. Literally. Torture. It’s how they break POWs, not letting them sleep. So you are only getting 2 hours of sleep while he’s playing weaponized incompetence. I think you should take the dog back to wherever it came from as this is just one more responsibility for YOU to handle. Not him. You.  I wouldn’t quietly quit, I’d got out with a bang! He’s not helping you out with anything so might as well do it alone. Trust me it’ll be a lot less work without his incompetence', a user said: 'I am getting more than 2 hours of sleep total I'm just waking up every two hours. Im commenting today to partially give an update. I'm still going through with my plan but he did call and apologize which is a rarity for him, he has taken over  half of the wake ups with the puppy overnight. I'm working on managing my calmness and facade of general indifference and he does look concerned. He should be. I do have other goals I'm working towards but won't specify.'",
        "In response to 'I'm curious as to why you assume she hasn't. Multiple times, even?', a user said: 'I have, this is honestly  my more aggressive\nWay of asking. Yesterday it was \"Hey, dinner is ready I need to get it out, Can you please take out the dog so I can turn off the burners and remove things from the oven?\". Before that it was \"Hey my days are really full , I would really like you to keep an eye out for any time the dogs nose is on the ground and to take him outside if you see it. That can be a sign that he needs to go to the bathroom\". Zero of those times resulted in a positive neutral response, one did result in the dog being brought outside, however since the training techniques I use weren't being used the puppy did not use the bathroom outside and did inside immediately instead. It is possible I'm not communicating the right way, but I have no idea what the right way would be because to me those feel effective.\" When x happens or you do this I feel y because y\" doesn't work at all because it turns into being all about me and how I feel, I do think this one is partially my fault because over the years to be more inclusive I started using \" we \" statements every time I completed a task or plans were made to help him feel more included with my family, friends, etc. Ive stopped that.'",
        "In response to 'So, the thing that jumps out here is that the two of you aren't communicating. At all. You are accommodating and getting resentful, then  you snap, then he gets defensive.\nYes, dial back what you're doing, especially things he doesn't see you doing (like letting him sleep in). But\nalso\nsit him down and have a meaningful conversation - not \"when is it going to be my turn\" but a conversation about changing things so you have a\nfair division of the load\n. He is more than capable of figuring out where to stash a dog treat so he can find it when it's his turn. He can get up on weekend mornings to be with early riser kid. He can adjust how long he spends in the shower or getting up earlier to work out so that you, too, have time to yourself.', a user said: 'Hi, I didn't put this in the post because it was already so long but this has been a conversation before and I agree there could be better communication. I have directly been told to ask when I need help. However, I have specifically said \"I need help and want you to help. This is me asking you to help me do x.\". This was also not well received, and to be frank I just don't see the value in having to ask for help every single time because even taking time out of doing those tasks is in itself work.'",
        "In response to 'Does he need this type of explicit detailed instruction at work or does he manage to keep track of what needs to be done and does it? If so, he can do the same at home. \nYou shouldn't have to ask him to \"help\", he needs to step up and do his part as a partner!', a user said: 'Yes, he works a job that literally is keeping track of things and problem resolution if those things cannot be tracked and with the instructions it's challenging on one hand if I give him few directions I'm not giving him pertinent information, but if I give him even more directions and offer resources like reading some PDFs I scanned from a puppy training book or etc.  I'm treating him like an idiot and it offends him.'"
    ]
}