{
    "username": "dankmeeeem",
    "contributions": [
        "In response to 'Maybe consider looking into an AM/renewals role! You still get the rewards of a “sale”, but less pressure and very little (or zero) cold calling.', a user said: 'Only downside is the massive pay cut. I had to quit my Renewals role a few months ago because the Fortune 500 Defense Contractor refused to pay more than $50K/yr (located in large NE US city).'",
        "In response to 'I think the people who heard about salespeople making absolute bank and want to start a career in sales should definitely read through the comments here. There's a lot of truth and reality that's being said about having a sales career.\nIt's ridiculously common to be motivated and hungry for the first couple months you start a role, and you work really hard, and you can get burnt out very easy. It's not a good feeling. There's a lot of stress that comes with the job. It can be very mentally strenuous.\nSales is a very rewarding career, but it takes a strong mental to be able to weather the constant rejection and pressure of quotas, or if you're commission only, just being able to put food on the table.', a user said: 'The pressure of a having a quota is so uniquely damaging to some people. I lived my entire life unable to understand what people meant by \"anxiety\" until I started falling behind on my quota. Every phone call, every email, felt like a fight for survival. And once I convinced myself I wouldn't hit attainment, I became the most unconfident and unproductive version of myself I've ever known. On top of all that, I developed a psychosomatic sleep disorder thats still effecting me 6 months after quitting. Maybe I'm just a weak person, but I never imagined that a career in sales could have such a mental downside.'",
        "In response to 'Do you know what career path you’re thinking about going into? I feel exactly the same way as you about quota, and now that it’s the last week of the month I feel like I’m fighting for survival and not being the confident person I can be. It’s a toxic cycle especially when there’s so many things you can’t control about prospects who ghost you, push timelines way back, don’t speak to the DM, are just window shopping etc.', a user said: 'I'm sorry to say but I have no idea what to do next. I come from a marketing/advertising background and only got into sales because I didn't know what else to do. Honestly I'm so cynical about my career and mental health at this point I'd be fine just being the \"IT guy\" at some small office an hour down the interstate.\nOne thing that I cant recommend enough is using your company's EAP (Employee Assistance Program) to get some therapy. 1. It will help with keeping rational and not quitting randomly one day. 2. They might be able to work with your HR team to give you some accommodations to ease your stress. Careful though, for me this ended up with DAILY \"progress\" meetings with my authoritarian manager.\nAlso word to the wise, never quit or get fired at the end of the month. Your health insurance stays through the last month of your employment, so if you quit at the beginning of the month you'll have a whole 30 days of insurance to use. (Learned that one the hard way and had to pay for therapy out of my savings).'",
        "In response to 'im fuckin burnt man. 3 new comp plans within the last year- in a similar situation to you where i won’t see commission for another 6 months+. making 55k salary with maybe $600 in “bonus” money each month just isn’t cutting it for me and it’s hard to stay motivated when you don’t feel like you’re being paid your worth.', a user said: 'Oh man I was in just about the same salary range ($50K) and it was the most aggravating experience to see how many MILLIONS in reoccurring revenue I would pull in to the company, yet when I ask for $5,000-$10,000 raise so I could afford to rent a studio apartment, I was told \"$60K+ is above their salary range for the Inside Sales Rep  position.'"
    ]
}