{
    "username": "dawno64",
    "contributions": [
        "In response to 'This is my exact situation. Our President and Sales Guy sit in an office and ping pong lofty ideas with less than zero follow through. It took over a year but now I’ve got it that we don’t fire drill Chase our tails with our hair on fire each time they have some never thought of ever brilliant idea that they’ll forget about. I ask them to submit a simple form. That’s it. Just fill it out with a summary, purpose, proposed ROI, and assign tasks. 100% of the time they’ll move on.', a user said: 'I noticed that with execs and salespeople too. As soon as they have to put forth actual effort and do some work instead of just...talk, it usually stops there.'",
        "In response to 'Original Post: I think my remote team mate is quiet quitting And it's ticking me off. Need advice if I should say something?\nMy team is fully remote,  spread  across the US. Our individual and team metrics are tracked by the amount of tickets we process on a weekly basis. This is a FULL time job and I've found that a member of our team is only logging about 4 hours a day - if that! Meanwhile, the rest of the team is putting in 9 hr days just to keep up with the volume.  We've also had to log in and work the last two Saturdays just to clear the backlog.  If this person would just work a normal day,  it would lighten the load on each of us. Our manager hasn't seemed to notice that this  person's \"numbers\" are half of what the other team members are producing. Do I speak up or keep my trap shut,  silently seething all day?\n**Thank you everyone for your input! I'm not going to do my managers job for them,  if they don't care,  I won't care either.  I'll hit my targets and focus on my career advancement in 2025.', a user said: 'Don't do anything, as hard as it is, but don't cover for this person either.\nI bust my ass WFH, getting work done, and I know at least two members of my team that... don't. One has told me about their side job, which they apparently work during our work hours, and when I have called them in a project they're at the post office, the doctors, the grocery store, etc\nAnother didn't get a project to me on time, and when I reached out to follow up, they said they had a sick kid they had to pick up from school...but they showed active on teams all day while accomplishing nothing.\nBoth of themare newer team members who not only have projects to work on, but should be learning the intricacies of our software systems in any spare time they have, and neither of them even know the basics.\nIrritating to be sure, but mentioning it to management opens the potential for a full RTO and I would lose my shit.'"
    ]
}