{
    "username": "dcDandelion",
    "contributions": [
        "In response to 'HIPAA only applies to healthcare organizations or healthcare providers; it does not apply to an employer/employee relationship. To perhaps the manager is aware of something OP is not  like you said.', a user said: 'This statement is incorrect. Legally, HIPAA applies to “covered entities,” which extend well beyond just healthcare organizations. However, that’s not the focus of this post. The main point remains that the employee may have a health issue, which the employer is rightfully not disclosing to protect their privacy.'",
        "In response to 'Yes, this is what I meant. Thank you for clarifying.', a user said: 'No problem. Your point came across loud and clear to most since HIPAA is used pretty ubiquitously to generally mean that health information should only be shared on a strict need to know basis. :)'",
        "In response to 'Original Post: I think my remote team mate is quiet quitting And it's ticking me off. Need advice if I should say something?\nMy team is fully remote,  spread  across the US. Our individual and team metrics are tracked by the amount of tickets we process on a weekly basis. This is a FULL time job and I've found that a member of our team is only logging about 4 hours a day - if that! Meanwhile, the rest of the team is putting in 9 hr days just to keep up with the volume.  We've also had to log in and work the last two Saturdays just to clear the backlog.  If this person would just work a normal day,  it would lighten the load on each of us. Our manager hasn't seemed to notice that this  person's \"numbers\" are half of what the other team members are producing. Do I speak up or keep my trap shut,  silently seething all day?\n**Thank you everyone for your input! I'm not going to do my managers job for them,  if they don't care,  I won't care either.  I'll hit my targets and focus on my career advancement in 2025.', a user said: 'How is it you became aware of the low hours logged and your manager has not? That’s difficult to comprehend considering weekend OT was mandated.'",
        "In response to 'My manager isn't as versed in our software system as I am. Our manager doesn't realize that there is a place where you can see all activity.  An employee from another department actually alerted me to it,  they were trying to get in touch with said team member,  their status was green but they were not responding to an urgent request', a user said: 'Eish. If what you’re saying is accurate, bringing this up would not only highlight your manager’s incompetence but also draw attention to the employee’s poor performance. What program is it that shows activity? You mentioned a green active icon which makes me think Teams, but Teams doesn’t display activity history to regular users (maybe superpower IT users).\nIt’s a messy situation, to say the least. If you have a strong relationship with the second-line manager or HR, there might be a potential pathway forward, but the situation is too nuanced for anyone to offer truly actionable advice.'",
        "In response to 'Not necessarily the case but anything like Salesforce will have user engagement on it where you can see when records were updated or made etc.', a user said: 'For sure. But SF last updated/modified records wouldn’t have the level of detail indicated in the post (OP and some colleagues logging 9 hours per day and the other person in question less than 4). Not saying there isn’t software that tracks this data, just seems like all sorts of data privacy landmines to share this information with every employee in a company and not management and above.'"
    ]
}