{
    "username": "DDChristi",
    "contributions": [
        "In response to 'Original Post: Quiet quitting my nearly decade long marriage. As the title says  I'm considering quiet quitting my marriage. I AM NOT ready to have the divorce discussion. He seems truly oblivious to the strife either that or has me questioning reality enough that I think he is.  We got a pet this weekend, I've wanted one for quite some time but resisted getting one for years because my plate was too full being a remote worker and a primary parent (my job is flexible) and I accurately felt Id be the one doing all the work. .\nI've been doing the night wake ups for the young puppy, and he stated I should get some rest when he gets up for work. I infered that he would be taking the dog outside while I rested the one remaining dog bathroom trip of the overnight. Not enough to be a 50/50... But sure I'll take it. I recognize that my point of view may be different than his and that I may truly be \"playing the victim\" as he so kindly put it.  I did infer it and assumed it was the case, but did also \"just spring it on him\". I agree I did spring it on him. At 3 AM I scheduled a text to him with the time of the next bathroom break, the location and flavor of the dog treat, as well as loose instructions to positively reinforce. I get a call asking for the location of the dog treat and he says it just looks like a cookie. My kid loves cookies but I had put them all away because well... Chocolate and dogs is no good.  Annoyed, I get up and check the packaging to confirm, yes this is the dog treat and I indicate the brand on the package shows a brand name that refers to tails and wagging. I go back upstairs and get another call 5 minutes later because surprise dog won't go to the bathroom and this is inconvenient to his routine .... In the 5 minutes since I was last present. Treat... Was left inside by the door so pup motive was not there. I take over, clearly annoyed. Dog uses the bathroom immediately. I'm pretty icy while he gets ready for work and takes a shower that is pretty long or it at least is to me because a long luxurious shower for me is 15 minutes, not 30+.\nHe comes out, I state that if he isn't able to fit in any bathroom breaks into his schedule then I would like to know because then I can set my expectations instead of assuming I will get a break. This turns into an argument about me springing it on him and how he no longer has time to do his morning schedule now because of this and the fires through the things he does in the mornings; workout, shower, dressed, breakfast, leave. Note: at least 40 minutes of this is shower. I ask when it will ever be my turn to not do the bathroom breaks. And get told I'm playing the victim and he will get up even more early so he has time.\nI just can't do it any more. I literally just wanted the opportunity to sleep 3 hours straight instead of 2 and I couldn't even have that. I try to be considerate because I've always thought that's what a person should do? I only buy groceries the entire house approves, buy foods specific to his tastes, do things like clean out the coffee maker when I'm done using it so it's not a nasty surprise at 4 am, let him sleep in on weekends unprompted despite parent of early riser, hell every now and then I'll even purchase a video game console accessory or game just because. But I'm not doing it any more. I've decided I'm no longer going to make an effort to be considerate or accommodating which will be very very difficult for me, If I'm going to do everything anyways why go out of my way even more for someone who so very clearly does not even consider me or my feelings?\nSorry for the wall of text and formatting. If I am TA please do let me know because I do agree springing the bathroom break on someone was a lousy thing to do, however I did think that a break was me not doing that bathroom trip.\nEdit: Bad formatting and grammar are bad.', a user said: 'He may have just been complaining but he did say he will get up even more early so he has time. Take him up on that offer even if it was said in the heat of the moment. “I need more sleep so I’m going to take you up on that offer you made of getting up earlier. Make sure you put the treats in a place you’ll remember.”\nAlso, your husband is an ass.'"
    ]
}