{
    "username": "ddoubles",
    "contributions": [
        "In response to 'Quiet quitting er strengt teke berre 친 ikkje ta p친 seg meir enn ein er tilsett til, og f친r betalt for. Om det er 친 arbeide ut over arbeidstid, eller 친 gjer arbeid som ikkje ein har betalt for 친 gjere er det same.\nDet vert som ekstralekser fordi ein er flink p친 skulen. Og s친 verte sur n친r eleven vel 친 ikkje gjera dei.', a user said: 'Dette er helt kontekstuelt. Det er stor forskjell p친 친 jobbe for familiebedriften eller en nystartet gr칲nderbedrift, som kan gi deg elleville karrieremuligheter om man lykkes ved 친 st친 p친 ekstra, og det 친 jobbe for McDonald's, hvor du kan byttes ut med hvem som helst og livet suges ut av sjelen din.\nHvis man velger den sistnevnte jobben, og tar en jobb for Espresso House etter 친 ha lest om hvordan de behandler sine ansatte, ja, da f친r du som fortjent. Ikke kom her og fortell meg om \"quiet quitting\" i etterkant, for jeg vil le av hvor ignorant du var i utgangspunktet.\nTL;DR\nSkaff deg en skikkelig jobb til 친 begynne med, og st칮tt ikke drittselskaper som f칮rer til at du utvikler en d친rlig holdning til arbeidslivet'",
        "In response to '\"f친 deg ein skikkeleg jobb\" er ei s칝rs ignorant ytring, tykkjer du ikkje?', a user said: '칀 jobbe p친 Espresso House er ignorant. Det poenget er vel ikke s친 vanskelig 친 ta inn over seg, vel?'",
        "In response to '[Deleted or Empty Comment]', a user said: 'Kan godt jobbe de jobbene, men kom da ikke 친 klag 친 syt, Du vet hva du g친r til.'",
        "In response to 'Nokon gongar har ein ikkje store valet, og er avhengig av 친 tena pengar for 친 klara seg. Det poenget er vel ikkje s친 vanskeleg 친 skj칮na?\n칀 snakka som om jobb er \"valvare\" for alle og ein kvar er rimeleg tankelaust, og 친 jobba for eit betre system der ein er vil vera meir til hjelp enn 친 sitja utan mat, eller?', a user said: 'Greit, om du velger innta offerrollen s친 er videre diskusjon futilt. Ha en fin dag.'",
        "In response to 'Spanande at du g친r ut fr친 at eg personleg jobbar p친 espresso house, og tar ignoransen din som personlege angrep fordi eg har st칮rre forst친ing enn \"f친 deg ein betre jobb\" 游땕', a user said: 'Det er kun et eksempel p친 en arbeidgiver som f칮rer til quiet qutting som fenomen, men problemt startet i det 칮yeblikket du tok offerrollen og tok en jobb du m친 sette grenser og gj칮re minimum innsats for 친 utf칮re.\nFordi du har en oppfattning om at du m친 ta en hvilken som helst jobb fordi egenverdet ditt forteller deg at du er en taper som m친 det.\nDerfor er det futilt med diskusjon. Fordi du ikke har troen p친 deg selv og har et egenverd.'",
        "In response to 'Lol tenk 친 ha et s친 forvridd virkelighetssyn at du tror man bare kan velge 친 unng친 친 ta \"drittjobber\".', a user said: 'Du er indokrinert i offermentalitet. S칮k hjelp'",
        "In response to '칀 sammenligne McDonald's med drittselskaper er naivt. Det finnes mange enkle jobber hvor du enkelt kan erstattes, men hvor du likevel behandles bra.', a user said: 'Alle som selger friterte poteter og annen junk er drittselskap.'",
        "In response to 'Du blander produktet de selger og hvordan de behandler ansatte.', a user said: 'Du kan v칝re heldig, men i det store og det hele behandles du som dritt, men du m친 ha jobbet flere stedet for 친 vite forskjellen. Anbefaler 친 pr칮ve det.'",
        "In response to 'Jeg begynte i en gr칲nderbedrift som var p친 vei til 친 ta av og hadde tiln칝rming om at hvis jeg sto p친 ville jeg f친 oppleve mer av suksessen til selskapet. \nI l칮pet av 3.5 친r der fikk jeg ingen l칮nns칮kning eller bonus for ekstra innsats, fordi det var det ikke penger til, samtidig som eierne fikk over en halv milliard i utbytte i samme periode.\nJeg gj칮r ikke noe for anerkjennelse lengre. Betal meg for tiden min eller drit og dra.', a user said: 'Anekdotene dine forteller meg at du var ignorant n친r du inngikk arbeidskontrakt. Du fikk som fortjent.\nL칝rdommen av det, den er uvurderelig, men har du noen gang satt pris p친 den?'"
    ]
}