{
    "username": "DeadWishUpon",
    "contributions": [
        "In response to 'Wait. So doing what you were hired to do when you contracted to do it is now \"quitting\"?\nThe toxic work culture in the US basically implies that you\nwill\nwork unpaid overtime, that your personal time is still company time, that showing up on time is showing up late, and \"doing the bare minimum\" (read: what you were asked to do) is considered bad.\nSo if you're not being overworked and underpaid, then the job will basically harass you until you quit, or until you're fired. Which is why it's called \"quiet quitting.\"\nIn reality \"quiet quitting\" is a term to demean people doing what they were paid to do.', a user said: 'I wish there was an only american thing, but here in Guatemala we have this kind of indoctrination that was born when Spain conquer us, \"Thank God, we have jobs\". Well, natives were not slaves, but barely and yep they had to be greatful to be able to bust their asses off so the rich spaniards would live in luxury.\nThat same attitude still lives in, even if not everyone works in agriculture. There is a meme titled: \"You are what's wrong with Guatemala\", and there's a list of things people do that ruins the country. One of them \"You, who spend all week dreaming of the weekend\". Well I'm sorry, I work everyday and deserve and long for my rest. Ugh.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'You are right, altough some of them did leave.'",
        "In response to 'Jim made some bad decisions early on as manager because there is a learning curve as there is with any job, he makes the same mistakes Michael did, ex combined birthdays  Also, he was not properly trained for the position because 1- it’s Michael and 2-Michael hated Jim being comanager with him.  likely, if Jim had not gone back to sales because it paid better he would have learned and been a good\nmanager in the long run.', a user said: 'I guess Jim could do be a good manager anywhere else, but in that office. I don't think the team will ever take him seriously because of all his office shennanigans. Which is weird because they kind of respected Michael. Who knows?'"
    ]
}