{
    "username": "DeathBySuplex",
    "contributions": [
        "In response to 'If there’s one thing I learned from corporate it’s that managers are not hired for skill or qualifications, they’re hired from nepotism. Your old manager probably knew someone who got them that job.', a user said: 'My job before my current one all the corporate guys worked at the same time at the same grocery store.\nYou can't tell me that all the qualified people in the company all happened to work Store #327 between 1997-2003. Like no other stores in the nearly 50 store district had competent people.\nMy direct supervisor couldn't even do MY job, he was a paperwork guy but couldn't do sales floor stuff. He came in because we had a remodel and was barking at me to make the display was different somehow than how I was doing it. I had worked in another store for a decade before moving to this other job (old store got bought out and the building sold off) and I was like, \"Maybe they just have some weird way they want it presented\" so I asked him to show me how he wanted it, because whenever I'd been told I wasn't doing a display properly the person complaing could-- you know-- show me how to do it. And he just started screaming at me for being lazy.\nThe other guy from a bigger store they brought with them came over after and told me that Corpo never really worked sales floor and didn't know how to make displays.\nMy last week Corpo guy came in again, and I already had my two weeks in, and nothing to lose so when he was bitching about how the place looked (I'd literally just walked in thirty seconds prior to them showing up and the place did look bad because my morning guy was a crackhead) I just happily asked him to show me how to do the displays. He kept getting madder and madder but I just cheerily asked him to show me, not just tell me it looked bad but show me what technique he wanted me to use.\nHe threatened to fire me on the spot and I just smiled wider and said, \"I put my two weeks in already, tomorrows my last day, we have to do the weekend order for product and I'm the only person in this store that knows how to do it you can't do shit to me dude. Now show me how you want me to do it or shut up and leave me to my work.\"'"
    ]
}