{
    "username": "DefaultVariable",
    "contributions": [
        "In response to 'Quiet quitting DOES NOT EXIST, people are doing their job and just their job. People care way more about the separation of their personal and work life', a user said: 'It does indeed exist. I’ve seen it plenty of times. And it’s a side effect of the shitty system. You work your ass off and you may get a 5% raise if you’re lucky, meanwhile the guy who does the bare minimum gets 3%. Maybe “times are tough” this year and no one gets raises* (except for management's bonuses). The guy who has been there for 15 years gets paid twice what you get but does less than half the work.\nThe reward for working hard is shit compared to the benefit of doing the bare minimum. And many cases exist where people work hard and get rewarded only to be the first to be laid off because you’re more expensive. The companies won’t understand that they’re losing a valuable asset, they just see everyone as an equal.\nCompanies have disincentivized hard work.\nNow add in the soul-crushing and time-consuming nature of most jobs and it just compounds the issue. It's no wonder why making it so people have more time to relax and be happy would increase their productivity when they actually are working.'",
        "In response to 'How is doing the bare minimum (i.e., meeting the established requirement) “quitting”?', a user said: 'It’s doing the bare minimum to keep yourself from being fired. That’s why it’s called quiet quitting. The person has essentially quit trying to do a good job. In many cases that makes the person more of an obstacle than if they actually just quit.\nFor example, I’m a software developer. If I task someone to write a method, they take a long time and write code that is bad quality, then that’s a problem. If I had known they were useless I could have tasked someone else instead\nE: be mad, but you doing the bare minimum hurts all of your coworkers too, not just your boss'",
        "In response to 'Just doing your job could still be doing a good job. \nBare minimum is different from \"just doing your job you're being paid for\"\nFor example im a ux design specialist, if i task someone to research and design a wireframe. I expect them to do their job. If they take longer than id estimated id ask them what the struggle points were. If they act maliciously by not doing their job (a.e. Taking their sweet as time knowingly, and or restraining progress on purpose) ill notify higher ups.\nQUIET QUITTING DOES NOT EXIST.\nOne is doing their job the other isnt,\nThey're not quiet quitting, they are purposely getting in situations to get fired.\nDoing your job does not warrant a termination.', a user said: 'Okay so I’m hired to be a software engineer right? I get given tasks to complete. Say I know that it will take me 5 hours to do a task. But instead I work from home and play video games for 5 hours and then do work for 3 hours. The next day I play video games for 6 hours and then do work for 2 hours.\nI could have completed the task at a normal rate, but I chose to intentionally slack off and cheat the company time. A lot of people do this!\nPerhaps your crappy effort is on par with other low performers and therefore goes unnoticed.\nThat is what is meant by quiet quitting. Knowingly slacking or producing sub-par work because you don’t view it as worth it to actually give it a normal amount of effort. And yet again. It’s a symptom of hard work going unrewarded.'",
        "In response to 'You basically proved my point. If the code is bad, then they don’t meet the minimum requirements. They get fired.\nThere is no quiet quitting.', a user said: 'You haven’t spent much time in large companies have you…\nOften times if the person is doing crap work it takes a very long time for large companies to weed them out. Heck, there are a significant amount of people bragging about playing video games for 5+ hours of their workday. That is quiet quitting. It’s doing as little as possible while still keeping the job. Eventually I’ve seen these people get found out and then they get put on a PIP to improve or else they get fired, but it can take several years for that to happen'"
    ]
}