{
    "username": "Deflagratio1",
    "contributions": [
        "In response to 'Let me explain more with regards to internal promotion.\nThe path for me is IC -> IC2 -> Lead IC -> Manager -> Middle manager\nI am currently at Lead IC, and I can go into Manager if I want. However, I DON'T want to do this, and never have. The bullshit just flows downhill and the people I report to as manager are slimy and nauseatingly ingenuine. I have been operating at a manager level for around a year or so, but I don't want to take the title and the small pay bump because of who I'd be reporting to and because of how extremely overworked I would be.\nA manager is expected to do the full-time job of like 2.5 people and nothing THEY do is ever enough either. Fuck that, I don't want to aspire to be a retail middle manager as the pinnacle of my career.\nFor people in my position, the obvious and usual choice (a very common trope in my industry) is to move into a \"back-office\" operational support department by leveraging my front-line industry knowledge and high-stress experience. That would be a SHOE-in for me, because I have a very good reputation with back-office departmental managers as \"that one front-office rockstar who is always on top of everything and would be a great addition to our team\".\nHowever, our organization REGION-LOCKS those opportunities to employees only in TWO STATES. And I am obviously not going to move from my state because of personal ties and a significant other. I live in a HCOL state and there are not many back-office roles in this area unless the organization itself is small and based out of my state.\nThat's why I say that there is no \"internal movement\" at my job. I don't want to pigeon-hole myself into some overworked, underpaid management position where the shit never stops flowing, I want to get into an operational support department like BSA/AML, fraud, collections, whatever. But of course, this obvious path is locked to me due to where I live', a user said: 'It's a very important distinction that you aren't actually locked out of the opportunities you want. You just aren't willing to do what you would have to do to take those opportunities. That is a perfectly ok decision, but you really need to reflect on how you got yourself into this position. You don't really get to be angry at the company on this front when the only real obstacle to the career move you want is you. You said you did a backwards move to this company hoping to move into one of those back office roles and didn't actually confirm where those jobs are. That's 100% on you.\nI will point out that your proposed career path also has one major problem. Everyone else in the company in your role has the exact same idea, and they just don't need that many people. I also work in the same industry and the number of people who make the jump is low compared to the total population. I say this as someone who has made a similar kind of jump. I'll also add that most of what you listed aren't operational support roles. They are call center jobs and are front line positions. You'll find the exact same issues you are currently experiencing in those kinds of roles as well. Yes you don't look at the customer, but you are still interacting with them all day every day, often dealing with the exact same problems you deal with in the bank branch. I have worked shitty in person customer facing jobs and I have worked call center. Call center is a different and higher level of stress. Bank Operations is very different from the roles you mentioned.\nOne final thing about trying to make the jump from branch to call center, your branch knowledge is a benefit, but it's honestly not as big a benefit as you think it is. The majority of what happens in a branch is trained over 2-3 weeks and a lot of it is backed into the mandatory onboarding for those call center jobs. Over 2-3 months you'll see a lot of situations. But all you really gain is some extra familiarity. Maybe you know how to navigate a system or 2 before training, but you will still have to sit through that day of training anyways. You are shaving a couple of days off the ramp up period which is often 1-2 months for call center work.\nIf you want to get into banking operations or banking call center work. You are going to have to be located where those places are. Based on what you said, there isn't anything like that in your area. If this is the career path you really want, moving is going to have to be a real option to consider. I made a multi-state move away from my family and friends (move done with my spouse) and it was one of the best choices we ever made for our lives. With the move we made new friends, Still talk and visit our old friends and our families, our careers are doing better than it ever could have been in our old area, and we are able to live the lifestyle we've wanted.'"
    ]
}