{
    "username": "DeLaManana",
    "contributions": [
        "In response to 'Original Post: It’s Down to Managers to Stop Quiet Quitting, Davos Leaders Say [External Link]: https://www.bloomberg.com/news/articles/2023-01-17/it-s-down-to-managers-to-stop-quiet-quitting-davos-leaders-say?srnd=premium', a user said: 'Not very good analysis or conclusion. Considering labor is a huge portion of expenses, that businesses are run by people and the current labor shortage, it amazes me that business leaders still have no idea how to\neffectively\nmanage their workforces.\nWorkers started to realize that many companies have awful work cultures, and that many jobs have a lack of benefits, advancement and job security. And then add a lot of inflation and financial anxiety. If the quality of worklife decreases, so will effort (because people intuitively understand diminishing returns of effort vs progress), and that effort then is applied elsewhere in travelling, moving, going to the gym, working on a new hobby, or getting a new job or degree.\nPeople who write articles like this have no idea how much the world has changed. When they say things like \"it’s up for debate whether the phenomenon is condemnable slacking\" it reveals the reason why people quiet quit - managers/higher ups who think like this constantly nagging employees under the assumption of bad faith laziness when they may just need extra time to process everything, like stress from rising rents, health, etc. Workplace culture is super important.\nThe way to alleviate quiet quitting is to provide workers better pay, a better culture, and the hope for advancement.'",
        "In response to 'I have a personal theory about this. I think that, due in part to vast economic changes spanning the globe, and due in very large part to American federal policy decisions, firms have existed in an environment for the past 40 years in which labor was not really a market. Or at least, firms didn’t need to treat it as a market. They simply dictated terms to the people selling their labor, and as a result, labor has gotten cheaper and cheaper over that entire timespan.\nYou can also see it internally in firms. Many companies outright do not negotiate pay anymore. Using ever-expanding HR departments (also due to other reasons), firms have essentially automated worker pay increases, while also minimizing them, so that most raises are tiny COL bumps and real raises are mostly given at promotion or as counters for departing employees. I’ve seen this many times at my own places of work and with friends and their employers. Employee takes on more work, or is perhaps just an excellent performer for some time. They ask for a raise. Their manager is enthusiastic. But the next week, their manager delivers the bad news from HR: no raises without a title change. So they ask about a new title. HR responds that they cannot make new titles just for raises. The employee will need to rise substantially in rank in order to make any more money. The employee finds another job, which pays them what they’re worth. Suddenly, HR will permit a substantial counter offer with no title change at all. But at that point, it’s too late, and the employee leaves. Rinse and repeat.\nThis, I think, was to stop incompetent managers from handing out raises every year and sucking up profit that could potentially passed to investors. Not a crazy thing to do, from that perspective. But what we’re seeing today is that these systems have ossified and become a core part of these firms, to the point that they’re unaware of the damage they’re causing because they can’t think about raises any other way. And that’s because labor hasn’t been a market from their perspective for the entire time they’ve been in business. So now that the labor market has dramatically shifted, and laborers are demanding higher prices for what they’re selling, many firms are too slow to react, because they’ve put in place an HR architecture that can only interact with the labor market by hiring and downsizing, and never by adjusting pay rates. They’re not used to the demand for labor not being fixed.', a user said: 'Your analysis is spot on. Since the 1970's/1980's, the balance of power shifted greatly towards capital and away from labor, reflected in things such as the decline of unions, outsourcing, the rise of multinational corporations, the decoupling of wages and productivity, the rise of part-time benefitless jobs, the shrinking of the middle class, and even tax rates.\nThe balance between capital and labor, especially after a slow recovery post GFC in the real economy and zero-percent interest rates/QE in the capital/financial economy, was way too uneven.\nThe issue now is this ethos has been entrenched in business culture and its difficult to adapt as labor becomes more valuable. The ethos has been to reduce labor expenses rather than invest in high-quality labor. I think thats why a lot of these analysts and commentators are wrong about why employees are quiet quitting, the Great Resignation, etc. They can't really imagine anything else.'"
    ]
}