{
    "username": "Delduath",
    "contributions": [
        "In response to 'Eeeugh bragging about the hours is one that was chronic when I was a chef. You’re not a real chef unless you’re working 16 hour days for 2 weeks without a day off apparently. The only person they’re mugging off is themselves.\nThe trouble is companies know a lot of chefs have this old school mentality and exploit it, putting them on salaries and making their situation impossible unless they pull stupid hours.\nThe last place I was a head chef at before I quit, my contract was 45 hours. So that’s what I worked one week just to make a point. I came into work on Monday and left packed up for a long weekend off at the end of service on a Wednesday leaving them without a chef for 4 days till I came back on Monday. Weirdly, immediately after that he hired 3 more cooks.\nFortunately I got out of it just last month after years of mental anguish which at one point put me in hospital lol.', a user said: 'I'm in a completely different industry and it wouldn't be as common for people to be like this, but the ones that are get mercilessly taken advantage of. \nOne person in my team literally does the work of two people and never submits overtime (for some reason totally unknown to me), and others have tried to tell them that they're actively preventing the business from hiring another person.\nAnd it's not like their dedication can be rewarded with a promotion, because they do so much unpaid work that it would cost twice as much to replace them.'",
        "In response to 'I remember someone on about 50/60k a year and I was on about 20k saying to me \"work your wage\" and it's stuck with me ever since.', a user said: 'That's the kind of attitude that keeps people at 20k. I worked hard on the grind and hustle until I was earning 180k at age 20. And let me tell you, daddy wouldn't have gave me that job if he thought that his special guy was lazy like you lot.'",
        "In response to 'Sarcasm aside, there's a shred of truth behind this. You'll advance less with a \"I come in, do my hours and leave\" attitude if for no other reason than someone else doing\nmore\nwill be favoured for promotions.', a user said: 'That's bullshit though, because the people who do the most work are the hardest to replace. Hard work is rarely rewarded that way.\nIf people want to advance they should do the work they are paid for but try to get to know every facet of the business, so the employers are given the impression that they are wasted in their current role.'",
        "In response to 'try to get to know every facet of the business\nHow is this not also above and beyond the scope of their job?\nWhether it's more\nhours\nor more\nwork\nthe same concept applies - if you show up and do exactly what's expected of you and nothing more you will be looked at less favourably than someone who does extra. I know I quoted hours originally but \"extra\" doesn't always have to mean raw time.', a user said: 'I think there's a distinction to be made between the work that actively benefits the employer and this kind of effort that is spent potentially making an employee better at their job in the long run, but won't benefit the employer at that time.'"
    ]
}