{
    "username": "denelian1",
    "contributions": [
        "In response to '. I know boomer relatives who were shocked to see how the world really works when they had to go into the modern world and find a decent job after working the same job for decades.\nOh...oh...you will enjoy this then.\nI'm now 57, so \"old Gen X\" - but I've been in tech since before most of you were born - and I'm very progressive, atheist - basically I am comfortable here on Reddit.\nBack in about 2012, a guy I know (Let's call him \"Rick\"), who was 57 then (and I was 47) was a volunteer at the same nonprofit organization as me.\nWe were both business officers of organization, and I used my laptop to do ordinary business stuff - write letters, make spreadsheets, email and so on. To summarize many interactions, he would constantly tell me how \"I don't understand why you think everything has to be on a computer...I never learned to use one of those things, and I never will!\" Rick would also go on about how \"kids don't want to work\" and all of the usual boomer crap. He was particularly proud of the fact that he was a high school dropout and \"all you gotta do is try and you'll get all the work you need.\" Over and over. He was infuriating, obstinate, racist, misogynistic and all of the other things. Of course he became a virulent Trumper.\nIn 2019, as a result of COVID the company Rick had worked for as a delivery driver for 24 years suddenly went out of business. It was a union job, but for various reasons, he ended up with no pension, and his unemployment ran out, and so on. He hadn't really saved for retirement, expecting to have a pension.\nThings got bad for him; he didn't get too sick, as he did get vaccinated (I know this because I witnessed it happen...another story entirely), but he lost his housing, and he ended up moving in with his elderly parents (he's single, never married).\nIn early 2021, as I tentatively started to emerge more frequently from the COVID stuff, I saw him outside a store and he was quite subdued. To be civil, I said, \"Hey, Rick, nice to see you\" and immediately he went on this long, quite sad story about how he's been trying to learn how to use a smartphone and the internet because every time he tries to get a decent job they tell him he has to apply online and he has no idea how to do that.\nHe actually believed the whole \"\nwalk in and look the manager in the eye and tell them you're willing to work\n\" stuff, he really did. He looked defeated and then he asked me if I'd help him apply for jobs online. I told him I'd be a terrible teacher and he might want to look at the local senior center for classes.\nNo idea what he's up to now, saw him recently at a doctors office, but he didn't see me.', a user said: 'What?\nI'm so confused... I'm \"young Gen X\" (I'm 45) but my dad has been in computers since he was changing bugs in a mainframe at PavePaws AFB.\nEven my mother, who was almost a\ntechnophobe\nknew how to use a smart phone and email before she died.\nNo, better, my literally 93yo\ngrandmother\ncould use a smart phone and email and apply for things online (she sent me the\ndirtiest\nfanfic, and was always mad i wasn't into the same fandoms as she was)\nOkay, no, now I'm sad.\nBut he could literally go to any public library, where the librarians will INDEED help him!\nEdit: autocorrect hates me'"
    ]
}