{
    "username": "DGAF999",
    "contributions": [
        "In response to 'Original Post: Quiet quitting could be the best thing for education. Everyone's definition of quiet quitting is different. Mine is not working outside of your contract ours. Work from 7am to 3pm and then you're done. No lesson planning outside of class, no chaperoning, no working gates unless it involves extra pay.\nWhen you ignore these boundaries, you overwork yourself, can't sustain the position, and you end up leaving the profession and in return your students lose a great educator.\nIf you can't do all the tasks a school asks for you to do during the day, that is not the fault of you, it is the fault of your boss requiring too much of you. If you continue doing these tasks outside of your hours you are effectively telling your admin that this is okay.\nWhen you put your value in working extra hours because it makes you feel like you are \"doing it for the kids\" you are doing the opposite long term. The precedent that teachers have to put so much time in outside of work is toxic and leads to teacher burnout. A shortage of teachers is not good for any educational system.\nI'd like to blame admin, government, or students but the easiest fix is in the teachers themselves. When we overwork ourselves, we effectively hurt education. Only work your hours and if you can't get your work done, let your admin know you don't have the time. Healthy work life balance can keep us going and bring more teachers into the profession.\nEdit: Sorry y'all. I didn't realize how problematic the term \"quiet quitting\" is. I am glad though that it brought some attention to the post which led to some good discussion. I will use a different term from here on out and I am happy a lot of you only work your hours or work your contract.', a user said: 'I just lurk here, but have to say this: as a (now adult) child of 2 teachers, PLEASE don’t work over your hours! As a kid, I was definitely neglected. My memories of my parents revolve around watching them grade papers for hours, and helping put together homework packets. For good work / home balance, remember that your own kids at home need you as well!\nAlso, thanks to all you amazing teachers! I know it’s a thankless job, but I appreciate all that you do (during work hours) for your students!'"
    ]
}