{
    "username": "diesel372",
    "contributions": [
        "In response to 'Original Post: Quiet quitting Me male HL wife LL Have you reached that stage ? Quiet quitting not leaving because of kids or what not but just quitting on the idea of romance in your head letting go of the resentment for your own mental health  and accepting that she’s just a roommate now ? We had yet another talk yesterday about it which she acknowledged the situation made promises again and that night it was just heavy snoring, told her today that I’m disappointed that our discussion led to no improvement even after her promises she said but we both agreed to make efforts ( because yeah I turned LL4U after all this time) I told her it’s ok I don’t even want to talk about it, I’m not even pissed as usual , she’s snoring as I’m typing this next to me and i don’t even care i don’t want her anymore and the sad part is the idea of getting to this point used to scare me but now I just don’t care, I don’t even think I love her anymore just that I’m used to her.', a user said: 'I've been slowly getting to this point. She refuses to even talk about sex. Cuddling? She only tries to cuddle me if she's asleep, and if I try, she practically recoils away from my touch. Despite this, if I ask her if she feels any physical attraction for me, she says, \"Of course, stop being ridiculous.\"\nI've asked her how it feels to have a spouse that physically wants you. No response. I've asked if we can schedule intimate time. No response. I've been serious about it, I've joked about it. No response.\nShe doesn't think there's a problem, so in her mind there's nothing to fix. She had some medical issues a few years back that made sex uncomfortable for her, so I backed off. When I asked her to talk to her Dr. about it, she didn't want to.\nI don't want to cheat, for me sex is just as much emotional as it is physical. I truly believe that if you're going to cheat you should just end the relationship - no one deserves to be cheated on.\nI also don't really want to leave, we've been through too much together over the past 18-19 years. So, to paraphrase the song, it's just me and my hand tonight (and every other night).'"
    ]
}