{
    "username": "DietFrenchFries",
    "contributions": [
        "In response to '[Deleted or Empty Comment]', a user said: 'Gen X’er here.  I’m truly sorry my generation sucks.  I used to be in the camp of “work your butt off; be a slave to your job”.  Then, I got laid off twice in Corporate America.  The second time I was laid off (not the same company as the first), I realized how I could be dedicated to my job but have no one care.  I was a single mom, and one of my kids is disabled.  I remember crying in the conference room when they told me, and all management wanted to do was send me off into the next conference room with the company that was going to help me find a new job.  The same people that I worked late for and gave up time with my kids for in order to meet client deadlines did not care one bit about the hardships I was facing by losing my job.\nTeaching is my 2nd career, and I jumped in all eager to work my butt off because surely parents and students appreciate all of the extra time I was putting in!  Hahahahahahaha!!!!!!\nI work my contracted hours now.  I do not get everything accomplished that I need to, but the world somehow keeps on spinning.  I wish I had figured this out 20-some years ago.\nThankfully, my admin acknowledges that we have too much to do and not enough time to do it.'",
        "In response to 'I'm confused... As a future educator I'm inspired to have students learn... If I was to just work my hours then what is the greater benefit to society that I am intentionally getting my degree for? Is this really what teaching is? What ever happened to inspiration and growth? I understand that resources are not always available but students should come first and their growth as young humans...', a user said: 'The more you work outside of your contracted hours, the more that will become the expectation.  The point here is that teachers are continually asked to work outside of contracted hours or expected to do that.  Most people do not want to work 60 hours a week.  If you want to do that, then have at it.  Just know that once you start doing that, that is the expectation from admin.  So, if you decide to take on an interest outside of work that cuts into those extra hours you have been putting in, don’t be surprised when admin starts noticing that you are not being as productive as you once were.\nYou can work your contracted hours and be passionate about your job.  I bust my butt when I am at work.  I work hard and do everything I possibly can while I am there.  I cannot get it all done in that time unless I juggle some responsibilities around, and even then, not everything will get finished.  I have figured out that it’s okay.  I don’t chaperone events because I have other interests outside my job that I am passionate about and want to pursue.\nYou are not a slave to your employer.'"
    ]
}