{
    "username": "diet_coke_cabal",
    "contributions": [
        "In response to '[Deleted or Empty Comment]', a user said: 'This is exactly it. I actually quite enjoy teaching, but I'm starting to hate my job. They keep adding more and more responsibilities to our plates while never increasing salaries. I work harder than every other professional I know, and I get paid the least. If I made double what I'm currently making, I would LOVE my job. Alternatively, if I had an additional prep time and actually had the time I need to do my job effectively during my contract hours and still got paid the same, I would be pretty fucking happy with my profession. I'm just sick and tired of working like a dog and still putting gas on my credit card at the end of the pay period, after 8 years in the profession and a fucking Master's Degree.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'I totally agree with you, but I personally wouldn't feel so resentful and bitter about taking some grading home or staying late a couple of times a week if I could afford to ever buy a house.'",
        "In response to 'You're not quiet quitting, you're Working To Rule, which means you are abiding to agreed upon terms. Our employers are trying to extract more out of us than we signed up for and not compensate us. There's nothing wrong with you not letting them exploit you.', a user said: 'In my observation last year, I was graded \"effective,\" which is totally cool with me. However, the only \"negative\" that my evaluator could find in my practice is that I don't advise any clubs or coach any sports. She said that, to be a \"highly qualified\" teacher, I would have to start getting involved after school.\nNo, thanks. If that's all that's preventing me from being \"highly effective,\" then I'll take \"effective\" all day long. I'm not working for free. I do too much already for what I make.'",
        "In response to 'You're not quiet quitting, you're Working To Rule, which means you are abiding to agreed upon terms. Our employers are trying to extract more out of us than we signed up for and not compensate us. There's nothing wrong with you not letting them exploit you.', a user said: 'In my observation last year, I was graded \"effective,\" which is totally cool with me. However, the only \"negative\" that my evaluator could find in my practice is that I don't advise any clubs or coach any sports. She said that, to be a \"highly qualified\" teacher, I would have to start getting involved after school.\nNo, thanks. If that's all that's preventing me from being \"highly effective,\" then I'll take \"effective\" all day long. I'm not working for free. I do too much already for what I make.'",
        "In response to 'I’ve tried to bust my ass and work tons of OT and never miss a shift and never be late ao that I could get promoted and at every job ever; this has never worked out for me. Wage increases aren’t even different from the slacker. So yeah I’m definitely a “quiet quitter now”. I’m done trying hard', a user said: 'This has literally happened to me everywhere I've worked. I remember working in an office, making $15.50 an hour. I made $900 every two weeks. The job wasn't difficult, but I wanted to be good, so I did everything as well as possible. The bosses noticed that I was doing well and I was fast, so they gave me additional responsibilities. They shifted some responsibilities from the HR Manager (who made more than double my wage) to me. The owner of the company (who just sold it for $15 million) would also push some work off on me. I took it and did it because I had the time (I still always left on time) and because I liked the people there and thought I could work there for a while, and because I needed more money, but the only thing they offered me was a \"promotion\" to an even bigger grunt position that paid $16 an hour, worked loads of OT and who was basically the company kicking post. No thanks.'",
        "In response to 'I have been \"working to contract\" for years now. If something doesn't get done then it doesn't get done. Whenever I am asked to do extra during my prep I always tell my admin upfront the opportunity cost for taking away my time:\n\"Oh you want me to plc today? Well, okay then my lesson plans will be late this week, chief. Oh I need to sub a class? Sure thing bossman, but my grades aren't going to be turned in by the deadline.\"\nI won't be winning teacher of the year by doing this but who cares about that. I said enough is enough when my daughter was born several years ago and I was trying to hold her while grade papers. I reclaimed my evenings and weekends for myself and my family and I haven't looked back.\nIf all teachers would do this then it would force\nthem\nto change how the education system is operated.', a user said: 'This is where I'm at. I still do\nsome\nthings outside of contract hours because I'm not tenured and can be fired, and my state doesn't have\nquite\nthe shortage that others do, especially in my content area. So I do grade some over weekends and I stay late a couple of times a week, but other than that... I'm no longer volunteering to chaperone. I'm not going to take on additional duties. I will take my laptop with me to lunch duty and work while I stand there for over an hour. I take my laptop during roaming duty (literally walk around the school for an hour) and post up somewhere and work. I leave as soon as I can and if that means I only have the next day planned, so be it. I have summatives from last month that aren't in the gradebook because I haven't had time. I had Covid for a week (that I got at a fucking pep rally at school) and didn't do a goddamned thing. I've had residual effects from it and have been really fatigued, so I haven't gotten to it. I used to work as a para and work an additional job and I'm STILL more exhausted coming home every day from a full time teaching job than I was as a full time paraprofessional and doing an additional part-time job every day. I'm just really over working harder than literally everyone I know, with more experience and qualifications, and STILL having to put gas on my credit card at the end of the pay period.'",
        "In response to '“Act your wage”', a user said: 'This is my favorite one.'"
    ]
}