{
    "username": "diktat86",
    "contributions": [
        "In response to 'Original Post: Quietly Quitting and Lying Flat I have wondered over the years why we are constantly told to work harder, work harder, but then things don't always get any better. But it's super-important for Singapore to be competitive against every else, right, so we got to work hard.\nBut I also see that in other parts of the world, there is a bit of a backlash against this kind of idea:\nquietly quitting\nand\nlying flat\nWhat is your opinion?', a user said: 'Here's something that I found pretty enlightening - the\nGervais Principle\n.'",
        "In response to 'I have absolutely no idea what the entire article is getting at. Mind elucidating?', a user said: 'There are 3 types of people in an organisation:\nSociopaths: CEO types who drive an organization to function despite itself\nClueless: middle-management, they are loyal to the firm and believe that hard work is always rewarded\nLosers: low-level workers. They are \"losers\" not in the cultural sense but the economic sense as they are not compensated in proportion to the value they create for the firm.\nSo OP said\nI have wondered over the years why we are constantly told to work harder, work harder, but then things don't always get any better.\nApplying what was said in the article, this seems like a message that the Sociopaths and Clueless would push (the work harder part), but things don't get better because ... there is no reason for Sociopaths to make the lives of anybody better.\nI liked this part of the article a lot:\nSo why is promoting over-performing Losers logical? The simple reason is that if you over-perform at the Loser level, it is clear that you are an idiot. You’ve already made a bad bargain, and now you’re delivering more value than you need to, making your bargain even worse.  Unless you very quickly demonstrate that you know your own value by successfully negotiating more money and/or power, you are marked out as an exploitable clueless Loser.\nThis article really resonates with me because I don't have the ambition, talent or energy to be a Sociopath or Clueless, and I find that the best position for me is to be the most efficient Loser I can and optimise my workload for the best work-life balance (heavily favouring the \"life\" side of the balance).'"
    ]
}