{
    "username": "DJ_Reasonable",
    "contributions": [
        "In response to 'I prefer the term \"acting your wage\". You get what you pay for, right?', a user said: 'Nope. Act with integrity no matter what. The real wage of a job is the person we are able to become because of it. But this applies to them also! Everyone has a responsibility to be their best and most ethical/ true self, and the whole universe is waiting for THAT. Underperforming the expectations of a job doesn't help you. Do your best every day and then switch to something better when you can. You agreed to the wage, now do your best! Do exactly what's expected of you, nothing less, but don't put your neck out either to do more than is required. And get more education if you can, and brush up your CV/Resume until it shines to find another position + get more education if need be. Good luck!'",
        "In response to 'You're contradicting yourself in assuming that acting your wage is underperforming, yet say to do what is expected and not put your neck out? The whole point of this is that people ARE doing exactly what they are paid for, and not more.\nThe issue is the expectation of managers and business owners that they will get free labor or extras by asking people to do things. I'm not saying that you can't do things like that, based on your relationship with your superiors, but the reason people are refusing now is how often that is exploited and people are sick of it. And I don't blame them for being sick of it, when productivity has been soaring and all the benefits have gone to the wealthy.\nAs for me, I'm actually a small business owner so I'm in a good position. But I know what being a wage slave is like. I also know how hard it is to get out of low paying jobs, no matter how good your resume is, and how difficult it is to afford education. Hard work is necessary, but not sufficient. Anyone who tells people to work harder doesn't understand that.\nPeople have to exist in the current lousy paradigm, but there is nothing wrong with them pointing out the flaws of the system and trying to change it for the better however they can. I am all for workers refusing to give more of themselves than they are being paid to do. Doing well at your job isn't a guarantee to get a promotion or a raise. Workers have been meeting the demands of management and owners for decades. It's time that some of the workers' demands are met.', a user said: 'Nope. What the OP lacks is the correct attitude orientation toward work itself, they by their own admission could do better but are throttling their performance. I said don't do more than what's asked. Those are not identical statements. The reason you do your best is not for a promotion or raise. It's because doing your best makes you the best person you can be. I don't disagree that people can point out the flaws in the system, and they can also do whatever they want. But it won't help them. The extrinsic rewards isn't the only reason for doing things. If it was why on G-d's green earth would there be teachers?'",
        "In response to 'The way teachers are being treated, soon there won't be any.\nThere is also a difference between having pride in your work, and allowing yourself to be exploited. In your previous comment you said\nUnderperforming the expectations of a job doesn't help you\nAnd I think the issue is that you are assuming that one's best is the requirements/expectations of the job, and not more. However, in the last several decades, requirements for hiring have become ridiculous, as have expectations of workers. Would you perform your best, if that is above and beyond what you are being paid for, and you are neither compensated nor recognized for it? If you are required to have a college degree to be a first level call center rep, you will get no recognition, support, or benefit from being a better worker than the job demands.\nMonetary compensation doesn't have to be everything for someone who cares about their job. But it shouldn't be to the point that people are exploited for their love of a subject, like teaching. And monetary compensation should be reasonable, in the expectation of allowing people to live a decent life.\nI think you're pushing the idea of \"hard work is its own reward\" and honestly, for most people, it isn't. And it shouldn't have to be. That idea is used to dismiss people who seek compensation for quality work, along with the idea that they should be grateful for opportunities, or particularly for artists, for things like \"exposure\". It's really just a way that people have used to get out of paying what they should.\nI understand where you are coming from, and if the US wasn't what it is today, and so monstrously unfair to workers, I think you would have a point. But I hope you can see that the attitude of \"hard work is its own reward\" has been used for years to essentially steal the value of labor from workers.', a user said: 'Ok, ok. You have very good points and it's honestly a pleasure to read despite the fact that we aren't agreeing 100%. I guess for some people it's a good tack, and for others it's not, but companies should indeed work in the best interest of employees, and there should be a better corrective system in place to track the relationship between profits, wages, and real living costs against the \"power expended\" in a position. You're also right that the barriers to entry are ridiculous and keep people impoverished and also manufacture false stupidity as I've heard explained before.\nYou have many good points, that I agree with. You've changed my mind a little also. You have to admit though, that there's plenty of people singing the same type of song as OP that do NOT try to do their best. I've worked many places that people are being paid quite well for what they are doing, and they are the highest paid employees (as my current job) and yet it seems the higher they are paid the more they complain, singing the same song (we are overworked and underpaid). They're asking for compensation for their cell phone plans to take a call from their boss when someone needs to ask them a question about some work they left partially undone. These are some of the better cases.\nThere are plenty of people who just expect that the job should cater to all their needs before they've even proven themselves. And there are plenty of other bad attitudes toward work. Good hard work is healthy and good for our personal development. That's not to say that people are taken advantage of, but that's not the side of it I'm speaking to.\nAm I wrong in saying that there are a faction of people who claim they are being taken advantage of but they really just have a bad attitude toward work in general?'"
    ]
}