{
    "username": "Django117",
    "contributions": [
        "In response to 'as homer has pointed out doing a shit job is the american way. Quiet quitting is just gen z learning about not giving a shit about your job and giving it a cute name. Unions have been doing this forever, it is called\nwork to rule\nI think gen z needs to go watch the \"quiet quitting\" documentary, office space', a user said: 'Definitely not a name bestowed by gen Z or millenials. \"Quiet Quitting\" is a term introduced with malicious intent.\nWhen it comes to the origin of the term, it comes from an economist in 2009. The term is used as a sort of propaganda as many have chosen to not become engaged with the downward rat race towards burn out and abuse. But why was this the case now?\nAt least within the field of Architecture, what I saw was a massive shift in terms of how people thought about their relationship to their employers. Having seen people being so quick to be laid off after the pandemic started and how desperate the employers were to get people back once they realized the economy hadn't entered a recession, many who graduated were left feeling relatively apathetic towards their employers. This also created a massive power imbalance in the workplace which gave far more power to the employees than the employers, which hadn't been the case for years. As a result, many of the poor practices of employers were put on display and rightly criticized. There were new unions created, salaries raised, etc.\nSo why the big stink? Well, many employers who had laid off employees had created this imbalance of power which would ultimately hurt the company in the long run. How would they explain this to investors? Well, rather than owning up to their mistakes and mis-reading of the situation, they chose a different avenue: changing the narrative.\nThe first part of this was actually the attempt to rebrand what was happening as \"The Great Resignation\". This was the result of a few factors. Firstly, horrible conditions imposed by employers on the employees they retained throughout the pandemic. Second, poor wages. Third, an aging population within the workforce that left permanently during the pandemic. The narrative was that people are unhappy so they are quitting. However, the truth is that many employees simply sought employment elsewhere as almost all companies were understaffed.\nSo finally we reach \"Quiet Quitting\". Why has this been the new term used in this narrative struggle? It has several practical effects why it's being used. It derails discussions about fair wages/treatment of employees and refocuses it to the individual employees' choice to engage or not engage with work. Using the term quitting implies that the worker is the one engaging in a falsehood, rather than the company that exploited them. The term has been expanded and contextualized as \"Doing your job to the bare minimum, i.e. the exact job description.\" It's not enough that the employer would have just cause to fire the employee (they\ncould\nfire the employee, however without proper cause they would pay severance/ unemployment). It was also weaponized as a way to shame workers who refused to give up remote working. This is all compounded with general disillusionment with the system of sticking your nose to the grindstone for years all for the chance of getting a promotion and being able to make decent money. The American Dream, the corporate rat race, etc. are all antiquated means of motivating employees that doesn't work anymore as the statistics and realities of the situation have become laid bare across multiple rough economic patches for the lives of millenials and gen z.\nTL;DR: Quiet Quitting is a term coined by an economist from 2009. It is currently being used to construct a narrative that demonizes the worker who chooses to do their job and shame them into giving into their managers' demands whether those be taking on additional responsibilities or returning to the office.'"
    ]
}