{
    "username": "DKDamian",
    "contributions": [
        "In response to 'Beg to differ. Donald Trump made a lot of wild promises and it often wasn't clear how he'd get there. But a whole lot of non-vague things came out of his mouth and he definitely made it look like he stood for something--even if it was something awful and we Dems all know he'd change his song for bigger applause in a heartbeat. His base had a much clearer sense of his priorities than Harris's.\nAlso, Trump frankly has way more charisma than Harris and can much more easily string people along on his nothings. We need to stop pointing to Trump like it excuses our own deficiencies, that's just sad. It's like we're trying to get Americans to grade us on a curve and it's just getting embarrassing at this point. We need to start owning our own strengths & weaknesses already instead of pointing to the other side and making lazy excuses.', a user said: 'Yes. Trump worked a shift at McDonald’s. Harris had Beyoncé on stage. It was clear to voters who cared about their actually day-to-day needs. He understands optics and messaging very well\n(Not a republican, not American)'",
        "In response to 'And she seemingly couldn't bear to break from Biden as she saw it as a betrayal.\nI wish people said the quiet part out loud on this specific talking point. I don't think it's that she couldn't bear to break away from Biden because she saw it as a betrayal. It's more that Biden didn't tell her explicitly, \"do what you have to do to win; if that means throwing me under the bus; do it twice, just for good measure-- democracy is literally at stake. you'll get no pushback from my team.\"\nBut he didn't do that and I think absent his permission, there would've been Biden loyalists who would've skewered her for weeks on making a break from him and leak stories about how aligned she was with Biden and they are \"dismayed and shocked that she's now betraying President Biden\" and further would've flamed the fires of \"she's a flipflopper with no identity.\"', a user said: 'Where is her agency in all of this? Why couldn’t she say something like that to him - “Biden we are friends and colleagues and will work together effectively. But during this election I need to win. I will say x and y and z about your performance to create space for my victory.”\nShe had responsibility.'"
    ]
}