{
    "username": "dogfighthero",
    "contributions": [
        "In response to 'That's true. It's why the only person I know to have successfully been able to 'lie flat' ( for several decades now) is only able to do so because he has a safety net and a form of passive income anyway: he inherited his mother's apartment after she passed away.\nHe still lives in the old 3 bedroom private apartment (surrounded by the original yellowing paint, hideous brown and orange furniture, and original kitsch from the 70s). He occupies the master bedroom and rents out the two smaller bedrooms. He occasionally does some work, if he feels like it. And lives contentedly on the modest amount of money his work and rental income brings in. He's single (never married, and to the best of my knowledge, hardly ever dated), almost exclusively eats at home, and his main form of entertainment is either playing PC games or D&D all day.\nThe only time I ever saw him show any sign of regret for his lifestyle was when another member of our group of friends was getting married. The wedding was a modest but happy one (both bride and groom were divorcees, an older couple with children who were already in their late teens and early 20s) with a focus on good food and a small but close circle of friends. The groom was telling us where he and his bride would be spending their honeymoon, as their children and friends cheered them on, and our stay-at-home friend quietly commented that he always wished that he could have a family too, with a wife and children, and travel the world with his spouse. He didn't think he would want that someday but now, he felt drawn to it. But he knew he wouldn't have a chance to do that. He was too entrenched in his ways to actually seek out a partner, and he didn't have the money to go on holidays, let alone raise a family at his late age.', a user said: 'I honestly think that his whole inner being, that primal self which sets off alarm bells when one is setting on a questionable path, knows that this entrenchment is not a way of life.\nThis entrenchment is instead an orchestrated distraction, something that insulates and protects him from feeling the raw unblemished pain from the full awareness that he is completely disconnected from the way of life which he desperately craves and wholesomely wants.\nThe silent comment at the friend's wedding was everything but a silent one. It was him crying out in pain, in a fleeting moment of clarity.\nHow dare I assume to know so much about his inner state when I've never even met him? Because I too lived such a life.'",
        "In response to 'I saw a tiktok that says the most miserable people are those who are super lazy but very ambitious. Sounds like the friend\n/u/Lady_Appleby\ndescribed.', a user said: 'I.e. you have dreams of flight, but all you have are a pair of fried chicken wings.'",
        "In response to 'Here's something that I found pretty enlightening - the\nGervais Principle\n.', a user said: 'I have absolutely no idea what the entire article is getting at. Mind elucidating?'"
    ]
}