{
    "username": "Dogzillas_Mom",
    "contributions": [
        "In response to 'A bit of media literacy goes a long way. It's easiest to notice with passive language excusing police violence, then you start start to see\nhow the media often acts as stenographs for the powerful, instead of investigates their statements.\nThen you can see how even in critical pieces\neditors can frame headlines to remove media culpability\n. Soon enough you realize there are guys like\nKen Dilanian now with NBC News\nwho has been documented clearing articles with the CIA press team BEFORE submitting for editorial review.\nThere are plenty of examples of this-\nNellie Bowles recently wrote about the horrific state of homelessness and social disparity in San Francisco\n, but from the perspective of an\nheir to the family that owns a massive portion of water reserves in California, who also thinks homeless people are gross and ruining the city\n.\nYou get to a point where even the benign you can read between the lines. Go read\nThe NYTimes\ntalk about the \nhip, trad Catholic Dimes Square\nand do a word search for Peter Thiel, the neo feudalist blood sucking billionaire Silicon Valley power broker whose name is absent, despite buying up press from referenced podcasts like Red Scare to US Senate Seats with his former student and\nstenographer\nand Arizona Candidate Blake Masters.\nThis isn't a post saying \"don't read the news they're lying to you!!!\". If anything, my point is to read the news, specifically because if you read enough and know what to look for, you can start identifying how and why they are saying what they're saying. Start figuring out who is telling you the full story, or close to it. Start figuring out who is comfortable calling out their peers and their \"betters\", and learn to notice when these things are glossed over. Learn about reporters, understand who and where they come from. Learn who's reliable, learn who omits what information. It's useful to know when these sources are just pushing a capitalist narrative, and when they are actually reporting on the state of economy and how that will affect you.', a user said: 'I think the most important thing in your post should be underscored: READ the news. Do not watch network news, streaming “news” (Cheddar is not news.), or anything on YouTube. Those things are not the news, they are vehicles for advertising.\nWhich, to be fair, so are newspapers. But this person is correct: if you read enough, you’ll notice patterns and you’ll learn to follow the money.\nThere is one newspaper in the US that I am aware of that is NOT owned by a giant corporate conglomerate such as Knight Ridder, Time Warner, etc. it’s the Tampa Bay Times and it is owned by a private, nonprofit educational organization dedicated to integrity in journalism, called The Poynter Institute. Seek out sources like that, where the content isn’t held hostage by shareholders.'",
        "In response to 'Original Post: Quietly quitting When I first heard the term 'quiet quitting' I needed to understand more of what that meant. Now that I know, I think that's me right now.\nI've been working the same job for 10 years at a major global electronics company, a name all of you would know instantly. It's a good job, it pays well, it's low stress with great benefits. I am good at what I do and my co workers are cool.\nAnd I don't give a fuck anymore.\nI stopped trying to advance. I stopped going the extra mile. I stopped being the one offering input at the weekly meetings. It just doesn't get me anywhere after all these promises of working your way up the ladder.\nI realized I hit a peak a few years ago and no matter what I do, or how hard I work, it doesn't matter. Upper management are mostly ambitious borderline sociopath MBA career climbers who are all young enough to be my children. They all give a creepy vibe almost like a politician who acts like they care about you, then they talk shit behind your back.\nSo I still do my job but I do the minimum amount required not to be noticed. I don't report errors on our website, I don't correct people when they are wrong. I just don't, period. The biggest thing that put a target on your back here is attendance, like even clocking in 1 minute late gets you on the tardy report that goes out once a week but I never have a problem with that, and quite honestly it blows me away how many co-workers just can't seem to get here on time because we aren't in a giant metropolis with lots of traffic. Usually the younger co-workers are the late one.\nI am in my early 50s and I've spoken with my immediate supervisor who is two years older than me about this, and we're both in agreement that we're too old and lazy to want to start over, so we'll just coast here as long as we can.\nAnyone else feeling this?', a user said: 'I am right there with you.\nI think turned the corner when I had a discussion with my manager for my annual performance appraisal. Exceeds was a 5% raise, Meets was 3%, and needs improvement =fuck you, update your resume.\nI always get Meets and as a former manager, I realized that probably 80% of us get Meets. So I asked, (without saying whose dick do I need to suck) what I’d have to do to earn exceeds. The answer amounted to about 20-30% more time and work. For 2% increase, which works out to like $30/paycheck. You want me to work 60 hours a week for $30? You can fuck all the way off with that shit.\nI do the bare minimum to, as you said, skate under the radar. I meet or exceed deadlines, take accountability for mistakes, show how I’m taking steps to avoid repeating them, and oh yes, it’s all about that time sheet, so o work from home and stay logged in an extra hour every day. To account for lunch.\nI could make a lot more money at some other job, but I’m in pretty decent financial shape. Not great, not super wealthy or even what I’d call well off, but there is enough for me. I have enough. I am enough. A bigger house won’t make me happier. (I’d like to downsize because even my modest 3/2 cottage is too much for me to clean.)\nI just wanna sock away as much moolah as possible and retire as soon as possible and make art all day.'",
        "In response to 'The ability to skate under the radar is probably what is going to keep me in my job for the long haul (I’m a late Gen Xer, so I have years to go until retirement, sadly.) I could try to go elsewhere and make more money, but they pay me a comfortable salary for relatively low stress work. I never work past 5 or on weekends. Any other job in my field that pays my salary or better is frankly probably going to expect a lot more of me, like possibly managing others (no thanks) or just taking initiative and being more innovative than I currently am. I don’t have the energy for it. I can’t imagine how I’ll feel in another 15 years if I feel this way now, but that’s a problem for another day.', a user said: 'I feel exactly the same way. I probably could make more money but then I’d have to work a lot harder. I’ve been in this gig for 20 years (incredibly) and I can sort of phone it in. 80% of my work, I can do in a fraction of the time allotted and I don’t really have to think too hard. The rest of my day is mine. I got a puppy after covid/work from home and this dog has never been left alone in a house all day in his little life. He’s also the best behaved dog I’ve ever had because we are together 24/7.'"
    ]
}