{
    "username": "doktorhladnjak",
    "contributions": [
        "In response to 'Quiet quitting DOES NOT EXIST, people are doing their job and just their job. People care way more about the separation of their personal and work life', a user said: 'It does exist but we used to call is coasting. Same phenomenon, new name, I guess'",
        "In response to 'This is at-odds with the state of employment in tech. Most fresh grads I know have had a terrible time trying to find work, with unemployment periods beyond 6 months not unusual.\nAm I biased in my sampling or is there a way to reconciled these findings with their experience?', a user said: 'There are specific factors at play in the tech industry right now that more severely impact new grads.\nThe rise in interest rates is shifting many companies away from a focus on growth to a focus on profitability. That’s lead to a reduction in hiring and an increase in layoffs.\nIdeally, most tech companies would rather not hire entry level at all because new grads require a lot of supervision and mentoring to be highly productive. Finding enough experienced software engineers is difficult and expensive though.\nIn high growth environments, most companies adopt a structure of a few experienced engineers directing and mentoring a set of junior and new grad engineers. Some companies have taken an alternate approach. Netflix only hired experienced people and paid them a ton. Even they have caved to hiring juniors now because ultimately it’s a cheaper model.\nAs growth is being less emphasized, many companies don’t need to hire as many new grads or any at all. They can achieve their goals with an existing, on average more experienced work force.\nFor companies that still do want to hire, there are more experienced engineers on the market than before and compensation has come down a bit, making it cheaper and easier to just take experienced hires.'",
        "In response to 'so is the takeaway that while we're in a \"tight labor market\", it doesn't apply to tech jobs?', a user said: 'Especially for new grads in tech jobs'"
    ]
}