{
    "username": "Downwhen",
    "contributions": [
        "In response to 'It feels really weird in the corporate world right now. My company is making record profits but is cutting costs wherever they can. We had layoffs, and benefits have been reduced significantly, all while our sales have been growing exponentially.', a user said: 'Same. 3 years at J2 doing medical capital equipment sales. Fortune 500 company, public. We've been hitting our numbers and had no reason to think anything was amiss. Was told a month ago that they are doing a reduction in workforce, \"realignment\" and other corp speak. I was in the second round of layoffs.\nHave been applying for another J2 since then, it's been weird - tons of open positions, but no callbacks or rejections. I suspect it's like my (former) J2 - they are leaving the jobs open but internally they have a hiring freeze. From the outside they have open jobs and are hiring, internally they aren't interviewing anyone right now.\nIt's really weird.'",
        "In response to 'Same here.  Major Fortune 500 company.  My circle of me and another 100 or so developers have constantly out performed, met insane goals, over delivered, and met every single crazy idea or switch this company has done the past year and a half. About a year and half ago the company decided to just put the pedal to metal on everything.  We handled it, expecting it to calm down...\nUpper management has been saying how great everything has been going and how impressed they are with us in the face of these radical changes, yadda yadda.  The highest productivity our software division has had ever.  Oh, we know we are under staffed, but no more hiring until mid to late 2024.  Oh, and we are restructuring, for the third time in 4 years, changing teams and responsibilities around and bringing more people back to office, because \"We are always looking for ways to improve.\"   What?  Nothing makes any sense.', a user said: 'Oh man, I literally just\ncommented this\n, something similar at my (former) F500.'"
    ]
}