{
    "username": "Dr_Rev_GregJ_Rock_II",
    "contributions": [
        "In response to 'Original Post: Quiet Quitting is the only response acceptable to Quiet Firing [External Link]: https://i.redd.it/1xcuh5fqr5j91.jpg', a user said: 'In retail, \"Quiet Firing\" happens all the time. You don't like the employee for whatever reason, you just schedule them little to no hours until they leave. I've seen it happen so many times.'",
        "In response to 'I gave a three weeks notice once. Manager didn’t schedule me another hour after that conversation. I know it’s a little different but in the same vein. I still needed the hours and pay. I had planned for the money and to continue working for them until the pre determined date, plus a week of courtesy!', a user said: 'Absolutely trash. That's more than accommodating enough to your employer to give them that much time. It's almost like that have a shortage of good workers that want to work for them for that wage and condition'",
        "In response to 'Withheld my last check because I didn’t bring back a shirt. They didn’t tell me I had to turn it in if I left when they issued it to me. Let my buddies dog play with it, tug o war, shredded to pieces and covered with slobber, brought it in as is and got my check.', a user said: '\".... And if you'll note in the employment contract, which I agreed to.... 'All property must be returned upon termination'. Which I did\"'",
        "In response to '[Deleted or Empty Comment]', a user said: 'Oh that's such a disgusting phrase. I love it'",
        "In response to 'Think what you like about the phrase, but if it happens to you, you're entitled to unemployment.\nAnyone working in retail absolutely must keep this in mind if it looks like your manager is going to go this route. Don't let them know if they pull that stunt that you will be collecting UI. Stay quiet and let them do it, then collect UI while you look for something else.\n\"Never interrupt your enemy while they're making a mistake.\"', a user said: 'Honestly most times, they don't even look at it unless you really messed up. They just click the box and move on.'",
        "In response to 'Or if you're in some type of protected position, your boss just takes all of your responsibilities away.', a user said: 'If anything, they'll drown you in extra work to burn you out. Nothing says protected position like working you until there's nothing left'",
        "In response to 'Witnessed it myself at current Job with another coworker at one point she was getting closing shifts then opening shifts and so on.', a user said: 'I just got a few of those shifts, but it's because I'm dependable and they don't want to do it themselves.'",
        "In response to 'Well knock that off', a user said: 'Oh absolutely. I've already talked to my boss and explained that it's not happening anymore. If I wasn't there anymore, it would fall apart, and they know that. Gives me as much leverage as I can get'",
        "In response to 'My spouse worked at a place that had \"unregretted attrition\" as a goal for managers. As in, be enough of a jerk to people to make them leave.', a user said: 'Oh I've seen this too. You can't be up front about it though... You gotta be a slight jerk, but make it look like your trying to push and motivate them. Keep the workload building just slightly faster than their ability to do it, and backhanded compliment the little bit they were actually able to get through'",
        "In response to 'JFC this is my worst nightmare, what kind of psychotourture is this', a user said: 'As a retail manager, the tricks to force someone out are disgusting. I absolutely refuse to be that kind of manager though. I can't do anything other than protect my people from the higher ups'",
        "In response to '[Deleted or Empty Comment]', a user said: 'The only real benefit from working for a larger retail company, is that they want you to burn through your vacation and sick time as fast as possible. Then, if you want to call out... It's a question of being able to afford that loss in pay'"
    ]
}