{
    "username": "Dramatic-Ant-9364",
    "contributions": [
        "In response to 'At the end of her term she will be jobless and divorced. Onlyfans will be her public life.', a user said: 'I think she is on it now posting as \"Sarah Palin Light\"'",
        "In response to 'I know, there's still some dudes that haven't been with her yet so they wanna see how that milf got where she is in life.', a user said: 'Not too many.   The Town Plow.'",
        "In response to 'Blind Items Revealed #20 - Reader Blind\nCrazy Days and Nights / by ent lawyer / Jul 3, 2024 at 1:32 PM\nMay 1, 2024\nThis local A lister seems to have blown her chance of working with the A+ + lister by revealing an interaction with an animal. People are surprised that she would make an admission about something like this. Truth is she was advised to do this by the advisor she is having a very public affair with to make her look tough. The advisor did this deliberately to torpedo her chances as he will also be working with the A++ lister and does not want her around. The local A lister has grown a bit obsessed with the advisor but unlike the local Alister, the advisor is not willing to leave his partner and considers this only as an affair.\nGov. Kristi Noem/Donald Trump/Dog/Corey Lewandowski', a user said: 'Not saying she is sleazy but Krusti makes \"Handjob\" Lauren Boebert seem wholesome.'",
        "In response to 'She's an oxygen thief.', a user said: 'Let's get Bill Barr to prosecute her'",
        "In response to 'Saving up for her next surgical procedure. God only knows what she’ll have done next (or have done again).', a user said: 'Horns on her head'",
        "In response to 'Original Post: Noem quiet quitting social media? Just read this and I see the same thing...', a user said: 'Krusti,\nI'm gonna miss you (just like you missed Cricket but didn't).\nNow get back down in the pit where you belong.'",
        "In response to 'The ten thousand dead horses y’all are beating aside, what really is she doing? Has any announcement been made? Is she moving to other platforms?\nEven if she’s not the VP pick and I highly doubt she is, she is responsible for gubernatorial duties until January 2027. Whether or not you agree with or like her, these pages are made to support her message as governor and whatever type of official statement she sees fit.', a user said: '\"message\" or massage?'"
    ]
}