{
    "username": "drearyriver",
    "contributions": [
        "In response to 'my bosses have flat-out told me that overperformance has become my new baseline\nFirstly, accept that as angry and let down as you feel, some of this is your fault, too. You continued to reward a company that didn't value your efforts by going above and beyond. As a direct result, scaling back your efforts is going to be incredibly obvious.\nSo, what do you do? Lean in. It's going to be obvious anyway, so acknowledge it.\nBe preemptive. Start planting seeds when talking with others:\nI'm so swamped this week, I don't know how I'll get it all done\n,\nI'm really spread thin right now\n,\nI'm buried in all these projects, I can't wait for the weekend\n. Get the jump on any disparities between how you used to perform and how you'll be performing moving forward.\nBaby steps. Don't go from giving 110% to 50% because that's a great way to label yourself a flight risk. Instead, drop to, say, 90% one week. Back up to 95% the next. 85% the week after that. Starting chipping away bit by bit, not all at once. Establish your output not as \"guaranteed excellence\" but rather \"guaranteed competency.\" Sometimes you get a lot done. Sometimes you don't. You're not inconsistent, you're human.\nDeath to letting them use you as your own success metric. When you are inevitably asked about these changes to your output, make sure your\npeers' output\nis the comparison factor. Not past you. If they say, \"Your numbers this month compared to your numbers last month don't look good\" swiftly redirect to, \"My numbers this month are in line with those of the other ICs.\" The definition of success can't be different for you than it is for those at the same level/pay rate.\nWhen you distinguish yourself too finely from your peers, you give your employer license to treat you differently. This distinction feels great when the praise and accolades are being heaped on, but when you realize it's nothing more than lip service, the resentment starts to set in. That's what you're feeling right now and that's what you're trying to mitigate by dialing down your efforts. Remember that. The goal is to protect yourself, not to punish your boss/colleagues/whoever.\nGood luck on the job hunt. I hope you find something soon and don't need to do all of this.', a user said: 'Best response right here'"
    ]
}