{
    "username": "dredgedskeleton",
    "contributions": [
        "In response to '“It’s on my advisor to think about what I can do to still get this degree”.\nI’m going by to plainly tell you that you are responsible and accountable for your own outcomes. If your words are true, your advisor is not only completely absolved, but also every future relationship where you blame your outcome on them. Professional and personal.\nIt’s fair to quit. It’s fair to decide something’s not for you. It’s morally reprehensible to blame that on someone else.', a user said: 'hasn't been my experience but based on content from this sub, it's fairly clear to me that many advisors are the precise reason certain students fail at obtaining their doctorate.'",
        "In response to 'FWIW, I think the PhD sometimes comes with high stress situations that distorts people's evaluations. I've seen a number of people blame advisors for things that fell squarely on their shoulders. I can't even imagine how a reddit rendition of their situations would've sounded from them.', a user said: 'but you can't deny the probable existence of a toxic advisor -- no need to strawman the idea'",
        "In response to 'In this sub, advisors are a primary reason students are miserable. At some point this became a rant channel. But to say advisors are the reason students fail to get a doctorate is absurd because it shows no personal responsibility.  Quit, change advisors, change schools, etc. it’s the students degree to earn, and putting the lack of a degree on someone else just sounds entitled as hell.\nEveryone with a modicum of intelligence can understand “I wasn’t going to succeed under advisor x” and at the same time understand “and I decided to quit and not try again” with full empathy. Just don’t turn it around on the advisor as why you couldn’t get a PhD in your overall life.', a user said: 'lol ok -- \"everyone with a modicum of intelligence\" can tell when someone is shoehorning a condescending attitude into an otherwise civil convo.\nas I said, it's not my experience. I do my PhD part time while working in tech and find it fairly chill. I think very bad advisors can trigger mental health episodes that can ruin someone's PhD experience. I think it's weird to say that everyone has the opportunity to overcome a toxic advisor -- that's like saying everyone can overcome an abusive boss. it's a narrow view.'"
    ]
}