{
    "username": "Dry_Accident_2196",
    "contributions": [
        "Anyone Ever Quiet Quit a Trip? This has happened probably three times where I get close to the end of a trip and just become over it all and just end to get back home (the US). I don’t want to visit another church/palace/museum, I don’t want to wander anymore (my feet hurt). I’m tired of eating out and just done with it all. Doesn’t mean I’ve had a bad time, but I’m ready to be back in my comfort zone and bed. So when this feeling hits. I sort of find myself shutting down.\nThen, I feel guilty because I’ve flown across the world to be in a city people dream of visiting and I’m not soaking in every moment. I will say when my social connections are low, this quiet quitting happens faster. But despite 100 museums and sites. I have no energy to see anymore.\nHas anyone else experienced this?\nEdit: I’m trying to read all of these responses, on touchy airplane WiFi. But thank you for your responses!",
        "In response to 'You need to have \"weekends\" while travelling.\nTake a day or two off! Just hang in the hotel and watch TV, lie on the beach, sit in a cafe for 4h reading a book.\nIt's your holiday. The point is to do what you want to do, not what you\nshould\ndo.', a user said: 'Very good point on weekends I haven’t considered.'",
        "In response to 'People were shocked one time when I went to London for the umpteenth time and got so sick of sightseeing that I just stayed around bought some groceries and spent tone day watching British television. I had the most enjoyable day and it help recharge my batteries.', a user said: 'This is the first trip where I just leaned into daily naps and long mid-day baths. Thank goodness I splurged on a nice hotel room.'",
        "In response to 'You feel guilty because you feel you are not maximizing your time in the foreign country, but you should not be framing travel that way in my opinion. You also shouldn't push yourself to the point of burnout. What is your purpose for traveling?\nI love my do-nothing travel days. I spent an evening in my Tokyo hotel flipping through TV watching a sumo wrestling match and eating reheated grocery store food. In Rome I thought the weather was too stupid hot and took an afternoon just lounging in a shady, tree filled park. In Saigon I visited the same cafe three times because it was nice enough and I couldn't be bothered to try and experience something new. It was comforting to go to a familiar place and the barista gave me a big smile when she recognized me.\nThose experiences were just as if not more important and memorable to me than the main attractions I visited. Just try to have a good time according to what you like to do and take care of your needs.', a user said: 'Yeah, I need to re-evaluate what I’m doing and why. I sort of go just to go places. Check them off my list. I’ve ran out of places I had a lifelong yearning to see.\nI’m very fortunate that I can do this Kaiser travel wherever I want once or twice a year, but i think I’ve gotten caught up in the lists more then the places themselves.'",
        "In response to 'I think that a lot of first-world / developed country residents, in particular Americans but not only Americans, have in recent decades been sucked into a weird maximization/optimization trap. Like, everything you do in life needs to be optimized in some sense, without attention to exactly what is being optimized overall. Specifically, over-tuning for efficiency means reducing resiliency to the point of non-existence.\nIn practical terms, this means we end up in situations where we optimize for things like seeing as many sights / having as many unique experiences as possible while traveling, at the expense of stuff like just vacationing or hanging out in a different place. I have always been by nature opposed to this kind of life so I guess I can see it from the outside.\n(OP, note that in no way am I criticizing you: I’m just reflecting on the larger context that seems to be producing so many experiences like yours!)\nIf we leave where we live and also leave behind our optimization mentality, we may find ourselves not only having more interesting experiences while traveling, but coming home refreshed and potentially with new habits we can continue in our home life.\nA lot of other people have made great suggestions, like stay in one place for a while, do day trips rather than changing your lodging too often, etc etc.\nI want to add one thought: when you’re staying somewhere for several days or longer, prioritize becoming a “regular” rather than trying every restaurant. Once you find a place you like, just eat there for the rest of your trip.\nI honestly think, too, that people who go back to the same place year after year have experiences that are worthwhile in ways that those of us who only chase novelty don’t experience.\nSo maybe pick one place you absolutely love, and put that on your list of travel destinations every year. In particular, stay in the same hotel every year, better still, book your next stay when you’re on your way out. I’ve never been in a position to do this, but I do cherish the experiences I’ve had of revisiting the same places repeatedly over the years.', a user said: 'Oh, how I love this suggestion (and took a screen shot). I realize I’m something needs to change on my end because I used to love traveling but now I’m becoming more and more numb and jaded. I certainly lack familiarity constantly going to something new 3 times a day. Your suggestion sounds like it would help ground me a bit cause I’m just out here floating around by myself in these fabulous cities but not connecting.\nSo, thanks'",
        "In response to 'I was in the UAE in August and the heat eventually wore me out so I turned my vacation into a sort of staycation within the vacation. I'd sleep in and order room service. I'd go get a massage and then have a pizza delivered to break up the monotony. I used to travel until I dropped but that trip made me realize how important it was to recharge my battery before coming back to reality.', a user said: 'Yeah, I think my body is telling me it’s time to change my expectations of my go-go-go desires. I too orders room service two times on this trip. I was always one to eat out but I just stopped caring.'",
        "In response to 'Sort of.  I went to a big city, planning to have a fab city vacation, and a couple of days in, I realized I wasn't enjoying myself.  So I cancelled what reservations I had left and went to a national park a couple of hours away, and found that yes!  I needed nature time and not city time!\nThat's the beauty of solo travel, you can change all your plans on a whim, or skip all the history and culture you planned to see and go shopping, or just go home.', a user said: 'Maybe that’s what I needed. Time away from the city. Maybe I was overstimulated.'",
        "In response to 'In Bangkok right now after travelling for the past two months. This is exactly, 100% how i’m feeling right now. Occasionally I feel guilty about feeling this way but then I remember that it’s literally my trip and I can do and feel what I want. If I just wanna chill and not do anything for the last few days, i’m gonna do it. I’ve got nobody to please.\nHaven’t eaten any Thai food for the past few days either, just American fast food. Fuck it. My trip, I do what I want.', a user said: 'I wish I could do 6-8 week trips. But even two-weeks gives me the itch to head home.'",
        "In response to 'When traveling with kids, I plan a \"lazy\" day in the middle of the trip.  This gave them a chance to be kids and recharge.  This approach may work for you.  If you like to cook, rent a place with a kitchen.  Also, a Spa day has worked for my siblings.', a user said: 'I’ll try that next time. Maybe embrace my inner kid!'",
        "In response to 'If I'm travelling around a country (rather than just a single city visit), I always plan my trip visiting the cities first and finish off in the mountains or by the coast for this very reason, so I can kick back and chill out.', a user said: 'That sounds like a very pleasant way to manage those trips.'",
        "In response to 'Yes, several times. When I’m done, I’m done', a user said: 'Thank you, you get it. I just hit a wall and I’m ready to bounce on home.'",
        "In response to 'It usually hits me fairly early in the trip. Almost like “ok, I made it here and seen a few things. Ready to go home now rather than in x amount of days I still have.” Then I’ll just go sit out in a park and do nothing for a bit. Realize I didn’t come all this way just to hold down a bench and it inspires me to keep sight seeing. Funny though because I figured it was mainly me. Glad to hear we’re both traveling!', a user said: 'I ended up sleeping in till noon. Found a place that served brunch. Ate around 2pm and dragged ky butt to a museum. At one point on my 20 min walk to the museum I was admiring the surrounds. But the other half was mentally calculating the hours till I get to the airport.'",
        "In response to 'This was me in Rome, by day 3 out of a 5 day trip I was done ... was just counting down the hours before I could get out of there, while all the \"OMG IM SO JEALOUS\" messages were coming in on my IG stories. But I had also done London, and Paris before that for 8 days.', a user said: 'Funny, I’m talking about Rome, lol. But this was my only stop/destination.'",
        "In response to 'Never have been in a hurry to get home….', a user said: 'Haha. I was once that way, but now live somewhere I love so going home is always a happy thought. Now, if I’m looking at a tropical beach with white sand and crystal blue water, I may want to pause on that trip home for another day or three!'",
        "In response to 'Once this happened.  At the end of a long Mediterranean cruise with a lot of stops, I was just over it when we got back to Athens.  We went to the Acropolis and the museum.  I didn’t want to see anything else nor go shopping.  I just wanted to go home.  It was a fabulous trip and stopped in so many places that were on my bucket list.  However, I now know that 3 weeks is just too long for me.  Getting back to the USA from Europe is a 24 hour ordeal and that is exhausting as well.  I couldn’t quit the trip because I had paid for round trip air fare.', a user said: 'Sounds like a great trip, but would be too long for me as well.'",
        "In response to 'I decided not to do G Adventures / Intrepid type trips anymore because the last two I went on I really hated the structured itinerary and really didn’t care for the other people in my group. The pace was too slow and the optional activities offered were a waste of time/money (you were oftentimes pressured into them by the trip leader). Thanks for putting a label to this… I acknowledge that it’s a privilege to be in this position… total first world problem. I do miss the wonder I used to feel when seeing something amazing for the first time. The threshold is very high now for me… sad really.', a user said: 'Some people hated the term but I’m like whatever, it fit what I felt.'",
        "In response to 'Absolutely. I was just in Jordan and in Egypt and quite quit in Egypt. I was on a tour with my father and we used a company that pretty much held our hands the entire time. Jordan was the first 8 days which was more or less fine because we had enough down time to just kick back. The Egypt trip was very busy and we combined three other tours together into one gigantic tour group. Also our tour guide was insane and had a reputation to uphold. We were overseas for 28 days and after day 12 I was done. At day 25 I literally stopped going on tours and just stayed in the hotel and went to the beach. I didn't even go to dinner with anyone anymore. I was just completely over the group.', a user said: 'Oh yeah, I understand the feeling. I did a tour in South Africa that was good but me and the tour guide had tension from the start. You know that simmering friction that goes unspoken. Safe to say, I wasn’t unhappy when we parted ways at the end of the tour. Saw another out group form the same company. The vibes, joy, and fun from the guide to the group gave me major FOMO.'",
        "In response to 'No', a user said: 'Haha. May the odds continue to be in your favor!'"
    ]
}