{
    "username": "dsklerm",
    "contributions": [
        "In response to 'Replace \"minimum required\" by required alone and it no longer sounds like employees are underperforming or unprofessional. Doing the required tasks and going home is being professional.', a user said: 'A bit of media literacy goes a long way. It's easiest to notice with passive language excusing police violence, then you start start to see\nhow the media often acts as stenographs for the powerful, instead of investigates their statements.\nThen you can see how even in critical pieces\neditors can frame headlines to remove media culpability\n. Soon enough you realize there are guys like\nKen Dilanian now with NBC News\nwho has been documented clearing articles with the CIA press team BEFORE submitting for editorial review.\nThere are plenty of examples of this-\nNellie Bowles recently wrote about the horrific state of homelessness and social disparity in San Francisco\n, but from the perspective of an\nheir to the family that owns a massive portion of water reserves in California, who also thinks homeless people are gross and ruining the city\n.\nYou get to a point where even the benign you can read between the lines. Go read\nThe NYTimes\ntalk about the \nhip, trad Catholic Dimes Square\nand do a word search for Peter Thiel, the neo feudalist blood sucking billionaire Silicon Valley power broker whose name is absent, despite buying up press from referenced podcasts like Red Scare to US Senate Seats with his former student and\nstenographer\nand Arizona Candidate Blake Masters.\nThis isn't a post saying \"don't read the news they're lying to you!!!\". If anything, my point is to read the news, specifically because if you read enough and know what to look for, you can start identifying how and why they are saying what they're saying. Start figuring out who is telling you the full story, or close to it. Start figuring out who is comfortable calling out their peers and their \"betters\", and learn to notice when these things are glossed over. Learn about reporters, understand who and where they come from. Learn who's reliable, learn who omits what information. It's useful to know when these sources are just pushing a capitalist narrative, and when they are actually reporting on the state of economy and how that will affect you.'"
    ]
}