{
    "username": "DweEbLez0",
    "contributions": [
        "In response to 'Original Post: Bill Maher being very anti WFH and against quiet quitting the past year [External Link]: https://i.redd.it/6nykqc1bx0pa1.png', a user said: 'We, “us humans” need to stop working for billionaires and the rich and for profits, and instead should be working and using our skills and labor to make what planet we have left livable. Money doesn’t provide any benefit to anybody when it just sits there and is used to make the wealthy more wealthy. Capitalism doesn’t help, it hurts, it becomes the only thing worth living for which is really not much when it has no benefit to anyone other than those who have the most.'",
        "In response to 'We're already doing cable again. At one time the big problem was cable companies bundling the one chanel you wanted with 23 junk channels (and usually 2 or 3 yet another shopping channels) and charging for all 23 rather than offering alacarte.\nThen streaming services came about offering everything for less than the cable company charged and without commercials.\nNow we have an ever growing number of streaming services offering an ever shrinking catalog of shows (as a bundle). And commercials have gotten back in as well though (for now) you can pay extra to avoid them.\nSo the big change is that now instead of adding package XYZ for that one channel you want it's adding streaming service XYZ for that one show you want.', a user said: 'This is why I quit watching TV years ago. Sure I’ll watch it at random occasions at relatives houses or whatever if that’s what we’re doing, but at home I have my hobbies to keep me busy. Fuck it, I’ll turn my hobbies into a business!'",
        "In response to 'are you meeting your goals\nAlso your goals are nebulous bullshit related to our overall company/division success, not actual tangible goals related to your job specifically', a user said: '“My goals are met. But you seem to not like it, and I can’t fix your problem with that.”'",
        "In response to 'this is how i operate at work. i make just enough to keep my head barely above water, with essentially no capacity to save money at all.\n\"the only reason i'm here is because of the pay, the company has negotiated with me and with the union to make that pay as low as it can get it, and so the result is my income is barely adequate. in return,\nso is my work.\n\"', a user said: 'My pay is as low as they can get it, so my work is as low as I can get it.'",
        "In response to 'Because people gotta eat. The vast majority of people are working for far less than what their time is worth.', a user said: 'They always Market, “Well if you won’t do it for $$ then I’ll find someone who will. I’m not paying you $$$.”'",
        "In response to 'I’m happy to go above and beyond for managers willing to do the same for me, but I’ve wasted enough years toiling under people who wanted to squeeze me dry while insisting they couldn’t afford to pay me better. If the boss makes it clear there’s no reward for working hard, then I’m just working hard enough to not get fired.', a user said: 'Okay, but do they pay you above and beyond?'",
        "In response to 'Original Post: \"Quiet Quitting\" is a bullshit gaslighting term. Don't let it become an acceptable term [External Link]: https://i.redd.it/fwj0foce59k91.jpg', a user said: 'Yeah fuck employers who manipulate workers.\nIt’s not a strike or protest, it’s giving employers what they paid for.'",
        "In response to 'Honestly the ultimate goal is finding jobs that pay you to do barely any work, and just stacking those on top of each other until you have enough to possibly afford an actual life.\nUntil then, it’s slaving away until death', a user said: 'The problem is employers catch on to this and invoke their insecurities into revealing this to exploit workers so that their efforts are solely into their company.'",
        "In response to 'Original Post: Forget quiet quitting. Millennials and Gen Zers are quietly working second jobs as they live paycheck to paycheck [External Link]: https://fortune.com/2023/05/19/quiet-quitting-side-hustle-second-job-millennials-gen-z-paycheck-deloitte/', a user said: 'Quiet exploitation = Quiet multiple jobs\nThis cancels out capitalism.\nFuck Capitalism'",
        "In response to 'only 2 jobs? i grew up in a trailer. I just turned 40, and still working 3 jobs. i was finally able to purchase a home, but still not sure i will ever be able to retire comfortably. i probably work 80 hours a week. my third job is sales, hopefully i can perform well enough to replace my corporate 9-5 job.', a user said: 'On a serious note how do you work 3 jobs and sleep?\nIs like each jobs 8 hours = 24 Hours and you manage to sleep during some of the tjme?\nOr is it full time and partial for the others so y can actually sleep?'"
    ]
}