{
    "username": "eac555",
    "contributions": [
        "In response to 'Original Post: How’s this for quiet quitting? I’m fully remote but have to go to occasional meetings etc.\nI compressed my hours to 4 days a week.\nI start at 7, turn on computer get teams on busy 24/7 use one of my many methods to prevent teams going away.\nGo back to bed until about 10am.\nCheck emails and only reply if necessary while eating breakfast.\nScroll Reddit/social media/utube.\nLunchtime is 12-2 so go to the gym but only “take” 30mins lunch.  Take phone with teams on and go away/busy every 10-15 minutes but never actually confirm when I take my 30 minutes.\nDo chores around the house and garden 2-4.\nLast hour do some work.', a user said: 'This is why they want people back in the office.'",
        "In response to 'I disagree.\nThis is how they try to justify RTO, but it's not the cause.\nOP is in one of two scenarios, both tied to the fact that companies use straw man arguments instead of disclosing the real reasons of RTO:\nThe work he performs in the last hour is enough to clear his backlog -> he's doing what he's been employed to do, so if he's mismanaged it's on the company;\nThe work he performs in the last hour is NOT enough to clear his backlog -> company has no adequate system in place in order to assess employees' productivity, either in or out of office.', a user said: 'I’m in office. My job can’t be performed at home. I work 12 hour shifts and rarely have enough work to fill that. Sometimes I actually work maybe only 2 out of that 12 hours. But I’m there if needed which is the nature of my job and management knows that. It’s been like this for many years. It’s pretty nice.'",
        "In response to 'Original Post: Gen Z isn’t quiet quitting. They’re rejecting outdated leadership I tend to agree. How about you ?\nhttps://www.fastcompany.com/91281732/gen-z-isnt-quiet-quitting-theyre-rejecting-outdated-leadership', a user said: 'Gen Z really doesn’t even have much work experience yet.'",
        "In response to 'Can we stop calling doing the job you are paid to do \"Quiet Quitting\"?  That is just marketing capitalists are doing to make it out to be something bad.\nYou are just doing exactly what they are paying you to do.', a user said: 'I’ve called it “staying in my circle” for many years. I do what I’m paid to do. Was once looked upon as having a bit if a bad attitude for this. But I have always done MY job very well and was never punished for staying in my circle. Have had more than one manager over the years say they finally understood staying in your circle and it was a good thing. I have been offered salaried management positions over the years but declined them. Saw the ways it changed people and how they were used and abused.'"
    ]
}