{
    "username": "ebeth_the_mighty",
    "contributions": [
        "In response to 'I have never heard it in a negative light. Quiet quitting just means working your intended hours and your intended job. Whatever you call it, teachers need to start doing it.', a user said: 'I prefer the phrase, “act your wage”. Quiet quitting sounds like I’m not doing my actual job.'",
        "In response to 'I only have the next day planned\nGranted I'm only in my second year, but I've literally never had more than the next day planned.  Ever.', a user said: 'I’m in year 14. Next day only, dudes!'",
        "In response to '[Deleted or Empty Comment]', a user said: 'About 10 minutes. Except for the course that’s new to me this year.'",
        "In response to 'Original Post: Is anyone “quiet quitting” this year? I’m curious if anyone else is doing this and how it’s going. My mental health was a mess after last year and my home life is messy— my daughter has a chronic illness that is not in remission. I decided at the end of last year that I was done overextending myself for this job.\nSince then, I’ve just said no, over and over. Can I help take tickets at a football game for four hours and $30? No. Can I lead a PLC? No. Can I mentor a new teacher for an extra plan bell? No, because I’ll just get called to sub for free every day— learned the hard way last year. I’m contracted to work from 7:45-3:15 and so that’s when I arrive and when I go home. If I have to stay extra for any reason— like my daughter’s late practice— I watch Netflix on my school computer and get a Pepsi.\nIt’s been a real relief so far— knowing there’s no pressure for what else may be lurking ahead. It doesn’t matter, because I’m not doing it anyway.', a user said: 'I’ve almost always just done my job without extras.\nI’ve been at this school 14 years. Most of the time, nobody even asks me to do extras—they know my answer is going to be, “Nope.”\nI think my principal nearly passed out when I put my name in for department head this year. There’s literally nobody else to do it. And a meeting each month ain’t nothin.'"
    ]
}