{
    "username": "edcRachel",
    "contributions": [
        "In response to 'Yeah I think the more I travel the more I embrace mixing up the pace to suit my comfort level and mood. First few times I traveled internationally I had a bit of a false sense of urgency, like \"maybe I'll never be able to do something like this again.\" Nowadays I feel a lot more assured that I can make travel a priority and don't need to make every trip as packed with activity as possible', a user said: 'Yep, mixing it up works for me too. If I travel too fast, I get really burnt out and exhausted. If I travel too slow, I get bored and need excitement. So I am all over the place - on my last trip it was 1 week in place, 12 days in the next, but then a 2 day stop, then 6 days in a small town with 2 day trip trips, then 2 days, then 2 weeks, then 2 days.\nI hate planning ahead so I can cater my next stop to how I'm feeling.'",
        "In response to 'Original Post: Anyone Ever Quiet Quit a Trip? This has happened probably three times where I get close to the end of a trip and just become over it all and just end to get back home (the US). I don’t want to visit another church/palace/museum, I don’t want to wander anymore (my feet hurt). I’m tired of eating out and just done with it all. Doesn’t mean I’ve had a bad time, but I’m ready to be back in my comfort zone and bed. So when this feeling hits. I sort of find myself shutting down.\nThen, I feel guilty because I’ve flown across the world to be in a city people dream of visiting and I’m not soaking in every moment. I will say when my social connections are low, this quiet quitting happens faster. But despite 100 museums and sites. I have no energy to see anymore.\nHas anyone else experienced this?\nEdit: I’m trying to read all of these responses, on touchy airplane WiFi. But thank you for your responses!', a user said: 'You're burnt out. That's usually my sign to get a really nice room for a couple days, get something super familiar like pizza or McDs or ramen noodles, and sit on my ass and watch reruns on Netflix for a day. I almost always feel better after.\nI usually plan to have one \"day off\" per week but sometimes I need more or less and that's ok too.'"
    ]
}