{
    "username": "eddyathome",
    "contributions": [
        "In response to 'Today's favor is tomorrow's obligation.\nIf a hero sticks around long enough,  eventually, often through no fault of his own, he gets to see himself become the villain.', a user said: 'Today's favor is tomorrow's obligation.\nRight here is a great quote.\nI've learned long ago, never become \"the guy\" when it comes to doing things around the workplace.  You notice the water cooler is empty so you replace the water jug?  Congratulations, you're now \"the water cooler guy\" for eternity.  You change out the toner in the printer?  You're now the \"printer guy\" meaning if the printer is out of toner, you're the one who has to replace it, if the printer jams, you're the one who unjams it.  If the printer is out of paper which is pretty damned simple to fix, it's you who has to refill the paper.  WTF does PC Load Letter mean!?! is all too real in the workplace.'",
        "In response to 'And smartphones have also killed this. The expectation is to be reachable for \"emergencies\" at all hours of the day, 7 days a week.\nEdit: Yes, I meant all cell phones. You know what I meant. Smart phones are much more damaging to my work life balance than my first work phone, a Nokia, was.', a user said: 'Funny how I often I forget to charge it or leave in airplane mode because I went to see a movie.'",
        "In response to 'I’ve heard of employers that will, by policy, contest every single one but almost never show up to the hearing.\nSimply because, on the off chance that the claimant also doesn’t show up, a lot of places will throw out the claim entirely.', a user said: 'I actually got unemployment twice because of this when really I shouldn't have because I was fired with cause.\nWith UC, when you first file, the burden of proof is on you, the (ex)worker to show you were fired unfairly.  If you are denied and you probably will be, appeal.  Now the burden of proof is on the employer to prove why you were fired.  This means showing paperwork filed in a timely manner, and also sufficient paperwork, and that they tried to work with you.\nOne time, they didn't file the paperwork within ten days so I won automatically and got it for nine months.\nThe other time, I was fired legitimately but I just decided to be a jerk and appeal it anyway just to waste everyone's time.  They didn't show up and again, I won automatically.  I got it for a year that time.\nThe takeaway?  Always appeal.  At worst you lose, but at best, you get a paid vacation.'",
        "In response to 'I am curious as to why the company would contest from someone receiving unemployment benefits? Do they(the company) lose money?  isn’t it gov. money?', a user said: 'It depends on the state.\nIn PA, there's a certain amount of taxes you pay for UC tax but it caps out at a certain level and for larger companies or for companies with high turnover like food service or retail, they often are at the maximum cap so it doesn't matter to the company either way.  Now if a company is below that level then it's in their best interest to contest the claim to keep their UC tax from going up.\nOn the other hand, there's often pettiness involved because they feel like why should this person get a free vacation when they deserved it.  Sometimes it's just sheer vindictiveness because they hope they can screw the person over just because.'"
    ]
}