{
    "username": "Educational-Heat4472",
    "contributions": [
        "In response to 'Original Post: I didn't get the promotion. Should I quit or quiet quit? A few months ago everyone in my team was let go apart from me. I was then told I could apply for my old manager's role. I applied but have now been told I didn't get the role and they are going with an external candidate.\nFor these past few months I have basically been doing this promotion role (and have received really good feedback from lots of senior people). I have not gotten a payrise to do all this extra work.\nI want to leave before this candidate starts because I'm tired of giving them essentially cheap labour. I was told if I didn't get this promotion, another role would be made available for me (in the same team), so I would probably have lots of leverage to negotiate a payrise. But I really don't want to have to essentially train this new external candidate who will be making more than double what I earn in the role I didn't get.\nShould I hand in my notice now, do a shitty handover and let the new person flounder? Or should I stay in my role with more money, but be looking for jobs on the side (it could be months and months before I find a good job). If I do immediately quit, I do have savings I could live on for 6+ months (took me years to save this amount).\nWhat would you do? Any advice?', a user said: 'This happened to me TWICE in the same role.  The first time it happened my coworker and I loaded up our new supervisor with all the crap we didn't want to do.  He lasted like 9 months.  The second time it happened I made a lateral move to get more training and work in a different group.  The new supervisor lasted about 6 months.  I used the training in my new role to get a position at another employer with a FAT raise.\nI learned later the third time they filled the supervisor role they had to fire the guy after like 4 months.   The fourth time the person lasted only 6 months before moving on.\nThe manager doing the hiring for that supervisor role was a total dipshit and didn't realize the role was difficult to understand and should only have been promoted from within so the new hire would understand expectations going in.  I would have likely took the supervisor position and stayed in it for 5 or more years.  Instead they have gone through rounds and rounds of hiring with the position left empty for 6 to 9 months at a time.  Fucking morons.'"
    ]
}