{
    "username": "Efficient-Pop3730",
    "contributions": [
        "In response to 'I get what you are saying but the idea of disqualifying a friendship because someone isn't financially well off or because they need antidepressants is kinda shallow too, and you'll be severely limiting yourself JW or not. Plenty of non JWs deal with personal issues while still being good people who are more than capable of maintaining quality friendships.\nJWs struggle to develop genuine friendships because the entire structure of social relationships is fucked in the org. You constantly have to have a wall up because you are encouraged to rat on each other, so you never have any level of vulnerability or honesty brought in. JW friendships are usually borne of circumstance and obligation, which is why managing anything beyond a surface level acquaintance while in is a rarity.', a user said: 'Being depressed JW or poor comes with lot's of bagage. Depressed people in org judge themselves. Oh I'm depressed cause I miss a meeting. Ore poor cause I don't work hard enough. Watchtower Is a ruthless cooperation. Makes Member have bad conscious for anything. It's hard to have contact with people like that. You tell them not to judge yourself too hard and they look at you as satan talking. Like you going against GB. Plus if you are depressed elders can think it's because your sinning. I tell you this is a ruthless cold cooperation'",
        "In response to 'Is Quiet Quitting now a thing for Jehovah's Witnesses?\nIt`s been going on for decades...\nBefore the Internet there were`nt many people you could talk to...Now we`re finding out a lot of people had the same Idea...\nIf you want peace in your life, Leave Quietly.', a user said: 'Yeah been going on from middle of the 90s. People just fade. Half empty congregation everywhere. Mostly Old people. Wonder how org gonna look in 5-10 years. Good times deffently ended for watchtower'",
        "In response to 'It's turning into a Sunday sermon religion for many. Zoom and COVID annihilated zeal.', a user said: 'Been going on for year's. Pandemi just Speed things up'",
        "In response to 'I dont want to say biblical prophecy but, hear me out, (I get it is probably bs) but this is what i keeping thinking and cant shake entirely yet\nWe were taught(I saw that with a very fucking great understanding we were taught lies mixed with truth)\nBabylon the great the world empire of false religion(which probably represents rome- prophectically maybe could make a point its the whole world, commerance, religions, and everything else) was supposed to parrlel the fall of babylon.\nThat is river drying up, we were taught it was the people leaving the churches…excluded witnesses. But honestly what if all religions have served their purpose for nations to keep people docile and now that they have the upper hand there is no need for it. Similarly what if the waters are drying up and people are leaving included from the false religion Jws', a user said: 'There's not gonna be any religion in new system\n. All gonna be gone'"
    ]
}