{
    "username": "El_Minadero",
    "contributions": [
        "In response to 'Original Post: Where Are the Workers? From Great Resignation to Quiet Quitting [External Link]: https://research.stlouisfed.org/publications/review/2023/09/27/where-are-the-workers-from-great-resignation-to-quiet-quitting', a user said: 'This is at-odds with the state of employment in tech. Most fresh grads I know have had a terrible time trying to find work, with unemployment periods beyond 6 months not unusual.\nAm I biased in my sampling or is there a way to reconciled these findings with their experience?'",
        "In response to 'There are specific factors at play in the tech industry right now that more severely impact new grads.\nThe rise in interest rates is shifting many companies away from a focus on growth to a focus on profitability. That’s lead to a reduction in hiring and an increase in layoffs.\nIdeally, most tech companies would rather not hire entry level at all because new grads require a lot of supervision and mentoring to be highly productive. Finding enough experienced software engineers is difficult and expensive though.\nIn high growth environments, most companies adopt a structure of a few experienced engineers directing and mentoring a set of junior and new grad engineers. Some companies have taken an alternate approach. Netflix only hired experienced people and paid them a ton. Even they have caved to hiring juniors now because ultimately it’s a cheaper model.\nAs growth is being less emphasized, many companies don’t need to hire as many new grads or any at all. They can achieve their goals with an existing, on average more experienced work force.\nFor companies that still do want to hire, there are more experienced engineers on the market than before and compensation has come down a bit, making it cheaper and easier to just take experienced hires.', a user said: 'so is the takeaway that while we're in a \"tight labor market\", it doesn't apply to tech jobs?'",
        "In response to 'Just asking; did they have a hard time finding work or finding work that paid as much as they wanted?', a user said: 'as in, 500 applications with just a handfull of interviews across a range of position types and pay-grades.'",
        "In response to 'Which seems strange to me. I work at a stadium. We are offering $22/hour and getting NO applicants. Granted, most people see it as temporary (just during the season) but we are booked with catering plus the company will fly you around the US to help at one of the 300 other stadiums or other facilities we have contracts with.', a user said: 'Maybe its the type of work here that is driving the labor shortage imbalance. As an example, I graduated in 2015 with a high GPa and a BS in physics. I could have applied for construction or service work, but in my mind, that would have invalidated all the work i put into my degree. It wasn't the pay\nper-say\nthat deflected me from these jobs, but concerns over wasted potential, upward mobility, and stability.\nI'm not sure how much this applies to the current labor market, but if you're a recent computer science grad, abandoning all the hard work, money, and stem talent from your degree to work an unrelated position is probably a hard sell, even if the position is high-paying.\nThere's a lot of interesting implications from the dichotomy of an overeducated populace that can't seem to find work, existing in a society that (at least culturally) values education. I don't see how higher education can ever become flexible enough to adjust to the demands of the job market considering it takes ~5-10 years to make a college professor, and an act of god to change school curriculum. So where does that leave supply and demand for labor?\nIdk. Its quite the pickle.'"
    ]
}