{
    "username": "elarth",
    "contributions": [
        "In response to 'I use to be a mailman. If you were good at your job you were rewarded with more work. Part timers worked 7am-7:30pm, Full timers worked 7am-3:30pm. When I became full time I would finish my route and have an hour or an hour and a half to spare.\nI knew if I went back they would give me more work to do, so I would just sit around until it was a safe time to go back to the station.', a user said: 'Lot of modern cars are likely going to change that. The had GPS monitoring for awhile, but this is now being scrutinized a lot more. I tell ppl frankly just look busy at your job even if you aren’t. I too got added a ton of additional duties. I would eventually get raises, but never to scale of the actual work. You’re like an actual diamond in the rough of pennies. You don’t always want to stand out. Managerial roles seem to be more on social disposition than talent to me. They kind of pick intentionally the ppl who will not come full circle how problematic current work culture is. Or you have the kind who knows, but it still benefits them.'",
        "In response to 'After years of being exploited for a having a strong work ethic, it's the only way I function now.\nI look back to previous roles and am shocked at all the other non-essential duties and attitudes that were expected for just a decent annual review.', a user said: 'Yeah I got conned into task that frankly deserved a manager promotion or at least a raise. Like actually I’m not going to do shit I’m not assigned as part of my normal job role for that 5 stars and a raise the size of just part of cost of living adjustments. I get weird at companies that think you have to earn a raise… uh the economy changes yearly. In normal situations 3% is actually just the same as I made last year cause things averagely go up. Why the hell would I go an extra mile for that? Part of why ppl don’t stay employed anymore at one job more than 1-3 years. Easier to get merit based raises by job hopping. I’m having the best time in contract work. My rates are adjusted more real time accurate. I’ve even picked up some skills too to add to my resume.'",
        "In response to 'And all the little tryhards glare at you for \"having the nerve\" to do exactly what you're hired to do, rather than actively looking for a bunch of extra shit to brown nose with.\nWhen you hire a plumber, you don't let them in and say, \"There's the house. We'll review your progress in 6 months.\"', a user said: 'For actual try hard yes. I try not to shaft a coworker just cause a company shit. It’s not very pro union to let your coworker suffer. I deflect problematic shit back to the company. I don’t even let it affect clients in anyway I can control at least. I let the issue fall on a managers head. One way or another. It’s the only way.'",
        "In response to 'I'm not even sure what you're trying to say. Every employee who is hired to do A, B, C should be expected to do A, B, C.', a user said: 'In shared work roles that have actual consequences it doesn’t always play out to fair. In my industry I could not ethically concede to poor medical protocol because I’m badly pay. That’s not a great way to go about that for all the reasons you’d imagine. In most cases the other nurses are shafted as much as me. So I prioritize task that are better for patients/coworker relationships. I do push back admin shit cause managers can deal with it. The person suffering is mostly my boss. Although these days I am my own. But I can sleep okay at night about it.\nClients and coworkers : 🤭\nBoss: Pissed as fuck but I’m not going anywhere.'",
        "In response to 'Original Post: What's your opinion on quiet quitting? Been doing it for almost a fortnight now, and it's changed my life (for the better).\nInterested to hear others' thoughts.', a user said: 'Unless companies want to bring back the incentives to do more this is the disposition of treating your employees like just numbers. There is no depth there. Why would a random person bust their ass with no incentive for random other ppl? It’s funny that employers have gotten very impersonal with employees and surprised it comes full circle.'"
    ]
}