{
    "username": "Electronic-Guess6296",
    "contributions": [
        "In response to 'Some  of my fellow “teacher friends” call working to contract “acting your wage”.\nWhen I started easing up on unpaid/unacknowledged work, I was shocked at how much I had been doing. Good luck!', a user said: 'Yeah, I had a meeting with my admin recently, because I felt overwhelmed with my duties (breakfast, car, and lunch) on top of being on-call behavioral all day at the school.  They told me the reason I'm overwhelmed is because I'm doing too much for our kids and not sticking to job description and that my extra duties would remain the same.\nShrugs\n. They weren't WRONG, but it still kinda sucks they won't pay this HIGHLY overworked position more.  People at Taco Bell make more than me, but I LOVE my kids.  🥹'",
        "In response to 'Yeah, it sucks that they didn’t really listen to you. :-(\nThey told you to stick to your assigned duties and contractual obligations, so do that.\nFirst thing you need to do is take your lunch, duty free, every single day at a predetermined time. Find a place to hide if necessary, and do anything but work. I read in a courtyard where there’s no phone (or kids). Notify admin that you’ll be taking lunch at x time and will not be available. (I case manage very high risk kids, so I know how hard that will feel.)\nIf you can’t do that at first, force yourself to come in two minutes before your AM duty  and leave every day one -two minutes after your PM duty (as soon as your contract permits). Come on at 7:28 if you have a 7:30 duty, for instance. Leave at 3:05 if your contract says you can. Remind them that your duty day has ended if there’s my pushback (there probably will be). Good luck!', a user said: 'Coming in at 7:28 sounds like heaven!  Haha.  My duty starts at 7:05, so I normally get to school around 6:50am.  That way, I can get my walkie, set my stuff down, and walk to duty.  I also work and case manage high risk kids!  It stinks shutting my walkie off and ignoring texts from teachers during my lunch, but as you said, it needs to be that way!'"
    ]
}