{
    "username": "emp_zealoth",
    "contributions": [
        "In response to 'Lmao. Wouldn't they want a person doing 3 people's work at a higher function in their company? And when you leave because of not getting what you deserve, they'll have to hire 3 people anyway, so was it worth it? Can't believe those people', a user said: 'Often the lower you are the more economically productive things you do for the company lol'",
        "In response to 'A set contract would have to offer some\nreally\nnice perks to entice a lot of people.  Personally, I don't even know what package could make me want to commit to 2 years for a subscription.', a user said: 'I dunno, I'd trade a kidney for a really good sci-fi series than isn't sabotaged with extremely obnoxious characters and just moronic behaviours causing pointless drama. If I could sign up for 2 years and get a guaranteed series with lots of seasons and episodes ... Lol'",
        "In response to 'A warranty is not intended to fix products that have worn out. It's intended to fix products that were manufactured incorrectly. If a manufacturer gets too many people taking them up on the warranty, then they've miscalculated how long their product lasts and are paying for truly broken products instead of defective ones.', a user said: 'We should make warranty mandatory for 10 years. Suddenly manufacturers will learn to not produce shit that is designed to break in the most obnoxious, preventable and unrepairable way'",
        "In response to 'I agree wholeheartedly about the cops. When I wrote resource I meant to change our sources of police to re-source them. For example employ a whole bunch of social workers in the force. Also I never said a boomer came up “quiet quitting”, I said it sounds like some thing a boomer would come up with because it’s a bad phrasing. .', a user said: 'The way you frame \"solutions\" is incredibly sus. Social workers have zero to do with any \"force\" and policing should be taken away from unaccountable faux military'",
        "In response to 'You don’t think adding social workers to handle the more sensitive elements of policing would be better than sending out police to deal with EVERYTHING? I’m pretty sure this has already been tried in some communities and it’s working. I’ve never heard of anyone being against social workers being sent out on calls, and I’d love to know more about why you don’t like the idea or find it problematic.', a user said: 'You are so brain broken by the deeply embedded idea that the police has to do everything that you are advocating to employ more police officers, just rebranded as \"social workers\". Social workers should never be employed by the fucking police, they should work on their own terms and actually be able to tell the cops to fuck off if they start acting out'",
        "In response to 'Why are you so angry? Are you aware that some cities have started hiring social workers within the police department, they are dispatched to calls that do not have a violent or danger element, they are not armed, and they help people with resources? They generally respond to mental health crises, and interpersonal squabbles. Some police chiefs, who were skeptical at first, now call the program “indispensable”. These social workers are considered members of the police force.\nI don’t understand your animosity.  You are resorting to insults like “brain broke”, which doesn’t personally offend me because I am confident with my intelligence and awareness of current issues— but it makes me worry about you. You seem to have a lot of anger toward ideas that are already WORKING to reduce police interactions and increase de-escalation in communities.  Maybe you should talk to a social worker. 😁', a user said: 'You are literally admitting that those social workers are still police officers, so no, they LITERALLY, BY DEFINITION do not reduce \"police interactions\". The second reactionary dipshits get in power, they can be instantly re-armed and turned back into armed goons (or fired, and the money for them spent on repression again)\nIt's better than nothing, but it's still more money for the police, instead of real social work'",
        "In response to 'I don’t like the wording of “quiet quitting”. Because it’s the exact opposite— it’s about finding a way to actually stick with your job and carry on. Messaging matters a lot more than people consider. “Black Lives Matter” should have been “Black Lives Matter Too”. Then we wouldn’t have had all the ridiculous “All Lives” people.  “Defund the Police” should have been “Re-source the Police” as in give them new sources of support, with a wider range of skills in dealing with the public. I wish we would give messaging MUCH greater consideration before just throwing out word soup. “Quiet Quitting” sounds like something a Boomer would come up with. Ugh.', a user said: 'Our current implementation of police is fundamentally broken, so police abolition is the only way. Of course no one advocates for zero ability for peacekeeping, it's just more complicated, but all the bad faith actors hear the first part and immediately go into damage control mode, trying to protect their state funded gangs'",
        "In response to 'Thanks.', a user said: 'It's more than that. \"Work to rule\" in the protest sense means you follow every insane rule your employer wrote down. If that means your entire work day is spent being stuck in a nonsensical loop of contradictory actions that produce nothing of value, as long as you actually do not break any rules, you \"work\" to rule, like a golem would.'",
        "In response to 'Original Post: It's not called \"quiet quitting\" That little term is a rebrand of working to rule. It's a labor action been around for a long time where employees work exactly to the terms of their contract and that's why it's getting rebranded. Working to rule is a much harder term to criticize. \nAnytime \"quiet quitting\" is brought up, shut that shit down immediately. We need to undo this particular rebrand as best we can. Doing more than what you're hired for needs to stop, and it can't while people working to rule are being vilified.', a user said: 'It's not even that. Work to rule is malicious compliance with ubiquitous insane and contradictory demands placed on the labour force, following which makes any productivity impossible\nIt's literally just doing YOUR job and not picking up slack for all the issues caused by lack of staffing, poor processes or abysmal management lol'"
    ]
}