{
    "username": "employerGR",
    "contributions": [
        "In response to 'I’m right there with you. Mentally, the Covid quarantine was a game changer for me.\nLike a lot of people, I spent the quarantine working from home. By home, I meant I left my apartment in the city and moved 600 miles away to be closer to family.\nOnce Covid was over, there was no way I was going back. So, I quit and started working for another company. That company was quickly bought out, and a year later they still don’t have a plan for how they will move forward. So for the last 16 months I’ve been working from home, maybe 20 minutes a day, for a six figure salary.\nI’m feeling the same supply chain/lead time issues as you, so every time I talk to a client I feel like I will only disappoint them by not being able to get them what they need when they need it.\nLike you, I really don’t care if I lose this job. If that happened today I would not even look for another job until 2023. I would spend the rest of the year figuring out what I wanted to do next, because I’d want it to be completely different than what I do now. I’m almost debt free, so I’ll probably make that change soon anyway.', a user said: 'I wouldn't mind doing nothing for that much money. I've done worse for less... hah.\nCovid hit me hard. I was making a cross-country move in the Us, changing locations, and changing industries. Finally got a decent job to start moving towards those bigger $$$ roles and then boom covid. I struggled like hell with a product that didn't quite fit the market (they downsized recently). And ended up moving companies once the market returned.\nCovid shifted my priorities. I don't ever want to work for a company that doesn't show a good base of respect for each person working there AND I will only work with people I most like and respect. We don't have to be best buds but I want to enjoy the people I work with and for.'",
        "In response to 'The way I see it, my low output is due to my employer’s current business model.\nAfter some recent changes, I’m pretty much inbound only. So other than quote follow ups I don’t perform any outbound duties.\nWe sell a physical product but management won’t maintain any significant inventory. Due to supply chain instability and wild fluctuations in material costs it’s now company policy that every RFQ goes through a formal costing process before a quote is issued.\nUnsurprisingly, that costing department has a backlog, so I’ll submit RFQ’s for costing and then wait, and wait, and wait.\nOnce costing is done, it takes no time to issue a quotation and follow up. So, I just sit here most of the time waiting for another department to do their job.', a user said: 'The worst thing in sales is WAITING a long ass time for pricing for a quote. It is hard to win sales if you don't have a figure.'"
    ]
}