{
    "username": "Empress_Life",
    "contributions": [
        "In response to 'And where did all these gated communities pop-up? Go get your stuff from the gate guards, 'Beverly Hills'.', a user said: 'This part right here. .'",
        "In response to 'Right? If I order something I watching the app the whole time waiting on it lol', a user said: 'Exactly especially alcohol bc you already know ID is required.. phone should always be in hand if u order anything to be delivered like this. Wrap it in a plastic baggie if u in the shower.. and please don't get an attitude if u mias the delivery bc u werent available..  ppl have no idea how frustrating it is trying to deliver something someone ordered with limited contact and pertinent info like gate codes.  Like.. don't you want your stuff? Or did u forget u ordered? Never fear as OP said you do get lots of alerts.. I have never ordered from any delivery platform and not recieved at minimum 5 alerts lol'",
        "In response to 'Original Post: Quiet Quitting DD style I was just going to ignore her but then she said I could've just called. Maybe Karen could've been by her phone at any point throughout the whole interaction. But no, she's a dummy and now we're here.\nThe second I cancel after the timer is up she messages back. I order as a customer sometimes and know just how many notifications you get sent by dd. It's basically all of them lol.\nAnywho she didn't message back and I got a super good dinner tonight I didn't have to pay for. Thanks boo!\nThe alcohol goes to my favorite smoke shop since I have no friends or people I see daily other than my shop😂', a user said: 'Damn! I never get cancelled alcohol orders lmao I always wish a MF would on those orders just so I can keep it lmao plus in my area alcohol orders are rare for me.  I don't know why.  Maybe they just know not to give me those orders bc let there be one hiccup lmao I'm canceling it, going home and DRANKING IT!! Lmao'",
        "In response to 'Only good take I've seen against OP so far.', a user said: 'That's true..  OP should have called at least once before dipping out.. probably should have called when OTW to deliver bc it was alcohol and customer hadn't responded.  But u can never tell what mood u are in at that point.. nobody wants to wait around for a customer when the promo clock is ticking!! Lol'"
    ]
}