{
    "username": "enkiloki",
    "contributions": [
        "In response to 'Original Post: Hey guys, I was “quiet quitting” until I got fired , now what? So I just got fired and they recommended me to file for unemployment insurance. HR was surprisingly nice. She basically told me they don’t contest the claims, so I think if I use the right words in my unemployed application,\nI might be eligible for unemployment insurance.\nHas anyone successfully received unemployment insurance benefits in this situation before and lives in the state of Illinois? One of the questions is below:\nAccurately report your reason for separation from your job when you initially file your claim for benefits.\nEDIT: I  shouldn’t have used the term “quiet quitting” on my post because I used the term incorrectly, my apologies. I meant to say, I was really underperforming on my job, barely doing any work for the past year or so. I did the bare minimum. I was  then placed under an improvement plan for a little over 6 months or so. They saw some improvements, and I was doing okay, until I mislead my manager with 2 assignments. I stated that I had completed the assignment but in reality I used last year’s data to mark it completed, while I attempted to catch up over the weekend.\nI never fixed the assignments and my manager found out what I did. That’s when she went to HR for the next steps. I emailed HR for a written confirmation on why I was fired and she responded “unsatisfactory performance.”', a user said: 'If HR was telling you they don't contest unemployment claims, she was telling you to put down 'layoff' on the application.   I used to work UI in a different state and most employers only contest if it's something egregious like fighting, stealing, or screwing.'",
        "In response to 'They don't contest it. Well, here in Missouri, the company doesn't have to because the state will.', a user said: 'It is against federal law for the state to contest UI claims.  The state is a uninterested party between the employee and employer.  They must follow the law.   The will go after claimants for fraud on their own when the state discovers fraud has been committed.   You may be confusing how the process works. You give a reason you were terminated from your job on the application. The state verifies this with the employer via a form.  If the employer doesn't respond the state assumes the employer agrees with the reason the employee gave and pays benefits if allowed by law to do so.    There a few times when this is not the case for example when a claim is randomly audited for compliance with the law.  If the audit finds benefits should not have been paid the state will move to deny benefits.  But audits are rare, fewer than 1000 per year.'"
    ]
}