{
    "username": "EquationsApparel",
    "contributions": [
        "In response to 'Just went through this a few months ago so I’ll share what I decided.\nI tried to decide between quitting and quiet quitting. I’m doing a hybrid.\nFirst, I’ve stopped doing all the ‘extra’ things I did before. Started directing everyone who came to me for help to “our new supervisor.”\nThen I started taking my lunch breaks again. Started leaving when the day was over. Stopped checking my email when I walked out the door. Started taking vacation and sick time. It was very freeing and made me less angry about not getting the job.\nI’ve provided help when asked but am certainly not going above and beyond. I’ve gotten praise for my handling of the situation, weirdly.\nI joked over the weekend that it feels very Office Space. The more I back off from my work, the more people think I’m succeeding.\nAnd I know the perfect job will come my way where my value is really seen. When it does, I’ll leave.\nThat’s my advice. Take some time to let the emotions die down and wait for the perfect gig. Strategize. Don’t rush.\nSorry you’re going through this. It’s extremely unpleasant. Keep your head up and remember that your coworkers are probably talking about what a mistake management made.\nEdit: clarity\nEdit 2: Clarity/spelling', a user said: 'started taking my lunch breaks again. Started leaving when the day was over. Stopped checking my email when I walked out the door. Started directing everyone who came to me for help to “our new supervisor.” Started taking vacation and sick time.\nI like your post, but can we please stop using the term \"quiet quitting?\" What people characterize as \"quiet quitting\" used to be known as \"doing your job.\" Everything you describe here is how work is supposed to be.\nThe term \"quiet quitting\" was invented to make workers feel bad about stuff like taking lunch, leaving at the end of the day, taking vacation, and not responding to emails after hours.\nThis is what you're supposed to do.\nThis is NOT a form of quitting. We need to stop normalizing free and unpaid work.'",
        "In response to 'I was just about to say, man I’ve been eating lunch and going home at the end of the day for my entire working career, it’s never been an act of rebellion I just figured it was normal 😂.', a user said: 'If I found out one of my team members was protesting something by taking a lunch break, my first question would be, \"You weren't going to lunch?\"\nDo people think being a good employee means not taking vacation?\nI've been in the workforce for three decades. I'm interested in finding out when vacations, lunch breaks, and not working after leaving work became bad things.'",
        "In response to 'I don't take vacation because I can't afford to go anywhere in the first place. Plus just taking a day off results in a pile up of work so much that it takes me 2 days to catch up for every day I take off.', a user said: 'Plus just taking a day off results in a pile up of work so much that it takes me 2 days to catch up for every day I take off.\nThis is a lack of management. It's the classic \"mail carrier\" problem. The mail is never going to stop. But the answer isn't for mail carriers to volunteer extra hours or not use their PTO.\nIf you're not taking PTO because there's too much work, then your management hoodwinked you into thinking the amount of work is your problem.'",
        "In response to 'Some companies have really weird cultures that you pick up on for stuff like that. I recall one company I worked at where people\nnever\nleft before 6pm even if you started at 7am. If you did leave “early” you’d get stares from the entire office.', a user said: 'If you did leave “early” you’d get stares from the entire office.\nI've been the person getting stares. I found that stares don't hurt me. And it was way worth it going home to my baby girl.'",
        "In response to 'We have seminars during our lunch hours( we can bring our lunch, of course)\nRegularly work outside working hours\nVacations are not normal \nSick or mental health days are not normal.\nI am in medical research.', a user said: 'This sounds awful.\nIs it that you don't get PTO or that people don't take PTO? Because I would be taking it. It's part of my compensation.'",
        "In response to 'As a GenX yes this is doing your job it has nothing to do with quiet quitting...also the same shit goes wearing multpile hats= dont mean more money and  more stress and punishment do your job and go home.', a user said: 'Yup. Just like a promotion that doesn't come with a raise in pay\nis not a promotion.'"
    ]
}