{
    "username": "ErogenousBosch",
    "contributions": [
        "In response to 'Original Post: Quiet quitting life I am quiet quitting life and nobody realizes that’s what it is. My friends think I’m just being a bad friend. My family just thinks I’m being a bad family member. I don’t want to die but I don’t want to live in the world any more. I just want to go to work and then come home and that’s it. I don’t want to go have dinner with people anymore. I don’t want to hang out and be made to feel obligated to stay until 11 pm before I can go home.  Nobody realizes that this is my way letting go of life, of escaping from the world.  I’m alone, I’m 30 years old and haven’t had an intimate partner for a decade. I love those in my life tremendously. But I just want to let go. When I’m home, I’m free to be who I want. To feel how I want, to look how I want. I can say what I want, my cat doesn’t mind. He doesn’t judge. He looks up to me and needs me and he’s the only thing that’s warm in my bed.  There’s nothing more signifícate to write here. Just thank you for listening.', a user said: 'From your positive description of home, it sounds like a perception of judgement might be the thing getting you down outside. I spent a year hiding in my room, pissing in bottles to avoid running into my flatmate at the time.\nSo I know I can't really tell you anything that will make you feel like its ok to be outside. I'm bed rotting with my cat right now. I will say the thing that got me some relief was weird. A few years ago I had to wear a portable EEG for a week. So my head was wrapped up in bandages like a mummy, I had about twenty wires coming off my scalp and joining in a big cord that came that fed into a battery pack/monitoring device on my hip. I looked like a crazy man. My doctor had to give me a literal note to give the transport police so they wouldn't think I was carrying explosives.\nBUT it was liberating. I felt like I finally looked as crazy as I felt. Because I hadn't been scared of people judging me, I was scared of them judging me incorrectly - of them thinking I was normal and sane, having expectations of me that I couldn't possibly meet. Anyway my point is this: you have a cat that loves you. You can obviously string a sentence together. Even if in small meaningful ways, you can connect to others. You have a home and a sense of self. If that sense of self does not fall in line with what you think society expects of you. then so be it. You can still find things out there that make you happy. When it gets to much, just go home and enjoy yourself with the cat. That's not quiet quitting. That's living up to your own values.'"
    ]
}