{
    "username": "errorexe3",
    "contributions": [
        "In response to 'Original Post: Anon tries quiet quitting [External Link]: https://i.redd.it/hajzm9g6jyxb1.jpg', a user said: 'I remember when I was getting burnt from work. I started doing the \"bare minimum\" doing exactly what my responsibilities and nothing more, timing everything so it'd take the whole day, same reaction. Was very weird, Ive been using that strategy for years now and... it works?'",
        "In response to 'Question: why would you do more (or way more) than what you are paid for (the bare minimum)?', a user said: 'I wanted to be proactive, we were a very close team andt he vast majority were all friends with eachother. Management was above average, our BIG boss was very recently part of our team and was very staff oriented. Our supervisors were ruthless to anyone who antagonzied the team because only the best in our city got to work at our facility due to the demands that'd arise.'",
        "In response to 'I mean, if you are doing exactly what you should - why wouldn't it work?', a user said: 'Probably the brain rot I picked up as a kid about working extra hard, maybe the company will notice and youll get more money or promotion or something.'",
        "In response to 'They will not pay more unless they have to', a user said: 'Correct!'",
        "In response to 'To be fair once a company gets to a certain size doing too much leads to logistical hiccups as projects and timings get moved forward. Like if you finish your half of the work but the whole depends on targets from 10 people, the work only finishes at the pace of the slowest person', a user said: 'Ill have to keep that in mind if I get a big boy office or logistics job. The jobs I have ever had were different, we didnt technically \"produce\" any tangible output, competency and effectiveness were our only real measures.'",
        "In response to 'You the job you were hired to do done and didn't commit yourself to other people's jobs and so your boss was happy.\nYou're surprised by this?', a user said: 'Im noticing in the comments that I do not have a regular career history compared to the majority here. No ones toes were stepped on when going above and beyond and none of the proactive duties or extra work fell under specific staff, instead a distributed respnsibility that were theoretically optional.'",
        "In response to 'in a post scarcity world a lot of our working hours are unnecessary and pretending they aren’t makes bosses giddy. This is doubly true in service or financial sector economies\nthat’s why the appearance of working hard becomes more important than the output. The work that needs to get done always gets done and for the rest you might as well pretend to be working or they’ll start thinking of “trimming the fat”. Really anything to not confront the fact that sometimes you pay people to do nothing because you pay for time instead of output and that’s just how it works.', a user said: 'Do you think we are effectively post scarcity? Obviously not the ideal definition but post scarcity in terms of needs vs. Availability of resources to meet those needs?'"
    ]
}