{
    "username": "EuropeIn3YearsPlease",
    "contributions": [
        "In response to 'If you’re equals and you consider him a friend you should have 0 problems addressing this directly with him.', a user said: 'It is the manager's responsibility to manage their resources. Not OP. Plus it is a privacy violation that OP even knows this is what his/her manager is doing and how his/her coworker is performing.\nThis is highly inappropriate all around. This manager did not do their job and they were not professional. OP doesn't manage his coworker and he certainly doesn't have to do work that someone else should be doing otherwise the manager needs to re-organize the assignments OP has and deprioritize his/her other tasks. OP should not have to work extra.'",
        "In response to 'I’m not sure it’s fair to blame the coworker for his workload being dumped on her. She says her manager knows it’s the coworker who’s slacking, but chooses to make that OP’s responsibility. I also understand “quiet quitting” to mean only doing work that is part of your job description. If that’s what OP means, it’s especially unfair to blame the coworker for refusing to do work he isn’t being paid to do if OP chooses to do work she isn’t paid to do. OP is equally capable of declining work she shouldn’t be responsible for.', a user said: 'Exactly. Love your comment'",
        "In response to 'Original Post: What to do if my counterpart has \"quiet quit\"? One of my coworkers has been quiet quitting for a long time. But we're basically in a workplace where people are unfireable (government job). His boss does not seem to want to confront him about slacking, so instead, she gives his work to me and makes everything about \"we\" and \"us\" instead of \"him\".\nInstead of telling him directly, for example, \"hey PERSON X, why aren't you responding to my e-mails?\" She'll e-mail both of us and say \"Hey Team, why aren't you guys responding to my e-mails?\" (When it's very obviously him, not me.)\nWhen he decides not to do his work, she just gives his work to me.\nHonestly, I don't care if he quiet quits -- that's his business. But when his refusal to do work is falling on my table, that's where I start to see things getting problematic. How would you deal with this situation? Telling on him is not a good option, we are equals in the workplace and he considers me a friend.\nEDIT: Wow, so many responses! Yes perhaps my use of \"quiet quitting\" wasn't the right choice of words. My coworker came into my office on Friday and told me he doesn't \"give a f***\" about this job but he feels powerful because he feels \"unfireable\". He spends the entire day working on his own stuff (he has a few side jobs that he does). Our boss seems to be intimidated by him and takes the easy way out - instead of giving work to someone who's going to push back, she'll dump it on others instead. Firing someone is an extremely complicated and long process here, and probably not something she wants to go through. The boss is in her third trimester of pregnancy and getting ready to go on maternity leave. My coworker and I have similar job descriptions so it's easy to give his work to me. Addressing the \"friend\" issue: yeah, I don't really know if \"friend\" was the right word here either. But we're equals and I guess you could say \"friendly\" to each other. Coworker brings me baked goods sometimes, has invited me to get-togethers, things like that. Situation really sucks.', a user said: 'Quiet quitting does not mean not doing your job. It means doing a 'meets expectation' job. It means logging off when it is your time to log off. If you log off at 5pm, you log off at 5pm not 5:30 or 5:45.  It means when you arrive on work on the agreed upon time and not earlier. It just means not going above and beyond. It is stupid this is even called 'quiet quitting' as a way to shame people for just doing THEIR job. Not extra. Not bending over backwards. Not working 2 people's job. Etc. Shit you aren't paid to do.\nYou OP need to learn to establish boundaries and stop calling this quiet quitting. Your manager is just taking the easy way out and shoving shit on your plate. You need to be firm. My hours are 8-5. If you assign me more work then I can complete in these hours then you should know it won't be completed on time and you will have to let me know what to prioritize. That's it.\nYou are becoming an easy person to walk over and the longer you do that the more you will be taken advantage of. It isn't your coworkers fault your manager is managing them right. It also isn't your fault. It's the manager's responsibility. They have to get the job done and that means putting your coworker on a PIP if necessary. It is YOUR MANAGER'S fault for abusing your goodwill. And you need to stand up for yourself.'"
    ]
}