{
    "username": "events_occur",
    "contributions": [
        "In response to 'Arresting and ticketing them creates a dangerous situation and cops don’t think it’s worth it to risk their own safety, do the work to build a case.\nIt's literally their JOB! Why don't you go to work and not do the job in your job description? Because you'd get fire.', a user said: 'It's literally their JOB!\nNot according to SCOTUS. They literally have no duty to enforce the law if it means putting themselves in danger. Sounds like a good reason we should tie their pay and pensions to reducing key crime metrics'",
        "In response to 'Even if they're never charged with anything being detained and having their bikes locked up for a bit is a deterrent. Honestly I don't think we need a massive punishment - from the videos it seems like most of them are teens who will probably age out of it soon enough. There are probably a few ringleaders who would be most worth trying to shut down, but I doubt it needs a massive crackdown to stop the problem.', a user said: 'This! Most anti-social behavior just the result of bad game theory. If one player is\nconstantly\ndefecting, and the other players – the cops, society – are cooperating by doing nothing, they will keep doing it, and even escalate! Defection must be\nreciprocated\nwith defection, up to a point. That changes the game and forces the antisocial player to revaluate their decisions.'",
        "In response to 'Original Post: My cousin is SFPD and has the same take on the bikers. Are we basically just paying them 3/4 $billion a year to cry and quiet quit? [External Link]: https://i.redd.it/uhdkr8xy39ld1.jpeg', a user said: 'That's always been the excuse about literally any non-violent crime: \"the police won't arrest because a jury won't convict because a judge won't sentence.\" There's perhaps some truth to it, we do have a lot of problematic justices, but the cops should still put these guys through the wringer even if those other checks fail. You have to raise the stakes – impound their bikes, make them sit all day in jail,\nwaste their time.\ninconvenience the shit out of them.\nDo this enough and the friction might make them think twice.\nI don't know what to do about our radical pro-crime justices. They need to be removed, but they can't.'"
    ]
}