{
    "username": "ExampleInfamous6326",
    "contributions": [
        "In response to 'Original Post: How to effectively quiet quit as the highest performer on my team I am the team's highest performer. I have a lead IC role (\"hybrid management\") where a lot of my job duties involve coaching, development plans and employee growth. I am one of two lead ICs and there are like 3-4 other ICs on the team.\nOver the past two years, I've taken this position very seriously and have operated at a much higher level (the position above mine) than expected. I was rapidly promoted to lead IC in less than a year and I have been told that going into full management is \"mine if I want it\". The difference between myself and the other ICs on the team (including lead IC) is pretty dramatic. I'm easily doing twice or three times the workload and have a much higher operational proficiency, client satisfaction, etc.\nFor a plethora of reasons, I've become totally disillusioned with the institution, middle/upper management, and the position. What's compounding my anger/depression is that I took my position as a downgrade in my career, but intended to be underpaid and underappreciated for 2-ish years to build up hands-on experience in a new industry. I've been ACTIVELY trying to get OUT and make a lateral or upwards move (externally, not internally as my institution does not offer internal jobs) and because of the PARTICULARLY shitty state of the white-collar job market (\"worse than 2008\"), I have been faced with rejection after rejection after rejection, usually after getting 99% of the way there. I also have particular grievances about the way that middle/upper management has \"strung me along\" on a variety of promises. I look back and see that I'm literally ROTTING in what was supposed to be a temporary position, in the prime years of my career, and I feel STUCK (can't get out no matter how hard I try).\nIt's important to note that I really don't *like* the idea of quiet-quitting. I always used to say \"why would you quiet quit? Just go find a better job that you feel fulfilled in\". The problem now is that I'm so bitter at the institution that putting in extra effort feels nauseating and violating, and I'm STUCK at this job due to the extremely terrible job market (unless I restart my career entirely or quit without a job lined up).\nAnyways, circling back to the point of my question: I've become widely known as such an aggressive overperformer that my bosses have flat-out told me that overperformance has become my new baseline for expected monthly performance. I used to easily get \"exceeds expectations\" every month, whereas now they want me to continuously struggle and squeeze every drop of effort out of myself just to justify a \"meets expectations\". My goal for quiet quitting is to start putting in the same amount of effort as the other lead IC, who notoriously underperforms but is never held accountable. However, it's going to become extremely and immediately apparent as soon as my next monthly performance evaluation hits, and my managers are going to be asking me \"WTF is going on\".\nI fear that this will immediately result in 1-2 months of \"does not meet expectations\", followed swiftly by a PIP or something like that. I'll be told to go back to my previous baseline, and when I don't, I'll be accused of insubordination or something. I really don't want to deal with this level of mental stress, especially as I'm already highly depressed from my rejections while job-searching.\nDo any managers here have an idea of what I should do to effectively and smartly go from \"ultra top performer\" to quiet-quitter?', a user said: 'When confronted with your underperformance, I would suggest that you say you are “dealing with some stuff at home” and don’t elaborate.'"
    ]
}