{
    "username": "Exciting-Region-8958",
    "contributions": [
        "In response to '[Deleted or Empty Comment]', a user said: 'She has noticed your lack of affection and feels relieved in it's absence.\nShe has been feeling resentful for longer than you.'",
        "In response to 'Yeah man it sucks, we’re not alone it’s more common than you think that’s why communities like this one can help you feel slightly better, and there’s success stories in here, so there’s still hope but I don’t know for me I’m good I don’t even want to save ir or what not, and that shift is just a protection mechanism from the brain imo, because expectation=disappointment. I even told her all of this yesterday, like yo you might not see it but this situation  is killing the whole dynamic of the relationship, just so you know, after the usual gaslighting telling me she doesn’t get her princess treatment so she doesn’t feel like my wife I told her what did you expect. It’s sad but most of the time it leads to divorce, what are your thoughts on that ?', a user said: 'She may feel relieved'",
        "In response to 'My wife keeps calling it the roommate phase. She's snide and nasty about it. Always some little snide comment like thanks roomie or some shit like that. I've explained it's just off putting to me and really kills any desire I have to even want to initiate. In my mind there is just going to be some kind of remark about any touching etc.\nEarlier tonight I come home from.work..she says hold out your hand...and says hi roomie..I lean in for a kiss in a playful manner and get the dont touch me speil....instantly  killed any type of desire I have.\nIm eating dinner alone, as she's in the bedroom, probaly playing some game on here phone. Got the dont talk to me, dont come near me Yada yada...\nJust venting....', a user said: 'Keep bringing it up to her is as off putting to her and is likely to kill off any desire she may have'",
        "In response to 'Google grey rock.  The mindset shift will make it easier to handle the pain of rejection.  Essentially treat her like the roommate she is.  Lean into your hobbies, hang with your friends, live your best life.', a user said: 'Did that technique work for your relationship?'",
        "In response to 'It didn’t fix the DB, but I’m in a much better place mentally.  I’ve lost weight, gotten in better shape and see my friends more than ever.  I think it may be pushing her to finally want marriage counseling .  She blew it off when I tried to set it up.  We’ll see.  I think I am open to whatever happens in the future', a user said: 'Grey rock advice is not solid advice.\nGetting self validation from exercise, friends, interests is solid advice.'",
        "In response to 'This is exactly where I am. We just went six months without sex. She says all the right things — she misses her libido, she misses sex — but actions speak louder than words. Now, she finally told me that penetration had started to hurt. She says she will look into doing something about it but I’m not holding my breath. Last week, she brought up the subject again and mentioned that we should aim for “quality, not quantity.” I just didn’t have the heart to tell her that the quality isn’t great either. After six months, we tried to have sex and it was unbelievably awkward. I had a hard time even getting aroused.\nSo I just don’t bring it up and the issue will likely die a slow death. Every other aspect of our marriage is good, so I don’t want to divorce.', a user said: 'She probably feels the same that the quality isn't great for her either.'"
    ]
}