{
    "username": "Existing-Constant-33",
    "contributions": [
        "In response to 'How did you find a hobby you enjoy? I mean nothing brings me joy anymore', a user said: 'I’ve found, when I get to the point of losing interest in everything, I force myself to either (1) do first simple steps of something I’ve enjoyed in the past or (2) try something new even if it sounds trivial or stupid.  Some examples… when I’m not depressed I’ve enjoyed knitting.  So I get yarn and just knit the most simple thing… a scarf.  The act of making something, the motions of, can sometimes trigger a slight interest.  Or feeling of accomplishment.\nFor trying new things, some ideas I’ve tried\n- paint by number (they make adult ones, inexpensive on Amazon)\n- zendoodles.  It’s just doodling, but looks nice.\n- I bought a book on making paper airplanes\n- small kits on Amazon, such as miniature dollhouses.\n- adult coloring books and gel pens\nAlso I’ve found developing my own “inner cheerleader” helps.  So when I accomplish even a small thing, I let that inner cheerleader talk to me like I’m 5 years old and have done something amazing'",
        "In response to 'Well, because they are my friends and my family.  I care for them deeply and I do not wish to cut them out of my life. They are all very good people.  I just don’t have the energy or motivation to uphold all the social obligations that are expected of me any more. Perhaps we can talk and they can understand where I’m coming from, but certainly don’t want them to think negative things that just aren’t true about me.  I may not want to be involved in the outside world any longer, but I don’t wish to taint the past thirty years of my life by burning bridges.', a user said: 'It’s good that you have people you care about so much.  I’ve been there, for an extended period, but came out of it after about 4 years.\nI think it’s worth the effort to try to explain, briefly, what is going on.  For their sake (so they don’t think they’ve done something wrong), your current self (since you care what they think), and your future self in case you find energy to want to re-engage with others.\nI basically said “sorry for my silence/disappearance.  It’s nothing personal.  I’m going through something, feeling incredibly overdone and currently taking care of myself involves a lot of solitude.  Thanks for understanding.  Please don’t take my behavior as a sign of not caring”\nYears later some family members helped me find help to understand what was going on that I needed SO MUCH solitude, that I was isolating.  I was able to regain some of the friendships.  I don’t think anyone ‘held it against me’ (that I kind of disappeared) but we still grew apart.  But the initial explanation helped me get back in touch.  At least I’d said ‘something’ to try to make it seem I wasn’t just being selfish and rude.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'One-upping someone’s troubles doesn’t help anything/anyone.  Things could always be worse … so what?\nThat doesn’t invalidate someone else’s feelings.\nWhen someone is tired/stressed/depressed … whatever, the last thing they need is to feel guilty about it!\nI’ve never seen sufficient ‘reason’ for my periods of depression.  Invalidating my own feelings led to intense guilt and made things much worse.  Depression / feelings / wanting-to-be-alone… whatever.  It happens.   No one should invalidate your feelings, and don’t do it to yourself.'"
    ]
}