{
    "username": "ExLegeLibertas",
    "contributions": [
        "In response to 'Original Post: This would be taken as \"quiet quitting\" [External Link]: https://i.redd.it/yxchlyvvsz3a1.jpg', a user said: 'this is how i operate at work. i make just enough to keep my head barely above water, with essentially no capacity to save money at all.\n\"the only reason i'm here is because of the pay, the company has negotiated with me and with the union to make that pay as low as it can get it, and so the result is my income is barely adequate. in return,\nso is my work.\n\"'",
        "In response to 'The detail about no saving money capacity hit me right in the gut. I think companies, especially big ones, thrive on that. Especially when inflation is high, or some political bullshit starts going on. Kinda makes sense, since politicians, almost universally, are elected by the big businesses in those respective places, or they actually run those businesses themselves. What I'm trying to say is I'm pretty sure at this point we're completely and utterly screwed, from multiple points of view.', a user said: 'well, we're certainly at the wrung-out ass-end of capitalism. something has to change.\ni think the spirit of the 2020 uprisings is still there, despite COVID being allowed to run amok and demoralize everyone with fatigue and new disabilities. there's room to hope for more community resilience and organization. it all starts with us, and with Actually Doing Material Things, however small.'",
        "In response to 'Man, they have really done a number on us. They are all in it together. Give us enough to eat but also as little as they can so that we can't afford to stand up for ourselves. I support the railroad but my union don't. I support the barristas and the Amazon workers. My union don't. They say nice things but we won't act on them. We need someone to unite us all. Our own Fuckin Trump! Other wise just get back to work and be happy you have a job. This is bullshit', a user said: 'on the contrary, we don't need \"our own trump.\" what we need to do is stop relying on individual people to try and game an already-broken system in our favor. we need to be rid of the system that keeps us all down in the first place. we don't need government, we need community resilience.'",
        "In response to 'My pay is as low as they can get it, so my work is as low as I can get it.', a user said: 'exactly.'",
        "In response to 'When we see ourselves as fighting against specific human beings rather than social phenomena, it becomes more difficult to recognize the ways that we ourselves participate in those phenomena. We externalize the problem as something outside ourselves, personifying it as an enemy that can be sacrificed to symbolically cleanse ourselves. -\nAgainst the Logic of the Guillotine\nSee rule 5: No calls for violence, no fetishizing violence. No guillotine jokes, no gulag jokes.\nI am a bot, and this action was performed automatically. Please\ncontact the moderators of this subreddit\nif you have any questions or concerns.', a user said: 'fair enough, i got carried away. :P'"
    ]
}