{
    "username": "Fabulous-Owl4161",
    "contributions": [
        "In response to 'Original Post: Why is quiet quitting even a thing in America? I mean, in Western Europe you're supposed to forget about work once you've spent your 8 hours (hour and a half for lunch and breaks included) at the service of the company.\nI can't understand why is quiet quitting even a thing... How could it be \"quitting\" to do just your regular job and refuse to do overtime or completing tasks outside of your job description? Isn't that what you were hired for? Why should you do unpaid extra work?\nThis mindset of \"you must sacrifice yourself for the company and you must be happy about it\" is downright exploitative and undermines any kind of work—life balance.\nIn countries like France, even contacting an employee during their vacation period may get the company into legal trouble, that's the standard in the developed world outside America.', a user said: 'One of the issues that I see that contributes to this mentality is living in what's called an \"at-will\" employment state which basically means that, within reason, your employer can fire you for practically anything.  When you aren't protected under law you end up going above and beyond trying to please your employer to stay on their good side so they don't fire you.  I think part of it is generational as well.  I'm Gen X so I have mostly worked for people in the Baby Boomer generation.  Most of them do have an impressive work ethic but they also came of age during a time when you could go to work for a company for 30 years, be promoted from within and enjoy a career with a guaranteed retirement.  Those days are over but we are still perpetuating the mentality that you should be loyal and work hard for your employer - even if that employer doesn't provide any opportunities to advance your career or any guarantee of a decent retirement.  I used to drink the kool aid and believe that if I worked hard for 20 years I could get somewhere.  I've been working hard now for 26 years and all I've found is disillusionment with the system.'"
    ]
}