{
    "username": "Fair-Housing6053",
    "contributions": [
        "In response to 'Your question is actually two parts, the government propaganda bit and the backlash bit, so I'll address them individually.\nThe government tells us to compete and work harder because they are completely right,\nprovided you look at it from a top-down perspective\nwhich is their job. This is not solely bullshit designed to get your to work hard so our elites can reap profits (not\nsolely\n- I admit it's probably still partly thus). Business does not reward second place. The \"best\" gets the contract and hence the revenue. When they tell us to compete, they mean 1) on a societal level, where we collectively present a competitive nation capable of fulfilling the needs of international business, and 2) the personal competitiveness needed to remain labor-relevant and hence qualify for the best jobs which leads to (1).\nSingaporeans tend to be dismissive of our neighbors in SEA, but the truth is that countries like Vietnam, Thailand and Malaysia are developing economic zones which are in fact quite competitive with Singapore. While (admittedly only a few) Singaporeans derisively mock the corruption and incompetence of other countries, they don't understand that businesses don't need\nthe whole nation\nto be educated, qualified, follow rule of law and have good infrastructure. They only need a\ncentralized city\nto be that way. China did this back in the 2010s with the modernization of Shanghai and Beijing, insulating them from the corruption and petty inefficiencies of other Chinese cities. Other countries have taken note and are creating such centers themselves, often with Singaporean investment (after all, we want to be a hub for a rich region).\nBut if our population gets complacent, our place will be usurped by one of these regions. This is a long process that won't happen overnight, but once it gets really going it becomes really hard to stop. Investment tends to be memetic - you think that investors are poring over billions of spreadsheets to find the best places to invest, but the large majority of them are as lazy as everyone else and just figure out what is \"hot\" and follow along. In many cases this works because \"hot\" is self-fulfilling when a mass of investments drive up property prices, bend the local governments to pass business-friendly laws, and education orients itself accordingly.\nSingapore is memetically good to invest in now, but this position will be shaken as Vietnam and Malaysia learn from us. Please keep in mind, their top academics are not stupider than ours, even if the population elects morons into their governments. They too understand the basics needed to attract overseas investment. If we get complacent, businesses will move and a lot of side-effects of this investment, like our high employment, will disappear. The UK is experiencing this precisely because the rural idiots took the importance of London for granted and now they're the ones losing all the jobs.\n----------------\nNow you may not agree and it is entirely justified for you to do so because it is not your role to look at it from a top-down perspective and you must make decisions that best benefit yourself.\nAnd in fact, the concepts you mentioned (\"quietly quitting\" and \"lying flat\") are not about defying national competitiveness but rejecting employer abuse. This is a trend I hope will push us into a more ethical employment framework and narrow the power balance between employer and employee, especially local SMEs who still think workers are peons to be exploited. They are in fact distinct from the hikikomori and NEET trend that originated in Japan but is seeping into other Asian cultures, because the latter are based on low or no employment.\nThe truth is, employers should\nNOT\nbe expecting employees to go above and beyond for the company (unpaid overtime, long hours, crunch), because our work is entirely a\ntransaction\n. We are not a fucking family. We don't owe then anything more than what they pay us for. And indeed, Singapore has some of the worst labor laws in the developed world, even compared to memetic hellscapes like Tokyo. We have virtually no protection or security net from our employers - they can fire you at will except for very specific discriminatory reasons. Employers treat us as expendable and so should not expect loyalty from us.\nBefore you give your time away, ask yourself if the company would fire people if profits fall. If the company has no loyalty to you, why be loyal to them?\nAnother important point here: job-hoppers report an astounding rate of pay increases compared to people who remain in the same company for more than two years. If you're the sort who sticks in one job forever, the company will LOVE you because they know they can heap a ton of abuses on you, perhaps toss you a consolation bone or two, and you wont quit. In this, I refer to the government's advice above - stay competitive and keep learning and developing your skills, constantly seek new employment and jump when opportunities present themselves. Don't \"lie flat\" when it comes to looking for new opportunities - make your own pay rise and promotions by cultivating your CV constantly. The real work that pays is the art of getting new jobs, not staying in them.', a user said: 'Nicely written'"
    ]
}