{
    "username": "Falkor",
    "contributions": [
        "In response to 'Original Post: People who quiet-quitted in 2021/22, where are you now? There was a huge(ish) movement of people quiet quitting their jobs a  few years ago (+ around the time Break my Soul by Beyonce came out).\nFor those who were inspired to quiet-quit, did you stay that way, change jobs, regain energy etc.?', a user said: 'The quiet quitting movement was great, it allowed me to identify all the dead weight in the team, as well as identifying redundancy candidates. Great work team!'",
        "In response to 'Mfw you comment this trying to be smart but the other comments are people quiet quitting hoping for redundancy.\nYou guys should link up.', a user said: 'Fine with me if it works for everyone 🤷‍♂️\nBut none of the redunancy payouts I gave were life changing, couple months pay at most.\nAnd the job market atm is brutal, I wouldn’t want to be looking right now.'",
        "In response to 'How come so many people from your team were made redundant? Are you bad at managing your staff?', a user said: 'I dunno, maybe?\nIt was only 2 people, when you have clear deliverables and expectations, it’s easy to spot the people not doing any or very little work.\nAlong with a company wide ‘restructure’ unfortunately those people had put targets on themselves by showing we could still function without them'",
        "In response to 'There's a difference between sacking someone for performance and redundancy... it is illegal in Australia to use performance for the basis of a redundancy. You make a position redundant, not the person. If there are multiple people in the same type of role, sure you do a skills matrix or have them interview off against each other, but yeah only a retard would make a person redundant over low performance. Then you can't rehire anyone into the same position lol.', a user said: 'Yep you make a great point, to clarify, in the org I was in there was a globally mandated reduction, like a lot of orgs have been doing. Sadly I had to lose some headcount, the teams had multiple people so unfortunately the people not pulling their weight were generally made redundant.'",
        "In response to 'Working to your agreed contract is \"dead weight\" not the sharpest are ya 😂', a user said: 'These people weren’t even meeting their deliverables. Far from their agreed contract.\nThey were doing pretty much nothing and hoping to just not get noticed'",
        "In response to 'Ahh well that's something else entirely isn't it? That's not quiet quitting that's the underperforming. You really should know the difference', a user said: 'Fair enough, apologies for not knowing the terminology 😂\nThese people just decided to do fk all, barely even their job.'",
        "In response to 'Agreed. The only thing these tire kickers are useful for is to sell things to because of their selfish consumer brains.', a user said: 'Seems a bit excessive, I wouldn’t go that far.'"
    ]
}