{
    "username": "FallenKing125",
    "contributions": [
        "In response to 'Original Post: Quiet quitting could be the best thing for education. Everyone's definition of quiet quitting is different. Mine is not working outside of your contract ours. Work from 7am to 3pm and then you're done. No lesson planning outside of class, no chaperoning, no working gates unless it involves extra pay.\nWhen you ignore these boundaries, you overwork yourself, can't sustain the position, and you end up leaving the profession and in return your students lose a great educator.\nIf you can't do all the tasks a school asks for you to do during the day, that is not the fault of you, it is the fault of your boss requiring too much of you. If you continue doing these tasks outside of your hours you are effectively telling your admin that this is okay.\nWhen you put your value in working extra hours because it makes you feel like you are \"doing it for the kids\" you are doing the opposite long term. The precedent that teachers have to put so much time in outside of work is toxic and leads to teacher burnout. A shortage of teachers is not good for any educational system.\nI'd like to blame admin, government, or students but the easiest fix is in the teachers themselves. When we overwork ourselves, we effectively hurt education. Only work your hours and if you can't get your work done, let your admin know you don't have the time. Healthy work life balance can keep us going and bring more teachers into the profession.\nEdit: Sorry y'all. I didn't realize how problematic the term \"quiet quitting\" is. I am glad though that it brought some attention to the post which led to some good discussion. I will use a different term from here on out and I am happy a lot of you only work your hours or work your contract.', a user said: 'It’s funny, I burned myself out during a long term sub job working passed hours. I’d been at the school 3 years, made great relationships with staff and kids, and had hoped doing near perfect in this position would get me a full time job with my own classroom (several teachers were leaving that year). I stayed at school until about 7-8 each night and then continued working until midnight at home as it was hybrid learning and I was given multiple kids that needed HEAVY accommodations to their work. By the end of the 3.5 months, not only was I burnt out, I ended up getting cancer (in remission now) most likely from the stress and overwork that destroyed my immune system. Best part? Wasn’t even offered a position when 4 opened up, despite my hard work and loyalty. So I quit and went to a new district and “worked the rule” only to have that admin to essentially say that if I wanted to be effective as a teacher, I’d have to work until like 5 or 6 each night and even use weekends. Can’t win anywhere. I’m in a much better place now thankfully.\nEdit: typo\nEdit 2: I’d also like to point out I stayed at that first school the remainder of the year as a building sub/para helping out with the staff shortage WHILE GOING THROUGH CHEMO, and still wasn’t even considered for a position'",
        "In response to '[Deleted or Empty Comment]', a user said: 'I appreciate it, and thankfully I am doing well, I’ve been a year cancer free so far.\nBut that’s such bullshit you went through. Like, it’s one thing for me being there only 3 years, but for someone who’s worked 13 years in the same place? With glowing reviews and 4 interviews? And still get nothing? Some of these districts are ridiculous. That’s why I’m reconsidering a teaching career and either working in special Ed with nonverbal elementary students (done it before and liked it), or some career working with kids outside of schools. Because at the end of the day, I love working with and teaching kids, but the administration/environment of a lot of schools I’ve been to have just ruined the idea of teaching for me.\nIf you haven’t found your permanent place yet, I wish you the best in finding it friend'"
    ]
}