{
    "username": "FantasticMeddler",
    "contributions": [
        "In response to 'Original Post: My cousin is SFPD and has the same take on the bikers. Are we basically just paying them 3/4 $billion a year to cry and quiet quit? [External Link]: https://i.redd.it/uhdkr8xy39ld1.jpeg', a user said: 'They have no incentive to do their job because they are paid regardless of if any actual police work is done.\nThey risk more doing something than doing nothing.\nWe have to let the police do their job, or this will keep escalating.'",
        "In response to 'Original Post: Is anyone else “quiet quitting” or just completely burnt out? I’m just completely over it. I used to be so “hungry” and now I’m catching myself doing the bare minimum, and I genuinely don’t care if I get fired.\nI think the largest factor is that I’m not getting paid until equipment ships and we’ve been on a year+ lead-time, so the carrot is essentially gone.\nI don’t have an ounce of ambition left in me, and it sucks because I have “golden handcuffs” to this job because I have over $50k in commissions waiting for me.\nIs anyone else feeling the same?', a user said: 'Yes\nIt doesn't help that my old company had no incentive structure for opps/meetings and just kept saying \"its coming\" over and over while hiring more and more SDRs and just paying them a base salary. That was ok when it was 0 stress, but I didn't sign up for no incentive, a quota, and 100 dial a day culture.\nThey hired this clown to \"run sales\" at my former employer. He literally could have been someone that walked off the street. He touted himself as some big player in the SaaS space and had rotated through 14 jobs the past 20 years, and only a few were in sales. He had 0 idea what we did and started ordering us to do massive massive activity and did not rectify any issues in our org around comp. When I realized he was just going to be a mouthpiece and attack dog for our inexperienced, young, and uneducated founder I just checked out. This was a 4 person sales team that had no need for a middle manager and decided to start adding headcount when everyone else was shedding. We had 0 sales coming in and it was all self service and PLG. AE making $0 in commission, SDRs making $0 in commission. Complete disaster. Saving grace was the founder was at least a chill person, then he hard this sales caricature to whip us into shape, and that basically amounted to him acting like a drill sergeant instead of actually....fixing anything.\nYou can't hire someone to fix something for you if you don't let them or know how to run a company yourself. All that happened was the stupidity that was happening before got augmented with a hard charging try hard asshole who put a ton of activity KPIs in place for no goddamn reason.\n​\nWithout commission, this is a low paying telemarketing job.\nWithout the chance of promotion to AE/SE/CSM/anything else, this is a low paying telemarketing job with no future.\nWithout the autonomy and lack of stress from WFH (constant standups, 30-60 minute morning meetings, and constant slack impromptu chats that turn into unnecessary meetings), this is a low paying telemarketing job with no future in a miserable environment.\nHaving seen what it was and what it had become, I did my activities and made a great effort. Booked tons of meetings, got paid $0. And realized if I actually hit these metrics they would never, ever actually pay me if they could get us to do it for free.\nBeing put on plan or just made to fear for your job is not an effective motivator for me. Quiet quitting is much better as you can go on unemployment. These companies are just banking on their SDRs not knowing better. I'm super done with this role and hope it goes away.\nI get spammed by half a dozen equally shitty companies each day to get me to interview and start the process all over again. They gaslight you into quitting, starting over with them, and then have the gall to ask you why you are still an SDR.'"
    ]
}