{
    "username": "Far_Cryptographer593",
    "contributions": [
        "Employee quiet quit... 4 years ago. What can be done? I have an employee that has been 6 years with the company, the first two years he was performing very well and had a salary increase 5 times (the maximum possible) within 2 years. After denying a promotion the employee almost immediately went on a month's sick leave and when he came back, he never discussed anything about career growth and performance. The employee is the most popular person in the team and is engaged with everyone on a personal level, but not on a work level any longer. The proactivity is completely gone and when assigned new tasks it can be meet with \"I dont think this is on my level\". All the managers are always given \"the cold hand\". Besides this, the employee has far the highest sick leave in the team. I thought the issues were outside of work but could never get a clear answer as the chemistry between us went to non-existent.\nEventually, I became a higher manager 2 years ago and a new manager took over and I dropped the responsibility. The new manager has pointed out all the work is bare minimum and the employee does not seem to be motivated and when discussing promotions and growth it is often met with \"I'm happy where I am\". In the last 4 years, there have not been any personal salary increases on top of the yearly for all employees.\nI recently found out through multiple non-managers that the reason for this behaviour is because of the denial of the promotion 4 years ago. After hearing the stories, I agree that I handled it very badly. We were suppose to have a meeting about the promotion before the employee went on a long holiday, but I cancelled it one minute beforehand with a Slack message saying there won't be a promotion and not giving any reason.\nI'm wondering what can be done at this stage? I want to solve this and not by a dismissal as there are very high employee rights in our country.",
        "In response to 'Just as a recap, employee gave you his best for 2 years. You basically told him it wasn't good enough and didn't show him the respect to do it in person or even give him a reason. Now, you're surprised he just does his job.\nApologize for how you handled the denial. Take accountability for what you should have done and tell them you appreciate their continued work. You disrespected him and he learned there's no point in giving extra. It'll take a million baby steps to rebuild the trust.', a user said: 'The employee gave his best for 2 years and was awarded for that 5 times, when the next discussion came around 6 months later he was awarded a salary increase but not a promotion. I agree 100% that I did not give the respect and it was a huge mistake.'",
        "In response to 'I'm failing to see any issue on the employee level and all the issue on your level.\nHe's doing the minimum required, so he's doing his job. He's happy where he is. He's good with his coworkers. He's not harping about not getting promoted. And he's not harassing management about a promotion.\nThe issue seems to be your expectations. You expect him to go above and beyond as he did before when he was looking for a promotion that you have since told him does not exist.\nWhere is he at fault here?', a user said: 'I am 100% at fault but I am also sure that he is not happy. And this is what I want to change, I want the person to be happy, I am not the direct manager any longer and the job expectations are not my main concern here.'",
        "In response to 'How recently did you attempt a growth conversation and how was it received? Also, how can they grow outside a promo if you’re not giving salary adjustments', a user said: 'I'm not the manager any longer but the current manager has tried to set yearly goals the last 2 years and 2 years with me. The employee sets up goals but does not reach them and therefore does not get a salary increase. The goals have to be something new so essentially the employee just chooses to stay on the same level.'",
        "In response to 'Sounds like the goals thing is arbitrary, and not utilized efficiently. Are those goals tied to business outcomes? Or are they touchy feely ambiguous ones that a manager can use arbitrarily', a user said: 'They are arbitrary and 90% connected to personal growth.'",
        "In response to 'Edit:\nwow didn't realise I was in\nr/antiwork\n. A lot of managers defending a drop in performance, change in attitude and excessive sick days.\nYou need an honest conversation with HR expressing your concerns. I suspect they'll tell you to document everything and to hold this employee accountable.\nThey can only coast by if you let them (though I appreciate it won't be liked and it's a lot of work). I don't think there's an easy way out other than calling them out on what they're not doing but should be', a user said: 'Accountable of what? To clarify, on paper, the employee is performing according to the job description, but the job description is really vague and broad. We cant force someone to aim for a higher level.'"
    ]
}