{
    "username": "faroffland",
    "contributions": [
        "In response to 'In a logical, fair company - sure.\nAs someone who went above and beyond consistently in a shit job, promotion never came regardless of effort and care on my part. I saved them thousands, pushed the company ridiculously well and got nothing for it, and treated like shit.', a user said: 'This is my situation now. I’ve done 2 interviews for jobs I’m more than capable of and not got the role - one in favour of someone it was very clearly made for from the get go and one because of ‘difficult personalities’ apparently (not my personality but who I’d be working with! This one particularly stung as I was the only fucking candidate and they’d rather risk it with someone external than give it to me - not that I particularly want it anymore given the reason lmao).\nIt’s absolute bullshit and my motivation is at rock bottom. I have gone above and beyond time and time again, and everyone in my team knows I do, but my interview panel was one where 2 out of the 3 panelists don’t work in my team or even my fucking field! How can you describe how you step up to the senior level time and again when 2/3 interviewers don’t have a clue what stepping up even is in your team/field??\nSo now, nope. Not stepping up. Not helping train anyone or doing anything else expected of me outside my job role. I’m coming in at 8, doing my role and leaving at 4. My manager is one of my closest friends and he is outraged I didn’t get these jobs too, but totally gets why I’m totally checking out from now on.\nI’m staying because I’m planning to have a baby within the next year and then once I’m getting back into my career again I’m out. I might not even come back after maternity, my husband earns more than enough that we could pay my maternity pay back (also partly because the maternity offering isn’t great lol). My manager knows this and has basically said ‘I’d be gutted if you left but yep go for it’.\nSo yeah, fuck it. I’ve worked my arse off for 3 years including throughout the pandemic and it’s now clear to me I will only progress when the organisation thinks it’s ok, not when I’m capable or demonstrate I am at interview. I’m done.\nCurrently working from home today and as we speak I’m playing PlayStation cos FUCK IT.'",
        "In response to 'I don’t blame you, a lot of companies take the fucking piss. At that old job I didn’t “quiet quit” I actually quit because I got screamed at for doing something my manager told me to do.\nI installed a suggestion box. That concept was highly offensive to senior management. Apparently people would abuse them through it and I asked what they meant and they said people would ask for sick leave.\nSo yeah, I quit. Getting reamed for doing my job and their attitude to their employees was enough for me to give up on them after everything I did for them.\nGet what you can, leave, don’t look back. Theres some seriously fucked up employers out there. No one quits a bad job, they quit bad managers.', a user said: 'It’s fucking mental isn’t it. I already act in this more senior role I went for a lot of the time, in fact the fucking head of department encouraged me to apply for a job ABOVE the one I went for! But she’s on maternity so it’s all gone to shit, leaving me to be interviewed by a panel who had no fucking idea what I was even talking about.\nAnyway - it is what it is. I can’t be bitter about not getting a job forever but I would 100% be applying to other jobs today if I wasn’t about to start trying for a baby. The good side of my role is I love my manager and team, and it is a flexible workplace where if I want to come back part time after a baby I can.\nSo I’m letting myself rage but also being practical and reminding myself there are benefits to staying through having a baby. It could definitely be worse and overall I do love my job, I just have zero progression here (and they’ve proven progressing here isn’t about ability or skill so quite frankly I don’t really want to progress in an organisation like that).\nIf my manager wasn’t one of my best mates I’d be leaving though. It’s so true about having bad managers, sorry you had such a shit time at a previous job! It’s like they actively don’t want to make workplaces a better place to work, which would then get better work out of people. I don’t get it at all.'"
    ]
}