{
    "username": "FartSpeller",
    "contributions": [
        "In response to 'They're going to TRY stopping it by slamming us with a recession and massive unemployment.\nThat might kick the can down the road a bit, but only pisses everyone off even more, long term.', a user said: 'Yes. The Federal Reserve is raising interest rates and reducing its balance sheet because they want to fuck you over.  Has nothing to do with the rampant inflation.  (/s)\nThey’re trying to make it possible for people to be able to afford housing and food in a few years from now.  As soon as inflation starts coming down, unemployment will start going up, then the job market won’t be so easy and many people will be glad to be employed at all.\nThis is all in the best interest of society.  10% inflation every year is not sustainable.  The Fed is a one trick pony and it’s the only way to fix it.'",
        "In response to 'The head of the fed dead ass said they will do whatever it takes to stomp out the wage increases we've been seeing lately.\nThe Fed is not your friend.', a user said: 'Right, because that’s what has to happen to slow inflation.  We could all make $500,000/yr but if a loaf of bread costs $20,000 your salary doesn’t go too far.'",
        "In response to 'And it's always the wage slaves who get pummeled, because doing ANYTHING to touch the ever-increasing record corporate profits is anathema.', a user said: 'It is indeed the wage slaves who feel the brunt of it.  But, the fed doesn’t set rules on how much a company can make or how much they should pay their employees.  Just set baseline interest rates.\nFurthermore,I think people fail to recognize that if the US started putting caps on how much a company could make and/or taxed the ever living fuck out of them, they would relocate to different countries with different rules taking all their jobs with them.'",
        "In response to 'The problem with this (And I do in part agree, the FED has to attack inflation), is Powells policies completely ignore companies experiencing record profits (not just in absolute terms, but as %'s ).\nIf you are going to take the stance that wage increases have been substantial and beyond a sustainable level, you also have to look at the whole picture where profits have exploded too (under crazy wage increases) and attack both fronts.\nTalking about people being able to afford homes, without discussing how we're going to reduce the prices on commodities all humans need, will miss the mark and the \"steel manned\" argument you are making.', a user said: '-If you are going to take the stance that wage increases have been substantial and beyond a sustainable level, you also have to look at the whole picture where profits have exploded too (under crazy wage increases) and attack both fronts.\nHow exactly would the Federal Reserve dictate how much a company does or doesn’t make?  Tax policy could impact their bottom line I suppose, but that’s our law makers not the Fed.\n-Talking about people being able to afford homes, without discussing how we're going to reduce the prices on commodities all humans need, will miss the mark and the \"steel manned\" argument you are making.\nI used home prices as a generic example.  Inflation makes everything cost more, including “commodities all humans need”.\nIt’s not like Jerome Powell is the supreme being that dictates all things about everything.  They just set the baseline interest rates which trickles down to interest rates of everything else.  If inflation is too high, those rates need to go up. That’s pretty much it.  I’m sure if Jerome could choose to make every member of society zillionaires while experiencing no inflation so a loaf of bread still cost $2 he would do that. That’s not how economy works.\nEdit: typo'"
    ]
}