{
    "username": "Federal-Sand-9008",
    "contributions": [
        "In response to 'Original Post: Got my boomer parents to say I should quiet quit. So I started a new job 8 days, 6 business day, ago. This is CapitalOne, by the way. Today, my HR manager gives me a call and tells me that I can either take a 25% pay cut or leave my job. I'm not even done onboarding yet, as they want me to watch nearly 40h of trainings along with applying for all my permissions without telling me what they are. On top of that, this was always meant to be a hold-me-over type of jobs, as I already took about a 30% pay cut for this job, but I had been unemployed for nearly a year, and wanted to stop bleeding money. And so I talked afterwards, in private, to some of my team members, and apparently this is just normal behavior for the company.\nMy parents gave me a call for the holidays after work. They asked me how the new job was going, and I told them about it. Both my parents are avid Fox News watcher, and had been complaining about the \"quiet quitting epidemic\" for sometime. My dad, was like, oh you should quit and find a better opportunity, but my mom interrupted my dad and told me that I should \"Take the offer, look for a new job, and do the bare minimum at my current position\". I informed her that, that is literally \"quiet quitting\", and she without missing a beat told me to \"quiet quit\" and my dad soon followed suit.\nMy parents might be pushing 80, but I'm glad I finally got them to see the light of how messed up our economy is. And I feel very proud about it, prouder than most other things in my life, and I made discoveries in my industry that fundamentally changed it, and you know what, I feel more proud about this, than I do that.', a user said: 'It baffles me how your laws permit this. Where I live it’s illegal to reduce a person’s salary once they have been registered. They would need to fire and re-hire  you with a lower salary to accomplish that, but doing so is considered unjustified dismissal so it gives you ground for legal complaints.\nIt sucks to have you doing quiet quitting a week into the new job, but at least you know that things won’t be getting any better so you can move on with looking for another job.'",
        "In response to 'It’s because America’s leadership was purchased by big companies. In fealty (or because they’re from that world), they made laws that helped CEOs and hurt workers. They killed programs that kept companies in check and allowed them to run like greed-on-wheels.\nIn the 1950s none of this would have been possible. Ironically, this is the time frame referred to when those that keep this shit locked in say “make America great again”.\nIt’s a t-shirt slogan. They have no intention of doing what’s necessary.\nAnd they don’t teach long term vision in business anymore. It’s “get in, get yours for as long as you can, then get out when it starts to inevitably turn or you get bought out.”', a user said: 'I hear you, sometimes it feels the law in general is made to help the companies and not the people. Companies constantly blocking the increase of the minimum wage to livable standards saying it will greatly affect their finances, then they go and sponsor a F1 racer with millions and millions just to have their name stamped in the bumper of the car.'",
        "In response to 'What country? Guessing Europe.', a user said: 'Mexico. But let me take the opportunity to correct one of my points. Your salary can be reduced as long as you consent to it by written. But they cannot do it if you refuse, and if they do it anyways you have the legal advantage.'",
        "In response to 'So if you refuse, they can't just fire you? In the US they can.', a user said: 'They can. But doing that is considered an unjustified dismissal so they need to pay compensation which is 3 months worth of salary,  20 days of salary for each year you worked there, plus other bonus payments specified by law (xmas bonus, antiquity bonus, vacation days not used, utilities, etc). And if they don’t, they get sanctioned.\nThe catch is that this is normally a long process, and companies tend to give a “resignation letter” to be signed instead of a “contract termination letter”, and some people sign it not knowing they have legal rights to that compensation money.'"
    ]
}