{
    "username": "FeFiFoPlum",
    "contributions": [
        "In response to 'So, basically, my job currently is software development manager. The vast majority of my work is coordinating my team and decision making. I am, a very good decision maker. Ironically, that skill was developed during my grind years.\nSo during my grind years, I was made a Tech Lead. During the time, I read everything about managing software teams.\n• The Mythical Man Month\n- Peopleware\n- Software Estimation: Demystifying the Black Art\nI also got Scrum certified.\nI’m not bragging but I am very good with people. Which is something the industry doesn’t have a lot of. Software devs, tend to be introverted. I’m an extrovert as well. I also have really strong communication skills.\nAll this, on top of my technical skills I built along the way.\nSo my days are very light and lean. I only take meetings if something is on fire. I communicate through emial and slack. I don’t waste developer’s time. If they need something, I get it done for them asap and often, that’s what leads to the positive reviews. Team Member feel heard.\nI also do some side stuff like push for time off for devs that do a little over time. If they request time off I’ll coordinate and make sure they can take their time.\nA lot of it, is simply not being as asshole. I also help my boss, think about problems. So they can make better decisions (they’re new at their position too. So they often appreciate the brainstorming)\nThe key, is “be seen, be competent”. That’s it. Most of corporate America is driven by the sales mindset. You don’t need to be good, you just need to sell yourself in a way to make them think you’re good.\nI mean, I think I’m good. But it basically comes down to controlling the narrative so people don’t get too suspicious.', a user said: 'That's a great place to be. You sound like an excellent manager.\nI also appreciate that you understand your strengths and you work to them. I think that kind of wisdom comes with experience.'"
    ]
}