{
    "username": "FerdinandTheBest",
    "contributions": [
        "In response to 'I wouldn't mind doing nothing for that much money. I've done worse for less... hah.\nCovid hit me hard. I was making a cross-country move in the Us, changing locations, and changing industries. Finally got a decent job to start moving towards those bigger $$$ roles and then boom covid. I struggled like hell with a product that didn't quite fit the market (they downsized recently). And ended up moving companies once the market returned.\nCovid shifted my priorities. I don't ever want to work for a company that doesn't show a good base of respect for each person working there AND I will only work with people I most like and respect. We don't have to be best buds but I want to enjoy the people I work with and for.', a user said: 'Hi there, today I've learned about our new, completely unrealistic, targets. Also today: We should introduced shifts so we will be able to answer emails that come in very late. Also normal: Just do it until Friday evening.\nNo\n&no&no. That is not in my job description. I do have a life. And yes, Covid shifted my priorities as well. Life is to short to suffer for an ungrateful company.'",
        "In response to 'I've spent the past month and a 1/2 literally doing nothing and somehow have not caught shit for it.. I'm so burnt out. I'm just kind of waiting for the day that I get put on a pip or just fired but that day still hasn't come so I'm gonna keep riding it out. I also got hit with a divorce a couple months ago so that didn't help, but I mean literally 0 effort. I show up to some internal meetings, 0 prospecting. Just take my base salary and golf or play video games all day.', a user said: 'I am taking online courses, just a suggestion (look up Google certificates). Stay strong. I am in a similar position. Plus, still on probation, not trained, no onboarding, than, out of the blue, unrealistic quotas. Looking for another job, waiting for an answer from another potential employer.  I will keep my fingers crossed for you.'",
        "In response to 'Original Post: Is anyone else “quiet quitting” or just completely burnt out? I’m just completely over it. I used to be so “hungry” and now I’m catching myself doing the bare minimum, and I genuinely don’t care if I get fired.\nI think the largest factor is that I’m not getting paid until equipment ships and we’ve been on a year+ lead-time, so the carrot is essentially gone.\nI don’t have an ounce of ambition left in me, and it sucks because I have “golden handcuffs” to this job because I have over $50k in commissions waiting for me.\nIs anyone else feeling the same?', a user said: 'Hi there, I am still on probation but, due to my company being pure chaos, no onboarding,false promises, people leaving, unrealistic quotas, virtually no tools etc. I am at the same point you are-dead inside.Looking for a new job at the moment, without  (or let us say, mostly without cold calling). The only thing keeping me going is Coursera and the gym (probably I am going there way to often...).'",
        "In response to 'Hows coursera?', a user said: 'Great. I am getting new job skills. Will help me to get\ns.th\ndifferent, like it has for many others. Just browse their offer in advance, there is a free trial but come on, 30 bucks a month for all you can learn is ok, in my books.'",
        "In response to 'Original Post: Is anyone else “quiet quitting” or just completely burnt out? I’m just completely over it. I used to be so “hungry” and now I’m catching myself doing the bare minimum, and I genuinely don’t care if I get fired.\nI think the largest factor is that I’m not getting paid until equipment ships and we’ve been on a year+ lead-time, so the carrot is essentially gone.\nI don’t have an ounce of ambition left in me, and it sucks because I have “golden handcuffs” to this job because I have over $50k in commissions waiting for me.\nIs anyone else feeling the same?', a user said: 'Update: Today I got rejected for a wonderful recruiter Gig....while I was typing this my jovial boss came in and asked me how I was doing. Yeah that is how little I care. Today I read some Dilbert cartoons dueing a meeting yo keep my spirits up. When my boss came in, I concealed my phone, I put up a shit-eating grin and answered:Marvelous! Yes we have great plans blah blah.\nI am on the brink of crying. I don't care about being a 100% fit I want to get out of this disfunctional hell-hole. Should I just quit?\nSorry, the scar is fresh. I need to get this off my back.'"
    ]
}