{
    "username": "Ferrousity",
    "contributions": [
        "In response to 'Can we stop acting like this is a legitimate term and not just a way for crappy employers to shame workers?', a user said: 'I made a comment already, but Google Work to Rule. Quiet Quitting is absolutely based on a legitimate union strategy'",
        "In response to 'The tactic is real, but the phrase \"quiet quitting\" turns it into a bad thing and shifts the blame onto the workers.', a user said: 'I wish I could give this gold. It's downright\ninsidious\nthat they've taken it from a context of workers reclaiming power and shifted it into almost an insult of laziness or work ethic'",
        "In response to 'Original Post: What are your thoughts on “quiet quitting”? Is it something you’ve been doing for a while or something you’ve recently started implementing? For those who don’t know, quiet quitting refers to not over extending yourself and going above and beyond at work such as taking on more responsibilities or staying late. You do what’s asked of you then go home on time.', a user said: 'Quiet Quitting actually refers to a union strategy called Work to Rule, and it's absolutely based. There's a reason we don't recognize it or know about it, and that's because thus country has gone out of its way to make sure anything that gives employees workplace power doesn't become public knowledge easily'",
        "In response to 'Yeah but let’s stop calling it quiet quitting', a user said: 'For sure, I fully support a campaign to refamiliarize the workforce with the original concept and all that actually entailed, not this still soft and subservient husk of what it used to be.'",
        "In response to 'Original Post: Quiet Quitting I monitor the AP email at work and get a lot of strange solicitations but this one really pissed me off.  It was an add for a webinar about ways to combat quiet quitting but their definition was ridiculous.  \"Quiet Quitting is when employees only do exactly what is expected of them never more\" how is this quiet quitting and not just doing your job. I'm both engaged and confused.  I'd heard the term before but never had it defined and man the revolution can't come soon enough!', a user said: 'Insidious as hell to guilt workers for not performing additional duties (for no additional compensation) when they are already undercompensated for the labor they\nalready\nperform'"
    ]
}