{
    "username": "Ferromagneticfluid",
    "contributions": [
        "In response to 'I have never heard it in a negative light. Quiet quitting just means working your intended hours and your intended job. Whatever you call it, teachers need to start doing it.', a user said: 'Quiet quitting to me sounds like you hate your job and you will do the bare minimum until someone fires you or doesn't renew you. The word quitting to me implies you want to be fired.\nWork to rule is so much better.'",
        "In response to 'The term \"quiet quitting\" isn't used consistently in the media . . . and teenagers are notorious for taking something out of context anyway . . .\nWhat \"quiet quitting\" (as I understand it) doesn't mean to do the minimum at your job, but rather not to overdo things . . . not to give yourself over to your work completely. Don't work overtime, don't stress about deadlines and obstacles you have no control over. Just do your job, within your 40 hours. If you are a teacher, that would mean no longer coming in early, staying late, working at home, spending your own money on the classroom . . .\nFor a student to \"quiet quit\" . . . if they were serious about it, it might mean not doing homework, or not pushing for that \"A\", just showing up and doing what you can during the school day.\nNot doing any work at all isn't quiet quitting, it's just quitting. And there's a lot more of that going around these days then there used to be . . . .', a user said: 'Naw quiet quitting is like daring the company to fire you rather than you just quitting yourself. That means doing even less than the what is \"required\" and realizing they probably can't afford to replace you. And if they do fire you, you were \"quitting\" anyways so no big deal.\nSo if you want to equate this to a teacher, it would be coming to work and teaching kids, but maybe you are showing movies more often than you should, not going to \"required\" meetings or fulfilling other duties that are asked of you and are probably in your contract.\nSo now if you want to properly equate it to a student, it would probably be aiming for a \"D\" or a \"C\" rather than a \"B\" or \"A.\"\nBut I bet students equate it to doing nothing at all.'",
        "In response to 'It’s the documenting and repeated calls home that make it not worth it to fail them. Trust me, we all give them pep talks and opportunities to dig themselves out, but there’s a 0% chance I’m spending valuable hours outside of class time documenting their laziness and calling their moron parents', a user said: 'You can't just give them an \"F\"? You have interventions, you have talked to them several times 1 on 1 in class, given them opportunities (I assume) to turn in work extra late.\nWhy do you need to call home? They are almost adults.'",
        "In response to 'Some schools make it a complicated process to fail a student, with multiple documented interventions and contact with parents. Easier to just throw the lazy ass a D and move on in those unfortunate scenarios', a user said: 'Yeah, I have that for graduating seniors, but just graduating seniors.\nAlso I have automated processes I can do like \"Email parents of every kid that has an F\" or \"Send every parent a list of missing assignments\" which I count as a contact.\nI do sometimes give students a D- and move on. As long as you haven't been a pain in my butt and put in some effort into the course, I don't see a D- as any different than an F. They can't take the higher level class after that.'"
    ]
}