{
    "username": "fine_lit",
    "contributions": [
        "In response to 'Original Post: When you quiet quit/ride it out till you get fired, it negatively affects others in this community I had a teammate who had been dropping the ball for a while and was finally let go this week. His output was so bad that my manager noticed and did some digging. Turns out he barely worked at all and was clearly just coasting till he got fired.\nWell, my manager and skip are PISSED and literally called out how they think our old teammate was working multiple jobs. In my xp, they definitely were as they had many signs.\nRegardless, it’s now coming back to bite my team and me with new policies. Yes I’m pushing back on all the BS coming our way and trying to minimize it, but I wouldn’t be surprised if activity monitoring software came up soon to flag suspicious activity as well. This gig has been great for OE for years and now it’s in jeopardy because someone couldn’t just quit when they were done… I have friends (OE and not) at multiple other companies who are dealing with fallout like this as well.\nMy point being, when you pull the anti work card and coast like this just waiting to be fired (which I see recommended here daily), it’s not an isolated event. You get your bag a bit bigger and your teammates (and fellow OEers) deal with the fallout.\nIt helps to push for more RTOs that may have not as it eliminates the possibility of many of these issues. This also affects remote offerings (wayyyy down from what I’m seeing myself in new job hunts)\nHow would you feel if others put your extra paycheck(s) in jeopardy?\nGet your bag, but don’t screw others over while you do it.', a user said: 'the idea of OE is inherently selfish and destructive to your colleagues by definition. From a “macro” perspective, you are single person taking up at least 1 extra job (often well paid comfy WFH jobs) away from other potential professionals, that may have non, no matter how hard you work you are at the bare minimum putting in half the time that other people put in (assuming just 2 jobs) which even if you are amazingly productive it’s not very different from quite quitting. You just feel like you’re on your high horse because you’re “grinding” but your actions as an OE are probably much worst for office morale/productivity than quite quitting. Imagine if tomorrow everyone found out that a) one of your colleagues is quite quitting and b) that you have been earning 2/3/4/5 salaries for the last two or three years, who do you think your colleagues would be most upset with?'"
    ]
}