{
    "username": "Flashy_Shop_9963",
    "contributions": [
        "Quiet quitting life I am quiet quitting life and nobody realizes that’s what it is. My friends think I’m just being a bad friend. My family just thinks I’m being a bad family member. I don’t want to die but I don’t want to live in the world any more. I just want to go to work and then come home and that’s it. I don’t want to go have dinner with people anymore. I don’t want to hang out and be made to feel obligated to stay until 11 pm before I can go home.  Nobody realizes that this is my way letting go of life, of escaping from the world.  I’m alone, I’m 30 years old and haven’t had an intimate partner for a decade. I love those in my life tremendously. But I just want to let go. When I’m home, I’m free to be who I want. To feel how I want, to look how I want. I can say what I want, my cat doesn’t mind. He doesn’t judge. He looks up to me and needs me and he’s the only thing that’s warm in my bed.  There’s nothing more signifícate to write here. Just thank you for listening.",
        "In response to 'Are you sure you are just letting life go, and not demurely asking for help? As in, \"please recognize I'm less present and pull me back\" or something.\nBut it usually doesn't work. As you say, people do not realize. And even if they do, they have their own problems to solve and their own lives to live.', a user said: 'I see what you mean. For me, no. I don’t wish for them to intervene.  I just wish that they didn’t think  it was so simple as me shirking my friendly duties. It’s so much more.  I just wish they understood, but if I talked with them, they would worry and I don’t want them to worry. I just hate that they think that.'",
        "In response to 'If you are getting away from them and don't wish any interaction, why do you care what they think?\nWhy is it important for you that they understand? I mean, most of 8 billion people on our planet do not understand you.', a user said: 'Well, because they are my friends and my family.  I care for them deeply and I do not wish to cut them out of my life. They are all very good people.  I just don’t have the energy or motivation to uphold all the social obligations that are expected of me any more. Perhaps we can talk and they can understand where I’m coming from, but certainly don’t want them to think negative things that just aren’t true about me.  I may not want to be involved in the outside world any longer, but I don’t wish to taint the past thirty years of my life by burning bridges.'"
    ]
}