{
    "username": "fleeingfox",
    "contributions": [
        "In response to 'Something that’s always confuses me is the idea that you should strive to work yourself into an early grave to have a good life.', a user said: 'You should strive for a reasonable balance between work and entertainment activities. As you get older, certain things no longer amuse you, but taking pride in your career gives people long-term people satisfaction.'",
        "In response to 'Eh.\nI spent 14 years absolutely busting my ass in my career field. It worked. I moved up quickly until I maxed out on the ladder. I knew my field. I cared about my work. But I was also existing in a constant state of burnout.\nI changed career fields for my mental health a year ago. I’m now in a non-management position in a role that is challenging but that I absolutely do not have to take home with me. I don’t feel defined by my title. My personal life and who I am as a person is completely detached from it.\nWhile I’ll likely move up the ladder a bit at some point for salary reasons, I have a much better sense of work life balance now that I’m not emotionally attached to my job. I mean, sure, I still have a solid work ethic and care about the quality of my work, but when my day ends I clock ALL THE WAY out.\nWhatever satisfaction ever came from working in a field I was passionate about wasn’t worth it. As I get older I intend to continue protecting my energy to spend on time with people I love doing things I love (however that changes over the years). I’m convinced that’s how you’ll one day reflect and see a life well lived.', a user said: 'Well I am very old and in my experience, people come and go. Kids grow up, friends move on. The average marriage in the U.S. lasts 8 years.\nWhen it comes time to make new friends, you need something more to offer than \"I'm broke but I have lots of time to spend with you\". Nobody cares. But your client actually cares if you do a good job on your work product. It gives your mood a lift in an uncaring world where old people are mostly invisible.'"
    ]
}