{
    "username": "Flowery-Twats",
    "contributions": [
        "In response to 'Do you think a lot of people will \"tone it down\" to punish their companies for RTO?', a user said: 'Yes, and some of the toning-down will be baked in: All the distractions and focus-sucking things in the office (aka \"collaboration\") will\nnecessarily\nreduce the quantity (and probably quality) of work being done.  And that's just the \"hard\" effects. There's also baked in \"soft\" effects, like being stressed from the just-completed commute (or stressing over the upcoming afternoon commute), etc.'",
        "In response to 'Being asked myself to go from full time WFH to hybrid. You better bet I am going to deliberately slow down my productivity on those office days, besides the fact it will naturally happen due to all the “collaboration”.\nAlso pulling way back on my flexibility with my hours when asked, no more jumping on for the odd thing for 5 mins after hours.\nI always thought my employment accommodations and compensation were a negotiation with my employer independent of my work colleagues. Apparently no it’s unfair to others who are hybrid if I’m WFH.', a user said: 'Also pulling way back on my flexibility with my hours when asked, no more jumping on for the odd thing for 5 mins after hours.\nThis. My company went \"above and beyond\" (by implementing full-time WFH for suitable roles TEN YEARS before COVID), so I've always reciprocated. Not any more.  Measure for attendance, get attendance. Measure for performance, get performance.'",
        "In response to 'Absolutely. The day in the office is hammer time. I get as much done as possible. Day after, it’s clock in, monitor any emails that may come in, and do me for the day. If you’re going to make me drive an hour in at 6am, pay for parking downtown, have to buy lunch and my own coffee, then drive another hour back home, all doing exactly everything I do at home, without even having a meeting, you better believe that next day is a free day for me.', a user said: 'Interesting sort of \"reversal\" of the usual response (\"I'll definitely be less productive when in-office\"). You're figuring \"the day already sucks what with having to commute twice and putting up with all the office shit, I might as well just put my head down and pedal-to-the-metal through the work because doing so won't add all that much suckage to the situation, then when I'm WFH I can coast and enjoy being at home\". I like that.'",
        "In response to 'I work at Chase.  I personally love a good “coffee badge” move.  With my team outside the USA, I don’t really care where I call them from.  I was remote ten years before it was “cool” with covid so their attempts to force me back 5 days a week aren’t working.  I show up in sweat pants, badge in, get coffee, make a couple phone calls and go home 30 minutes later and work.', a user said: 'I'm about to get RTO-ed after having it announced over a year ago (we're not the most organized place, like a lot of big companies). I'd always heard, unofficially, that coffee badging was considered by management and, therefore, they configured the offices to force \"badging out\" to exit and would be monitoring for it (coffee badging).\nIn a team meeting yesterday, my manager said something which made me go \"hmmmmm\": My manager is the only person who will get the badge-in reports, so they don't GAS if we coffee-badge. I will be in a location with none of my team members (which makes RTO double stupid), so I'm really considering it. My concern is that some Karen in the office will eventually notice what I'm doing and squeal over my manager's head, getting us both in trouble. Is that a concern for you?'",
        "In response to 'I feel like most will do this. My employer is forcing us back in the summer and when that happens my laptop is staying in the cubicle and I’ll delete outlook/teams from my phone. They said no work can be done outside of the office, so I hit my 40 hrs and then done', a user said: 'They said no work can be done outside of the office,\nMaybe I'm ascribing too much sinister intent to them (then again, maybe not), but I think THAT is one reason most companies are going with hybrid instead of full-time RTO: If you're allowed to WFH, you can't (legitimately) claim that you can't work outside of the office.'",
        "In response to 'Quiet quitting? Just what exactly is that? If you quit you still quit, doesn't matter how you do it. The company is still going to classify it as an employee quitting and not a termination so collecting unemployment will still be challenging for you as an employee to get.\nBut for anyone who does quit, I'll want to ask them, what leverage do you think you draw from that?\nEmployees have no leverage, none whatsoever. I always laughed at the people I see in here when they say they're going to defy the order or quit to try and show the company who's boss. Really, all that's going to happen is the companies will laugh at you because they're either going to outsource your job or hire a college grad who will take $20k less a year to do the job. Either way, the company got rid of someone who wasn't compliant and they save money on refilling the role.', a user said: 'Based on your first paragraph, I'm going to assume you are not trolling but genuinely aren't familiar with the term (hey, we can't all know everything about everything, right?). So\nthis is quiet quitting\nIt is NOT literally quitting one's job, so the concepts of unemployment and leverage and who will replace you don't enter into it. (And nobody QQing or thinking of QQing believes they have any leverage, that QQing will make their employers say \"yikes, people just doing the bare minimum... we better reinstate WFH immediately!!\")'",
        "In response to 'Quiet quitting isn’t doing the bare minimum. It’s doing what you are paid to do and only that, nothing more, nothing less.', a user said: 'What's the difference between those 2 things (\"bare minimum\" and \"only what one is paid to do\")? They sound the same to me.\nAnd FWIW, every definition I've seen, both from websites and general discussions like this one, do classify QQ as \"bare minimum\").\nFor example'"
    ]
}