{
    "username": "FluorideLover",
    "contributions": [
        "In response to 'Are you suggesting the bike is the problem here? 🤣🤣🤣', a user said: 'like the green goblin mask'",
        "In response to 'Even if they're never charged with anything being detained and having their bikes locked up for a bit is a deterrent. Honestly I don't think we need a massive punishment - from the videos it seems like most of them are teens who will probably age out of it soon enough. There are probably a few ringleaders who would be most worth trying to shut down, but I doubt it needs a massive crackdown to stop the problem.', a user said: '🥇'",
        "In response to 'Yes, you are, but SFPD also has a point. The DA probably won't prosecute all but the most violent (or notorious) crimes, because the DA knows the judges here will not convict. Indeed, they might not even timely schedule the trial and then force a dismissal of the charges.\nhttps://www.nbcbayarea.com/news/local/san-francisco/criminal-cases-in-sf-dismissal/3626171\nI'm not a fan of the way SFPD is failing in its mission, but I can understand how demoralized they'd be with endless catch-and-release.\nEDIT: Yes, yes, juries convict and judges sentence, but SF juries and judges alike show a disposition against either.', a user said: 'It’s not the cops’ job to prosecute or sentence. If they want to do that work, they can go to law school first.\nImagine telling your boss that you refuse to work because you don’t like how some person in a separate office is doing their job — and still demanding to get paid and more funding for new\ntoys\njob equipment!'",
        "In response to 'If you’re so concerned why don’t you actually rally to vote for DAs and judges who will actually hold up their end of the equation?\nI’m struggling to understanding… if cops arrested these people over and over and they keep getting let out without charges and every now and then someone dies or gets seriously injured in a chase, what exactly would your response be? That’s good enough? Or would you then, finally, complain like this guy about DA and judges and policy?\nI despise these bikers as much or more than anyone, and yet even I can acknowledge the authorities who actually have to interface with the assholes have a point, while the soft hands type away on Reddit', a user said: 'while the soft hands type away on Reddit\nbut you’re typing away on Reddit, too. I guess you’re just doing it with crusty hands? 🤔'",
        "In response to 'Can we just have a bikers mega thread already.', a user said: '+1, but that would require mods :’('"
    ]
}