{
    "username": "fonix232",
    "contributions": [
        "In response to 'Replace \"minimum required\" by required alone and it no longer sounds like employees are underperforming or unprofessional. Doing the required tasks and going home is being professional.', a user said: 'It's the dumbass capitalistic \"constant growth\" bullshit translated to your output. You're expected to go above and beyond, and in some jobs, it's actually being compensated.\nThe problem is that what's expected as a baseline always seems to be growing, which means you're providing more value to the company... But then you get no extra compensation for it. Imagine if e.g. taxis worked this way. One day you expect them to do a 10 mile trip for, say, £30. The next week, you now expect them to go 11 miles for the same price, then 12, then suddenly you're at 25 miles and still paying the same amount. This is clearly unsustainable, but most employers don't care, they'll fucking milk you dry then discard you because there's a younger, less burnt out one to come and take your place.'",
        "In response to 'Someone trying to put a label on something so others can rage on it. Quiet Quitting is just a term business use as the younger generations are finally wise to the fact that they should be paid for going above and beyond and not just a pat on the back. Business are losing free labour and using terms such as wage theft, quiet Quitting to try and get older generations to go 'back in my day'. The old dynamics are not working so they are trying to bring them back through anger.', a user said: 'Uhm, wouldn't wage theft be the other way around, i.e. employers not paying for the time worked?'",
        "In response to 'Very much so (as do my colleagues in the NHS, quite frankly: yes Gladys, a health professional\ncan\nstrike). I particularly enjoyed the insight from \"[workplace] decorum expert\" (\n1\n) Pattie Ehsaei\n\"Quiet quitting is doing the bare minimum required of you at work and being content with mediocrity,\" she told the BBC.... \"Advancement and pay increases will go to those whose level of effort warrants advancement, and doing the bare minimum certainly does not.\"\nThe simple fact that the quoted segment follows Emma's story of having her workload increased to the point that she was \"\ntaking care of the whole team\n\" and that she was turned down for a pay rise shows just how little Pattie seems to know the workplace.\n1.\nnote that while I\nam\nquoting, I'm taking the liberty of quoting and using scare-quotes at the same time because, really? A \"\nworkplace decorum expert\n\"? I can't tell if this a symptom of peak capitalism, or some form of prank that just went on too long for her to take it back.', a user said: 'Advancement and pay rises in most private sector positions come from jobhopping, not putting in 2-4 extra hours every day until you burn out and get fired for \"underperforming\".'"
    ]
}