{
    "username": "ForeignSource874",
    "contributions": [
        "In response to 'Answer: It depends on the audience- for workers is the concept of not staying after hours for unpaid work, not answering calls after hours or working on weekends, and not going above and beyond your job description because the company will likely just lay you off the moment it gets the chance, as most employment is actually underemployment and working conditions (including mental health as a result of working conditions) have deteriorated since Deregulation in the Reagan era.\nFor employers and corporate news stations, its the sudden withdrawal of workers from the \"one company\" mindset and the loss of a sizeable amount of free capital and production from those workers. As much of corporate media is right-leaning, the \"tough guy/ just deal with it\" mentality of the Gen X and Boomer owners and leadership are not observing mental health as a result of working conditions but instead a byproduct of \"woke culture\" to put a boogeyman out there instead of the very real dangers of overworking and undercompensating. Since the pandemic provided opportunity for corporations to grossly inflate prices (in line with, but then far exceeding any supply chain disruptions) and reclaim and cement those higher prices by blaming a \"worker shortage\" which is actually just a failure to find workers to exploit for the previous underemployed wages. By providing the news cycles with a term that takes away blame from the corporation, they can begin to lay off sizable percentages of their workforce \"for cause\" and replace them with lower paid, less experienced workers. These new workers are typically just entering the workforce and less likely to stick around when work conditions suck, because it sucks EVERYWHERE.\nThus, quiet quitting in whole is actually the grassroots beginning of the new workers rights movement.', a user said: 'Yeah, not so much. A solid 7 hours in the work day is the expectation for salaried workers—it’s codified in the labor code. Any company that doesn’t pay sufficiently to justify extra obligations outside core business hours is probably going to lose its talented workforce in short order.\nThis isn’t a GenX anachronism — GenX just knows when to draw the line and where, and how to that without fanfare, drama, or whining.'"
    ]
}