{
    "username": "Foreverstoned21",
    "contributions": [
        "In response to 'Original Post: Quiet quitting life I am quiet quitting life and nobody realizes that’s what it is. My friends think I’m just being a bad friend. My family just thinks I’m being a bad family member. I don’t want to die but I don’t want to live in the world any more. I just want to go to work and then come home and that’s it. I don’t want to go have dinner with people anymore. I don’t want to hang out and be made to feel obligated to stay until 11 pm before I can go home.  Nobody realizes that this is my way letting go of life, of escaping from the world.  I’m alone, I’m 30 years old and haven’t had an intimate partner for a decade. I love those in my life tremendously. But I just want to let go. When I’m home, I’m free to be who I want. To feel how I want, to look how I want. I can say what I want, my cat doesn’t mind. He doesn’t judge. He looks up to me and needs me and he’s the only thing that’s warm in my bed.  There’s nothing more signifícate to write here. Just thank you for listening.', a user said: 'felt like this before, I know this might sound dumb but try to find a hobby you enjoy (put as much effort in these) or go out and walk around a nearby park that has a trail/woody area. I’ve found that nature helps me feel more at ease. You never stop growing, maturing and changing. You might feel like you’ve peeked but you have your whole life ahead of you. Grow your circle, try new foods, places you’ve never been. your story isn’t over yet, so don’t rush to finish it before reading the whole book.'",
        "In response to 'Depression ruins all of the things you mentioned. I can hardly bring myself to watch tv anymore', a user said: 'It did ruin movies and such for me too! But you gotta remember to keep your heart light and your mind will follow. Be gentle on yourself, I rotted in bed for weeks at a time, no motivation to even feed myself (I live alone) and at night binge eat and drink and smoke until I fell asleep and repeat next day. But I had to stop the cycle, because when I eventually did get around to writing my letters and getting my boxes to pack all my stuff to throw away, I realized I don’t want to die. Not really. I just needed the void to stop staring into my soul and leeching my happiness away. Small changes everyday, 5 minute walks at sunset, calling my little sister to just talk to someone instead of going days without speaking a word due to living alone. Every day for 2 weeks and god it sucked at first bc I just couldn’t get myself up but you have to be gentle with yourself. 2 months later, I’ve picked up gyming again and discovered my passion for dancing and somehow in those few weeks, i slowly started to feel like myself again.'"
    ]
}