{
    "username": "Foulbal",
    "contributions": [
        "It's not called \"quiet quitting\" That little term is a rebrand of working to rule. It's a labor action been around for a long time where employees work exactly to the terms of their contract and that's why it's getting rebranded. Working to rule is a much harder term to criticize. \nAnytime \"quiet quitting\" is brought up, shut that shit down immediately. We need to undo this particular rebrand as best we can. Doing more than what you're hired for needs to stop, and it can't while people working to rule are being vilified.",
        "In response to 'I work in a union shop, and when my supervisors piss me off I do\nexactly\nwhat I'm told. . . . . . . And\nONLY\nwhat I'm told.\nWorking as instructed still means you need to be instructed.\nI also regularly admonish new hires for working off the clock. They don't start paying us until exactly start time, so if you come in early, even if you punch in, they don't pay you until you were scheduled to start.\nI think this is a stupid rule, so when I get there early I sit on the conveyor belt that is required for work to happen and play on my phone. They can't turn the belt on if someone is on it, so if they want to start working they have to ask me to move.', a user said: 'This is the way.'",
        "In response to 'If this sub would lay off this phrase, I'd see way less of it. Almost putting in work to get it out there.', a user said: 'My point was to acknowledge the phrase being used, and to call it what it truly is.\nThe phrase itself is annoying, but it won't go anywhere without significant pushback in certain circles.'",
        "In response to 'The funny part is that employers get upset about employees not going above and beyond their duties. But how many times has your employer paid you above and beyond your salary?', a user said: 'That's exactly the point. \nYou are hired to do A, B, and C for X, Y, and Z compensation. If you go ahead and do D because you were asked, the employer will not match that extra effort with appropriate compensation in the majority of cases.'",
        "In response to 'I prefer act your wage over work to rule', a user said: 'I dislike \"act your wage\" because something about it sounds juvenile or passive-aggressive.'",
        "In response to 'I love where you're coming from, but I disagree. Working to rule is a protest tactic. Doing your job should not be seen as a protest, but as the norm. Call it Doing Your Job.', a user said: 'There is no difference between working to rule and \"quiet quitting.\" Their definitions are identical.\nYou are correct, working to rule was and is a protest tactic. It is being used as one now in response to low wages and employees being treated like garbage, but it is being framed as a negative with a new phrase. They are the same with one spin benefiting the worker and one to make workers look lazy.'"
    ]
}