{
    "username": "fpsfiend_ny",
    "contributions": [
        "In response to 'Original Post: Employee quiet quit... 4 years ago. What can be done? I have an employee that has been 6 years with the company, the first two years he was performing very well and had a salary increase 5 times (the maximum possible) within 2 years. After denying a promotion the employee almost immediately went on a month's sick leave and when he came back, he never discussed anything about career growth and performance. The employee is the most popular person in the team and is engaged with everyone on a personal level, but not on a work level any longer. The proactivity is completely gone and when assigned new tasks it can be meet with \"I dont think this is on my level\". All the managers are always given \"the cold hand\". Besides this, the employee has far the highest sick leave in the team. I thought the issues were outside of work but could never get a clear answer as the chemistry between us went to non-existent.\nEventually, I became a higher manager 2 years ago and a new manager took over and I dropped the responsibility. The new manager has pointed out all the work is bare minimum and the employee does not seem to be motivated and when discussing promotions and growth it is often met with \"I'm happy where I am\". In the last 4 years, there have not been any personal salary increases on top of the yearly for all employees.\nI recently found out through multiple non-managers that the reason for this behaviour is because of the denial of the promotion 4 years ago. After hearing the stories, I agree that I handled it very badly. We were suppose to have a meeting about the promotion before the employee went on a long holiday, but I cancelled it one minute beforehand with a Slack message saying there won't be a promotion and not giving any reason.\nI'm wondering what can be done at this stage? I want to solve this and not by a dismissal as there are very high employee rights in our country.', a user said: 'You're an idiot. You had a diamond in the rough. Imagine if you helped him grow!\nHopefully someone else values him/her'",
        "In response to 'Original Post: My last paycheck didn’t deposit. Hey yall!! I posted last week about how my boss blew a hissy fit when I called in once because I was grieving the loss of my dad.\nNow my last paycheck didn’t deposit this morning!! I texted my coworkers and I know at least one of them got paid. But this is a common occurrence, she always seems to fuck up payroll somehow. (This is the 7th time payroll has been fucked in the year I worked there). I’m pissed because now I have to reach out to her and I “quietly quit” so I was hoping I wouldn’t have to do that.\nSpeaking of which, I approached her about the text hoping to have a productive conversation. I took accountability for calling in after having so much time off for his hospital stay, death and funeral. She started going on about how she’s been looking for her “fourth token” meaning she has had 3 employees that work for her who are all subpar human beings, and she’s looking for a 4th person to help her run the shop/support her/be a normal human being… well I don’t feel like I’m her fourth token and I don’t want to be. So I left this letter and my key, packed my shit and didn’t go back.', a user said: 'This business is subpar since it can't pay you on time. Idk about the lot of you being subpar. Sometimes you have to put your foot down and make them trip.\nGood for you!'"
    ]
}