{
    "username": "Fraudguru",
    "contributions": [
        "In response to 'Original Post: Employee quiet quit... 4 years ago. What can be done? I have an employee that has been 6 years with the company, the first two years he was performing very well and had a salary increase 5 times (the maximum possible) within 2 years. After denying a promotion the employee almost immediately went on a month's sick leave and when he came back, he never discussed anything about career growth and performance. The employee is the most popular person in the team and is engaged with everyone on a personal level, but not on a work level any longer. The proactivity is completely gone and when assigned new tasks it can be meet with \"I dont think this is on my level\". All the managers are always given \"the cold hand\". Besides this, the employee has far the highest sick leave in the team. I thought the issues were outside of work but could never get a clear answer as the chemistry between us went to non-existent.\nEventually, I became a higher manager 2 years ago and a new manager took over and I dropped the responsibility. The new manager has pointed out all the work is bare minimum and the employee does not seem to be motivated and when discussing promotions and growth it is often met with \"I'm happy where I am\". In the last 4 years, there have not been any personal salary increases on top of the yearly for all employees.\nI recently found out through multiple non-managers that the reason for this behaviour is because of the denial of the promotion 4 years ago. After hearing the stories, I agree that I handled it very badly. We were suppose to have a meeting about the promotion before the employee went on a long holiday, but I cancelled it one minute beforehand with a Slack message saying there won't be a promotion and not giving any reason.\nI'm wondering what can be done at this stage? I want to solve this and not by a dismissal as there are very high employee rights in our country.', a user said: 'and the gall to call this a \"quiet quit\". he refuses to do\nmore\nthan his job - what's wrong with that? He's DOING his job.\nbecame a higher manager 2 years ago and a new manager took over and I dropped the responsibility.\nso you basically washed your hands off it 2 years ago and are crying now because you can't fire him? very nice. slow clap.'",
        "In response to 'drab sense illegal tender air homeless elderly hard-to-find concerned badge\nThis post was mass deleted and anonymized with\nRedact', a user said: 'OP, here's your answer 😂..... you need to disrespect this employee.'"
    ]
}