{
    "username": "freedinthe90s",
    "contributions": [
        "In response to 'My boss's boss knows my boss is a piece of work\nI wouldn't count on that meaning anything to do. Your boss's boss keeps your boss around...', a user said: 'Excellent point. Adding to that, there is no guarantee that your boss’s boss will be around in six months. Unless they are the owner, of course.'",
        "In response to 'Original Post: How to Approach Annual Review After I Quiet Quit Almost a year ago, my boss pulled some power move BS and I made two changes as a result: I took work email off my phone and stopped working more than the expected hours. No more extra from me - if an opportunity for a conference proposal comes and she doesn't mention it at the weekly meeting, neither do I. If she has a \"good idea fairy\" moment of something she's really like to see happen I just...don't.\nMy boss's boss knows my boss is a piece of work and after I confided in a colleague that I was thinking about leaving, I was rewarded with a raise.\nSo now we're at the year-end and I put together the end-of-quarter metrics. To do so, I pulled from last year's annual report, and holy hell while we've hit our metrics most of the \"extra\" stuff has fallen away.\nIt will be time soon for my annual review and next year's goal-setting. I'm wondering if anyone has any advice for the discussion. I'm thinking that no good comes of telling her that I'm done doing more than what's required, but I have to think it will be fairly obvious. Anyone have any good advice?\nFWIW we are a team of three, and we replaced the other team member last year, had someone for a little over a month who didn't work out, so I think I can play it off like some of my time was spent mentoring? I also want to stay in this job at least 5 more years because of some specific benefits and the hopes that my retirement-aged boss will quit in the next two years. Thanks!!', a user said: '“Quiet quitting” but you want to stay 5 more years in the hopes your stay outlives your bosses’ stay?\nI would think hard about that strategy and how it benefits you.\nThat said, it’s hard to frame it as a goals discussion if you have no intention of progressing. If you truly want to just outrun the clock and do very little for the next few years, maybe just talk about how you’re happy in your role and feel this is the right pace for you. Focus on how you’ve met your metrics. If pressed, say it isn’t the right time in your life to take on more. Short, sweet answers.'",
        "In response to 'Yeah, it’s not real quiet “quitting” if you plan on staying for 5 years. Saying you are comfortable in your role and current duties and don’t want to take on more is fine, but you won’t get any more raises or promotions this way. You are doing the bare minimum, expect to get that in return.', a user said: 'I think you’ve just brought up the kicker. Even if the boss quits, they leave behind a minimum-effort employee that has done nothing remarkable to be promoted. The company will just bring in someone new from off the street. I don’t think this works out the way OP is hoping...'"
    ]
}