{
    "username": "FrigidNorthland",
    "contributions": [
        "In response to 'Original Post: ‘This has to stop’: A young man on TikTok says he and his wife make $120K/year — but can only afford this run-down house. Why Gen Z, millennials are using 'quiet quitting' to cope [External Link]: https://moneywise.com/real-estate/real-estate/young-man-quiet-quitting-cope', a user said: 'Basically we are at the point that a single income family making 100k a year but bought pre covid and locked in a 2.5% mortgage is in a better position than a dual income family post covid and 7% rate.\nThe point of dual income was to have a huge buffer and easily save.'",
        "In response to 'I think your spot on with this. I’ve had this discussion many times recently with people. $100k a year, which don’t get me wrong is not a bad salary, is not what it was even 5-10 years ago. I’d say $100k today is what $50k was 15-20 years ago. Where I live you are going to have to spend about $300k to get a decent starter home that won’t require too much work on it. With that price, the rates the way they are, utilities factored in etc., your looking at $3k a month for that house. With a $100k salary, minus taxes, minus health insurance, 401k etc. (then factor in car payments, food, other bills) your not left with much. It’s honestly sad. I really feel for those people looking to purchase a home for the first time.', a user said: 'yea.  We gross 180k and have no debt.  we could put down 100k on a shity home with no work done on it why would I.  I dont want a 1960s/1970s home.  They should have built more homes when it was cheap now its too expensive.\nAgree on wages.  Theres a lot of people that say 'Wow 6-figures' when in reality thats more like 70k use to be or something\nI make less in real terms than I did 10 years ago.  But I have a lot more responsibility.'",
        "In response to 'I think your spot on with this. I’ve had this discussion many times recently with people. $100k a year, which don’t get me wrong is not a bad salary, is not what it was even 5-10 years ago. I’d say $100k today is what $50k was 15-20 years ago. Where I live you are going to have to spend about $300k to get a decent starter home that won’t require too much work on it. With that price, the rates the way they are, utilities factored in etc., your looking at $3k a month for that house. With a $100k salary, minus taxes, minus health insurance, 401k etc. (then factor in car payments, food, other bills) your not left with much. It’s honestly sad. I really feel for those people looking to purchase a home for the first time.', a user said: 'There needs to be crash, and someone has to take a loss but forces dont want this to happen'",
        "In response to 'My car got totalled last year and insurance gave me 10% more than I paid after taxes in 2020. We looked at cars but I couldn't stomach spending so much on a car when I work from home and haven't missed driving.', a user said: 'yea i know that happened to someone also.  Its like I dont want a check, I want a car'",
        "In response to 'They DID. The average American bought a house at like 22-25 before the 90s. Like look at the average age of first child in the past. Now assume a house came before that by about a year', a user said: 'single income also'",
        "In response to 'Millennials are in their late 30s at this point… how is that a young man lol', a user said: 'boomers think millenials are those 'college kids' still.  we havent been in college in 10 years plus'",
        "In response to 'Yep I know someone who graduated with nothing but a couple month internship on their resume and was immediately offered a job for $70k at age 22 with a govt contractor. It’s been 2 years now and she makes even more now at the same place.', a user said: 'moneywise.com/real-e...\nmy first real job out of school was 19/hr with 4 year degree.  6 years of raises i was up to 23/hr.  i got 70k when i job hopped in my early 30s'",
        "In response to 'Original Post: ‘This has to stop’: A young man on TikTok says he and his wife make $120K/year — but can only afford this run-down house. Why Gen Z, millennials are using 'quiet quitting' to cope [External Link]: https://moneywise.com/real-estate/real-estate/young-man-quiet-quitting-cope', a user said: 'so its combined income of 120k.  so two making 60k each'",
        "In response to 'Original Post: ‘This has to stop’: A young man on TikTok says he and his wife make $120K/year — but can only afford this run-down house. Why Gen Z, millennials are using 'quiet quitting' to cope [External Link]: https://moneywise.com/real-estate/real-estate/young-man-quiet-quitting-cope', a user said: 'part of the problem is you put the extra effort in to get a 5% raise instead of 3% or you get a promotion that is 5%. But thats not even inflation.  Even if kept with inflation you had to do extra work and then take on more responsibilities just to keep up with inflation.  It should be 5% promotion + Inflation'",
        "In response to '$120K in Edina, MN nets a monthly take home of 6,800 on a $385K house (3/2) with ~10% down equals $3K a month mortgage... not unrealistic. Not great - but yes it would work and it's a great place to live.', a user said: '20% use to be the standard'"
    ]
}