{
    "username": "FU-I-Quit2022",
    "contributions": [
        "In response to 'What country is that because the United States employers expect a notice but aren't required to give one', a user said: 'The double standard is amazing. My last full time job they gave me one week severance - after I put in a string of 70 hour, OT exempt weeks - boss made it sound generous. My first job out of college I gave them 3 weeks notice - boss canned me on the spot without pay. Another job, at a \"family business\" I was fired - essentially for not doing my job and the bosses kid's job good enough for him - zero notice, zero severance. Lesson learned: I don't work full time for anyone anymore - I do part time contract for 4 different places. If one wants to fire me go right the fuck ahead - there's plenty of other work.'",
        "In response to 'I had something similar at my last company. It went from a team of 15 data scientists/engineers down to less than a handful. More work, less people. No pay changes. Nothing.\nI ended up telling them, politely, why I was leaving and not accepting a counter offer. I laid it out in the most corporate terminology, explaining a quick cost/benefit analysis showed I was being screwed on all fronts. Team fell apart not long after I left.\nTake care of yourself. Do what you can, but don't let others use you. And when you need to, I recommend politely telling them where they can shove it - in the most corporate friendly way.', a user said: 'Similar story here. In March 2020 during COVID, my company's satellite office laid off 6 of its 18 staff workers on the same day, including me. The remaining workers got a 40% pay cut, but actually ended up with MORE WORK. Three more people left by the end of the year - they basically had no project managers left - and they are still trying to hire, because the newly hired workers are sub-par. You reap what you sow.'",
        "In response to 'They aren't holding all the cards they just want people to think that.\nIf the employee refused the extra workload and his employer fired him now the employer has to hire and train\ntwo\npeople.  and since they would be firing OP that means unemployment insurance rates may rise for the employer.\nIf he gives OP lets say a 33% raise to accept more work he has to hire and train\nzero\nmore people and he doesn't have to fire anyone.\nIf the employer really doesn't want to pay more he might also just keep the employee and try to shunt the work onto someone else but that's still a win for the original employee.', a user said: 'They want people to constantly think that the next recession is right around the corner, so that they work \"scared\". The subservient attitude gets you nowhere, because what happens happens, and you HAVE to cash in on the good times so that you're prepared for the next recession. Because truth be told, when that time comes, they're gonna lay you off regardless.'",
        "In response to 'Original Post: We should just call it this to show how stupid the term \"quiet quitting\" is [External Link]: https://i.redd.it/1kfth56gqeu91.png', a user said: 'And they're trying to quiet wage theft you - if you're OT exempt. If you ARE OT exempt, don't do a minute of OT. They can threaten your job, but it would be an idle threat; who are they gonna give two people's work to? If you do make OT pay (especially time and a half) and if you can spare the time off and are OK working extra, then that's extra money. My first job out of college I had a tyrant of a boss but was paid OT - boss didn't pay much attention to my hours - so I banked all that OT, bought my first computer, software, printer/scanner and after two years put together a great portfolio and got the hell out of there. On the job, time is money, and if you're spending time not making money, you have to better protect your time or you'll never have any money.'",
        "In response to 'Never underestimate an employers' willingness to fuck around (fire someone and give their work to another already overworked employee) and find out (watch their operations fall apart).', a user said: 'Seems to be a pride thing. \"Nope, not going to give raises. Would rather watch my business slowly die.\"'"
    ]
}