{
    "username": "Funklord_Earl",
    "contributions": [
        "In response to 'Making bonuses based on “team based outcomes” sounds like a group project where one or two people go above and beyond, and the rest of the group lags behind but wants the same bonus. Not motivational to me.\nWorkplaces definitely need to change to address generational difference in work-life balance. But Gen Z also has a lot to learn from experienced, successful workers too. Genuine communication and open minds are the key to long-term happiness in work and in life.', a user said: 'Genuine communication and open minds are the key to long-term happiness in work and in life.\nThis is huge and probably one of the issues that the younger generation are having the most difficulty grappling with. Not because they’re not capable of these things, but because the opposite is so deeply ingrained in the culture of many organizations.\nDouble speak, corporate bullshit talk, not fostering a workplace of open and honest communication, liars and people who just want to get ahead at all levels. It’s exhausting. I’m in my 30s and have only recently started advocating for myself at my job more. I’m good at what I do. I have ideas. I need them to be respected, but also challenged when appropriate. I need management to be honest. I need to feel safe being honest with management. I need to know\nwhy\nwe’re doing something, not just\nthat\nwe’re doing something. If I have to work some bullshit job so I don’t literally starve and die then I at least need to feel connected to it, even if just a little bit or I’ll go insane.\nYea, fuck this “quiet quitting” rhetoric. It’s people waking up to the reality that most jobs where this idea is even an option are just a waste of everyone’s time. People want to work. People like helping people. People don’t like being treated like a child all the time and deferring their talents and creativity to some old who demands respect because they’ve been doing the job for\nsooo\nlong. To your point, there’s a lot that can be learned from people with more experience, but the culture makes it so hard and frustrating sometimes haha'"
    ]
}