{
    "username": "fxn",
    "contributions": [
        "In response to 'Original Post: 'They're in a state of fear': CEOs are worried about quiet quitting [External Link]: https://www.bnnbloomberg.ca/they-re-in-a-state-of-fear-ceos-are-worried-about-quiet-quitting-1.1822866', a user said: 'As news of the trend flooded the internet, human resources companies, consultants, law firms and even artificial intelligence startups have jumped in to offer advice on how to prevent and combat it\nI bet the advice won't include paying employees more and treating them like human beings. (After reading the article, it didn't.)\nBut executives don’t know what to do about it.\n\"My MBA taught me that employees are replaceable meat-fucks, how do we get them to do twice the work for half the pay?\"\nHuman resource professionals say leaders are concerned about whether they can rely on their employees if there’s a recession\nHave employees ever been able to rely on their employer during a recession?\n— or if they can afford to fire and replace quiet quitters in a tight labor market\nThe answer to my previous question.\n“A lot of leaders and clients I work with, some for the first time in 30 years, they’re in a state of fear as an employer.” said Erica Dhawan, workplace consultant and author of a book about remote and hybrid work. “They feel they have to keep people that aren’t performing.”\nAren't performing? Or performing to the exact degree you pay them and treat them? I'm astounded they can say this while year-on-year record profits are almost guaranteed.\nGranger said many come to realize that it’s actually a management problem.\nIncredibly observant, I guess those multi-million compensation packages\ndo\npay for something. Let's see where they take it.\nThere’s even an artificial intelligence startup claims to offer a solution, analyzing emails and Slack messages to detect engagement, burnout and turnover risk among employees.\nOh, straight to dystopia. Why was I surprised? By management, they didn't mean the wealthy elite who make all the decisions, earn all the wealth, and distribute all of the risk. They meant they weren't \"managing\" the \"problem\" well enough.\n“If you get into a situation where organizations start to see this tip, and now there’s massive amounts of quiet quitting happening, that is almost certainly going to lead to some massive downstream effects on the\nbusiness\nthe earnings of the C-suite and their ability to ruthlessly exploit the working class\n.”\nI fixed it for you.\nI hate these people. May all their mansions, yachts, and private jets burn down around them and their underage prostitutes expose them.'"
    ]
}