{
    "username": "gamescan",
    "contributions": [
        "In response to 'I keep seeing this over and over but can someone ELI5 me why won't judges in SF convict? What is the reasoning behind this?', a user said: 'I keep seeing this over and over but can someone ELI5 me why won't judges in SF convict? What is the reasoning behind this?\nSFPD can't be bothered to close cases, collect evidence, and make arrests.\nWithout evidence (there's the whole \"beyond a reasonable doubt\" thing) a prosecutor isn't going to take a case and a judge (or jury) won't convict.\nIt all goes back to SFPD refusing to do the job.'",
        "In response to 'I'm not an apologist for nor supporter of the police, but I think you are mischaracterizing their position. To use your analogy, it would be more like there are 12 different VPs and product people each asking for different things, and your group only has enough people to deliver 6 of them. There are various strategies you could use in this situation - do just enough on each one to stop anyone from getting too mad; prioritize the ones that are most likely to make it to the final product; prioritize the ones where the person asking has done you favors in the past; etc. You could even figure out ways to work better and more efficiently, and maybe get 8 of them done.\nI don't know for sure exactly how resource constrained the SFPD is. They aren't very forthcoming with the information that would answer that question, and I don't trust them to self report accurately. But their claim has pretty consistently been that they don't have enough manpower and are subject to too many restrictive and time consuming procedural rules to address all of the law enforcement needs of the city.', a user said: 'they don't have enough manpower and are subject to too many restrictive and time consuming procedural rules to address all of the law enforcement needs of the city.\nThis is the same SFPD that illegally raided a journalist's home.\nWhen they complain about \"time consuming procedural rules\" they mean the law.\nThey're complaining that they have to follow the law and produce evidence to back up arrests and that they're not allowed to break the law to do so.'",
        "In response to 'Original Post: My cousin is SFPD and has the same take on the bikers. Are we basically just paying them 3/4 $billion a year to cry and quiet quit? [External Link]: https://i.redd.it/uhdkr8xy39ld1.jpeg', a user said: 'My cousin is SFPD and has the same take on the bikers. Are we basically just paying them 3/4 $billion a year to cry and quiet quit?\nIf your cousin agrees with the pic OP, they are the problem.\nSFPD can't use the excuse that the DA won't prosecute when they're too lazy to do their job.\nCops whined about the DA.\nThe DA got replaced.\nSFPD needs to shit or get off the pot.'"
    ]
}