{
    "username": "gamma55",
    "contributions": [
        "In response to 'Paitsi kun tekee työnsä hyvin, niin palkankorotuksen saaminen on huomattavasti paljon mahdollisempaa. Ainakin itse sain moisen.', a user said: 'Tämähän on lähtökohtaisesti vähän .. hassu lähestyminen.\nTyösuhde on bisnestransaktio, ja sä toimitat työtä sovituilla ehdoilla ja sovitun määrä, etkä muuta.\nEihän firmatkaan toimita ylimääräistä ja toivo että \"ehkä asiakas maksaa joskus enemmän kun sai nyt ekstraa\".'",
        "In response to 'Firmathan 'toimittaa' kaikenlaista ylimääräistä, sillä ajatuksella että jospa asiakas jatkossakin valitsisi meidät, ja suostuisi maksamaan meidän hinnat vaikka ei ollakkaan just se kaikista halvin.\nMenet rengasliikkeeseen. Siellä on odotusaulassa nahkasohvat, kahviautomaatti, lehtiä. Niiden homma on myydä ja asentaa renkaita, tää kaikki on ylimääräistä.\nMenet markettiin. Siellä on penkkejä joille istahtaa. Sieltä löytyy kierrätyspiste mihin voit toimittaa vanhat paristot ja elektroniikat. Ei nää oo marketin businesta.\nMarketista ostat levyn Fazerin sinistä. Se on pakattu kauniiseen paperiin, sen sijaan että olis vaan ruskeassa paperissa. Ne tekee suklaata, mutta stailaa sitä pakettiakin.\nMenet ravintolaan syömään. Pöydässä on siisti pöytäliina, ja pöydällä voi olla kynttilää, kukkia tms. Ihan turhaa hömppää moiset, vois olla pelkkä pöytä, kunhan ruokaa saa.\nEsimerkkejä on loputtomiin, ja sama voi toimia työntekijänkin suhteen. Jos ei toimi, niin sitten voi nostaa kytkintä ja mennä paikkaan jossa hyvää työntekijää arvostetaan.', a user said: 'Arvaatko millä nämä \"ylimääräiset\" on maksettu? Mihin leivotaan tuotantoyksikkökohtainen vyörytys kiinteistä ja muuttuvista kuluista?\nEi ne ole ylimääräisiä, vaan sä maksat siinä rengasliikkeessä niistä sohvista.\nBrändäys on osa tuotteen ominaisuuksia, ja asiakas maksaa ne aina. Joka kerta. Oli se brändäys sitten \"yksilöllistä palvelua\" tai \"sinisiä kääreitä\".\nJa se ei edelleenkään ole se mistä on kysymys. Se on siitä, että kun ostat renkaat, niin saatkin vanteet ilmaiseksi, vaikka et edes halua niitä rumia paskoja. Tai ostaessasi 200g suklaata onkin rasiassa 80 000g suklaata.\n*Tätä on se, että työntekijä toimittaa enemmän kuin oli sovittu. Ja ihan samalla tavalla kuin firma voi \"toimittaa ylimääräistä\" kun se tarjoaa asiakaspalvelua ja joustavaa hankintaprosessia, työntekijä voi työtarjouksen hyväksyessään laskea että tuolla hinnalla saa sovitun työn + jouston, koska se on \"laskettu hintaan\".'",
        "In response to 'Eihän firmatkaan toimita ylimääräistä ja toivo että \"ehkä asiakas maksaa joskus enemmän kun sai nyt ekstraa\".\nEtenkin startupeissa suht tavallista nuoleskella potentiaalista asiakasta, jotta säilyy asiakkaana / laajentaa yhteistyötä.', a user said: 'Ja seuraavaksi osaatkin jo arvata miksi valtaosa startupeista epäonnistuu. Ja johtaa siitä päätelmän miksi työsuhteen rinnastaminen startupin liiketoimintaperiaatteeseen on vielä typerämpää kuin ilmaisen työn toimittaminen.\nJa mainitaan nyt että jokainen startup joka on onnistunut, on polttanut sijoittajien* rahaa subventoidessaan tuotteitaan, joka on jotain jota melko harva työntekijä pystyy edes tekemään.\nVai miltä kuulostaa polttaa säästöjä että saa tehdä duunia?'",
        "In response to 'Eihän firmatkaan toimita ylimääräistä ja toivo että \"ehkä asiakas maksaa joskus enemmän kun sai nyt ekstraa\".\nEn tiedä mitä \"toimita ylimääräistä\" tarkoittaa mutta kyllähän firmat nimenomaan tekee ns. extraa. Sitä kutsutaan asiakaspalveluksi. Ihan yleistä sekä B2B että B2C. Se voi olla alennus, joustoa toimitusajoissa, maksuajoissa, takuuta, huoltoa jne. jne. En ole ikinä törmännyt yritykseen joka ei tuota tekisi.', a user said: 'Asiakaspalvelu on hinnoiteltu mukaan tuotteeseen tai toimitukseen, ei se ole mikään ilmainen lisätoimitus. Ne on kaikki hinnoiteltu mukaan. Palvelut alennukset markkinoinnit, kaikki.\nKuluttajille se on lakiin kirjattu, firmoille toimitussisältöön sopimuksilla.\nYlimääräinen olisi vaikka se että rakennutat talon ja rakentaja tekee siihen 3 ylimääräistä kerrosta omalla rahallaan.\nEdit: ja työntekijän työn toimitussisältö on kuvattu työsopimuksessa ja sen liitteissä, ja venyvät käsitteet yleensä rajattu työmarkkinaistuimissa ja muissa.'"
    ]
}