{
    "username": "gangler52",
    "contributions": [
        "In response to 'God bless her, but unless Chief Creative Officer Kevin “My Word Is Gospel” Feige leaves the halls of the MCU to focus on the other part of Marvel he’s head of and got to work writing and righting the Spidey ship is the only way I can see any OMD stuff being fixed.\nI don’t see any writer being able to defeat Spidey Editorial and it be a damn shame to see Simone’s name be dragged through the mud because editorial would have her writing slop', a user said: '\"Your arms are too short to box with God, Gail Simone.\"'",
        "In response to 'I think this “back to basics” moment is more difficult to swallow because the X-Men are fundamentally different than any other super hero team. The Avengers, Fantastic Four, etc are people who choose to abandon their normal lives to selflessly fight for others. The X-Men are not. They fight to survive and protect themselves as much if not more than to save others. Krakoa didn’t merely represent expansion. It represented newfound prosperity, security, it was a victory, maybe not the victory Xavier imagined, but a victory for all mutantkind nonetheless.\nThis coming reset isn’t like reducing the Avengers back to the MCU roster, it’s the loss of almost everything the X-Men ever fought for.', a user said: 'I mean, I feel like that's just normal ups and downs.\nWhenever any hero has an arc where they're on top of the world, it's right before they're about to be struck down to their lowest point.\nIt's not even the first time this has happened to the X-Men. They've created like three other utopias where mutants could run away and be free of the flatscans in the last three decades I'm pretty sure.'",
        "In response to 'Genosha, Utopia, what else?', a user said: 'There was a version of Asteroid M that was basically the same thing in the nineties. Previous versions had just been a home base for The Brotherhood of Evil Mutants but this one was an isolationist paradise available to all mutankind. If I recall correctly.'",
        "In response to 'As a pathetic Spiderman fan I love the idea of reading the comics for X-Men but feel intimidated by just how batshit they seem and how many characters there are.\nAs a One Piece fan I already have hundreds of minor characters I'm keeping track of as it is', a user said: 'I'd feel pretty confident that Gail Simone would introduce you to anybody funky she was gonna use.\nShe's an old hand at using off the beaten path Marvel/DC characters. She keeps it pretty accessible.'",
        "In response to 'Maybe she wrote it earlier, but I could swear I got new issues of her Domino series at Marvel around 2022...\nStill glad she is coming back. Love Simone's work!', a user said: 'https://www.amazon.ca/Domino-Vol-1-Killer-Instinct/dp/1302912984\nThe trade paperbacks were apparently published in 2018. Time does fly.'",
        "In response to 'She credits her slow down as feeling burnt out from writing 5 comics a month', a user said: 'Yeah, lot of other industries just let a writer do less work for more money.\nPeople who stay in comics pretty much do it for the love of the medium. Not weird at all that she'd move to videogames for a while.'",
        "In response to 'I still hope this relaunch is all a fever dream and we're about to have a 10 years run set on Krakoa by Al Ewing. Is it too much to ask?', a user said: '\"Ten Years at least!\"\n-Eren Jaeger, remarking on his hopes for the Krokoan Era of X-Men Comics.'"
    ]
}