{
    "username": "garaks_tailor",
    "contributions": [
        "In response to 'this phrase needs to be banned from this sub...\"doing your job\" or \"working as directed\" are the only descriptions workers should give.', a user said: 'Ha.  Me two jobs ago.\nHey can you take on this business intelligence software also?  \"Sure.  Send me to these trainings and pay for my cert.\"\n\"Ooooh thats like a lot of money, we'll get back to you.\"'",
        "In response to 'God, I wish I had one of those. I can fill all the time in the world. I'm just tired of stressing about getting enough hours to pay the bills.', a user said: 'I think my next job is going to be a government job.  Get that pension and fuck off.'",
        "In response to 'I just started at a government job about 6 months ago. Pay is decent, but the benefits are amazing. Its honestly a pretty boring job, but no one really bothers me too much. 20.5 years to go and I'm done.', a user said: 'Ooooh does it have work from home?'",
        "In response to 'My position does not. And they just told everyone that was working from home that they had to come back like two months ago.', a user said: 'Man.   I do like my work from home.   Is the work load ridiculously light?  Like you could probably not even be there 7 hours a day?'",
        "In response to 'Right now my job is to clean up this warehouse that our electricians use for products. They haven't had anyone in the warehouse for 3 years and before that they told me the guy running it before pretty much checked out for like 5 years before that. So it has been pretty neglected.\nSo if I wanted to I could work for 8 hours a day everyday, but I work for a few hours, then chill out then work again. Also I order parts for the guys and give them a hand in the field if they need it. There are only 4 total electricians on staff.\nOne day in the future though when everything is cleaned up, organized, labeled, and inventoried then I won't really have much to do besides hang out in the warehouse, order parts when low, and grab the electricians material when they need it.\nAlso I'm part of the IBEW union which is a nice perk.', a user said: 'Nice.  I do IT work and wished so many sysadmins didnt have their heads up their ass in a self made man fantasy.  Love to have even just a professional org like the BAR or AMA.'"
    ]
}