{
    "username": "garlicroastedpotato",
    "contributions": [
        "In response to 'Study: finds the same thing as every other study and trial on this topic.\nCompanies: Nah, fuck that.', a user said: 'The problem is broadly that it just doesn't work for every company.  10% of the companies in this trial abandoned it being unable to make it work.  30% are fully switched over and will be keeping it long term.  Roughly the remaining 60% haven't fully changed over and aren't finding any efficiency gains yet but are going to continue to try and make it work.\nLike this is companies over one year.  And only 3 out of 10 of them were able to make it work.'",
        "In response to 'didn’t read the study but u mentioned 60% weren’t noticing any efficiency gains but were they experiencing any negative drawbacks? if not, i think that’s enough to warrant switching over especially if it means boosted moral for their employees', a user said: 'The 60% are companies that haven't been able to fully switch their entire company over to a 4-day work week with 8 hours per day.  In order to make this work (cutting a full 8 hours from the work week) you need to find efficiencies that will allow you to have the same productivity they had before.\nI can't say exactly how those 60% of companies couldn't reach the goal of their whole staff on a 4-day work week.  But, it's like that they had many employees who were either working 5 day work weeks or working 10 hour days.  You could have also had a sizeable number of employees who were on call.'",
        "In response to 'Love this quiet-quitting bullshit. Like doing only the contractually obligated amount of work is somehow cheating the system. Am I being quiet-fired everytime my employer only pays me for as many hours as I worked?', a user said: 'For this particular study the employees participating had to sign an agreement to ignore the rigidity of their contracts and accept all work that was presented to them.\n5% of all employees quit within a month of the study beginning.  This might not necessarily be because they didn't like the hour changes or their work duties but could also just be, because the labor market is tight and people found better paying jobs.'",
        "In response to 'as homer has pointed out doing a shit job is the american way. Quiet quitting is just gen z learning about not giving a shit about your job and giving it a cute name. Unions have been doing this forever, it is called\nwork to rule\nI think gen z needs to go watch the \"quiet quitting\" documentary, office space', a user said: 'Work to rule only works for union jobs because the specific terms of your contract are laid out.  Hourly employees can't work to rule because most hourly employees don't have pre-defined tasks that they have to do and since the 90s there has been an overall growth in hourly workers.'"
    ]
}