{
    "username": "gaytee",
    "contributions": [
        "In response to 'Not very good analysis or conclusion. Considering labor is a huge portion of expenses, that businesses are run by people and the current labor shortage, it amazes me that business leaders still have no idea how to\neffectively\nmanage their workforces.\nWorkers started to realize that many companies have awful work cultures, and that many jobs have a lack of benefits, advancement and job security. And then add a lot of inflation and financial anxiety. If the quality of worklife decreases, so will effort (because people intuitively understand diminishing returns of effort vs progress), and that effort then is applied elsewhere in travelling, moving, going to the gym, working on a new hobby, or getting a new job or degree.\nPeople who write articles like this have no idea how much the world has changed. When they say things like \"it’s up for debate whether the phenomenon is condemnable slacking\" it reveals the reason why people quiet quit - managers/higher ups who think like this constantly nagging employees under the assumption of bad faith laziness when they may just need extra time to process everything, like stress from rising rents, health, etc. Workplace culture is super important.\nThe way to alleviate quiet quitting is to provide workers better pay, a better culture, and the hope for advancement.', a user said: 'That’s the takeaway, we’ve made this corporate system, and we still have no reason to trust or value management.  But, this is a gooomberg article, it’s written FOR upper management. Why would they admit faults here?'",
        "In response to 'That many companies conducted exit interviews with employees leaving during that time was a good idea, Grant said, but “I would much rather see employers conducting entry interviews or stay interviews.”\nThis reminds me of when I took a Human Resources class in college and the course was going on about how apparently more pay isn’t a priority for employees in the workplace. The past few years proved that concept to be bunk.', a user said: 'Gotta be more boomer propaganda. Pay has always been the only thing that matters.\nOnce good pay is achieved, the other things come into play, but not a second before.'",
        "In response to 'I took a business class that said something similar, but followed up with a shift towards benefits being seen as more important to employees. Fucked up, tbh. Seeing as how shit like our Healthcare and retirement plans can just be tied to our jobs...', a user said: 'Not only that? (I assume csuite does it differently) but everyone at my company has access to the same 5 health plans, the same benefits, etc, so whether you’re a new hire or a senior dev w 10 years, the only thing that changes is your pay.\nThe kid out of college doesn’t care about health insurance, they’re healthy they wanna buy a house and travel and drink with their friends. Likewise, the senior dev of 10 years doesn’t care about beers in the fridge or free lunch, comfy couches or company outings, they just wanna pay their mortgage and send their kids to decent schools.'"
    ]
}