{
    "username": "GD_Bats",
    "contributions": [
        "In response to 'Ohhh I like this.  The yearly raise failed to exceed inflation? People didnt quit, they were Quiet Fired.', a user said: 'Or had they pay quietly cut'",
        "In response to 'This.\nThe answer is no.\nLife has to be something beyond work, simply because a single human wants it to be.\nIf 99.999% of humans born wanted to work themselves until they died and that was the way the world was, it still wouldn't be right because that . whatever % left still doesn't have representation.\nMajority rules, sure, but how much are we willing to take away from a human? Where does the \"pursuit of happiness\" end and begin here?\nWe can pursue it all day, but don't think it's real? Is that it?\nNo. The answer has to be no. I don't want to work at 8 hours and 1 second. I'm done. We're done. If I like you, we can hang out, but you aren't telling me what to do, and we aren't talking about work.\nLet's talk about my side hustle. Let's talk about my partner. Let's talk about my children. I don't want to talk about Karen.\nFuck man my girlfriend complains\nALL THE TIME\nabout trauma she experienced years ago.. like 8 jobs ago.. AND all the trauma she experienced since then. And no, it's not just bullshit. People don't rub their dicks on me when we're alone together, so I can't relate to her problems and whether or not there \"traumatic\" and that means \"she's not just bitching\" before any of you assholes say that. Women are traumatized regularly at work. (It occurs to me that this needs some explaining.. I am correlating her complaining about trauma to her\nstill spending time at the same job she worked at 8 years ago even though she has been off the clock for 8 years because some dick wagon rubbed his dick on her in a copy room\n- so it's relative, you see? She's been off the clock for 8 years but she still gives them an hour or two every once in a while when she struggles with that evening in her head.)\nI thought about this today: all the dudes women meet on tinder and emergency friend their way out of because they're super sketch.. those dudes are the same mfrs they are\nforced\nto work with on a daily basis and the company expectation is that everyone gets along. And if shit goes down, she's the one to blame because she has cleavage or legs or fucking feet.\nIt's insane. This is all insane.\nSo, the answer is fucking no.\nPeriod.', a user said: 'Took a dark turn but yeah, everything in that comment needed to be said'",
        "In response to 'My job wanted me to download their app for \"ease of use\" and other BS stuff. I worked for years without it, nothing changed, so I don't need it now.\nI told them I had no room but if they bought me a work phone I'd happily put the app on it. Of course they then told me to come into the office for a tech guy to check my phone for space instead.\nI put a whole bunch of apps I'd never use in every nook and cranny. Got them to drop it after a few weeks.', a user said: 'Of course they then told me to come into the office for a tech guy to check my phone for space instead.\nYeah fuck that. That's your hardware and especially without any kind of compensation from them, they can go pound sand if they want you to put their secret activity monitoring suite onto your personal device.'",
        "In response to 'Studies show that's not a lasting effect actually.\nTrue engagement are things like managers that spend time developing employees, mentorship programs, recognition, etc.', a user said: 'Recognition and career development is fine and good but with today’s inflation, more money is still the starting point before you look at those other things. There isn’t a substitute for being able to pay your bills and save a little extra.'",
        "In response to 'Right, but consider the value of more money drops off once people can cover their expenses.  After that the other pieces are more significant in moving the needle for employees.\nIf a person is considering leaving a position making 110k but they get to work from home vs a similar position making 125k but they're in the office 3+ days a week.  The deciding point would probably be the cost of time (along with responsibilities and etc).\nA job making 40k vs 60k however, money is going to play more of a significant role.', a user said: 'I really don't think the average American is anywhere near making over six figures; the 40-60k range is significantly more common.'",
        "In response to 'I don't disagree, but the point is that at some point money stops being one of if not the main driver.', a user said: 'I would like to be at that point; as is most people in this country will not experience this.'"
    ]
}