{
    "username": "Gelflingscanfly",
    "contributions": [
        "In response to 'Original Post: I realized I'm in the \"quiet quitting\" phase of my relationship. I watched a YouTube video last night called \"Are Women Quit Quitting Their Marriages?\" by Frankly. It's essentially a curated compilation of TikToks of women talking about themselves and others quiet quitting their relationships, the signs, and why.\nIt was very eye-opening because it made me realize that's the stage of my relationship I'm in. I'm tired of the conversations that never result in change, I'm tired of the defensiveness when bringing up a concern, I'm tired of the dismissiveness when trying to help, and tired of feeling required to react a certain way to things he says. The straw that broke the camel's back was a text conversation I had with my boyfriend a few weeks back, which I previously posted about if anyone wants to go read it. It really solidified how little he cares about my responsibilities and thinks his wants should supercede them and will never show the slightest interest in anything I care about.\nA lot of the TikToks in the video mention how men are usually \"blindsided\" when their partners just up and leave, when the reality is they didn't care to notice the signs since their partner's unhappiness wasn't directly affecting them. I've been emotionally and physically pulling back from my own relationship by being less physically and emotionally present: Not calling him in my free time, not going to his place as often, choosing to hang out with friends and family instead, not engaging with his playful banter (which I find annoying), slowly moving anything of mine out of his apartment, giving minimal effort in the conversations we do have, etc. I'm basically treating him like a friend at this point. And not even a close one.\nA lot of people will probably read this and ask \"Why not just break up?\" Well, the comments of the video explained that perfectly! Quiet quitting the relationship is an exit strategy for women so they can physically, emotionally, financially etc. prepare for the end of the relationship, then leave when it's safe and will have minimal impact on them. I feel if I broke up with him today, I would feel nothing. The only thing I would miss is our mutual friend who I met through him, and the Palworld base I built in a server he owns.\nThe relationship is already dead as far as I'm concerned. I just need to pull the trigger and make it official.', a user said: 'You’re going to feel so much better once you’re free, I wish you all of the best moving forward'",
        "In response to 'Just don't ask them who they think is to blame', a user said: 'Omg I accidentally sparked a conversation with my boomer dad about this during what was meant to be a call to sincerely thank him for something he’d done that really helped me immensely. Like I really wanted to convey to him how I felt his love for me and wanted to bond. Instead the conversation went off the rails as he screamed at and over me how I was ignorant, uneducated, and a fool if I didn’t agree with him despite the fact that he was just insisting baselessly, with no examples or reasons why he felt the way he did. Just “it’s the democrats fault! And if you don’t accept this unsupported opinion as fact then you’re dumb as a rock!”\nI didn’t ask him who was to blame for whatever we were talking about at the time, he did. But I answered truthfully and holy shit I’ll never willingly step on that land mine again.\nIt really fucked me up, made me cry to hear my dad tell me his opinion of me was so low as that in a tone like I was his worst enemy. There was no reason to go nuclear like that, and after trying unsuccessfully to deescalate and redirect for 10-15 minutes I told him he was being unnecessarily confrontational, and hurtful and if he continued to scream insults at me I was going to end the call. Gave him a few warnings and then hung up on him.\nMy dad has always had his difficult moments, and we haven’t always seen eye to eye, but he’d NEVER been so hateful to me. We didn’t speak for nearly two years. It still hurts even after he’s apologised for losing his temper. After the apology and ground rules discussion we had I realised I can never talk to my dad about 90% of things I feel passionate about, most of my values, because apparently who I am as a person and what I believe in is a hot button issue for him and highly likely to unlock thst mindless rage.\nIt’s left me on a position where I still love my dad because he’s my dad, but I feel like even as a nearly 50 year old adult I can’t have anything close to an honest relationship with him  because I have to censor myself to keep the peace. It’s stifling and feels like we have reverted back to how it was when I was a teen and he was super controlling/strict and I was forced to live a double life.\nIt really sucks because we had some deep and meaningful heart to hearts and real growth and bonding back in 2007-2017, then I moved back to my chosen city 100 miles away and I’ve watched him get sucked into the fucker Carlson rage mindset snd all of our progress is gone. I had to give up the idea thst I’ll ever feel truly close to my dad, which breaks my heart. We don’t talk or interact much as a result.'"
    ]
}