{
    "username": "Geno_Warlord",
    "contributions": [
        "In response to 'As someone who is 5 years into the industry, they are a bunch of psychos. I used to keep getting attacked because - \"You only do what you are given. You don't have initiative, you should go above and beyond and voluntarily take up more projects.\"\nBasically, here is the deal - they cannot reduce the salaries. Hence, they are firing people and overworking existing people, expecting them to do additional work. Ie, reduce a team of 10 to 6 and expect the same total team work for the same individual pay. Hence, they are asking us to \"go above and beyond\" and do other people's jobs.\nOh also, meanwhile, they can fire you at anytime with zero justification, and have the security clear out your desk within 10 minutes.', a user said: 'I’m absolutely not quiet about it and have complained about certain people who don’t even do their job and push it onto others. I was talked to a few months ago about not doing some things and I went on a tirade about everything I’ve told them about certain people and I’ve been overworked to the point I said I’m no longer doing their job and they can do something about those people. Thank god I’m in a union because I would have so been fired otherwise and they’d have one less person to keep everything limping along until they finally crack down on the clearly under performing.'",
        "In response to 'How does the union handle the fact that some people aren’t doing the job they’re supposed to do?', a user said: 'Very very slowly. Then they get promoted to a salary job and then fired because salary positions aren’t a part of the union. It takes a ton of effort to fire someone who’s in the union.\nThere was one person that my unit was building a case against to get him fired since he had major issues. He even went to other coworker’s houses uninvited to confront them about some shit(big nono in Texas if you know what I mean). Had the cops called on him and reports filed because of it. Then he somehow got wind that we were getting a case together against him aaannnnddddd he files a sexual harassment complaint against my entire unit to HR. That was a month long shit show that went nowhere. He wasn’t fired because of his harassment claims but he was moved to another area where he promptly went out on mental health leave which he’s out of sick pay now and they’ll have him fired if he isn’t back by the end of the year because his qualifications will expire soon.'",
        "In response to '\"Act your wage\" - I just lost 9 years of raises thanks to wage compression this year, so I'm only doing what's expected of an entry-level employee.', a user said: 'The fuck is wage compression? Where they pay cut everyone to a static wage so it’s easier on payroll? I hope you’re looking for another job right now.'",
        "In response to 'Wage compression:\nWhen companies offer higher starting salaries to attract new talent without adjusting the pay of current employees\nBasically, the minimum wage jumped in my state, and now they need to offer higher pay to attract new employees, but they didn't adjust the scale for existing workers. I started at this job making $12/hr, which was $3 over minimum wage at the time, and now, after 9 years, I'm making $19/hr - which looks good on paper, except the state minimum wage is now $16/hr, so I'm still making $3 over minimum wage.\nThe worst part is that I'm expected to train kids walking in the door, making as much or more than me, who were in middle school when I started here.', a user said: 'Yeah, that’s a gtfo wage there. I’d be looking to leave asap if they don’t want to compensate. Other jobs will be looking for experience and will pay for it because they themselves fucked up and did the same thing. If minimum wage jumps up by $7 and they don’t give you at least a $3-4 raise, they literally only want to exploit you.'"
    ]
}