{
    "username": "GeorgeJohnson2579",
    "contributions": [
        "In response to 'Wie viele Mails und Terminanfragen ich nach 21 Uhr bekomme ist unheilig. Das erzeugt einfach eine gewisse Erwartungshaltung, wenn alle anderen auf der Arbeit so etwas machen, aber ich sehe das auch nicht ein. Wenn ich frei habe, habe ich frei.\nFür (Ab-)Rufbereitschaft müsste ich ja auch bezahlt werden.', a user said: 'Ganz ehrlich: Wir hatten mal eine Kollegin, die hat teils noch um 2 Uhr nachts Mails geschrieben. Auch an Sonntagen. Manchen Leuten musst du glaube ich den Rechner sperren.'",
        "In response to 'Klingt nach einer sehr guten \"Hey, wisst ihr noch damals..\" Geschichte', a user said: 'Das sind im Nachhinein immer die besten Geschichten. Aber nicht, während sie passieren. xD'",
        "In response to 'Prinzipiell ist es doch egal, wenn die Kollegin nachts um 2 und am Wochenende gut arbeiten kann, soll sie es tun. Erwartet sie Antworten außerhalb der normalen Arbeitszeit?', a user said: 'Nein, aber man merkte, dass ihr das auf die Gesundheit schlug und sie anscheinend kein Privatleben hatte.'",
        "In response to 'Ganz ehrlich: Wir hatten mal eine Kollegin, die hat teils noch um 2 Uhr nachts Mails geschrieben. Auch an Sonntagen.\nSpricht ja auch nichts dagegen, ich arbeite auch gern nachts. Das ist ja das tolle an E-Mails (und der Vorteil gegenüber Anrufen): Man kann sie dann bearbeiten, wenn man gerade selber arbeitet.', a user said: 'Ja, nur hat darunter alles bei ihr gelitten und das hat man gemerkt.\nBin ja auch eher die Nachteule und morgens vor 9 zu nichts zu gebrauchen.'",
        "In response to 'Bin kein Millenial und verhalte mich trotzdem genauso wie oben beschrieben...', a user said: 'Warum bist du kein Millennial? Da ist wohl was bei der Lebensentscheidung falsch gelaufen. So können wir dich nicht einstellen.'",
        "In response to 'So erwähnt Unternehmer Ed Zitron, dass der Begriff den Arbeitnehmern gegenüber nicht fair wäre. Er wirke deplatziert, beleidigend und stelle Beschäftigte in ein Licht, welches sie als „die Bösen“ darstellt. Seiner Ansicht sei es ein nachvollziehbarer Trend, der zeigen würde, dass Beschäftigte selbstverständlich keine Überstunden schieben müssten, ohne diese bezahlt zu bekommen.\nUnternehmer Kevin O’Leary widerspricht: Er stelle nur Menschen ein, die bereit seien, mehr als notwendig zu arbeiten – denn das trage generell zum Erfolg dieser Menschen bei. Mit dieser provokanten Einstellung ist O’Leary nicht allein.\nMan könnte ja mal O'Leary fragen, ob sein Unternehmen es als Sieg verbucht, wenn sie 20% mehr Arbeiter einstellen, aber der Umsatz des Unternehmens gleich bleibt.\nDenn noch immer gibt es Unternehmen und Arbeitgeber, die bereit sind, die mentale Gesundheit ihrer Arbeitnehmer aufs Spiel zu setzen, um Unternehmensziele zu erreichen.\nSome of you may die, but it's a sacrifice I am willing to make.', a user said: 'Er stelle nur Menschen ein, die bereit seien, mehr als notwendig zu arbeiten – denn das trage generell zum Erfolg dieser Menschen bei.\nVoll nett von dem, dass der sich um meinen Erfolg sorgt!'",
        "In response to 'Boah alter können wir diese dummen, reißerischen Reposts aus amerikanischen Subs endlich bannen? Mit solchem Mist wird eine ganze Industrie gefördert die amerikanische Artikel durch DeepL jagt und dann den Content kein Stück anpasst. Dieses \"Quiet Quitting\" gibt es als gesellschaftliches Phänomen in Deutschland gar nicht, sonst hätte man das im öffentlichen Dienst schon längst als solches benannt.', a user said: 'Das gibt es hier auch. Nennt sich normale Arbeit. ;)'"
    ]
}