{
    "username": "GerundQueen",
    "contributions": [
        "In response to 'He “considers you a friend” but has no problem with his workload being dumped on you, or you getting equal fallout from his actions?\nYou sure about the friend thing?', a user said: 'I’m not sure it’s fair to blame the coworker for his workload being dumped on her. She says her manager knows it’s the coworker who’s slacking, but chooses to make that OP’s responsibility. I also understand “quiet quitting” to mean only doing work that is part of your job description. If that’s what OP means, it’s especially unfair to blame the coworker for refusing to do work he isn’t being paid to do if OP chooses to do work she isn’t paid to do. OP is equally capable of declining work she shouldn’t be responsible for.'",
        "In response to 'You've clearly never had to manage government employees. When something needs to get done, it needs to get done. You can't fire people for being useless. You basically have to catch them committing actual crimes on the clock, and even then, there's often a long drawn out battle with the union, where the person may still keep their job. Those useless people could tank the manager's promotion opportunities though, so they end up dumping more of the work on the employees that actually work.', a user said: 'I’m going off of the term “quiet quitting.” This is a derogatory corporate term for “acting your wage” or just “doing your job.”  Basically saying “I was hired to perform XYZ tasks for $ABC salary. If you’d like me to perform additional tasks we can talk about additional salary, but I will not do additional work for free.”  Which makes sense, if you think about it. If I agree to pay you $500 to paint my house, how open would you be to painting my neighbors houses while you’re there for no additional charge?\nNow it could be that OP is using the term incorrectly, and that what she really means is that her coworker is not doing his job. And I’d understand her frustration there.'",
        "In response to 'The issue with some employees quiet quitting, or even actually quitting suddenly, is that most of the time they have poor management that would not actually care to make things better. So we can blame management all day long, but unfortunately, this usually only negatively affects your coworkers. If you can’t get your coworkers to come to your level, you’re directly making their job harder, not management.', a user said: 'That may be true, but still not the coworker’s fault.  And really I think management is being spared the burden that should be their responsibility because OP and workers like her are choosing to pick up the slack. I truly don’t know anything about OP’s position, but she says it’s basically impossible to get fired. Is there any reason she can’t also say “sorry, I’m busy with my tasks at the moment and don’t have the time or capacity to take on anyone else’s responsibilities”? This helps shift the burden back onto management where it belongs. Of course poor management is going to offload their work onto any employees who are willing to take that unpaid burden. Coworker chooses not to be one of those workers, sounds like OP is letting herself be one of those employees.'"
    ]
}