{
    "username": "ghettoccult_nerd",
    "contributions": [
        "In response to 'Answer: It's corporate propaganda.\nThe job market was really strong for workers, and workers were re-evaluating their priorities in light of the shift to ubiquitous work from home.  They realized that they weren't under the thumb of their employer, and started taking \"work-life balance\" seriously.\nOn the other hand, their corporate overlords had a bunch of legacy real estate they were having a hard time justifying maintaining.  While their bottom lines continued to be as strong as ever, middle management started to feel more and more useless.\nIT infrastructure had a do-or-die moment, and with 2 continuous years of business running remotely, those who survived have proven (sometimes to their own dismay) that their business doesn't require brick and mortar to house their workers.\nAnd because of this, remote work has been normalized.  Before, you kind of had to live within driving distance of your workplace.  Now, not so much.  So the job applicant pool has gotten much larger.  Good for companies because the talent doesn't have to be colocated.  Good for workers, because more jobs are available, especially outside of cities.\nThis perfect storm has taken the power away from the corporations.  Workers are making lateral moves for more money because more jobs are available and inflation has outpaced normative corporate cost of living raises.  It's all because of remote work, and that's why they want to stop it.\nSo now they talk about people \"doing the bare minimum to get by\" and needing more oversight to improve output.  What they really want is you back under their thumb and powerless.  They want you to go back to being a toady, sucking up to them and freely giving of your precious time in the hopes of a raise.\nBut they're not the only game in town anymore.', a user said: 'but doesnt this blade swing both ways?\nif you dont have to live near where you work, couldnt your employer hire outside of conventional borders? why hire you to work remote, when an employer can hire someone with your skillset from another (cheaper) country to work remote?\nof course your own personal skillset will differentiate you from others, but thats true no matter the situation.\nwhats to stop corporations from just essentially outsourcing all of their remote work?'",
        "In response to 'A lot of things actually.\nPure financial cost isn’t the only factor.\nDeveloping loyal in-house expertise and skills; retaining staff usually leads to much better performance. I can tell you all our outsourced work in IT is regarded round the business as substandard compared to our internal teams and we’re working on bringing it all in house.\nNot to mention all the benefits more control brings.\nIt’s like saying “why spend extra money and eat at a steak restaurant when you can get a cheeseburger from mcds” sure you can, it won’t be as good in any way though.', a user said: 'but if a McD burger gets the job done, i dont see a large corporation splurging on the steak, to stay on theme.\nim not trying to be a negative nancy, but we all know a lot of corporations would saw their collective noses off if it meant pleasing the shareholders. my stance isnt so much a quality vs quantity thing, but rather, will the allure of reducing the bottomline become too alluring for CEOs at some point.\nif its just a matter of training, but now you can hire 3,4,5 times the employees for the cost of one, i dont see differences in skills to be insurmountable from a board room pov.'"
    ]
}