{
    "username": "ghigoli",
    "contributions": [
        "In response to 'I had our CEO tell me that work-life balance is bullshit. He told me work is just part of the life and that while you may need to work, you have to live and enjoy life outside of work too. Under him we got increased PTO, several pay increases, company stock, and all sorts of new benefits. Whenever he came to town, he spent time with us (not just photo ops) and was really great. He told the board of directors and other executives that what would set us apart is how we treat our employees and that they needed to invest there instead of their exorbitant bonuses and raises.\nThe board forced him to resign right after.', a user said: 'CEO was actually trying to run a company.\nBoard wanted to run it into the ground and pick apart the dead pieces for personal gain. Think of it like seagulls attacking a whale. When a company gets so big the only gain these directors have is to either make the whale eat and shit more or to pick the whale apart whenever its gasping for air hoping to feed off the beached corpse.\nReasons to never go public as a company.\nThat CEO would've been great as a private company CEO building the company from the ground up.'",
        "In response to 'Couple months back, our team was assigned to a new supervisor. Immediately they emailed the team declaring that full time WFH was over and we would be reporting to the office two days a week minimum; no discussion.\nOur team lead quit right away. I threatened to quit as well - until an old soup called me dangling a promise of a promotion if I stayed; reluctantly, I elected to stay.\nSurprise, surprise. No promotion came.\nThese people don’t fucking care about us. We’re little more than pawns in their game.', a user said: 'promises don't happen.\nwhen there is a promise ask for it in writing with dates and an email copy to HR.\nif they can't do that then its clear its a \"promise\" and not something they'll actually do.'",
        "In response to '\"How dare you serfs try and stop the return of feudalism!\" /s', a user said: 'bruh we worked less in feudalism like we got half a year off and everything was fucking paid for. just don't try to fondle the lords daughter and everyone was basically ok.\nprobably less war too tbh.\neven then the lord actually didn't have rights to kill us or touch us or whatever. were paid workers.'",
        "In response to 'Original Post: What leaders need to know about quiet quitting… aka the labor rebellion [External Link]: https://v.redd.it/xravs6qh8ot91', a user said: 'when you screw people over to the point of poverty and death. Managements shitty treatment of workers finally caught up to them.\nThe stakes are so high for workers now that literally nothing that management can do in the past other than increasing pay and being nicer to employees is going to make them competitive.  They tried every trick in the book and we know all the tricks. Pizza parties, pool tables do not pay the rent and using them usually end up being scolded by management would put those things there to begin with.\nNow they forced workers to unionize or just quit the job in general because its not worth doing when you have poverty breathing down your neck and another person screaming at your face. Apparently we can walk away from one of them and its surprisingly easy when there is no problems for just walking off the job because at the end of the day you were no better working or not.  Office job, retail, blue collared work. its really all the same just different people yelling at you and different hands to pay. No one is really saving all there money even if its tied to stock (the stock is in a bear market).\nCollectively just driving up the requirements for a better job is really just making people say I spent all this money on education and this job better pay me for it. They will maybe 5-10 years later.  Either that or people just stop going to college. Even if you get the job its most likely no going to be a good job working 10 hours a day with traffic , and being micromanaged, or \"cyber stalked\" by the company day and night. Then pay for an apartment , student loans, city taxes, inflation, and upcharges in the city, and parking, that is 3 times the cost where just going home to your parents and working a starbucks  without a degree is roughly the same amount of money  but without the hassle. Although one option is not plagued with debt.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'make them all read books and do nothing. call it \"quiet teaching\".\ni've had a few truly did not give a shit teachers. they just had a lesson list with some pages and they then just made us do tests. anything open end question just got 100%.\nthe grading was all just this little scanner the teacher had to put papers in and they just write the percentage and grade on the paper.\nyou can seriously not do jack shit if your students are \"Tame\" enough.'"
    ]
}