{
    "username": "Gilarax",
    "contributions": [
        "In response to '\"CEOs are worried about quiet quiting..... But executives don't know what to do about it\".\nMaybe just compensate the employees for the record profits they're helping to achieve? You don't even have to be a crazy altruist executive, even just split 50% of the extra profits amongst the work force of thousands, while you keep the other 50% for like 5 people.\nThat'll do a hell of a lot towards incentivizing your employees.\nEspecially if every other company is still hoarding the full 100% like fricking hob goblins.', a user said: 'Yeah, meritocracy would be really nice.'",
        "In response to '\"CEOs are worried that offering decent wages and hiring enough staff to cover the agreed on workload will make it harder for them to abuse employees and justify their yearly bonus\". Labour is not valued equal to what it produces, the entire core of Capitalism is that those in charge get more value from the workers they employ than the workers get paid for. We have just seen this situation erroded to the point where workers don't feel they need to do anything extra unless paid and not abused by the employer. Employers have gotten used to the situation where they can treat people unfairly and as entirely disposable.\nUsing the term \"Quiet Quitting\" is just playing into their hands though. Its not quitting in any sense, thats utter BS, its simply doing what you are being paid to do\nand nothing more beyond that\n. Framing it as a negative thing is pushing the Corporate side of the dialogue. We need a different term and different media coverage of it, because the solution to this and the \"workers don't want to work\" (another Corporate Propaganda viewpoint) is simple: Treat employees fairly, and pay them well. Hire enough people to cover the actual workload. Keep employees even when things slow down so that you can keep their experience handy for when they pick up again. Stop treating employees like so much dogshit. Companies will no doubt make less profits but they will make more consistent profits in the long run and supersede their competitors who don't treat their employees well.', a user said: 'I would add that companies need a seniority plan that does not include managing people. Just because Joe needs a raise, and he is good at his current position, doesn’t mean he would make a good manager. A shitty manager will cost the company far more in the long run.'"
    ]
}