{
    "username": "gingergrisgris",
    "contributions": [
        "In response to '\"Quiet quitting\" makes it seem like the worker actually left the company - like someone who doesn't put in an official resignation notice or tell anyone they're leaving, just stops showing up.\n\"Quiet quitters\" how they're using it in the article is how we define our \"steady Eddie's\" in my workplace - they don't show any interest or initiative to move up the ladder, but that's totally fine, because they're content with their daily work and always get the job done. The company would actually be in shambles without people like this.', a user said: 'Yes, you are right. At my workplace we have many who we'd describe as just \"happy where they are.\" And that's ok.\nUsing the term \"quiet quitting\" instead does feel like it has different implications, like someone is actively being a poor worker.\nWhile my company has never viewed those \"happy where they are\" people poorly, instead seeing that as a just fine way to be, I can totally see that mindset flipping if this topic gains enough momentum due to the negative connotations of the term \"quiet quitting.\"'",
        "In response to 'Oh fer cute. That isn’t quiet quitting; that’s a combination of Lutheran passive aggressive politeness our grandmothers perfected in church basements for 70 years, sneaking out on Friday afternoons to head up North during the summer and seasonal depression during the winter. We can stay at a job we hate for years doing the bare minimum next to that bitch Deb, but I’ll still buy wrapping paper for her kid’s hockey team because poor kid has Deb as a mom and I hate that bitch.', a user said: 'I feel like I'm not quite following this since my passive aggressive skills are not honed enough being from out of state, but holy cow I love that last bit about Deb. Golden.'",
        "In response to 'Original Post: Minnesota among top 5 states for quiet quitting’ [External Link]: https://www.fox9.com/news/minnesota-quiet-quitting-jobs-2022', a user said: 'This buzz word being in the news makes me nervous that people are going to start being vilified for having boundaries and wanting a healthy work-life balance. I really hope that talk of it dies down so that doesn't happen.'"
    ]
}