{
    "username": "Goddamnpassword",
    "contributions": [
        "In response to 'Original Post: The news media ignoring declining American life expectancy in favor of nonsense like \"quiet quitting\" is one of their most heinous lies of omission to date [External Link]: https://i.redd.it/5vgz6ij9blea1.jpg', a user said: 'The news covers Covid pretty intensely, or at least did up until about half a year ago.  And that’s clearly what caused a massive drop in it right around 2020.'",
        "In response to 'The news covers Covid pretty intensely, or at least did up until about half a year ago.\nThat's not the same thing as covering declining life expectancy - and investigating solutions.\nAnd that’s clearly what caused a massive drop in it right around 2020.\nWhy is the US the only country where life expectancy isn't rebounding?', a user said: 'Here is the link to the underlying report, digging into it it seems to largely be a story of a long divergence in the average life expectancy beginning in the 1980s.  Then in 2020 life expectancy falling through the floor for men with a lower decline for women.\nThe ten countries we are compared to all have better public options or single provider healthcare systems.  The US isn’t rebounding because these are future projections and without massive reform to our healthcare system people will continue to die at younger ages compared to people living in countries with better healthcare coverage continuing the trend that began before Covid.\nhttps://www.healthsystemtracker.org/indicator/health-well-being/life-expectancy/'",
        "In response to 'Yea.  We pay the most for healthcare for the worst outcomes.   It’s almost like someone is profiting off us …', a user said: 'Funniest part about that is this is from Kaiser Family Foundation, you know  the same Kaiser as kaiser permanente the largest healthcare insurance and healthcare provider in CA.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'I mean they are still a for profit company, when most people say single payer they mean government sponsored like Medicare or Medicaid.  Kaiser is what used to be called and HMO but after those were outlawed they became a “consortium.” To you point it’s a probably the best for profit healthcare system out there.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'You don’t know what your talking about almost all doctors take Medicare, 90%+ of doctors including specialists take it. Medicaid is amazing to just good depending on the state and it’s biggest drawback is how hard it is to get onto it. Both provide wider coverage at lower cost to the individual then any private plan.\nKaiser is the worse version of both, it cost you more and geographically locks your treatment to the state of California.'"
    ]
}