{
    "username": "Gold-Sherbert-7550",
    "contributions": [
        "In response to 'I suppose it's more so for his benefit than it is mine. I was ready to pull the trigger on it 2 weeks ago, but then he told me that day happened to be a negative anniversary, and that the whole month of February was a sore spot for him. So here it is March, I'm planning on doing it within the next couple of weeks.', a user said: 'You're just procrastinating. Rip off the bandaid.\nWho cares about his \"benefit\"? You're breaking up with him. There's not going to be any day that's good for him. This man told you that\nthe entire month of February\nwas some kind of negative anniversary. Now the negative month is over but you have to wait until March.... sometime?\nIn the meantime you're still spending time with him and being in a relationship.'",
        "In response to 'My boyfriend is also depressed and has to call suicide prevention on a regular basis. I've had to tell myself that whatever he does after leaving the relationship is not my fault, nor my problem. I've tried to help him with his mental health the entire relationship, but he refuses to make an effort and expects me to sit there and listen to him complain while pretending everything is going to be ok. This is a big part of the emotional disconnect I've had to train myself for.', a user said: 'Does he, by any chance, make these calls in front of you?'",
        "In response to 'Original Post: Quiet quitting my nearly decade long marriage. As the title says  I'm considering quiet quitting my marriage. I AM NOT ready to have the divorce discussion. He seems truly oblivious to the strife either that or has me questioning reality enough that I think he is.  We got a pet this weekend, I've wanted one for quite some time but resisted getting one for years because my plate was too full being a remote worker and a primary parent (my job is flexible) and I accurately felt Id be the one doing all the work. .\nI've been doing the night wake ups for the young puppy, and he stated I should get some rest when he gets up for work. I infered that he would be taking the dog outside while I rested the one remaining dog bathroom trip of the overnight. Not enough to be a 50/50... But sure I'll take it. I recognize that my point of view may be different than his and that I may truly be \"playing the victim\" as he so kindly put it.  I did infer it and assumed it was the case, but did also \"just spring it on him\". I agree I did spring it on him. At 3 AM I scheduled a text to him with the time of the next bathroom break, the location and flavor of the dog treat, as well as loose instructions to positively reinforce. I get a call asking for the location of the dog treat and he says it just looks like a cookie. My kid loves cookies but I had put them all away because well... Chocolate and dogs is no good.  Annoyed, I get up and check the packaging to confirm, yes this is the dog treat and I indicate the brand on the package shows a brand name that refers to tails and wagging. I go back upstairs and get another call 5 minutes later because surprise dog won't go to the bathroom and this is inconvenient to his routine .... In the 5 minutes since I was last present. Treat... Was left inside by the door so pup motive was not there. I take over, clearly annoyed. Dog uses the bathroom immediately. I'm pretty icy while he gets ready for work and takes a shower that is pretty long or it at least is to me because a long luxurious shower for me is 15 minutes, not 30+.\nHe comes out, I state that if he isn't able to fit in any bathroom breaks into his schedule then I would like to know because then I can set my expectations instead of assuming I will get a break. This turns into an argument about me springing it on him and how he no longer has time to do his morning schedule now because of this and the fires through the things he does in the mornings; workout, shower, dressed, breakfast, leave. Note: at least 40 minutes of this is shower. I ask when it will ever be my turn to not do the bathroom breaks. And get told I'm playing the victim and he will get up even more early so he has time.\nI just can't do it any more. I literally just wanted the opportunity to sleep 3 hours straight instead of 2 and I couldn't even have that. I try to be considerate because I've always thought that's what a person should do? I only buy groceries the entire house approves, buy foods specific to his tastes, do things like clean out the coffee maker when I'm done using it so it's not a nasty surprise at 4 am, let him sleep in on weekends unprompted despite parent of early riser, hell every now and then I'll even purchase a video game console accessory or game just because. But I'm not doing it any more. I've decided I'm no longer going to make an effort to be considerate or accommodating which will be very very difficult for me, If I'm going to do everything anyways why go out of my way even more for someone who so very clearly does not even consider me or my feelings?\nSorry for the wall of text and formatting. If I am TA please do let me know because I do agree springing the bathroom break on someone was a lousy thing to do, however I did think that a break was me not doing that bathroom trip.\nEdit: Bad formatting and grammar are bad.', a user said: 'So, the thing that jumps out here is that the two of you aren't communicating. At all. You are accommodating and getting resentful, then  you snap, then he gets defensive.\nYes, dial back what you're doing, especially things he doesn't see you doing (like letting him sleep in). But\nalso\nsit him down and have a meaningful conversation - not \"when is it going to be my turn\" but a conversation about changing things so you have a\nfair division of the load\n. He is more than capable of figuring out where to stash a dog treat so he can find it when it's his turn. He can get up on weekend mornings to be with early riser kid. He can adjust how long he spends in the shower or getting up earlier to work out so that you, too, have time to yourself.'",
        "In response to 'Just because one person refuses to hear, doesn't mean the other person isn't communicating.', a user said: 'Of course. But \"when is it going to be my turn\" isn't a useful way to call him out. OP should stop martyring herself, but she should also be very clear with what she wants and what she expects.'",
        "In response to 'Hi, I didn't put this in the post because it was already so long but this has been a conversation before and I agree there could be better communication. I have directly been told to ask when I need help. However, I have specifically said \"I need help and want you to help. This is me asking you to help me do x.\". This was also not well received, and to be frank I just don't see the value in having to ask for help every single time because even taking time out of doing those tasks is in itself work.', a user said: 'I have directly been told to ask when I need help\nSo, first, dispense with the idea that he is \"helping\". That frames everything as your job/responsibility and his contribution as something he does as a big favor to you.\nSecond, the communication the two of you need to have is not you asking for help (ugh) in the moment, it's\nplanning ahead of time\nfor how the two of you will\nshare household responsibilities\n.\nSo maybe the two of you decide that you will alternate who gets up with the puppy in the middle of the night. Whoever is handling the puppy is\nfully responsible\nfor taking puppy outside, figuring out where the dog treats are, etc. No waking you up at 3 a.m. pretending that he, a grown ass man, cannot read a treat box.\n(As\nu/peskybug\nsaid, you know he doesn't pull this shit at work or when it's something he is doing for himself. Do you think he's calling a personal trainer at 7 am saying \"I don't remember how to adjust the weights on my barbell\"?)\nAnd yes, do the 'quiet quitting' when it comes to things like negating your own preferences in food shopping or letting him sleep in every weekend while you kid wrangle.'",
        "In response to 'Yes, he works a job that literally is keeping track of things and problem resolution if those things cannot be tracked and with the instructions it's challenging on one hand if I give him few directions I'm not giving him pertinent information, but if I give him even more directions and offer resources like reading some PDFs I scanned from a puppy training book or etc.  I'm treating him like an idiot and it offends him.', a user said: 'Have you pointed this out to him explicitly?\n\"Honey, I need you to help me understand this. If give you directions and offer resources, you get mad that I'm treating you like an idiot. But if I step back and trust that you can handle it, you get mad that I'm not giving you pertinent information. What would you do in this situation?\"\nAnd you know, if he's just going to be a dick regardless, then save yourself the effort and let him be mad. \"Honey, you're an intelligent and capable man. Your job is literally problem solving. I trust you to handle it.\"'"
    ]
}