{
    "username": "GoodMoGo",
    "contributions": [
        "In response to 'sim, as empresas tão começando a entender que se essa moda pegar eles vão ter que gastar mais dinheiro. Então tão pegando o termo (que já foi cunhado em tom pejorativo, já que entregar o que você foi contratado pra fazer não é um pedido de demissão silencioso (quiet quitting)) e fazendo umas campanhas abobalhadas...\na questão que eles tão tentando vender é que o quiet quitting é sobre funcionários preguiçosos quando na verdade é sobre patrões escrotos e empresas mesquinhas', a user said: 'se essa moda pegar\nExiste desde sempre. Agora recebeu marketing, nome, e ficou viral...'",
        "In response to 'cara, existe desde sempre, mas já trabalhei em diversas empresas em que o contrário é o normal... ficar até as 22h no escritório é normal e quem não fica é mal visto...\ncomo eu disse, se essa moda pega as empresas vão ter que gastar mais dinheiro pra contratar gente o suficiente pra atender as demandas de trabalho ao invés de explorar todo mundo e falar que isso é cultura da empresa\ntem que receber marketing e virar viral mesmo ué quanto mais gente fazendo melhor', a user said: 'Eu estou em conflito com tudo isso. Estou completamente no meio de um quiet quitting total. Não posso generalizar mas, no meu caso, eu fiz muito mais e melhor do que fui contratado. Por duas razões: Precisava ser feito e eu quero aumento e promoção desde o começo. Depois de vários anos, ficou óbvio que todo o esforço extra tinha pouco a ver com qualquer adiantamento. Não é o caso só pra mim. Vi aconteçer com muitas pessoas. A gota d''agua que me fez passar o dia inteiro no Reddit foi quando tive uma discussão a respeito do meu trabalho e me disseram \"ninguém te mandou fazer isso\".\nO problema é que as expectativas mudaram por cause do que eu fiz. Daí fica difícil não recomendar à qualquer pessoa pra entrar como o Gerson e ö importante é tirar vantagem\".\nMas é aí que entra a merda que o Brasil está e os EUA estão entrando.'"
    ]
}