{
    "username": "goodolarchie",
    "contributions": [
        "In response to 'The simple answer is pay them better but that’s always the last thing they want to hear.\nAlso, it is actually counterproductive to work harder than you’re paid. Cause if your employer is already getting the job of two people from you for min wage, they have no incentive to hire anyone else. And it is possible to make yourself too valuable to promote. It might be more profitable for them to keep you in a lower position that you’re already overworking yourself in than promote you and have to find someone who won’t be as profitable in that same position.', a user said: 'You're right, but there's more to it.  The only thing that incentivizes rewarding employees for \"working harder\" is the threat that they might leave and take their high output elsewhere.  They'll pay you your\ncost of replacement\n*\nrisk of attrition\n.   If you're busting ass for a promotion, you have to also be ready to jump ship. Good career advice is to make it clear to your manager or leadership that your goal is to be at this higher level, that it's important to your professional development and to be recognized for elevated work.  Ask what they would need to see from you to make this happen this year, and get yourself on the right projects to prove your value.\nVery few companies will proactively look in the market and say \"You know, if person X went to our competitor, they'd make 15% more money.  Let's keep them happy here and just pay them now.\"  It's almost always the case that you would need a competing offer to be matched.\nIf you get 6, 9, 12 months down the road and there's no progress, you have projects you can discuss in detail to your next employer on the interview for the position you're trying to get.  This happens all the time.\nAlso there's this notion that taking a competing offer to your company is a death knell.  I think that's only true if it's surprising to them, see above about being transparent with your goals and make that a quarterly conversation.  I've done this and stayed at the company happily for another 2 years. If you like your job/team/company and want to advance there, this is the best way to do it.  You might not want to play the game, but they absolutely will be, in which case they will just be playing you.'",
        "In response to 'People who go above and beyond are the people who get promoted to the next position.\nThat's the myth, and to be fair it's a compelling one.\nThe reality more often is that you get to a position and then stop advancing, either from too-stiff competition at the positions you're applying for or because you're perceived as\ntoo\nvaluable in that position. At that point, it becomes more beneficial to go to a different company for better pay, or a perceived chance at upward mobility.\nAnd all of that ignores that some jobs don't\nhave\nupward mobility (small businesses) or people get promoted for reasons other hard work (kissing ass, nepotism, favoritism).\n\"The hardest workers get promotions\" sure looks good on a coffee mug, though.', a user said: 'And all of that ignores that some jobs don't have upward mobility (small businesses) or people get promoted for reasons other hard work (kissing ass, nepotism, favoritism).\nI have to underscore this last part, having worked my way up the corporate ladder and gotten my own team individuals multiple promotions each.  When a given manager has three people who have worked hard enough to earn that promotion, and the manager can only get approved for one, who do they go with?  Studies show (and my experience echoes) that it's who the boss has the best relationship with.\nThat's salient right now because a lot of workers are pushing back on the \"return to office\" mandates etc.  In the great equalizer of COVID and remote work, everyone was on that even playing field, but the data show that remote workers get passed up more often, and end up making less money.  In other words, simply schmoozing and putting in face time with the boss is one of the greatest factors in being promoted.  At my company, a lot of people are starting to spend a day here and there in the office, but after the great dispersal of COVID, very few people are in the same region let alone city as their boss (who are spread around the US, and world).  It means when they bring in the new department leader, who lives in Chicago, everyone in Chicago knows they have an inherent leg up on upward mobility.  It's basically their game to lose.'",
        "In response to 'Unless you're stuck in a situation where your boss is prejudiced against you for some reason, in which case seeing them in person more is only going to allow more people to overhear the slanderous degrading nonsense the boss says, further degrading your professional reputation and therefore inhibiting your opportunity for advancement.', a user said: 'Unless you're stuck in a situation where your boss is prejudiced against you for some reason\n\"Hey boss, can we grab a coffee?  I feel like we got off on the wrong foot.\"  People are generally more charitable face-to-face, and you're more likely to have your challenges / perspective humanized.  How many online fights would be resolved in 5 minutes over a coffee or beer if those two people could break bread in person?\nIf you're stuck in a remote setting, you don't even get that option.'",
        "In response to 'I'm sorry I'm just totally flabberghasted that there exist people who extol the virtues of office culture as superior to from-home.  I mean I know they're out there I met one at work when I spent a week helping an undermanned department and just kinda stared blankely at her too cuz. .. what the honest to goodness fuck is even miss-\nable\nabout commuting to a space where you're around a ton of people and the guaranteed subset of assholes thereof, where environs are distinctly (at times intentionally) uncomfortable, decisions are made in the most infuriatingly inefficient or shortsighted or plain-old-stupid fucking ways but you're not the decision maker so you gotta do it anyways, where your lunch is\nguaranteed\nnot to be as good as it could be if you had access to your entire kitchen (obviously), where you are statistically\nsignificantly\nless safe\nwhile\nthere and to\nget\nthere you engage in the 8th leading cause of death twice, going there costs money eating there costs money, being there\ncan\ncost money for some, where people show up sick and spread their sneezle coughy bullshit, where some barbarians don't utilize toilet etiquette or wash their hands, where there exists a minimum of one petty tyrant in the building at all times that will busy themselves policing your shit from a place of authority, and then at least one additional petty tyrant who does the same but from a place of \"superior\" morals, politics, religion or intelligence.  Some offices are freezing in winter and scalding in summer and others are exactly the opposite: equally uncomfortable but now for $$$$.  The entire set-up is mindnumbingly infuriating and\nespecially\nwhen the work-to-be-done in question does receive significant benefits from being done at a central location, or god help those that rely upon it, I just...\nWHY\nThe one and only thing I can sorta see that it's got going for it is: socializing.  lmfao text your friends and get together or go to a place that people congregate at like a bar or a beach or\nfuck\nthis is so trivial\nand\ntrivially easily accomplished any thousands of other ways that no it doesn't, it's disqualified from the pros-cons list we're buiilding for office spaces.  If that is actually an argument someone was thinking while reading this, then that would actually constitute a successful illustration of one of those facets of office space life that is mind-numbingly infuriating. We all can do this all the time when not here, many of us can't (job-dependent) or don't want to do it while we are here, and if that's one of the arguments for\nbeing\nhere = example achieved.\nEdit: so yeah that stopped being about or really even too you sometime rather quickly on.  Just meaning to say please dont read this as a declaration of rhetorical or argumentative war it's not it's a rant and a request for a single response summing up why oh why do you miss that how can you miss that', a user said: 'That was a nice rant!\nI've been work from home 100% remote for 10 of the last 13 years, across three companies.\nThe upside:\nMore upward mobility due face time\nMore lateral mobility because of networking and strong relationship building. That means having an in at another company.\nMore real friends and potential romances. People underestimate this one so I'm glad you mentioned it.\nI got a hell of a lot more daily steps when I commuted and had to walk around a bunch of buildings.\nAnd there's a ton of downsides too . But I don't think just going to any office is worth it. It's really only if you can go to HQ, and the company has a thriving headquarters. I don't think there are a ton of startups anymore that build around this intense proximity, daily standups, set the devs next to the sales teams type stuff anymore. I think all that died with covid.\nOverall I look at it as a good thing but I already got to take advantage of the aforementioned benefits. I was working from home pre-covid and it was a big deal for me to be able to take my job with me. I had to get VP approval, and when I bought a house, I had to show the bank a signed letter stating that I was allowed to work at this remote location. Think about how much that's changed in the last 3 years.'",
        "In response to 'Thats how it was for YOU but most companies play favorites and nepotism is huge. I'm seeing it now at my company. There's a guy here that nobody likes, he causes trouble all the time gets in peoples business, goes to hr for any little slight he feels, guess what hes friends with the owner..', a user said: 'Thats how it was for YOU but most companies play favorites and nepotism\nI don't understand the use of the word \"but\" here.  My story is one of institutional nepotism that is intrinsic to human nature and our biases.'"
    ]
}