{
    "username": "goog1e",
    "contributions": [
        "In response to 'Like a hostage video. She's forced to provide content', a user said: 'Meri moved away and suddenly we start having Kody and Robyn scenes.  The paychecks used to be joint into the family account but now each adult has their own contact/paycheck.\nRobyn and Kody are being forced to actually film in order to get paid.  Kody is still taking the majority of the work, but he needs plots and content and there's no one left in Flagstaff but Robyn.\nThe lack of K/R scenes previously was because (in my own theory) the contract was for a certain number of hours filming, as a FAMILY.  So Kody had more control over who had to film.\nNow him and Robyn have their own contact and have to perform to be paid. They can't piggyback on the other's work'",
        "In response to 'Honestly this is what gets me through Kody and Robyn's scenes. My petty self enjoys knowing Robyn is pissed she actually has to work for her tlc paycheck now. She's not the favorite wife in a polygamous family anymore. She's just boring old Robyn trying to come up with something anything for content.', a user said: 'Yes lmao.  Imagine having to perform for an audience that's nearly 100% people who HATE you.   For their amusement and so they can hate on you more. Because you have no other income.\nI realized it during TalkBack or Lookback last season.... She was SO CLEARLY miserable just watching scene after scene of her villainous behavior and having to try and explain herself and Kody.'",
        "In response to 'I think most of the OG13 is NC with him because they don't want to film with him. They're hoping to ice him and Robyn out of the series with lack of content.', a user said: 'Oof I wonder if he has only made the offer to meet or talk things out if it's filmed.'",
        "In response to 'Wasn’t this whole season filmed before Garrison passed?', a user said: 'In Meri's subscriber live she said that it's gonna catch up to that point before the season ends.'",
        "In response to 'Robyn is one of the few women to benefit from polygamy. If the og wives had not taken her out of the trailer park she’d still be “sittin thur,” trying to find man to pay her cc debt. I don’t think she had a spark to extinguish', a user said: 'Exactly.  She was monogamously married and her husband filed divorce.   She chose polygamy at like 30.  No sympathy for what it did to her.'"
    ]
}