{
    "username": "gorchalas",
    "contributions": [
        "In response to 'Original Post: Quiet quitting eli tämän syksyn yksi ärsyttävimmistä uusista termeistä on saanut vastaparin: quiet firing Quiet quitting (\nHesarin maksumuurilinkki\n) josta suomeksi käytetään termiä hiljaiset loparit. Termi on määritelty niin, että se tarkoittaa työn tekemistä niin, että suoritus on tarkalleen juuri se mitä on vaadittu. Tämä taas on markkinoitu meille jonkinlaisena alisuoriutumisena vaikka se tarkoittaa vain normaalia työntekoa.\nNyt ilmeisesti samasta koneistosta on putkahtanut uusi termi: quiet firing eli hiljaiset potkut (\nHesarin maksumuurilinkki\n). Hiljaiset loparit tarkoittavat työntekijän savustamista firmasta ulos estämällä tältä ammattitaidon kehittäminen, eteneminen uralla ja muilla tavoilla kiusaamalla.\nHiljaiset potkut ovat puhdasta kiusaa ja täysin epäasiallista kohtelua. Ilmiö ei ole uusi, firmasta ulos savustamiselle on vain keksitty pöhisevämpi termi. Jos työntekijän työsuorite ei miellytä, tulee työnantajan ottaa aihe kahden kesken puheeksi työntekijän kanssa rakentavassa hengessä ja pohtia yhdessä siitä mikä estää suoriutumisen ja miten siitä päästäisiin yhdessä yli eikä millään lapsellisella kiusanteolla.\nJos olette uusia työelämässä niin älkää langetko tällaisiin riistokapitalistisiin kusetuksiin. On täysin ok tehdä töissä juuri se mitä siellä kuuluu tehdä, tämähän on aivan normaalia. Palkkakin on neuvoteltu sen työtehtävän mukaan ja jos se normaali taso ylitetään niin pitää siitä silloin maksaakin enemmän. Ei ole mitään järkeä venyä äärimmilleen joidenkin katteettomien lupausten toivossa. Joustaa voi tietenkin kunhan se tapahtuu molempiin suuntiin. Kohteliasta on olla se joka joustaa ensin ja aika nopeasti se tulee ilmi, että toimiiko se molempiin suuntiin vai ei, ja joustamisen voi nopeasti lopettaa, jos se paljastuukin yksipuoliseksi ja resurssitappio jää pieneksi.\nJos koet töissä hiljaisia potkuja eli ulos savustamista niin ota se pikimmiten puheeksi luottamushenkilön ja mahdollisesti työsuojelun kanssa.\nPäivän vitutusannoksen tarjoili tänään Helsingin Sanomat.', a user said: 'Miks ihmees hesarin pitää kopioida noita jenkkien idioottitermejä ja mukailla samoja juttuja, jossa duunari on kasa paskaa. Raataa pitäis ja elämä omistaa firmalle. Grindaus jne. Suomessa onneksi jonkinlainen järkitouhu.\nQuiet quitting myös terminä typerä. Se, että ei ryhdy urotekoihin nähdään jotenkin laiskuutena ja ilman korvausta tehdyt ylimääräset pikkuhommat jos jättää väliin on työnantajan pulaan jättämistä. Tämä tosin vähän omana kokemuksena, kun en suostunut pariin kertaan töiden jälkeen toimittamaan toiseen ravintolaan paria raaka-ainetta ns kotimatkalla ulosleimattuna.\nPaskanmarjat. Isäntä määrää palkan ja renki suhteuttaa työn määrän palkkaan. Ei mitään ilmaiseksi. Turha tehdä hyvää työtä jos palkaksi saa lisää työtä ja viiden vuoden jälkeen saada ehkä yhden palkkaluokan enemmän kuin toinen, joka tekee kolmanneksen vähemmän. Tai pahemmassa tapauksessa palkka menee palvelusvuosien mukaan ilman osaamislisiä, ravintolat/kaupat/jne mitä onkaan'"
    ]
}