{
    "username": "gordito_delgado",
    "contributions": [
        "In response to 'Yeah the term is weird, right? Doing your job isn't quitting. It sounds like setting boundaries as a worker. Certainly there are boundaries to what an employer is willing to do for you on their end.', a user said: 'This \"quiet quitting\" thing has such a weird name. It's literally \"Doing your job.\"\nYou don't pay the price of a 97' hyundai and expect the performance of a F1. If you want you car to run at that speed, well... it will certainly cost you.\nI really hate how this corporate hustle culture eventually became a scam to have workers give their 100% while giving them a 20% salary. What was the point of that in the first place? Why did we allow ourselves to be used like that? I remember people shitting on the french for being on strike all the time, supposedly being \"lazy\" and demanding their rights. Guess what? They are correct and we were the suckers.\nPaying X and getting X\n10\ndoes not apply anywhere else in the market, (certainly not profesional services) why are employees any different?'",
        "In response to 'I stopped giving 100% a long time ago.\nAn employer gets my best, which could be 50% one day, 80% another day, and maybe just maybe they'll get a 90% day somewhere in the week. I don't do 100% any more.\nI consider my body a very specialized and valuable piece of equipment. I don't subject valuable equipment to a 100% duty cycle. Why? I don't want to burn it up.', a user said: 'I really like that analogy, I may steal it!\nIt is kinda crazy how we often undervalue and burn out literally our most valuable asset (brain and body), which is the one that generates so much of our revenue as workers.'",
        "In response to 'I really hate how this corporate hustle culture eventually became a scam\nto have workers give their 100% while giving them a 20% salary. What\nwas the point of that in the first place? Why did we allow ourselves to\nbe used like that?\nBecause we were trained by boomers, who benefitted from the extra work that they did.  Back in the 50's through the early 80's, hard work would get you ahead.  If Tim the stockboy at the local grocer saw a task that needed to be done that wasn't his task and he did it anyway, he would be rewarded with a raise and a promotion.  Now if Tim the stockboy sees a task that needs to be done and it isn't his task and does it anyway, it becomes part of his job and there's no raise.  I have lived through that.  I did extra work for one company and it was beneficial for a lot of people.  When I asked why my compensation did not reflect that when it came time for a raise, my manager said that what I had done was part of my job now and I should not expect an increase for it.\nBasically the way we were trained to work was based on the way things were between about 4 to 7 decades ago, not the way they are now.', a user said: 'It is a pretty accurate assessment I'd say. Sorta like we were running outdated software.'"
    ]
}