{
    "username": "gorkt",
    "contributions": [
        "In response to 'Original Post: Why is quiet quitting even a thing in America? I mean, in Western Europe you're supposed to forget about work once you've spent your 8 hours (hour and a half for lunch and breaks included) at the service of the company.\nI can't understand why is quiet quitting even a thing... How could it be \"quitting\" to do just your regular job and refuse to do overtime or completing tasks outside of your job description? Isn't that what you were hired for? Why should you do unpaid extra work?\nThis mindset of \"you must sacrifice yourself for the company and you must be happy about it\" is downright exploitative and undermines any kind of work—life balance.\nIn countries like France, even contacting an employee during their vacation period may get the company into legal trouble, that's the standard in the developed world outside America.', a user said: 'I think \"quiet quitting\" is a media/corporate tactic to try to disrupt the wakening labor movement by attempting to divide workers into the achievers/slackers categories.  People get annoyed if they think they are doing someone else's work and blame them instead of blaming the system for not hiring enough workers.\nI never heard of the term until the last few weeks when the media started spewing out articles about it.  I haven't heard an actual person say the term.\nIt's a bunch of bullshit.'",
        "In response to 'Original Post: New type of quitting discovered \"Quiet quitting is easy to identify; employees who are quiet quitters visibly reduce their effort and avoid going the extra mile. Soft quitting, on the other hand, happens quietly over time. Employees don’t necessarily reduce their work output, but their enthusiasm fades, their curiosity dwindles, and their emotional connection to their work diminishes.\"\nThe cure is to lick the boot harder.', a user said: 'They really want to try to make anything other than sacrificing your health and life for the company some sort of character flaw, don’t they?'"
    ]
}