{
    "username": "goyaangi",
    "contributions": [
        "In response to 'Original Post: My last paycheck didn’t deposit. Hey yall!! I posted last week about how my boss blew a hissy fit when I called in once because I was grieving the loss of my dad.\nNow my last paycheck didn’t deposit this morning!! I texted my coworkers and I know at least one of them got paid. But this is a common occurrence, she always seems to fuck up payroll somehow. (This is the 7th time payroll has been fucked in the year I worked there). I’m pissed because now I have to reach out to her and I “quietly quit” so I was hoping I wouldn’t have to do that.\nSpeaking of which, I approached her about the text hoping to have a productive conversation. I took accountability for calling in after having so much time off for his hospital stay, death and funeral. She started going on about how she’s been looking for her “fourth token” meaning she has had 3 employees that work for her who are all subpar human beings, and she’s looking for a 4th person to help her run the shop/support her/be a normal human being… well I don’t feel like I’m her fourth token and I don’t want to be. So I left this letter and my key, packed my shit and didn’t go back.', a user said: 'I'm just saying, this is the ONLY experience I've ever had working in grooming salons. (I'm assuming grooming due to blades and what I assume is some fur!)\nIt's always a clique type who pushes one out, and it's never easy to just stop working there. They kick you out your last 2 weeks, they make your life hell, or they do this shit.'",
        "In response to 'Just putting my two cents in, this is not my experience in grooming. The salon I work at is awesome. Everyone cares and no one is intentionally pushing people out, at least not anymore than any other job I’ve worked at outside of dog grooming. I even put a 2 week notice in, worked the full 2 weeks with nothing but positivity coming from the owner. She even hugged me and said good luck when I left, and ultimately welcomed me back with open arms when I came back. I know a lot of salons can be toxic, but there are good ones out there.', a user said: 'I'm keeping my fingers crossed. When I'm able to, I'd absolutely love to go back because it's by far been my favourite job I've ever had. I'm not giving up just yet!'"
    ]
}