{
    "username": "Grabs_Diaz",
    "contributions": [
        "In response to 'Except poorer people have more kids. It’s not an issue of affordability. Especially when you compare how little people had historically.\nWork hours have been declining over time', a user said: 'That's no longer true. In developed countries, for the past few decades, a U-shaped curve can be observed. The richest few percent have the highest fertility rate, while middle-class women/couples tend to have the fewest kids, until the lowest income percentiles finally exhibit slightly higher fertility rates.\nHere's an exemplary graph for the United States.\nAlso, across countries, you see that at some development level, fertility rates are no longer falling and might even rise again for countries with HDI>0.9 compared to countries with 0.85<HDI<0.9.'",
        "In response to 'It is true that the highest incomes do have a higher fertility rate it is the\nreally\nhigh incomes, like the 0.1% not the 5% or 1%. In fact if you take the 1% income brackets fertility rate it is the lowest in the US despite the highest incomes having a higher rate. This is because of just how few it actually is', a user said: 'According to the graph I linked, families with an income of more than $300k have a similar fertility rate compared to families with an income below $20k. That corresponds to the top 5% vs the bottom 10%. Families with incomes above $500k (top 2%) even have significantly more children than poor families. [\nref\n]'",
        "In response to 'Except poorer people have more kids. It’s not an issue of affordability. Especially when you compare how little people had historically.\nWork hours have been declining over time', a user said: 'Work hours have been declining over time\nAlso one more caveat I just remembered here is, that these numbers can also be somewhat misleading. What's commonly referenced is average work hours\nper full time worker\n.\nThose have indeed fallen off over the past decades (though in some countries like the US they've been stagnating since the 1980s)\n. If you however consider the hours worked (in gainful employment) per capita or per family, the picture is far less clear, mainly due to the rise in full-time employment of women since the post was era (\nhere's a time series for the employment ratio of the US\n). Individual workers work fewer hours but society as a whole works the same or even longer and the average education time has risen over time as well.'"
    ]
}