{
    "username": "gravitydefiant",
    "contributions": [
        "In response to 'Original Post: Quiet quitting Update: wow, the support!  Thank you all!\nWill now only refer to this as \"Just doing my job\"\nStarting today, I quit working for free.  I won't manage the school food pantry, sew for students or school programs ( uniform alterations, letter jackets, CTE jackets, prom dresses), work the gate or track meets, cover hall duty for others, support fundraisers, sponsor or coach teams, provide snacks to students, participate in staff potluck meals.\n I will arrive 2 minutes before my designated duty time and leave 2 minutes after hours.\nI will take off every Friday to help my family, and take off every PD because I have yet to attend a worthwhile PD (I have only been teaching since 2001, a valuable PD is unlikely to occur in the next year).\nI have 80+ days of leave accrued, and I will leave as few on the table as possible. \nThere is no union power in my state, so I am on my own.', a user said: 'There is no union power in my state, so I am on my own.\nYes and no. I'm certainly not going to tell you there's no value in having a union. But you don't need to be recognized by the NLRB to organize your coworkers to work to rule with you. The more people do it, the easier it'll be for everyone, and also the more impactful.'",
        "In response to 'Agree, and I have been a member of the \"Association\". But I have also seen them tell staff that they are basically without rights to appeal and fight a decision.  In my state, striking will cause your certification to be pulled and your pension to be lost.', a user said: 'Ok, but I'm not telling you to strike. I'm not even telling you to form a union. I'm telling you to encourage coworkers to do what you're doing, which is doing the exact amount of work you agreed to do.\nAll this fear is why things are never going to get better in places like that'",
        "In response to 'In some states, like mine, attempting to organize can get your license suspended', a user said: 'Organizing to follow your contract? I highly doubt it.'",
        "In response to 'have you worked in a public school?', a user said: 'For most of the last 20 years.'",
        "In response to 'Original Post: Is anyone “quiet quitting” this year? I’m curious if anyone else is doing this and how it’s going. My mental health was a mess after last year and my home life is messy— my daughter has a chronic illness that is not in remission. I decided at the end of last year that I was done overextending myself for this job.\nSince then, I’ve just said no, over and over. Can I help take tickets at a football game for four hours and $30? No. Can I lead a PLC? No. Can I mentor a new teacher for an extra plan bell? No, because I’ll just get called to sub for free every day— learned the hard way last year. I’m contracted to work from 7:45-3:15 and so that’s when I arrive and when I go home. If I have to stay extra for any reason— like my daughter’s late practice— I watch Netflix on my school computer and get a Pepsi.\nIt’s been a real relief so far— knowing there’s no pressure for what else may be lurking ahead. It doesn’t matter, because I’m not doing it anyway.', a user said: 'There's no such thing as quiet quitting, but I do intend to try to work to rule.\nIt's a miserable failure so far, but we're only a couple of weeks in.'"
    ]
}