{
    "username": "greenswizzlewooster",
    "contributions": [
        "In response to 'Original Post: Why is “quiet quitting” even a thing? Quiet quitting is defined as someone only doing what’s in their job description and nothing more. My question is: why the fuck is there even a term for this, and why does said term involve “quitting?” Why is it apparently an expectation that someone should do more than what they have been hired to do? This is something that has always appalled me, ever since my very first job.\nIn one of my first jobs, my boss would give serious side eye whenever I refused to do something that pretty clearly wasn’t part of the job I was hired to do. I wasn’t particularly successful in that job and quickly realized that part of doing the corporate dance is doing whatever people ask you to do at all times no matter what.\nThe thing is, doesn’t the term “quiet quitting” imply that you’re inherently not doing part of your job? Shouldn’t that be the proper definition? Not “not doing things that already aren’t part of your job?” What the fuck is happening lol', a user said: 'The thing is, people quietly refuse to do things that aren't in their job description all the time.  Executives often pretend they don't know how to put paper in the copier or unjam the printer.  They usually don't explicitly say \"that's not my job\", but it gets pushed off on a lowly admin who magically figures out how to do it by the hocus-pocus of reading the manual.\nExecutives will pretend that the keurig of Nespresso is some kind of obscure and difficult machine because making coffee is something underlings are expected to do, even if it's not part of their job description.\nExecs refuse to answer their own phone because having an assistant answer makes them seem more important and busy, even if they're just playing solitaire on their computer.\nWhat bothers industry analysts isn't people refusing to do things that aren't specifically part of their job description, it's that peons are getting uppity and trying to act like management.  Management expects peons to do as they say, not as they do.'"
    ]
}