{
    "username": "greenwitchlavender",
    "contributions": [
        "In response to 'Original Post: Quiet quitting: why doing the bare minimum at work has gone global | Work & careers [External Link]: https://www.theguardian.com/money/2022/aug/06/quiet-quitting-why-doing-the-bare-minimum-at-work-has-gone-global', a user said: 'I started new job at solicitors company. Faster i got and quicker I worked, more work I was given, more mistakes I made and more I got told off. What's a point? Noone apart from this deeply unpleasant and I suspect burnt out girl was working fast or pulling unpaid overtime. So... I slowed down to pace of injured snail. I still get told off purely because they have literally no standard operating procedures and what I get told yesterday is wrong today and both yesterday's and todays will be wrong tomorrow. I am also quite underpaid at least £3000 a year for all that so no motivation to busting my arse for people who don't appreciate it. High staff turnover and etc. haha you pay peanuts you get monkeys....'",
        "In response to 'Well that sounds exactly like law. I got out of that sector - it’s a shit show.', a user said: 'You would think conveyancing and lender finance would have better procedures for their basic staff. But nope. Well that explains why they are alway hiring for this team in this law firm in our town.'",
        "In response to 'You’ve completely echoed my thoughts. It’s almost as if you work at my company.\nThe funny thing is, I get told “the company is not making money to warrant pay rises”.\nI work in fund management in the finance sector, our company literally makes money from making money.\nYet I see people who have been on maternity leave for 9 months getting promoted to dept. heads at a 10k per year salary increase and I see people with less experience than myself being taken on for similar roles, starting at 2-3k more than I’m on.\nI guess they think we’re all fucking stupid and we can’t see it blatant as day, but then they also wonder why our department have the highest staff turn over across the business.\nAbsolute morons.', a user said: 'It's annoying infuriating and sad at same time.'",
        "In response to 'Original Post: Quiet quitting: why doing the bare minimum at work has gone global | Work & careers [External Link]: https://www.theguardian.com/money/2022/aug/06/quiet-quitting-why-doing-the-bare-minimum-at-work-has-gone-global', a user said: 'You are right I could. But out of all places where I was bullied in, this one is fairly easiest. I spent 15 years in health and social care followed by year and half in council. Or I already know how to deal with crappy people. Mean girl found herself reported to HR, all crap being recorded and called into meeting. She is happily ignoring me now. I am done running away from abuse. Also please note that I am practicing witch (believe what you like) so what goes around comes around and also I do not wish to harm the unhappy miserable brat, but I won't have her pushing me out out of job that is literally door into new direction of my career. I was abused as child, in schools and many employments and the patterns are so similar. I have been far too nice to point of being naive. Well no more. Sorry for long winded reply 😊'",
        "In response to 'Ah that sort of explains it a bit more thanks, I know you’re not the OP I replied to but sorry again for sounding rude to him/her', a user said: 'No, not rude at all. Sorry, I didn't see your comment to reply quickly enough. Yes it's in line with nature and spirituality and whatever resonates with you. I personally don't follow many Wicca beliefs but there is no right or wrong way :) I also practice reiki and one of the principles there is being kind so I do try as much as I can without being a pushover.'"
    ]
}