{
    "username": "greenman5252",
    "contributions": [
        "In response to 'Original Post: Corporations Are Worried About Disengaged Employees \"Quiet Quitting\", But Nobody Talks About The Underpaid Workers That Have Been \"Quiet Fired\". [External Link]: https://i.redd.it/a7btgkkkgp5e1.png', a user said: 'What if they are so ineffective that they never produce enough labor value to cover their share of payroll?  Why would you give a raise to someone before they produced enough value to cover the cost of the raise?'",
        "In response to 'They wouldn't still be employed at said business were that the case, so if they're still employed there after so long it rounds us back to the question of \"why go out of your way when the business isn't doing the bare minimum?\"', a user said: 'I’m not sure why you would think that.  You can’t simply fire someone because they are marginally ineffective.  There are lots of places where the lack of available labor means that a fired employee might not be able to be replaced with a new employee in a reasonable period of time.  But that raises the question of why it would be OK to not at least pull your own weight?'",
        "In response to 'Businesses can fire/lay off people for not meeting expectation. Businesses often like to do \"corrective actions\" for people not meeting those expectations. So, if, by your own example, someone is consistently underperforming, something will have been done about it. Often involving the employee, their manager, and an HR rep.\nI think the better question is, why do you assume people aren't pulling their weight?\nOr more succintly, why are you kissing corporate ass?', a user said: 'Because I operate an agricultural corporation where I am HR, the manager, the CEO, and a 60 hr a week line employee.  I can measure daily how much someone harvests relative to how much they are paid in wages, benefits, housing, etc.  agricultural employees are difficult to replace mid season because the competent ones are employed.  We pay substantially more than the highest minimum wages in the US and we provide raises commensurate with increases in wholesale produce prices.  It’s obvious when someone is producing less value than they are being compensated for.'",
        "In response to 'I operate an agricultural corporation\nJust say you're a farmer. No need to fluff yourself.', a user said: 'I think in pointing out the weaknesses in overgeneralizing about the relationship between employee compensation and employee production of value, it’s important to use examples from situations that reflect the actual makeup of the corporate world.  Most corporations are small businesses, almost all have fewer than 100 employees, most of these are lean enough to exclude having HR or layers of management.  Most of the other farms, nurseries, wholesale suppliers and purchasers that I deal with also operate as S or C corps.  Makes sense to discuss the issue  of whether employees routinely deliver labor value greater than their payroll costs enough to justify pay increases beyond the annual ratcheting of wages that follows inflation from a business sector that I’m involved in.  If these generalizations are only valid for a certain segment of corporate work, it might be better to specify and not tar everyone with the same brush.'"
    ]
}