{
    "username": "GreedyCricket8285",
    "contributions": [
        "In response to 'Original Post: Quiet quitting - How do I do it properly Been at J2 for 9 months. Reorg in March completely dismantled my team. Manager new what was happening and fled to a new team.\nWas assigned to a new team a couple of months ago. Have not had any work assigned in almost a month. I log on. Attend a couple of team meetings. And that is it. Asked my current (new) manager if there were opportunities to hop on other projects. They pretty much responded by telling me to enjoy the free time and that they would get back to me. A new manager for my team will be hired within the next month.\nI've applied for an internally posted role with no success. No response to application.\nAny thoughts on how to handle this situation. I literally am doing nothing and earning a paycheck. Am I wrong to continue logging in until I get let go?\nThought about taking PTO for a week. Thinking now that I should just save my PTO, log in, start my mouse jiggler, and go about my business.', a user said: 'This is just a humblebrag post, isn't it?'",
        "In response to 'A lot of the posts on this sub are. SWE love to go on reddit to humblebrag.', a user said: 'Odd way to spell \"LARP\".'",
        "In response to 'Companies must define clear KPIs to measure productivity, and act quickly if they are not met.\nSome of us here have OE’d for longer periods because we still deliver to those goals. OE doesn’t always mean we slack it off.\nIn many cases, we’ve gone to higher positions making 30% more and working twice as much. With OE we stepped down to be a highly effective IC and still put in the extra time, yet now I’m putting that extra effort in another company and making 100% more instead of 30%. It’s just logical.', a user said: 'OE doesn’t always mean we slack it off.\nI've repeatedly gotten meets or exceeds expectations at every job since starting OE.  I hate how people think OE = slacker.  That's the opposite in my experience.  Being OE weirdly helps me focus.  When there's too much downtime my mind drifts.'",
        "In response to 'I see a lot of posts on a sub like Millennials w ppl lamenting the fact they have no job, the market sucks, they'll never own a house, the system is rigged, etc.\nIt always makes me think of the folks here, 'getting theirs' while there's 'not enough' to go around.\nI mean, yes, rage against the machine, always, but you have to eat.', a user said: 'It always makes me think of the folks here, 'getting theirs' while there's 'not enough' to go around.\nI have two jobs and am on the hiring/interviewing group for both.\nAt J1, we have\nTWO\nopen positions we cannot fill on my direct team.  We have tried hiring, but cannot find anyone with the skills required that also is willing to RTO.  Management is stubborn and won't open it up to remote even though half the team is remote.\nAt J2, we are hiring remotely. They just announced we took on a couple of new contracts and are hiring two junior SWEs along with promoting two additional folks to management, which will need backfilled.  I work in HR software support, so I also see salaries.  They're trash.  Not surprising we can't even find juniors.\nPersonally I am not taking any job from anyone else.  We just can't find the people we need for what we are paying/asking them to do.'",
        "In response to 'How's the market looking for hiring self taught SWEs? I'm trying to switch careers. I'll even work for free.', a user said: 'You'll have to stand out in the crowd. With no work history, you do that by showing initiative. Find something you like to do, a hobby, an interest, and write an app for it. Doesn't matter if there's already one out on the market. Do it anyway. Then do it again and again. Keep going, and make your repositories public so I can look. That kind of hustle got a few guys in my J1 hired.  Their passion impressed me the most, even if they weren't the most experienced or polished.'",
        "In response to 'Regardless, if you take a job, OE or not it’s an agreement for a time trade. Don’t be a piece of shit and honor your end of the agreement you make.', a user said: 'it’s an agreement for a time trade\nI'm not selling my time.  I'm selling my output.  Based on my last performance reviews, both of my jobs are pleased with what I produce.'",
        "In response to 'And the only reason you can well is because you’re on the positive side of the time trade. I swear you people in this sub are some of the most stubborn and stupid people I have ever seen on Reddit, as an entire community.', a user said: 'you people\nWhat do you mean, \"YOU PEOPLE\"?'",
        "In response to 'Original Post: When you quiet quit/ride it out till you get fired, it negatively affects others in this community I had a teammate who had been dropping the ball for a while and was finally let go this week. His output was so bad that my manager noticed and did some digging. Turns out he barely worked at all and was clearly just coasting till he got fired.\nWell, my manager and skip are PISSED and literally called out how they think our old teammate was working multiple jobs. In my xp, they definitely were as they had many signs.\nRegardless, it’s now coming back to bite my team and me with new policies. Yes I’m pushing back on all the BS coming our way and trying to minimize it, but I wouldn’t be surprised if activity monitoring software came up soon to flag suspicious activity as well. This gig has been great for OE for years and now it’s in jeopardy because someone couldn’t just quit when they were done… I have friends (OE and not) at multiple other companies who are dealing with fallout like this as well.\nMy point being, when you pull the anti work card and coast like this just waiting to be fired (which I see recommended here daily), it’s not an isolated event. You get your bag a bit bigger and your teammates (and fellow OEers) deal with the fallout.\nIt helps to push for more RTOs that may have not as it eliminates the possibility of many of these issues. This also affects remote offerings (wayyyy down from what I’m seeing myself in new job hunts)\nHow would you feel if others put your extra paycheck(s) in jeopardy?\nGet your bag, but don’t screw others over while you do it.', a user said: 'Some people just suck.  We had a guy who would play World of Warcraft, in office, every day.  There isn't any reason someone should just jump to \"they're OE\" just because someone isn't outputting up to standard.'",
        "In response to 'Management just needs to have less tolerance for employees who don't get work done. One of my contracts was like that. Guy was pretty slow, only got like one task done in a month. He was just gone one day and we moved on. It was refreshing.\nTech management needs to be smart enough and connected to the work enough to know when an excuse is BS. And they need to be empowered to get rid of the slow people.\nThen they wouldn't need to rely on RTO/HR/IT policies to try to make people work. It's already at will employment.', a user said: 'Management just needs to have less tolerance for employees who don't get work done\n100% agreed.  Before I was OE we had a guy who was pretty blatantly OE (at a work function he got a little tipsy and told me he took on another contract).  He produced\nnothing\nin over 8 months.  It took a new director coming in to review everyone's work to actually axe him.  Our direct manager didn't want to lose the position, which did happen.  That guy has never been replaced.'",
        "In response to 'Original Post: You’ve Heard of Quiet Quitting. Now Companies Are Quiet Cutting Layoffs are down, but employers are still finding ways to cut jobs -  Is this normal or economy tanking? More problems expected in late 2023 or 2024?\nWorkers are waking up to emails and team-meeting requests with a jarring message: They aren’t fired but their jobs are gone.\nPeople on the receiving end of these memos describe running through a range of emotions, from relief that they’re still employed to a sense of dread that their bosses secretly want them to leave.\nhttps://archive.ph/cYXyk\nhttps://www.wsj.com/lifestyle/careers/youve-heard-of-quiet-quitting-now-companies-are-quiet-cutting-ba2c326d', a user said: 'They aren't fired but their job is gone?  Wtf does that mean?'",
        "In response to 'You just don’t want them to hire the consultants and “fix the glitch” in payroll I guess.', a user said: '\"What would you say you do here?\"'",
        "In response to 'Makes me think of the people being put on the roof like Big Head in Silicon Valley, but really it's just levels of doublespeak I've never seen before', a user said: 'Exactly.  This is just them firing you.'"
    ]
}