{
    "username": "gregaustex",
    "contributions": [
        "In response to 'That many companies conducted exit interviews with employees leaving during that time was a good idea, Grant said, but “I would much rather see employers conducting entry interviews or stay interviews.”\nThis reminds me of when I took a Human Resources class in college and the course was going on about how apparently more pay isn’t a priority for employees in the workplace. The past few years proved that concept to be bunk.', a user said: 'It's true that just giving someone a raise usually doesn't result in more loyalty or effort or commitment. What's missing here is recognizing what does.\nA competitive wage, then add flex hours, more vacation, a job where you deal with less bullshit (standing meetings, BS paperwork) and are more measured on results and have the latitude to pursue those results. Working with people you like. Being treated like an adult with the presumption of competence.'",
        "In response to 'Original Post: It’s Down to Managers to Stop Quiet Quitting, Davos Leaders Say [External Link]: https://www.bloomberg.com/news/articles/2023-01-17/it-s-down-to-managers-to-stop-quiet-quitting-davos-leaders-say?srnd=premium', a user said: 'Quiet Quitting is like Defund the Police - an unfortunate label for a reasonable thing.\nBack when I was corporate, I had all kinds working for me.\nThere were the go getters. They worked long hours, and in return they expected promotions and raises. Fail to deliver and they would leave. They were good people to have on the team, albeit sometimes high maintenance, especially the ones who weren't as awesome as they thought they were.\nThere were also people happy with their pretty decent jobs. The worked normal hours, did their job delivering solid work, and could be described as \"reliable\". They weren't killing themselves to impress anyone and you could tell they had richer lives outside of work than the go getter. I called them \"tractors\" in my head. They were good people to have on the team.\nNow the \"tractors\" are \"quiet quitters\"? So what? This is not a \"problem\" to \"fix\".\nThe only problem I see if when people hear \"quiet quitter\" and think it means \"quit and stay\" (which was also a thing). Those parasites are a drag on everyone, and management definitely has the responsibility to identify and fire them.'",
        "In response to 'They will get shit on for it.\nI remember when I first entered the workplace, and noticed how inflation was outpacing my raises...and every adult I talked to insulted me, and said I should just \"look for another job, if you can't pay your bills.\"\nOkay...now, 10 years and 6 jobs later, I'm finally making decent money...and those same adults now call me a \"disloyal job hopper,\" and \"the reason the economy is in shambles.\"\nThey tell you to stop trying to change the system, and just look out for yourself...then they insult you for taking their advice.', a user said: 'This matters\nI'm finally making decent money\nThis does not\nthose same adults now call me a \"disloyal job hopper,\" and \"the reason the economy is in shambles.\"\nJust don’t hop so much it inhibits people hiring you…but see point 1 so you’re fine.\nAlso maybe a small point but I have bad news, you are the adult now.'"
    ]
}