{
    "username": "grenadegorilla",
    "contributions": [
        "In response to 'The population of apathetic JW (PIMQ, PIMO, or faded) seems to be growing substantially. My guess is 20 to 30% of congregants are in this category. As a result, I think JW will simply stop participating in the way the Gb wants them to.\nLocal elders now find themselves as minders. They’re growing weary of that.\nFamily and friends are likely to resist hurting family and friends\nThe governing body is taken with a chuckle and a grain of salt by at least 20% of congregants right now.\nThis might be wishful thinking, but the population of apathetic JWs is growing. The larger their population the more influence they will have. And their influence will gravitate towards normalization.. That’s my guess anyways', a user said: 'I think you may be right. As an example, the circuit assembly for my old congregation was just last weekend. I didn’t attend but my wife did. She said the amount of guys with beards was abnormally high. People just don’t care anymore. And if everyone just starts growing beards because they don’t care, the masses can’t be stopped and eventually it will become the norm. I realize this is a relatively insignificant example but it proves the point on a small scale.\nI’ve said before that pimos may not realize how much power they have collectively. If they all just stopped going at the same time, it would be like kicking the leg out from under a chair. The chair may not fall immediately but it’s very unstable.'",
        "In response to 'In mine they just showed with a mustache, but they were with a full beard some weeks ago, now they are growing it again. haha', a user said: 'They got a little taste of the glory. Can’t go back now!'",
        "In response to 'I can’t grow a beard but every book or article ever published has Jesus and his disciples with beards. I wonder will Jesus comes back if they will take away his privileges for having a beard.', a user said: 'I can barely grow a jack sparrow looking goatee. It’s not the best but I’m rocking it nonetheless! Jesus would definitely be counseled on his beard and on his clothing that too closely resembles a dress and therefore would be considered gay. According to Sam herd.'"
    ]
}