{
    "username": "groggyMPLS",
    "contributions": [
        "In response to 'Except \"quiet quitting\" isn't a thing. If you're showing up to work and doing the job you're paid to do, then you aren't quitting. You're literally doing your job. It's an incredibly arrogant, upper class American notion to think that everyone who works should necessarily go above and beyond what they are paid to do and come up with a derogatory term for people who don't.', a user said: 'This is moronic. Obviously “quiet quitting” refers to a deliberate reduction in effort by any individual to some level below their own normal personal standards, for their own reasons. And obviously, this phrase was coined by journalists and not by big bad greedy corporate America. Obviously.'",
        "In response to 'It's a derogatory term aimed at shaming people who successfully do their jobs (because anything less would result in disciplinary action and termination), and encouraging a culture where it is expected of workers to go above and beyond what they are expressly paid and contracted to do as standard.', a user said: 'No, it’s clearly not.'",
        "In response to 'Okay, I'm going to give you three definitions:\n1) Wikipedia: \"Quiet quitting is an application of work-to-rule, in which employees work within defined work hours and engage solely in activities within those hours. The philosophy of quiet quitting, despite the name, is not necessarily connected to quitting a job outright, but rather doing exactly what the job requires. Proponents of quiet quitting also refer to it as acting your wage.\"\n2) Dictionary.com: \"Quiet quitting is an informal term for the practice of reducing the amount of effort one devotes to one’s job, such as by stopping the completion of any tasks not explicitly stated in the job description. The term implies that this is done secretly or without notifying one’s boss or manager.\nQuiet quitting doesn’t actually refer to quitting a job. The term is used in varying ways that refer to different methods of reducing productivity or the amount of work one performs.\nThe practice is often based on a rejection of the pressure or expectation to “go above and beyond” in one’s role as the norm (especially when not being fairly compensated for such tasks and responsibilities). It often involves abandoning ambitions for advancement.\"\n3) LinkedIn: \"In a nutshell, \"quiet quitting\" is about rejecting the notion that work has to take over one's life and that employees should go above and beyond what their job descriptions entail. According to Metro, this can take many forms – including turning down projects based on interest, refusing to answer work messages outside of working hours or simply feeling less invested in the role.\"\nAll taken from the top results on google for \"define quiet quitting\".\nPlease explain how I'm wrong?', a user said: 'Well mainly you’re wrong in that you’ve asserted that the term was concocted by some corporate gremlins in order to shame people. The definitions you’ve shared reflect the opposite.'",
        "In response to 'I don't think you understand what you've just read.', a user said: 'I think you must not? Show me a connotation that sparks the outrage you feel about how the term is used.'",
        "In response to 'It's a corporate rebranding of work to rule. Work to rule as a concept has been around for decades.', a user said: '🙄'"
    ]
}