{
    "username": "GrootRacoon",
    "contributions": [
        "In response to 'Original Post: \"Desculpability\"??? Aulinha da empresa tentando enfiar ideia de Quiet Quitting em mim vsf. [External Link]: https://i.redd.it/qyqrxbgf58o91.jpg', a user said: 'pera, a empresa tá tentando enfiar a ideia de quiet quitting em você? não faz sentido isso, as empresas tão querendo justamente que as pessoas não adotem isso'",
        "In response to 'Pô, não precisa fazer  muito esforço pra sacar que o OP quis dizer que a empresa está tentando enfiar a ideia de que quiet quitting (termo de bosta) é ruim. O slide com certeza traz exemplos de declarações que a empresa entende como ruins', a user said: 'É que o título e o slide parecem contraditórios... E como já vi várias pessoas (aqui nos comentários inclusive) confundindo o que o termo quiet quitting significa, resolvi comentar. Mas concordo com você, quiet quitting é um termo bosta e criado pra gerar confusão mesmo'",
        "In response to 'Imagino que esse slide foi postado no contexto da empresa falando o que não fazer', a user said: 'Imagino que sim, mas o título tá confuso porque diz o contrário'",
        "In response to 'Por que? Não seria benéfico à empresa os funcionários trabalharem mais do que deveriam?', a user said: 'seria, justamente.\nQuiet Quitting é você entregar o que você foi contratado pra entregar\né você não trabalhar mais do que tá sendo pago pra trabalhar'",
        "In response to 'Entendi, mas acho que a empresa tá apresentando esse termo justamente pros funcionários terem \"medo\" de trabalhar normalmente.\nTipo, um funcionário que não entende muito vai ver o termo \"quiet quitting\" e vai achar que o chefe tem motivo de demite-lo se ele agir dessa forma.', a user said: 'sim, as empresas tão começando a entender que se essa moda pegar eles vão ter que gastar mais dinheiro. Então tão pegando o termo (que já foi cunhado em tom pejorativo, já que entregar o que você foi contratado pra fazer não é um pedido de demissão silencioso (quiet quitting)) e fazendo umas campanhas abobalhadas...\na questão que eles tão tentando vender é que o quiet quitting é sobre funcionários preguiçosos quando na verdade é sobre patrões escrotos e empresas mesquinhas'",
        "In response to 'se essa moda pegar\nExiste desde sempre. Agora recebeu marketing, nome, e ficou viral...', a user said: 'cara, existe desde sempre, mas já trabalhei em diversas empresas em que o contrário é o normal... ficar até as 22h no escritório é normal e quem não fica é mal visto...\ncomo eu disse, se essa moda pega as empresas vão ter que gastar mais dinheiro pra contratar gente o suficiente pra atender as demandas de trabalho ao invés de explorar todo mundo e falar que isso é cultura da empresa\ntem que receber marketing e virar viral mesmo ué quanto mais gente fazendo melhor'",
        "In response to 'Eu estou em conflito com tudo isso. Estou completamente no meio de um quiet quitting total. Não posso generalizar mas, no meu caso, eu fiz muito mais e melhor do que fui contratado. Por duas razões: Precisava ser feito e eu quero aumento e promoção desde o começo. Depois de vários anos, ficou óbvio que todo o esforço extra tinha pouco a ver com qualquer adiantamento. Não é o caso só pra mim. Vi aconteçer com muitas pessoas. A gota d''agua que me fez passar o dia inteiro no Reddit foi quando tive uma discussão a respeito do meu trabalho e me disseram \"ninguém te mandou fazer isso\".\nO problema é que as expectativas mudaram por cause do que eu fiz. Daí fica difícil não recomendar à qualquer pessoa pra entrar como o Gerson e ö importante é tirar vantagem\".\nMas é aí que entra a merda que o Brasil está e os EUA estão entrando.', a user said: 'Tô na mesma... De uns tempos pra cá comecei a ter funções de gerência e sou contratado como pleno... Chegou a época de feedback que já tinham me prometido uma promoção e não veio... Falaram que nunca prometeram... Resolvi então fazer só o que meu cargo inclui, quando pedem mais eu falo que não tenho autoridade pra lidar com essa responsabilidade'",
        "In response to 'quiet quitting\né a mais nova forma do patrão extorquir o funcionário, trabalhador. Palavra nova conceito antigo.', a user said: 'o contrário né? quiet quitting é justamente você entregar o que foi contratado pra fazer e não ser extorquido pelo patrão'",
        "In response to 'mas o termo quiet quitting tem justamente um valor \"pejorativo\" como se fazer somente o que foi acordado no contrato/contratação fosse errado.\na conversa que eu vejo pelos\n/r/antiwork\nda vida é justamente que foi um termo cunhado pra isso. pra \"desvalorizar\" o certo', a user said: 'sim, concordo que o termo é péssimo e provavelmente foi cunhado pra ter um tom pejorativo... mas é o nome que pegou e o significado dele é esse, fazer o que foi contratado pra fazer'"
    ]
}