{
    "username": "GroundbreakingRip970",
    "contributions": [
        "In response to 'True but she has even less input and looks as enthusiastic as I do turning up to work in the last week of my employment before quitting.', a user said: 'Me on Zoom meetings the last month at my job\n<image>'",
        "In response to 'Wasn’t this whole season filmed before Garrison passed?', a user said: 'Some super sleuth Redditors clocked that in the outside “fight” with Robyn in the snow where she is insisting that he do more to connect with his other kids, the color of the jacket Kody is wearing wasn’t released yet in the timeframe this season was filmed. Also because of the amount of snow on the ground that was still around in Flagstaff, it had to have been filmed later and inserted as filler.'",
        "In response to 'Does anyone know what those failed businesses were that Kody. was talking about?', a user said: 'My Sister Wives Closet for one'",
        "In response to 'She was showing first year employee effort the first few seasons as she embedded herself as favourite wife.\nShe's now showing long term employee fatigue.', a user said: 'I agree. Her participation seemed to change when Sol showed up and then once she got that legal wedding license, she was set.'",
        "In response to 'Robyn is very much like my aunt. Both want to play the martyr, and if anything gets tinest bit hard, they act like no one ever has gone through what they have gone through.\nThey also refuse to listen to other people. You can tell them the reality of a situation, and they will then call you a bully or an awful person (or monster in my aunts case), and then expect you to still come around and do the heavy lifting.\nBoth also refuse to do any type of work, and expect others to provide for them because they somehow deserve it? But also the very little work they do do (such as maintaining the home or helping family members with menial tasks) is “really hard.”\nBoth are emotional vampires.', a user said: 'Have someone in my family like this too. It’s exhausting! Always needs help with the most basic of tasks, incapable of work and does the barest minimum to help anyone else. Needs help moving - you show up and nothing has been packed. She is so overwhelmed and just doesn’t even know where to start {{dramatic dry crying!}} Also has men rushing in to rescue her when she bats her eyelashes and wide eyed pleads for their help, until they burn out or she gets bored and then moves on to her next victim.\nIt took me a few seasons to realize that’s why Robyn gives me such ick. I’ve lived this and it’s zero fun'",
        "In response to 'I agree. she gave way more in the early seasons. it's ridiculous now that all we get are staged convos outside. the conversations happening outside even if the weather is bad makes it so obvious she has severely limited filming in their home lol. I'm so curious what she actually does all day? at least with Christine these past few years have been busy - buying a new home, decorating it, meeting and dating David, all the various wedding planning and parties. Janelle was splitting time between North Carolina and Flagstaff. Meri had the bnb, has friends, and likes to travel. what does Robyn do???? what is a typical day like for her? we never see it', a user said: 'According to Kendra (back in Vegas) Kody and Robyn lay around in bed all day'",
        "In response to 'What I mean is that she's provided less content and with less enthusiasm as the seasons have progressed. \n Watching the earlier seasons she's far more vocal and animated.', a user said: 'Less enthusiasm\n<image>'",
        "In response to 'I didn’t get the hate either until I watched the series in its entirety and then later did a rewatch. I honestly don’t think that she’s intelligent enough to have puppeteered the whole situation but you can see that she fairly quickly takes a head wife type position early on. She speaks up first and often as the authority of polygamy etc. She makes sure that Kody has every reason to prefer going to her house which is a lethal combination when she’s the new cute one. She monopolized Kody’s time over the years so much so that she went too far and this is where you see the true cracks start to form in the other marriages. Robyn might not have been doing this intentionally to break the other marriages but she truly was awful at being a polygamist wife in that sense.\nHaving Kody keep trailing Meri along was the absolute cruelest thing she’s done. It’s very quick but in one of the last few episodes Kody accuses Robyn of not allowing him to let Meri go. I think this was him being the most honest about the situation. I mean we saw it ourselves. They say loneliness for a person is as bad as smoking or a substance addiction. People have their own opinions on Meri but keeping her on the line and giving her hope, that was horrific in my opinion. Robyn even says herself in one of the Vegas episodes, not wanting Meri to go to\ncollege\nffs: “I don’t want her to meet other people, make new friends and then leave us which is common in families like ours”', a user said: 'I agree Robyn’s not a mastermind of strategic planning. She expected the OG3 to hang around because of their faith, serving the celestial kingdom and commitment to the show. What Kody and Robyn were doing isn’t that uncommon in polygamist families. Many of the women who escaped have shared stories of being expected to work to support the favorite shy pretty head wife and her demands while the money and husband’s time are not divided equally among the households.'",
        "In response to 'I feel like I missed it. I had watched until around season 11/12 then restarted at the second to last season when Christine had left and Janelle and Meri were working on leaving. I just missed why we all dislike Robyn so much. I went back to catch up and even in season 12 Christine is crediting Robyn for her relationship with Kody getting better.\nShe seems to be genuinely devastated by the events in the family. She said from the beginning that she was marrying Kody because of the situation with the other wives. I feel bad for all of them that this is how it’s turned out.', a user said: 'If you had a best friend or sister in a relationship like Meri has with Kody, would you encourage her to stick around and hang in there for his crumbs? For over a decade?\nMeri says on one of the recent episodes that Robyn hadn’t reached out to her in more than two years. This is how she treats someone she cares about? Knowing that person was all alone for holidays and quarantining according to her rules during the pandemic, she still didn’t let her come over.'"
    ]
}