{
    "username": "grubbtheduck",
    "contributions": [
        "In response to 'Original Post: Quiet quitting eli tämän syksyn yksi ärsyttävimmistä uusista termeistä on saanut vastaparin: quiet firing Quiet quitting (\nHesarin maksumuurilinkki\n) josta suomeksi käytetään termiä hiljaiset loparit. Termi on määritelty niin, että se tarkoittaa työn tekemistä niin, että suoritus on tarkalleen juuri se mitä on vaadittu. Tämä taas on markkinoitu meille jonkinlaisena alisuoriutumisena vaikka se tarkoittaa vain normaalia työntekoa.\nNyt ilmeisesti samasta koneistosta on putkahtanut uusi termi: quiet firing eli hiljaiset potkut (\nHesarin maksumuurilinkki\n). Hiljaiset loparit tarkoittavat työntekijän savustamista firmasta ulos estämällä tältä ammattitaidon kehittäminen, eteneminen uralla ja muilla tavoilla kiusaamalla.\nHiljaiset potkut ovat puhdasta kiusaa ja täysin epäasiallista kohtelua. Ilmiö ei ole uusi, firmasta ulos savustamiselle on vain keksitty pöhisevämpi termi. Jos työntekijän työsuorite ei miellytä, tulee työnantajan ottaa aihe kahden kesken puheeksi työntekijän kanssa rakentavassa hengessä ja pohtia yhdessä siitä mikä estää suoriutumisen ja miten siitä päästäisiin yhdessä yli eikä millään lapsellisella kiusanteolla.\nJos olette uusia työelämässä niin älkää langetko tällaisiin riistokapitalistisiin kusetuksiin. On täysin ok tehdä töissä juuri se mitä siellä kuuluu tehdä, tämähän on aivan normaalia. Palkkakin on neuvoteltu sen työtehtävän mukaan ja jos se normaali taso ylitetään niin pitää siitä silloin maksaakin enemmän. Ei ole mitään järkeä venyä äärimmilleen joidenkin katteettomien lupausten toivossa. Joustaa voi tietenkin kunhan se tapahtuu molempiin suuntiin. Kohteliasta on olla se joka joustaa ensin ja aika nopeasti se tulee ilmi, että toimiiko se molempiin suuntiin vai ei, ja joustamisen voi nopeasti lopettaa, jos se paljastuukin yksipuoliseksi ja resurssitappio jää pieneksi.\nJos koet töissä hiljaisia potkuja eli ulos savustamista niin ota se pikimmiten puheeksi luottamushenkilön ja mahdollisesti työsuojelun kanssa.\nPäivän vitutusannoksen tarjoili tänään Helsingin Sanomat.', a user said: 'Opetettu niin että jos haluaa ylimääräistä se maksaa lisää.\nTeen tasan sen verran töitä mitä on ja kuuluu, jos tulee enemmän niin sitten enemmän palkkaa tassuun niin alkaa hoitumaan. Urakkapalkalla jos olisin nii huhkisin munahuurussa niin kauan kuin terveys kestää ja antaa myöten itseään rikkomatta.\nIlmaiseksi ei kannata alkaa ylimääräisiä töitä tekemään, ellei sitten tosin halua 🤔'",
        "In response to 'Toki tässä voi olla myös taktinen, riippuu täysin siitä mitä elämältään haluaa. Jos firmassa on kulttuuri jossa kovasta työnteosta palkitaan rahallisesti tai ylenemisellä, niin kannattaa harkita myös tätä.', a user said: 'Totta tuokin jos näin on, nykyisessä firmassa jossa olen töissä, ylenemisen mahdollisuus aika lähellä 0, koska homma jota teen sitä tekee vain 2 ihmistä koko firmassa ja siitä ei oikein pääse ylenemään eikä alenemaan. Hommaa kyllä riittää mutta siinä on turha lähteä muiden töitä tekemään lisäksi koska se ei näy edes sanallisena kiitoksena ylemmältä taholta, jos jotain niin ainoastaan töitä ja vastuuta tulee enemmän.\nedit; Ja kaikki sykkimiset mitä nähnyt työelämäni aikana tuttujen, kavereiden että työkavereiden osalta niin suurimmalla osalla vastuu on vain kasvanut mutta se ei ole näkynyt palkassa millään tapaa. Toki tulevaisuudessa CVssä voi näyttää paremmalta, mutta sekään ei takaa parempaa pestiä tai palkkaa.\nEikä se tarkoita että teen työni huonosti, teen ne työt jotka mulle on määrätty ja teen ne kerralla hyvin niin sillähän siitä.\nElämältäni tosin haluan enemmän ja tarkoitus on kouluttautua muihin hommiin jossa kovalla työllä todella saavuttaa oikeasti jotain ja se todennäköisesti näkyisi rahallisestikkin.\nJa niinkuin oma esimiehenikin aina iloisesti tokaisee \"tällä rahalla saa tämän verran\"'",
        "In response to 'Ja kaikki sykkimiset mitä nähnyt työelämäni aikana tuttujen, kavereiden että työkavereiden osalta niin suurimmalla osalla vastuu on vain kasvanut mutta se ei ole näkynyt palkassa millään tapaa. Toki tulevaisuudessa CVssä voi näyttää paremmalta, mutta kyseisellä hetkellä siitä ei ole kuin ylimääräistä työtä ja mahdollisesti stressiä\nNo joo, ehkä sitä välillä unohtuu että voi olla että omat duunipaikat on olleet jotenkin erityisen reilu-rationaalisia: eli jos teet kovaa duunia, niin sitten sen yleensä löytää myös palkkanauhasta ennemmin tai myöhemmin.\nEli omassa kokemuksessa nimenomaan (yleensä älykkäällä) sykkimisellä on päässyt niin uralla kuin rahallisesti eteenpäin.\nMutta kirjoituksesi on toki järkevää: jos mitään positiivista ei oikein seuraa, niin miksi sitten sykkiä. En odota miltään perusasiakaspalvelijaltakaan että sykkisi helvetisti firman eteen.', a user said: 'Riippuu varmasti hyvin paljon eri aloista, voin olla toki väärässä, mutta uskoisin ainakin IT puolella kovalla sykkimisellä ja osaamisella olevan paljonkin positiivisia vaikutuksia kuten myös esimerkiksi raksalla jossa voi vetää urakkapalkalla kun osaa hommansa oikeasti hyvin.'"
    ]
}