{
    "username": "GTAIVisbest",
    "contributions": [
        "How to effectively quiet quit as the highest performer on my team I am the team's highest performer. I have a lead IC role (\"hybrid management\") where a lot of my job duties involve coaching, development plans and employee growth. I am one of two lead ICs and there are like 3-4 other ICs on the team.\nOver the past two years, I've taken this position very seriously and have operated at a much higher level (the position above mine) than expected. I was rapidly promoted to lead IC in less than a year and I have been told that going into full management is \"mine if I want it\". The difference between myself and the other ICs on the team (including lead IC) is pretty dramatic. I'm easily doing twice or three times the workload and have a much higher operational proficiency, client satisfaction, etc.\nFor a plethora of reasons, I've become totally disillusioned with the institution, middle/upper management, and the position. What's compounding my anger/depression is that I took my position as a downgrade in my career, but intended to be underpaid and underappreciated for 2-ish years to build up hands-on experience in a new industry. I've been ACTIVELY trying to get OUT and make a lateral or upwards move (externally, not internally as my institution does not offer internal jobs) and because of the PARTICULARLY shitty state of the white-collar job market (\"worse than 2008\"), I have been faced with rejection after rejection after rejection, usually after getting 99% of the way there. I also have particular grievances about the way that middle/upper management has \"strung me along\" on a variety of promises. I look back and see that I'm literally ROTTING in what was supposed to be a temporary position, in the prime years of my career, and I feel STUCK (can't get out no matter how hard I try).\nIt's important to note that I really don't *like* the idea of quiet-quitting. I always used to say \"why would you quiet quit? Just go find a better job that you feel fulfilled in\". The problem now is that I'm so bitter at the institution that putting in extra effort feels nauseating and violating, and I'm STUCK at this job due to the extremely terrible job market (unless I restart my career entirely or quit without a job lined up).\nAnyways, circling back to the point of my question: I've become widely known as such an aggressive overperformer that my bosses have flat-out told me that overperformance has become my new baseline for expected monthly performance. I used to easily get \"exceeds expectations\" every month, whereas now they want me to continuously struggle and squeeze every drop of effort out of myself just to justify a \"meets expectations\". My goal for quiet quitting is to start putting in the same amount of effort as the other lead IC, who notoriously underperforms but is never held accountable. However, it's going to become extremely and immediately apparent as soon as my next monthly performance evaluation hits, and my managers are going to be asking me \"WTF is going on\".\nI fear that this will immediately result in 1-2 months of \"does not meet expectations\", followed swiftly by a PIP or something like that. I'll be told to go back to my previous baseline, and when I don't, I'll be accused of insubordination or something. I really don't want to deal with this level of mental stress, especially as I'm already highly depressed from my rejections while job-searching.\nDo any managers here have an idea of what I should do to effectively and smartly go from \"ultra top performer\" to quiet-quitter?",
        "In response to 'Some practical advice: I think if I surveyed all of the people I’ve managed over the years, 80% would claim to be in the top 50% of the team. Of the people who clearly considered themselves the highest performer on their team, maybe only half or fewer were actually the most\nproductive\n.\nThat’s not to say I doubt the OP. I’m trying to say that it’s much harder to accurately gauge our own performance than we think. Trying to target arbitrary comparisons is easier said than done.\nIf anything, I’d just try to match a couple people around you plus a little extra for safety margin. Trying to stack rank your peers, effectively, is very likely to result in a different perspective than your managers.', a user said: 'I'd say it's gotten to the point where you can't even compare the workload that I take on vs those of my peers.\nClients always believe I have a middle management/general manager job title and they think the other lead IC is the least-paid one in the team.\nI'm always correcting clients and also counterparts in other departments by telling them that I'm not the branch manager, or \"the one in charge\" at my branch, but that I'm just an IC and that I'm doing the things that my managers should be doing and that I'm taking accountability and responsibility that managers normally do.\nA lot of the follow-ups that I undertake and the high level of care I put into my work would only be done by someone high-up in the totem pole, because no one else is cogniscent enough or cares enough to put that much underpaid effort into this job (except me, because I do it for the clients who will benefit for my approach).\nA lot of what I do also involves cleaning up messes created by my manager, who means well but doesn't have a great attention to detail. A lot of the time, he gets overwhelmed and tired and gets SLOPPY and I have to clean up after him or coach him on how to do certain processes effectively.'",
        "In response to 'Stop doing this:\nA lot of what I do also involves cleaning up messes created by my manager, who means well but doesn't have a great attention to detail. A lot of the time, he gets overwhelmed and tired and gets SLOPPY and I have to clean up after him or coach him on how to do certain processes effectively.', a user said: 'Clients will suffer, their financial situations will suffer, important cases that affect them financially will not be done and fall through the cracks. A lot of it is me calling clients and giving my word that something will be done, and then needing him to finalize cases using authority that only he has.\nIf I go \"not my problem\" and back off of it, clients will instantly be harmed and my word will be compromised'",
        "In response to 'This probably qualifies as an Unethical Life Protip. I did something similar in the past as an IC at a previous company along with my colleagues when a nonsensical performance metric system was foisted on us:\nIt sounds like at least some of your perf metrics are 1) quantitative and 2) transparent within your company (i.e., you can see or deduce the metrics for other ICs).\n1) make a histogram of metrics for ICs comparable to you\n2) assuming you really are in, say, the 9th decile, compare your metrics to the median.\n3) figure out how much effort it takes to stay, say, at the 6th decile (just above median), and do that much.\nTL;DR: if a bad quantitative metrics system is used against you, you can use it right back.', a user said: 'We used to have numerical, quantitative sales goals (both branch and individual), and when we had them I would demolish the rest of the team just by giving way more of a shit. I always was and still am focused on client satisfaction, so clients trusted me and I became a \"personal banker\" with a huge book of business.\nNow we have new management and no more numerical goals. Performance is based off of behaviors displayed, how you can influence others in the team to align with those behaviors, professional development, etc. I still outperform my team by 200%+ because I can easily perform those behaviors and influence morale on the team while STILL getting huge sales numbers and being very operationally detail-oriented (which results in superb client satisfaction, reviews and retention).\nThe guy who is at the same level as me, it's as if we're both at the same level, but he's just acting as a cashier of the grocery store while I'm general manager in the back office doing 30 different things and cleaning up other people's messes and escalating with other teams for follow-ups and error resolution. The other dude is just sitting at the figurative cash register moving money in and out of the till and he doesn't want to go any further than that'",
        "In response to 'This is probably not what you want to hear, but the \"other dude\" is doing a better job than you are, from an ROI point of view.  If you're doing the work of a general manager and getting paid as much as the cashier, metaphorically speaking, then the cashier is the smart one.\nBluntly: if \"giving more of a shit\" isn't producing results\nfor you\nat your company, you can either change the amount of effort you put in, change companies, or decide you're ok with it and keep keeping on.', a user said: 'I will say that the reason why I \"did the work of a general manager\" (so to speak) instead of just being the proverbial cashier is because I entered into this industry and into my position with the express goal of obtaining as much knowledge, skills and proficiencies (via overperformance and going above-and-beyond my job description) as possible.\nThat happened around 1 year ago, and since then I've started plateauing with the dangling promises in front of me from middle/upper management that I was suckered into believing.\nThe obvious play would be to just leverage all those skills, all that high performance work, and all that experience into a great career or job in the section of the industry that I could feel comfortable advancing in. However, because of my LOCATION and because of the JOB MARKET (agghhh just typing the words out again fills me with frustration and anger), I feel stuck. I send out so many applications like blowing dandelions into the wind and the only crumbs I get back are worthless (i.e, lateral moves or sub-lateral moves that will put me in a position of having an even higher level of stress with less opportunities to absorb useful knowledge).\nI see positions being filled that I know I would have been perfect in, but they're filled by the star candidates that the hiring managers can afford being picky for, because they've flooded the white-collar job market in my area.\nI feel trapped and disgusting and angry every time I have to once again walk into my branch at work. I want to just leave and keep my dignity intact, but I keep getting rejected at every step'",
        "In response to 'You have reached the point of “it’s time to move on.”', a user said: 'I'm AGGRESSIVELY trying to move on. I've been trying for about 5 months now by applying with tailored resumes, both in AND out of my industry, both with and without internal referrals.\nI've gotten to the offer stage many times, with amazing interviews and perfect questions/answers during those interviews, but then they end up finding a candidate that has a LITTLE bit more experience in a SPECIFIC aspect of the job, and who also interviewed pretty well. Even though I make an exceptional impression, it's so flipping competitive that I can't easily move on.\nWhen I DO get an offer, it's for a position that is extremely shitty (i.e heavy sales goals, high pressure, or very low pay outside of my industry with stress-inducing metrics) and I know that if I accepted it, it would make my mental health even worse than where I am currently'",
        "In response to 'If you’re moving on, it’s worth going over your managers heads and going to the executives where the owners are the board and let them know that all their money is being lit on fire and one form or another. Hell you might get a promotion that way.', a user said: 'Nooooo that would not be great. They would say \"oh wow we had no clue, I'm so terribly sorry about this\" and hold some meetings with me, but NOTHING would change for the better and I would be branded a bridge-burner and a wild, unhinged liability. It would be the equivalent of an adult tantrum and no respect would be gained'",
        "In response to 'Sure but it’s not in the managers best interest to put that employee on PIP just because he goes back down to a normal work ethic. How would that benefit the manager?', a user said: 'They are going to understand that I'm \"no longer trying\" (aka, that I'm no longer pushing myself to be uncomfortable in my jobs by jumping through ever-narrowing hoops in order to display behaviors they want to see). Their choice then is just to accept it without saying anything, or to try and dive in and use a mixture of coercion and faux-concern to drill down and say \"I know you want to give up, but you can't do that - what needs to change?\"\nThe changes that would need to happen are so fundamentally structural and just will not happen, so then we circle back into them saying that \"this is not a charity\" and then swinging into the coercion/stick part of the equation to try and scare me back to my previous behavior'",
        "In response to 'The line that was fed to OP is something my last job did as well. They literally gave promotions to ppl with general lower performance but that had one good quarter than to give it to the one that was always high performing..\nTheir “logic” was that to get promoted you needed to deliver more than your usual, not your levels usual but what you personally set as normal for you. So if you were unlucky and had a manager that didn’t fight for you when you were performing higher than the other ppl on your level and you didn’t get promoted suddenly your high performance was seen as your standard performance for that level.\nIt is a lazy manager that uses that excuse imo. It is not fair to the employee and will lead to high performers leaving the company as they are pushed to a burnout.\nFor OP I do think a slow decrease in work done might be the only way that could work, if he drops immediately down in his performance his manager will have questions.\nWhat I learned from my experience was setting boundaries better, saying things like “what tasks can I offload should I take on this new task” and never ever to go to 100% of what I can do.. I stay at 60-70% of what I know I can do, still my manager at my new job is impressed with how much I manage to accomplish in a week/month.\nI apply the same for my team. At least once a month I check in with them on workload and mental load of what they are working on. Make very clear that it is important not to consistently run at 100% capacity. There will always be times where suddenly extra projects or tasks show up unplanned and we need to not go above 100% when that happens.\nInitially my team was confused, but in the 2 review cycles they now have had with me I got 25% of the team promoted, they get feedback how valued the team is and other managers and directors have made clear how much they like that my team can ramp up fast when something unforeseen happens and help out.\nI think especially in the US we are used to push ppl to 100% capacity at all times and ignore that this leads to burnout, not being able to firefight when needed without creating fires in other areas.\nA well rested team with appropriate workload will deliver higher quality work and faster than an exhausted team.\nAlso, OPs manager should have moved him up to full management or at least gotten him a good raise and bonus for the work. Sometimes we can’t promote due to outside reasons but having someone move to a hybrid role and not at least get a raise and nice bonus will just create frustration in the employee you rely on to do more.\nAnd if the other lead is really doing so much less he should have been removed and replaced by someone who performs better, which likely would have helped not to overload OP with work as well.', a user said: 'Yes, the other lead should have been removed. He actually quit and then was allowed to come back at his same position and pay when his other thing didn't work out. There was obviously clear favoritism at some point with him. He is a very chill and friendly, genuine person, however, so I'm not resentful towards him. The rest of the team is pretty damned resentful towards him, though. As for me, I always viewed him as a convenient comparison tool so that my position as the top performer would always be assured.\nThe other lead is always just absent all the time and then when he does show up, he basically does the easiest/most bare minimum stuff (quantity over quality) which does help us to a certain extent, but I imagine that if I cloned myself and had another one of me in his position this team would be an utter powerhouse and nothing would stand in our way.\nWhat you mentioned about being pushed to 100% all the time resonates with me, because one of the reasons that I felt disillusioned was that I could NEVER just \"do enough\", even by overachieving so much. I could never feel like I was able to overachieve and then feel \"comfortable\" in my position. I was always uncomfortably pushed to jump through more and more hoops, more and more behaviors, more and more distracting efforts. I could never just maintain my very high performance. I always had to improve something, which was not sustainable'",
        "In response to 'Why would your over performance become the new baseline? That only makes sense if you got promoted to a higher level. And even then they shouldn’t hold you to a different standard than others at that same level.\nI think your best bet is to slowly scale back. Are you working evenings and weekends? If so I would start by refusing to do any work on the weekends unless it’s critical. Then the next month stop working in the evenings as well. When management asks about it, just say you were working on the evenings and weekends but now you’ve started to seek a better work life balance.', a user said: 'In the words of my manager: \"You consistently go above and beyond and display an amazing level of client service/operational excellence/etc. But, it's obvious that you have done this consistently - this is your new baseline. This is what is EXPECTED of you. In order to grow within this institution, you need to be continuously improving...\" (etc etc etc)\nI am not working any overtime, because we are all hourly and overtime is not allowed. However, my \"overperformance\" is related to the level of attention to detail I bring to cases I handle, to the sorts of behaviors I display to clients, and how loyal and satisfied my book of business is. It also is directly related to the amount of money I'm bringing in for the organization'",
        "In response to 'A bit of a contradiction - you have been offered a full management job but there is no internal movement up at your job?\nIf you trust a higher up (not necessarily your boss), is there someone you could talk to about your ambitions and your past experience (taking a pay cut to learn a new industry; I guarantee it’s not top of mind for whoever you’re reporting to)?  Because if they really like and value you, they will create a job for you.\nIf you don’t like the company, still try to gain lateral or upward experience and titles, so when the job market turns again you can aim for an even higher role at the new company.\nAlso, if you are feeling unmotivated , do take a step back from your previous high performance.  If they ask you why, tell them you are experiencing burn out.', a user said: 'Let me explain more with regards to internal promotion.\nThe path for me is IC -> IC2 -> Lead IC -> Manager -> Middle manager\nI am currently at Lead IC, and I can go into Manager if I want. However, I DON'T want to do this, and never have. The bullshit just flows downhill and the people I report to as manager are slimy and nauseatingly ingenuine. I have been operating at a manager level for around a year or so, but I don't want to take the title and the small pay bump because of who I'd be reporting to and because of how extremely overworked I would be.\nA manager is expected to do the full-time job of like 2.5 people and nothing THEY do is ever enough either. Fuck that, I don't want to aspire to be a retail middle manager as the pinnacle of my career.\nFor people in my position, the obvious and usual choice (a very common trope in my industry) is to move into a \"back-office\" operational support department by leveraging my front-line industry knowledge and high-stress experience. That would be a SHOE-in for me, because I have a very good reputation with back-office departmental managers as \"that one front-office rockstar who is always on top of everything and would be a great addition to our team\".\nHowever, our organization REGION-LOCKS those opportunities to employees only in TWO STATES. And I am obviously not going to move from my state because of personal ties and a significant other. I live in a HCOL state and there are not many back-office roles in this area unless the organization itself is small and based out of my state.\nThat's why I say that there is no \"internal movement\" at my job. I don't want to pigeon-hole myself into some overworked, underpaid management position where the shit never stops flowing, I want to get into an operational support department like BSA/AML, fraud, collections, whatever. But of course, this obvious path is locked to me due to where I live'",
        "In response to 'There are two different definitions of “quiet quitting”. One is where you stop doing everything except the absolute minimum to avoid raising suspicions. You’re collecting paychecks until they fire you and playing a game to see how long you can stretch it.\nThe second, which doesn’t make sense IMO but is used a lot on Reddit, is where you go from high performer to average performer. It’s really hard to give advice in these scenarios because you never really know if the person is a superstar or they just imagine it that way.\nIf the OP is actually so far above their peers that nobody compares, there shouldn’t be any concern about PIP or firing. A company isn’t going to fire one person for performing at the same level as their peers.\nWhich begs the question: Why the fear about getting fired? Either it’s irrational, or the OP isn’t entirely honest with themself about how much better they are than their peers', a user said: 'I know I would never get fired, but if I make it extremely obvious that I'm quiet quitting (i.e no longer pushing myself to grow and outperform myself) my managers will start putting undesirable pressure on me by threatening disciplinary action. They've done that before when I was overachieving but they wanted me to do more, more, more, more. They say \"this isn't a charity, we won't pay people to just \"make it through the day\", you have to do XYZ\" (which my peers never do).\nMy dream is to overachieve and be a high performer at a job where my managers can recognize this and help me maintain that level of achievement indefinitely. Where I can feel comfortable knowing exactly where I stand with my work and my performance and feel totally fulfilled at the end of the day without that sickly feeling of being whipped for more'",
        "In response to '“Quiet quitting” in whatever form you imagine it involves not caring what your managers think as long as you don’t get fired before finding the next job.\nIf you’re quiet quitting then you shouldn’t care what these managers think because you’re busy finding the next job.\nI do sense some cognitive dissonance in the way you say you want to be a top performer in a thread where you’re asking for advice on how to quiet quit.\nI also think you’re developing some extremely unrealistic expectations with comments about wanting to feel “totally fulfilled at the end of the day” and having managers help you maintain high performance indefinitely. You’re the only one responsible for your performance at the end of the day and a job will always be a job. Find a job and a pace that you can sustain and stick with that.', a user said: 'What I mean by that is, let's say my job involved tracking report for bank fraud, following and investigating accounts, responding to escalations from front-office staff, staying on top of new fraud trends, and thinking proactively to improve processes that would prevent future fraud.\nI would bring an extremely strong work ethic with a high attention to detail, a commitment to continuous documentation at every level, and a high level of operational proficiency that would have tangible results via a decrease in successful fraud at the institution.\nI want THAT. I would work HARD and I would work diligently but I would feel totally satisfied and fulfilled at the end of the day. I want to be able to go into my performance evaluation and have my manager say \"You're doing great. Let's go through some of your recent achievements. Wow, great job on this. This one was really special. I think you're meeting (or exceeding or whatever) expectations. No complaints here. What do you want to work on/develop? How can I support you?\"\nI don't want to continue in a position where I'm going so far above and beyond (above and beyond what the description of the job is, AND so far above and beyond the other individuals in the team) and I keep getting harangued for more, more, more.'",
        "In response to 'about the consequences\nAnd your self respect. Quiet quitting would make me feel really icky. A true professional puts in a respectable shift while finding another job.', a user said: 'This is how I always felt too. I mentioned it in the post. I was always of the opinion that \"bruh, why would you quiet quit? Just find a better job where you feel more fulfilled and leave\".\nThe issue now is that I am sending out so many applications and going through SO much emotional energy investment doing interviews, filling out custom-tailored applications that are of high quality, and so forth - and I feel trapped at this job. I can't just quit without something lined up and I can't line something up that is LESS shitty overall than what I have'",
        "In response to 'Bluntly, you're so burnt out that you're depressed and not thinking clearly. You're doing some catastrophic extrapolation that seems unwarranted.\nGo to your manager and tell them that the current pace is burning you out.  If your manager is halfway decent, they'll see that. If they're fully decent, they'll be appalled that they drove you to this.\nTake some PTO (or even sick leave) and come back with clear boundaries. If they PIP you for that, they have lost their top performer, will have to go through an arduous process for replacing you, will lose months of productivity, and might not even get budget approval for a backfill. If you're truly the highest performer, the cost of replacing you is way higher than the cost of easing up on you. They'll almost certainly be making that calculation.', a user said: 'I have used ALL my PTO on interviews for other institutions as well as getting sick (I get sick very frequently due to an immune system issue). Therefore, I don't even have any PTO left to just take a few days to clear my head.\nFurthermore, my direct manager constantly tells me that I'm such a valuable asset that the institution would do \"ANYTHING\" to retain me, and that I should never worry about being fired. I truly believe him, but his managers (middle management) probably see me as a valuable PEON to exploit and have only dangled career advancement opportunities in front of me, constantly moving goalposts and shifting timelines. This has made me very jaded towards our middle management and in the organization as a whole.\nThe fact that I let myself get things dangled in front of me and not leave the organization for so long feels truly disgusting and now I feel resentful every time I have to show up to work and keep giving these people my labour. In ANY OTHER JOB MARKET, I would have been able to escape by now, but all this bullshit with the sabotage of my country is causing me to be trapped in this ridiculous situation. I hate it'",
        "In response to 'You don’t know how to do things half assed?  Are you for real?', a user said: 'I can never be half-assed towards the clients. I will always serve them to the best of my ability, and do things properly/see them through, because my work ethic and moral compass demand it.\nBut yeah, you're right. I'm just basically acting extra sloppy when it comes to my team and time management and stuff like that. I'm not doing coaching, I'm not doing development, I'm not doing the behaviors they want. I don't have the HIGH MORALE that they want. I'm visibly upset/mopey pretty much all the time, and I've made it no secret that I'm aggressively trying to interview and get an offer I can accept'",
        "In response to 'I tried to quiet quit in a similar situation.\nAfter a single day they rode my ass so hard that I knew it would be impossible.  Unfortunately it's a very different situation when they've come to rely on you as a top performer.  It's a greater loss to them, and they take it very, very personally.\nAdmittedly, I didn't last long after that.  I ended up in a shouting match with my boss, who then demanded that I write my own PIP and present it the next day.  I physically could not degrade myself like that, and so I tendered my two-week notice instead.  It was the last day anyone at the firm spoke to me... so I sat around for two weeks twiddling my thumbs.', a user said: 'Sorry that happened to you breddah. Luckily, my institution is not this toxic, but I definitely would have done the same. At some point I would quit with nothing lined up out of respect for my own dignity. I have a lifestyle where I can live frugally from savings for many, many months if need be. I just don't want to handicap my career in my prime career years'",
        "In response to 'When confronted with your underperformance, I would suggest that you say you are “dealing with some stuff at home” and don’t elaborate.', a user said: 'I have basically said that to my direct manager who is quite understanding. He definitely understands. It's just that eventually, he says that I have to \"pick up the pace\" again and that \"this is not a charity\" and that \"we don't just pay you to get through the day\".\nThey really just want to continue getting back to the point where they can most efficiently wring me for every droplet of effort every month, and NOTHING will ever be enough to where they will say \"awesome, just keep doing this\"'",
        "In response to 'Just give them a reason so they can justify it in their mind.  “I’m sorry- I know I’m not operating at 100% right now.  I’m going through a lot personally.  I’ll get back up to speed soon.”\nAnd then just don’t.', a user said: 'This is probably the best advice for my situation and probably what I will end up doing, and have already been doing to a certain extent. It will work for the medium term, and I'd like to say that I HOPE that I will be out of here by then... but I've been saying that since AUGUST 2024 and have just been presented with constant defeat after defeat after defeat since then'",
        "In response to 'I was a high performer in my previous job.  I always continued working hard and making an effort to produce quality work.   However, when I decided that it was my time to leave, my quiet quitting as a high performer included not volunteering to help on projects I was not assigned to, leaving work at a decent hour, etc.  My impetus for leaving my old job was poor work-life balance which was also damaging my health.\nWith your bosses having told you that overperformance is the new baseline for meeting expectations,  it is almost like a target has been placed on you.   Being at the point of disillusionment is not an ideal work setting, so you should put more energy towards leaving. When I decided to leave, my second job became looking for a new job.   Every day after work, I came home and did at least 1-2 hours of new job search-related activities and then on the weekend, I would put in at least 2-3 hours each day going through job listings and preparing resumes, cover letters, and applications.  I would strongly recommend focusing on getting out of there into a better situation.   The job market isn't the greatest, but there are still opportunities out there for people with experience, education, and training.', a user said: 'I get off work at 6:30 PM, by the time I get home and change it's 7:00 PM. I have to immediately cook (done by 7:30 PM), then eat (done by 8:00 PM) then clean up and get ready for bed so that I can be asleep by 9:30/10:00 PM because I need to wake up early to exercise (30 minutes daily) and fully evacuate my bowels (takes 1 hour per day due to IBS).\nThe reason I'm explaining all this is because during the weekday, I often get like 2 hours of free time total. One hour of that is during my lunch break, where I'm so fried and frazzled from work that I go into the break room and work on a personal project on my computer. When I have the 1 hour after work, I'm so tired and it's so late that I just want to watch videos for 1 hour before I go to sleep.\nI have tried applying for jobs during either one of these times but it's like scaling the cliffs of Mt. Everest. The only thing I have to look forward to is my 1-2 hours of \"play time\" per day, ripping it away by applying to a job (which feels like buying a lotto ticket and throwing it into the river) is sometimes too painful to do, and I lack all motivation to do it'",
        "In response to 'They’ll be mad at you for not over performing in a dead end role. You’ll need to look into any objective measurements for your output and your peers and use these the defend doing the same amount of work. Don’t accuse your peers of poor performance, just insist on how your output mirrors theirs.\nForce conversations to email. Recap verbal conversations in email. Print these as you go because one day very soon you’ll be locked out. Your goal is to evidence discriminatory treatment and termination to file for unemployment (assuming you’re US). They’ll probably get irrationally angry and term you but this is exactly what you want. Ideally, you’ll be able to draw unemployment for some time while you take a breath and line up something else.\nGood luck!', a user said: 'I don't mean to discount your very good and solid CYA advice, I just don't think my position is this bad. I think my managers want to retain me for as long as possible, and they're somewhat incredulous and happy that I haven't already just moved on. They're thinking now that I have some serious self-confidence issues or something similar, and they're slowly realizing that I am not a very high flight risk. Then they get comfortable wringing me for effort and throwing me to the side like a used towel. They are no longer offering any sort of internal development opportunities or any opportunities to grow my knowledge in the industry - in fact, it's the opposite. I was recently exposed to how a different, rival institution operates (due to a merger) and I realized that there are a LOT of opportunities to amass and accrue knowledge there. With our institution, it's the opposite - they WANT to keep us dumbed-down and low-level so we can remain complacent product-pushers. Disgusting'",
        "In response to 'I wouldn’t quite quit if your finding it difficult to find another job…', a user said: 'Fuck it, maybe I just quit without something lined up. I have a lot of savings and live frugally. I wouldn't even start to touch my investment accounts for at least a couple of months.\nI do have this proof-of-concept for a piece of software I developed that acts as an ERP for small businesses with a module-based DLC-esque system. Maybe I should just build an actual working prototype and somehow commercialize it. I estimate it would take me 2-3 full weeks of work to do that. Every day that I get more rejections in the job market I just want to do that. The risk is that it goes nowhere and then I find myself unable to land a decent job but now I'm unemployed so there's added stress'",
        "In response to 'Make job searching your new side hustle.\nWhat’s in writing (metrics)? Meet those expectations.\nRegardless of what leadership says about not meeting your prior levels, keep doing it and say you’re doing the best you can and thankfully still hitting your targets.\nIn the meanwhile, start securing previous annual reviews, letters/emails of accolades, potential references and networks contact info, and a Plan B (in case they let you go although this would make no sense considering your high performance, but stranger things have happened). Use your vacation and PTO. If you’re in the health insurance plan, make any appointments needed.', a user said: 'I am trying to make job searching a side hustle. It's just very demoralizing, because I get out of work at 6:30 PM on the weekdays so between exercising, cooking, eating, cleaning and sleeping, I have NO time to apply during the week. On the weekend, I can spend an entire day \"working\" by applying to 20 jobs or so, but then I'm so stressed out and upset that I try and try and scavenge whatever little time I have via revenge nighttime procrastination. It adds to my depression during the week. On the weekend I just want to work on my own personal projects (coding, music, etc) and when I can't do that for whatever reason I get very upset and end up having a worse week for it'",
        "In response to 'Totally get it. Are you able to alter your schedule, temporarily, until you secure a new job? For example, work and all the weekday things after work. Job search on Saturdays til 5 then recreation/family/friends/events? Sundays- rest and music? However you can make it most feasible for your life during this time.', a user said: 'Yes, this is the current schedule I'm following. It does work decently. I spend saturday job-searching. My girlfriend also demands attention and time spent together too which is fair, because I usually can't give her more than 15 minutes per day during the week (we live together). In moment of depression I just want to dive in harder to my personal projects, my coding and my music creation even more. This often creates arguments between us. I am an only child and am used to just being alone all the time, whereas she is constantly trying to spend ALL her time with me, which I totally get.'",
        "In response to 'I’d go nuts. 😣 Not an only child but vigilant about my alone time.\nWishing you all the best throughout this time.', a user said: 'Thanks, breddah. This is nice of you to say. I hope you know I really appreciate it'",
        "In response to 'You need to get a new job and just do your job. I did this a few years ago and my life is so much better. Set those boundaries day 1 and stick to your guns.', a user said: 'I'm trying really hard to get into a new job that's not going to put me in a shittier position than the one I am in already. For example, I've gotten offers for things such as a debt collector position or a customer service agent at the airport for $19/hr in a HCOL area. I can't justify going backwards on my already very meagre hourly pay, and bludgeoning my career like that by starting all over again.\nAll I can do is keep trying, but every bit of energy I expend on interviews and hope and excitedness after I have a really good interview or whatever, is almost depleted. I just feel so upset and dejected inside at making it to final round so many times and being edged out by a \"unicorn\" candidate that has just a *little* bit more experience in the very niche, hyper-specific thing that the job is about, and that is viewed as a \"safer\" bet due to their age and experience whereas 27-year-old-me is viewed as \"still a kid\"'",
        "In response to 'If they hold you accountable but not this other person, and you both have the same job duties and responsibilities, I would go to HR and argue for favoritism. I would make sure you do your duties as described and nothing more, if they want more they need to redo the job desc and pay more with it.\nUp to you how much you want to rock the basket etc since the market is poop.', a user said: 'Yes, this is a scorched-earth tactic. This will burn a lot of bridges. Not worth it imho.\nThe other IC is a genuine guy and he wouldn't hesitate to help me in my career at the drop of a hat. The only valuable thing that has come from this job apart from the experience is the contacts I've made, so it would be foolish to just burn them over some throwaway job'",
        "In response to 'I would hate for you to have a “stain” on your resume as to how you ended this role with this organisation. Just be mindful of this that it doesn’t come back to bite you later down the track', a user said: 'Even if they fired me on monday morning, that stain isn't making it to my resume, lol. Maybe you're referring to TheWorkNumber (aka, they reporting to future employers that I'm not eligible for rehire) but my company does not report to TheWorkNumber so that point is moot. I think I successfully milked all the resume-boosting aspects I could from this job'",
        "In response to 'I didn’t mean anything bad, but I just meant to say that don’t let all of your hard work over these years be judged in the future. I’ve been in a similar position sort of. I guess I understand your frustration is all I’m trying to say.', a user said: 'Ah yeah I getchu <3 appreciate the kind words. Yeah I hope I will remember my stint here as one where I managed to get a lot of good experience, helped out my community and also learned how to navigate poor management'",
        "In response to 'I’m sorry too much whining. You took the job willingly to get experience, which you got, now you’re whining because you can’t quit and move on as easily as you would like. You put yourself in this situation to get taken advantage of. If you want to work less, do it. If you want to make demands of the bosses do it.  If you want to quit, quit. No one forced you to work 3x as hard as the other guy for the same salary/position.', a user said: 'I'm whining because of TIMING and the fact that this ordinarily would have been a good career move for me. Of course I have to happen to do it and be in this position during an extraordinary time where shitter-in-chief is actively destroying the economy and flooding the job market to further his agenda. I just got declined from an amazing back-office position the recruiter told me I would have been a shoe-in for if it wasn't for huge amounts of additional candidates and out of those hundreds of course there was 1 that had just slightly more experience in the specific niche thing that job was about'",
        "In response to 'Bro stop it. Spend more time on job search and less time feeling sorry for yourself. I’m going to take a guess here that you are working 40 hours a week. Quiet quitting is for losers. Just because your peer is a completely dead weight doesn’t make you such a superstar. If you are as good as you think, keep on doing what you’re doing and keep on looking and you’ll find it soon. It absolutely does not benefit you in any way to go out with a whimper and ruin your reputation with everyone you’ve worked with over there. You never know when someone might have an opportunity or if you’d even like to come back, go out on a high.  So you lost out on ONE job to a better candidate boo hoo. I’m no fan of the current administration but like i said cream rises to the top. Sincerely - good luck.', a user said: 'It's not even one job, it was time and time again. It just KEEPS happening and I'm not used to that after having job searched in 2015, 2019 and 2023 when times were really easy for applicants. And when I was busting ass in my current role and making a huge positive reputation for myself, it was all for naught - my local upper management just wants to dangle fake stuff in front of me and use me for my effort (they don't care about me) and all the other managers in other departments can't give me jobs because of the region-lock. Otherwise I would already have transferred out into a more long-term and fulfilling role. I feel totally stuck and it feels worthless to even keep trying. Even if some people notice it makes no difference anyhow and I already have the positive referrals from ex-managers who left the company. Just hurst'",
        "In response to 'How much is the pay?', a user said: 'I live in a very HCOL area and my pay is like mid-twenties, very low'",
        "In response to 'You come across as having a big lack of accountability honestly. I think you’re too bitter to have much of a future at your current company. You can take your performance down, sure. But I think a good parallel path would be to dig into why your attempts to find a different job have failed. If you’re as good as you say you are, you would do well to find a position commensurate with what you perceive are your skills and contributions.\nIt reads like you’re blaming everything external to you to the reason why you’re unhappy.', a user said: 'I have done a lot of soul-searching, and I have indeed come to the conclusion that the source of my unhappiness lies with external factors. I feel comfortable saying that because of the circumstances surrounding my anger and frustration.\nI know I'm damned good, and I know I'm a proverbial needle in a haystack. I receive validation from so many different stakeholders in my life. My girlfriend always calls it \"my curse\" that I seem to gravitate towards these situations. People around me who have jobs grossing 140k+/yr constantly say that \"I would be perfect in XYZ role\" or \"I would succeed so well in their institution\" or that I'm \"wasting my time\" in my current role. I am desperately trying to get there, to leverage my skills and experience into a position where I can use my work ethic and attitude to launch myself into a comfortable position in my career. I just keep getting faced with rejection after rejection in situations that everyone around me agrees are \"very strange\" and/or \"bullshit\". I know that doesn't really mean much, but I'm not getting any feedback from any of the varied stakeholders in my life that suggests that anything about this situation is the result of something else than really terrible luck.\nAs for a future within my current organization, I would love to stay in my org and move to the back office. It's just not possible due to region-locking. Copying from another comment above:\n\"For people in my position, the obvious and usual choice (a very common trope in my industry) is to move into a \"back-office\" operational support department by leveraging my front-line industry knowledge and high-stress experience. That would be a SHOE-in for me, because I have a very good reputation with back-office departmental managers as \"that one front-office rockstar who is always on top of everything and would be a great addition to our team\".\nHowever, our organization REGION-LOCKS those opportunities to employees only in TWO STATES. And I am obviously not going to move from my state because of personal ties and a significant other. I live in a HCOL state and there are not many back-office roles in this area unless the organization itself is small and based out of my state.\nThat's why I say that there is no \"internal movement\" at my job. I don't want to pigeon-hole myself into some overworked, underpaid management position where the shit never stops flowing, I want to get into an operational support department like BSA/AML, fraud, collections, whatever. But of course, this obvious path is locked to me due to where I live\"'",
        "In response to 'The job market is still great very high performers. Always is.', a user said: 'As a very high performer and a great interviewer, I am able to make it far in the process. Hiring managers and recruiters quite like me. But I am 27 years old. I am viewed as a more \"risky\" pick that the hiring managers don't HAVE to take because there is always a more experienced, slightly older candidate that has just a little bit more experience with whatever industry I'm applying for. They appear a little bit calmer and more mature, whereas I come across as very confident and charismatic but with a lot to prove.\nIf the job market wasn't the way it is, on average I wouldn't be in the same final rounds with those sorts of \"star\" candidates. Then, my high-performance status would be enough for me to land offers left and right. I wouldn't be getting edged out like this'",
        "In response to 'Have some pride in your craft and refuse to lower your own standards. Don’t quiet quit. Demand a raise. Demand a promotion . Quit outright like the damn champ you are if they won’t. If you quit and they want to hire you back, ask for twice as much more than you requested befor quitting. Ask for your superiors position. Email your CEO. In fact, walk into his office.', a user said: 'Walk into his office, jump on his table and aggressively shake his hand while making eye contact. Give him a\nBusiness Hug\nand nod knowingly before loudly bellowing your LinkedIn bio while maintaining the handshake. Assert dominance in a friendly way by joining a WebEx meeting with your Bluetooth® ear piece. Make sure to urinate in the leftmost urinal and keep participating in the WebEx meeting while you do so. This must be done while the CEO is seated in the stall next to the urinal.'",
        "In response to 'Start building an ai tool to do your tasks for you', a user said: 'I actually am really good at coding and building performance improvement tools to automate processes. I have done that a lot in my current role. However, an AI agent cannot do my job. I cannot even do my job from home. It has to be done in the office and it is client-facing. I actually do have an idea to develop an ERP for small businesses, though, because I am exposed to a lot of small businesses at my job. Maybe I should just quit with nothing else lined up and just do that and see if I can develop something that will benefit small business owners'",
        "In response to 'I’d suggest not quitting . I don’t believe in quiet quitting. You quit with valor and take that with you into whatever you do next . Quiet quitting It sets you up to accept failure and mediocrity vs solving the issue. I suggest demanding more. What I did a few times in my young career- I just didn’t go to work one day. Came back next day like nothing happened. Did this 3 times- I got 10-15% raise within a week offered to me each time,', a user said: 'Fundamentally, this job was always going to be a 1-2 year stepping stone position for me where I accepted being underpaid in order to get, in exchange, a large amount of industry experience and flex/demonstrate transferrable skills that I could use throughout the rest of my career. The problem I'm experiencing now is that due to factors outside my control, I cannot escape this job now and I'm extremely bitter at the institution and the management for stringing me along. Even if they offered me a 15% raise tomorrow, I would not suddenly want to stay.\nIf they created a new position for me, which they EASILY could justify (loan specialist) based on my workload, the value I bring to the org, etc, then I would stay and take on that new role. But they won't do it, they don't care about retaining me. They could also offer me an operational support role and give me an exception so I could work fully remotely in my state, but they won't do that either. Fuck em'"
    ]
}