{
    "username": "GuardEcstatic2353",
    "contributions": [
        "In response to 'There are \"black companies\" that keep the tradition alive of working people to the point of suicide.', a user said: 'I think there were a lot of black companies in the 1980s to early 1990s. That was when the Japanese economy was at its peak.\nSimply put, people worked to their limits back then, which boosted GDP and incomes.\nThere were even commercials for energy drinks that encouraged working without sleep.\nNowadays, Japanese people don’t work long hours. The younger generation quits their jobs pretty quickly.'",
        "In response to 'When did you work in Japan?\nIt is pretty rare to have once a week type of regular after work drinking today. There are various surveys, 2%-6% employees have once a week or more after work drinking.\nhttps://money-bu-jpx.com/news/article052903/\nhttps://www.workport.co.jp/applicant_data/detail423.html\nhttps://presswalker.jp/press/41163\nhttps://prtimes.jp/main/html/rd/p/000000052.000069473.html\npre-covid\nhttps://gallery.intage.co.jp/nomikai2017/', a user said: 'Well, there are definitely people who enjoy drinking parties. They like talking to others and often go out with coworkers. People like that generally tend to get promoted. In the end, relationships matter, and those who are more social usually move up the ladder.'",
        "In response to 'Having worked in Japan, I don’t think this takes in consideration of after work drinking sessions, which destroyed me after a week. I know not every company does it but it’s still crazy common', a user said: 'Well, in reality, only promising employees with good relationships in the company get invited out for drinks after work. It's usually the sociable ones who enjoy those kinds of gatherings. Inviting someone who isn't outgoing just isn't fun, and it could even be disrespectful to clients. So, forcing someone to go out drinking isn't something that realistically happens.\nForeigners often say that Japanese salarymen are forced to go out drinking and are exhausted because of it, but that’s rarely the case. It’s usually ambitious people who want to climb the corporate ladder or sociable types who choose to attend those gatherings.\nConversely, people who never attend drinking parties often seem shy, don’t get promoted, and tend to leave the company quickly. That’s the impression I have.'",
        "In response to 'Japanese worker productivity has been low for decades.  It is not a new phenomenon.\nhttps://www.nippon.com/en/japan-data/h02240/', a user said: 'The reason for that is Japan has a lot of self-employed people and many small businesses.\nOver 99% of companies in Japan are small businesses.\nWhen it comes to productivity, large corporations in Japan are actually very efficient.'",
        "In response to 'Original Post: Japan's historic work ethic is declining—45% of workers admit they're quiet quitting [External Link]: https://fortune.com/article/japan-work-ethic-declining-45-percent-of-workers-quiet-quitting/', a user said: 'I think there were a lot of black companies in the 1980s to early 1990s. That was when the Japanese economy was at its peak.\nSimply put, people worked to their limits back then, which boosted GDP and incomes.\nThere were even commercials for energy drinks that encouraged working without sleep.\nNowadays, Japanese people don’t work long hours. The younger generation quits their jobs pretty quickly.'"
    ]
}