{
    "username": "guymoron",
    "contributions": [
        "In response to 'Average working hours\nincluding unpaid OT\nis below global average in Japan(1903) already, lower than the US(1976).\nFancy words like\nworking to death\nor\nblack companies\nexist, but what is considered illegal working hours and making news for violating labor law in Japan is just average working condition in nearly 30% of countries in the world.\nThe average yearly working hours in Singapore(2,215h) or Vietnam(2,163h) are considered illegal 'black company' level by Japanese standards, while India(2,428h) and China(2397h) are considered working to death in Japan.\nAverage regular time is 1800-1850 hours in Japan and legal OT cap is 360 hours a year.\nWorking OT of 100 hours a month or 80 hours of 2 consecutive month are defined as working to death in Japan, average certified working to death cases involving 2300-2500 hours of yearly working hours(including unpaid OT)\nOf 169 countries and regions in the list of average working hours by OECD, 53 of them have over 2200 hours of average yearly working hours that would be considered illegal/black companies in Japan.\n11 coutnries have average working hours of 2400 hours or more that would be not just violating OT cap but also considred working to death if they apply Japanese labor law.\nhttps://clockify.me/working-hours', a user said: 'Having worked in Japan, I don’t think this takes in consideration of after work drinking sessions, which destroyed me after a week. I know not every company does it but it’s still crazy common'",
        "In response to 'When did you work in Japan?\nIt is pretty rare to have once a week type of regular after work drinking today. There are various surveys, 2%-6% employees have once a week or more after work drinking.\nhttps://money-bu-jpx.com/news/article052903/\nhttps://www.workport.co.jp/applicant_data/detail423.html\nhttps://presswalker.jp/press/41163\nhttps://prtimes.jp/main/html/rd/p/000000052.000069473.html\npre-covid\nhttps://gallery.intage.co.jp/nomikai2017/', a user said: 'Interior design. I’m not Japanese btw, I worked there for a month for my firm on a project, and the people who linked up with me works in the hotel and hospitality industry. Maybe that’s what they do to accommodate visitors, they do this in China too'"
    ]
}