{
    "username": "Gyzonx",
    "contributions": [
        "In response to '[Deleted or Empty Comment]', a user said: 'I always strongly suggest for people to leave. Find a job somewhere else. I know all retail stores are similar with crappy management but I’ve never seen worse than Walmart. I know so many people that went to Target, Hannafords, Andy’s, and so many more places. All of them have said that it’s astronomically better than Walmart. If you can, make the leap to somewhere else. That place is t worth it.'",
        "In response to '\"Never seen worse than Walmart\" pfft. Go work Dollar General', a user said: 'I mean, every store is different. Some are going to be worse. But overall, from what I’ve seen, Walmart is usually worse.'",
        "In response to 'Original Post: \"quiet quitting\" is apparently a trend now Basically means you do what you were hired to do and nothing more. The \"bare minimum\" as it were. Gen Z adopted the term and its a tik tok thing now.\nI always thought it was called \"not being taken advantage of\"', a user said: 'Really, don’t go above and beyond. I learned that the hard way, for sure.\nThe store I worked at definitely drove me out. They overwhelmed me so much to the point where I just couldn’t handle it anymore. They had me cover electronics / S2S (my department), fabrics, sporting good, hardware, and jewelry/appeal on my own several times. Front end would still try to take me for service desk. Then they would get bitchy with me because I never participated in the required hour long zone at the beginning of my shift, and the end. I was too damn busy with costumers. I make the mistake of learning just about everything. The team leads had me doing things that was supposed to be their job. (like finalizing trucks and high end) I learned how to fix the coin recycler. I tried to team lead 3 times for a a few different areas and every time it went to someone who was extremely under qualified. My favorite being the 20 year old who was in the military for 3 months, hurt his knee, and quit. Never worked retail before and was handed seasonal TL on a silver platter. Dude was applying for maintenance but the coach just heard, “military” and offered TL. Kid did nothing but flirt with the girls and sneak in the break room every couple hours to snack because he was stoned out of his mind most of the time.\nWas so stratifying to watch them beg me to stay. And yes, before I left I did talk about it to the managers. But they kept pushing me.\nYes, I’m still bitter about it all. But really, leaving was the best thing I could do for myself and for my family. I’ve never even happier than I am right now.'"
    ]
}