{
    "username": "Haan_Solo",
    "contributions": [
        "In response to 'Ah yes. I always remember my boss at one place, who was a cool guy, said out loud to the team with a smile on his face when someone had informed him they had completed all their tasks, \"your reward for completing all your tasks is....more tasks!\".', a user said: 'A few months ago there was a lady in a company all-hands meeting (400-odd people in the teams call) ask why we work based on hours and not the output of our work/tasks i.e. if we are given a task for a week and we work hard to complete it in 3 days, why can't we take the other 2days off? HR didn't really have a response to the question and it was almost like the couldn't compute why someone would ask that.\nI promptly replied in the chat (I know, stupid of me) that we live in a capitalist society where hard work is rewarded by more work and that's why there is no incentive to work hard or beyond what is expected.\nAt the end of the meeting the head of HR sent a message, publicly so everyone could see, along the lines of \"@Haan_Solo, I will put something in the diary to discuss your comment.\"\nShe really didn't like me saying that. I did become somewhat infamous in the office after that though haha'",
        "In response to 'How did that meeting go?', a user said: 'It was pretty funny,\nFirst she tried to tell me that I didn't understand the lady's question and that I didn't know her or her job role, but I had a chat with the person after the meeting and we agreed with one another. I told the HR lady as much so she just said 'ok' and moved on.\nThen she said that my words\nmay\nhave upset or made employees feel uncomfortable (they didn't like that I used the word 'Capitalism'), so I asked her if I made anyone feel uncomfortable and she didn't answer.\nShe pretty much ran out of steam at that point and we finished the call 🤣'",
        "In response to 'I hope you said in that meeting “where was the lie?”', a user said: 'Yeah I basically did haha, I explained the call in another reply :)'"
    ]
}