{
    "username": "HailToVictors21",
    "contributions": [
        "I have Stage 4 Cancer and my wife quietly quit our marriage. AMA What the title says and add in the current climate in the US, so to move out and get a divorce would leave us both fucked.\nEdit: Wanted to tell everyone thank you for your kindness",
        "In response to 'Do you have a good support system outside of your marriage? I hope you have someone you can talk to about all your stress. 🙁', a user said: 'Family is supportive and I have some cancer support groups. Wife will chip in if I ask, but doing so makes me feel like a burden and sets my anxiety off more than it already is.'",
        "In response to 'I'm the caregiver for my wife, both bipolar and cancer.\nIf your wife is not doing the minimum then she's not being mindful to your needs.\nI assume she's suffering through caregiver burnout, nothing to mock or make fun of because it can look exactly like this.\nShe will need her own breaks but she will need to care for you, but it's her choice\nI'm sorry you're dealing with this', a user said: 'Not sure what she is dealing with as she refuses to talk. She never really has been a caregiver. I don’t own things and manage my own care. Wish I could understand where her head is, but she won’t have communication.'",
        "In response to 'My father in law has stage 3C lung cancer. It’s been tough but he finally finished chemo and now on immunotherapy! His tumor shrunk and he seems to be doing good. He was about 120lbs when he was 200lbs but is up to 140lbs now! Are u getting cancer treatments?', a user said: 'I had to stop chemo as my blood tests kept coming back too low. I will be doing surgery soon to remove some tumors on my liver.'",
        "In response to 'I am so sorry for you.. no words can help but wishing you all the best! What do you want still make happen in your life? Do you have a specific wish?', a user said: 'Yea to beat cancer. Pretty much my only focus while knowing it will probably kill me in the next few years.'",
        "In response to 'What symptoms did you get and how bad were they before you went to the doctor ?', a user said: 'Started with loose stool and then not going at all. Doctor was going to have me just take stool loosener, but I felt something more was going on and demanded a colonoscopy and was having surgery within days.'",
        "In response to 'Ah man, I've been feeling nauseous, my appetite decreasing lately, tired and agitated...like 95% of my stools are loose and have been since November, so I've been thinking about getting a doctor appt. As now I'm starting to have a little pain in the Anus...too', a user said: 'Please get a colonoscopy to rule anything out.'",
        "In response to 'We're you otherwise healthy, or felt fine ?', a user said: 'Yea. Still feel pretty healthy even when going through chemo. Been weird.'",
        "In response to 'Damn. I'm sorry, and it's not right she did that. Has she left the house? Is she with someone else? Did she bother to explain herself, or did she just ghost you?', a user said: 'We still live in same house. She refuses to leave even for a bit as we are close to her family. I would have to quit my job and move if I had to live for sometime with a relative. Obviously with cancer I can’t quit as I need the insurance, so I am trapped or fucked so no real winning situation.'",
        "In response to 'Again, I'm so sorry this is happening to you. Keep taking care of yourself and your kids. Whatever you do, don't leave the house. I agree with others saying to take measures to legally protect yourself and your assets for your kids.\nAs much as you may want to believe your wife will act in the best interest of the kids, she is acting out of fear in ways that insulate herself from you, so she is already putting her own avoidance of being present amid your suffering ahead of everyone else. In the fear response of fight, flight, or fawn, she has chosen emotional and physical flight thus far. Don't assume she won't go further if she continues on this trajectory and eventually talks herself into leaving.', a user said: 'Yes, but nothing has stopped her support of her kids and on that we work very well.'",
        "In response to 'What from your point of view is the reason for the marriage ending?', a user said: 'Not really sure. I have tried to get an answer as the down slide began right around my cancer diagnosis. She has since claimed she was over it long before then.\nWe argued more, but I also felt she stopped being half a relationship and decided she wanted what she wanted and was going to do what she wanted.\nMind you I spent much of our marriage adjusting to make her happy. I have virtually no friends because she would always start a fight if I tried to hang out with friends. My only friends where her friends significant others.'",
        "In response to 'That's emotional abuse. I'm sorry man. Do you want resources on getting out?', a user said: 'Maybe something I need soon. Trying to do this as civil as possible as we have kids and I don’t want things to be nasty for them.'",
        "In response to 'You have to protect yourself too, and this won't be fun but I hope you can keep fighting for custody of them. I have some resources for you to use.\nhttps://www.thehotline.org/\nhttps://www.crisistextline.org/topics/emotional-abuse/\nhttps://www.joinonelove.org/get-help/\nI am not an expert. But I do want to help in the way I know I am able. I hope that these can get you some help.', a user said: 'Appreciate this'",
        "In response to 'Sorry, not buying it.  No one doesn't know why their marriage failed.', a user said: 'Well that’s like your opinion man.'",
        "In response to 'How did you get cancer?', a user said: 'I have a genetic mutation that causes my body to create many polyps and if unchecked they turn into cancer. Thought I was having issues because of diet and after forcing my doctor to schedule me a colonoscopy I found I was stage 4 cancer patient and in 24 hours my life got turned upside down.'",
        "In response to 'So did you have tumors in other areas of your body or was the diagnosis purely based on colon polyps?', a user said: 'Digestive system'",
        "In response to 'Oh you poor thing you have FAP? I just got checked for it because of some really bad digestive issues. It’s 5am rn and I was just awoken out of a sound sleep to go barf. Life is so exciting. Wish I could hug you random stranger', a user said: 'Yeppers. Hoping for the best for you.'",
        "In response to 'Did you know about this mutation before your diagnosis? The best preventative for FAP is having your colon removed. Is this something you've talked to your kids about yet? Since there's a 50% chance you passed this on to them.', a user said: 'I did not know about it before. We are doing things with my kids to be more infront of things.'",
        "In response to 'As stage 4, what’s stopping you to say fuck it to all and live with giving in to every intrusive thought?', a user said: 'I have kids'",
        "In response to 'Yea that’s understandable. My mom had a rare cancer and I wish she spent her time doing what she wanted instead of what the drs. Wanted.', a user said: 'I do more with my kids as far as events and things where I hope it creates memories for them.'",
        "In response to 'I’m not sure what type of cancer you have, you mention digestive system and liver, but for what it’s worth, my dad have colorectal cancer stage 4. The tumor had grown so large the had to close him up when they went to take it out. It had grown on his liver and kidneys. His treatment was successful. He’s here with me 20 years later at the age of 84. They gave him chemo to reduce the mass, operated on him, removed part of his liver and most of his colon and then more radiotherapy I think? But he’s fine. It was successful.', a user said: 'Thank you for sharing this. These stories help give me hope in the darkness.'",
        "In response to 'Make sure your will is appropriately written.', a user said: 'Not too worried about all that as I know she would make sure it goes to taking care of my kids.'",
        "In response to 'Kids?  How many, how old?', a user said: 'Rather not get too detailed.'",
        "In response to 'I'm sorry man. Truly', a user said: 'Thanks'",
        "In response to 'Reading comments it's sounds like your wife was verbally abusive\nI know you said she would chip jn, I wouldn't trust her', a user said: 'Not verbally abusive she just got annoyed and played the not talk game of if I didn’t just do what she wanted done and when she wanted it done.'",
        "In response to 'Has your cancer spread? What locations? So sorry to hear about this.', a user said: 'I have it in colon, liver and lungs(very small amounts)'",
        "In response to 'Do you have a bucket list of things you want to do?', a user said: 'No because that would mean I am not fighting this cancer 100%. I know it will probably end me in a few years, but I have to put all my energy in fighting and staying positive'",
        "In response to 'You willing to do anything and everything to fight it; or just the standard routine?', a user said: 'Anything. Which is why I am having over half my liver cut out.'",
        "In response to 'Can you please add some context to how your wife “quietly quit” the marriage?', a user said: 'Stopped communicating. Silently growing apart from me without even telling me. I feel she saw how her friend treats her husband and thought it was pretty sweet deal. She would be happy if i just did whatever she asks. She wants everyone to think like her and be like her(which is how her friend always was)'",
        "In response to 'My mom currently is receiving chemo for stage 3c colon cancer. You said your blood counts are too low to continue chemo, my mom had the same thing and they gave her a shot to increase her WBC. Has your oncologist tried that?', a user said: 'They gave me iron infusions. My platelets weren’t recovering super well.'",
        "In response to 'How do you come to terms that you could potentially die soon? How do you make the time left count?', a user said: 'I am a realist. As far as making the time count I try to do what I can with my kids and otherwise just try to manage the crippling anxiety and mild depression'",
        "In response to 'do u feel betrayed, or was something expected?', a user said: 'I was blindsided.'",
        "In response to 'Wow that's shit mate...are you looking at deaths door.', a user said: 'Hard to say. Doctors haven’t mentioned much as far as timeline other than sharing with me 5 year live expectancy data. I am at this time palliative care, so I guess it could turn worse at any point as I am off any treatment waiting on surgery'",
        "In response to 'How are you doing mate', a user said: 'Holding up. Few weeks out from Liver surgery'",
        "In response to 'When did you find out about the cancer?', a user said: 'Almost 2 years now'",
        "In response to 'Two years strong then! How are you feeling these days?', a user said: 'Most days I physically feel fine. Mentally I am a rollercoaster of anxiety, depression and then days that are good or just normal. Things can trigger my anxiety and lately I feel isolated and alone.'",
        "In response to 'What kind of cancer? (Oncology nurse here). I’m so sorry for your diagnosis and your wife.', a user said: 'Colorectal'",
        "In response to 'Do you feel neglected?', a user said: 'I just feel isolated and trapped.'",
        "In response to 'What’s stopping you from applying to all these credit cards and just living your best life .', a user said: 'Not my style.'",
        "In response to 'Because you're a lot to deal with - said in the most direct, but not mean spirited, way. She may need some support getting through this, along with you getting some.', a user said: 'I mentioned this and asked if this sudden shock has played a roll and she just seems annoyed. She sees someone, but is more about her dealing with her shit and not working on us. Tried couples counseling and it just became a shitfest and the guy we saw was kind of a dick.'",
        "In response to 'What does the political climate in the US have to do with anything?', a user said: 'Everything is 10x more expensive.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'Yea think it being genetic most treatments haven’t had the same impact as those with cancer not caused by genetics'",
        "In response to 'What are you going to do with your newfound freedom besides focusing on your health?', a user said: 'Freedom is far away.'",
        "In response to 'Do you have life insurance?', a user said: 'Yes as long as I have my job'",
        "In response to 'how old are you and her?', a user said: '40’s'"
    ]
}