{
    "username": "HarpersGhost",
    "contributions": [
        "In response to 'A lot of the TikToks in the video mention how men are usually \"blindsided\" when their partners just up and leave, when the reality is they didn't care to notice the signs since their partner's unhappiness wasn't directly affecting them.\nThere was a good post about how men think there is a tolerable level of permanent unhappiness that women are cool with staying in. They are fine with our suffering because they still get to do the things they want and not do the things women want them to do. When hetero women start to pull away, a lot of men are actually happy because they think they won. No longer are you \"nagging\" or telling them you are unhappy. Then when you dump them, they are shocked because to them, the relationship has never been better!', a user said: 'tolerable level of permanent unhappiness\nHere's the comment where that first appeared.\nhttps://www.reddit.com/r/BestofRedditorUpdates/comments/13nr27x/comment/jl1jvjr/\nIt's a story about a guy being blindsided about being dumped.'",
        "In response to 'TIL that “Quiet Quitting” was “you do the work you were paid to do and nothing more” instead of “no call/no show until you’re fired”', a user said: 'This whole PR campaign is weird because there's already a known \"issue\" called presenteeism, which is when an employee comes in and does far less than they are paid to do.\nThe word is a variation of absenteeism, but instead of the employee staying home and not doing their job, they come into work... and don't do their job. It's especially a problem with sick employees who come in, can't really work anyways, yet the employer still pays the employee a wage.\nIt's also tied up in morale issues, where the employee had mentally checked out but hasn't actually quit. So yeah, known HR issue for years.\nIf anything, THAT should be called quiet quitting, not this \"I'm not doing extra unless you pay me\" which is pissing off employers for not getting extra work for free.'"
    ]
}