{
    "username": "Haunting-Ad-9790",
    "contributions": [
        "In response to 'Original Post: Quiet quitting Update: wow, the support!  Thank you all!\nWill now only refer to this as \"Just doing my job\"\nStarting today, I quit working for free.  I won't manage the school food pantry, sew for students or school programs ( uniform alterations, letter jackets, CTE jackets, prom dresses), work the gate or track meets, cover hall duty for others, support fundraisers, sponsor or coach teams, provide snacks to students, participate in staff potluck meals.\n I will arrive 2 minutes before my designated duty time and leave 2 minutes after hours.\nI will take off every Friday to help my family, and take off every PD because I have yet to attend a worthwhile PD (I have only been teaching since 2001, a valuable PD is unlikely to occur in the next year).\nI have 80+ days of leave accrued, and I will leave as few on the table as possible. \nThere is no union power in my state, so I am on my own.', a user said: 'You're not quiet quitting, you're Working To Rule, which means you are abiding to agreed upon terms. Our employers are trying to extract more out of us than we signed up for and not compensate us. There's nothing wrong with you not letting them exploit you.'",
        "In response to 'The way I see it, the employer is always on work to rule. They have never gone outside the contract for our benefit.', a user said: 'Imagine going to your boss and saying you did your work you're expected to do and telling them to pay extra.'",
        "In response to 'This is the way to fix a broken system.  “Exploit” for fucks sake.  What I wouldn’t give to have a “normal” work schedule.  Except I don’t bitch about it. Instead of complaining about handing out orange wedges at scholastic sporting events chose a different profession. No one forced you to become teachers.  It’s literally one of the only things you can do with a History degree for example. Unless you can get a job as a curator at a museum you’re pretty limited. Those were your choices. Own them or quit loudly! Every teacher I ever had preached not doing the bare minimum.', a user said: 'It's a fucking job.'"
    ]
}