{
    "username": "Healing_touch",
    "contributions": [
        "In response to 'Also the problem is if you do more than your peers they tack on more work for you. Where is the incentives to work hard?\nThere is no more corporate loyalty they will fold up and steal your pension if they could.\nProductivity keeps rising yet they won't monetarily compensate then cry when their workers di bare minimum.', a user said: 'At my last company I was in the top 1 spot nationally for a specific task, to really drive home what I was accomplishing I averaged around 30 open items (keeping it vague here) whereas person number two NATIONALLY had 356 open items and that was the lowest they ever got it. The average number was in the thousands. I had the same work flows, I had the same volume just more efficient with my time and not only accomplished more but I was so efficient I had some down time padded into my weekly schedule so I could jump in on any fires in our district or just help a coworker finish out whatever.\nDuring my review I was chastised for being too efficient and “for the sake of optics, we are going to give you more work because Ellen (not her real name) looks more busy than you” Ellen was 162 in the company. Ellen was given a promotion because “she was the hardest worker!” But the promotion meant she had more tasks but she couldn’t possibly do them all so they tried to foist them on to me, because obviously I had so much extra time ):\nI didn’t take on her tasks (I actually told them if they’re worried about optics I will slow my efficiency to ensure every minute I’m on the clock is dedicated to slowly doing my tasks so I fill my time… but that meant my output would take a massive hit and I wanted it in writing I wasn’t going to be fired or reprimanded for my numbers taking a hit) but it was the moment in my career that I realized it wasnt just bad bosses doing these things, but pretty much everywhere in corporate America were and I would not burn myself out giving too much.\nSo many people are claiming my and the younger generation are entitled and have bad work ethic but… when you’re literally getting punished for it and watch less performing team members either be treated better or equal why would we break our backs?'"
    ]
}