{
    "username": "heapsp",
    "contributions": [
        "Anyone else's departments like completely falling apart due to people quitting / quiet quitting? We are a growing business, as such we went from supporting about 300 people and 100 servers to 1500 people and 200 servers, multiple office locations, and 1000 azure resources.\nOver the last two years, our sysadmin / cloud team went from 3 to 2, to 3, to 4 (for only a few weeks), to 3, to 2, to basically 1.\nThe candidates we are getting want 120k+ fully remote and aren't even that knowledgeable.\nInstead of letting me build a team how i see fit, and giving me a director role, the current VP and director seem to think we can just get through this... They are rolling the dice and think that it will get better by 2023 somehow.\nCompany implosion coming... which will probably result in me losing my job. HA.",
        "In response to 'Companies with these problems have most if not all of these problems;\nExpecting more than 40 hours a week\nLow vacation count\nshitty management\nshitty culture\nlow pay\non site work requirements\nshit benefits\nYour company is to blame, not the employees.', a user said: 'good point. thanks.'",
        "In response to 'First, stop with the \"quiet quitting\" bullshit.\nStrike it from the vocabulary and correct anyone you see using it. Doing your job and going home is the baseline. If your company cannot survive without overworked gunners then it does not deserve to survive.', a user said: 'true, im sorry i used the term (and used it incorrectly).\nI think that's the problem - the business im in has expected the hustle culture from the workers, and now they aren't getting it - so instead of adapting I believe we will all be fired and replaced with a MSP. It will result in DISASTER for the company, I'm sure... but that doesn't really matter for me cause ill be out of work. LOL'",
        "In response to '[Deleted or Empty Comment]', a user said: 'listing skills for a single employee that should be across several employees\nThis is the main one i would think, since we are critically understaffed they have the folks come in and handle a wide range of things including procurement, escalated problems from t1, and other items which are NOT what someone is looking for.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'hhahaha good one! im going to use that.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'When i was in my early 20s I was the best sales person in my district at circuit city. Our store was one of only a few that was shining while the company was crumbling around us. One of the leadership came to our store and wanted to have a quick chat with me - I thought WOW, i must be getting praise, maybe a raise or a bonus or something - at the very least he probably wants to know what I'm doing right. When i walked in to meet with him, he basically told me my numbers in a certain category needed to improve or I'd be out. That was it.\nI was so furious I nearly teared up - and that interaction still haunts me to this day. Circuit city didn't last as a company for 6 more months.\nCouple of important lessons learned that day.\nWhy do people care SO MUCH about earning other people money? If you aren't an equity holder or on a commission or bonus program, do not get emotionally invested in the success of your company. STOP GIVING A SHIT.\nWork is about the knowledge gained, connections formed and the people you meet along the way. This dude got canned just like the rest of us - why would he spend his last 6 months raining down misery on people. No matter what happens in a company, if you are in a management position always show people respect.'"
    ]
}