{
    "username": "heathers1",
    "contributions": [
        "In response to 'Original Post: Quiet quitting Update: wow, the support!  Thank you all!\nWill now only refer to this as \"Just doing my job\"\nStarting today, I quit working for free.  I won't manage the school food pantry, sew for students or school programs ( uniform alterations, letter jackets, CTE jackets, prom dresses), work the gate or track meets, cover hall duty for others, support fundraisers, sponsor or coach teams, provide snacks to students, participate in staff potluck meals.\n I will arrive 2 minutes before my designated duty time and leave 2 minutes after hours.\nI will take off every Friday to help my family, and take off every PD because I have yet to attend a worthwhile PD (I have only been teaching since 2001, a valuable PD is unlikely to occur in the next year).\nI have 80+ days of leave accrued, and I will leave as few on the table as possible. \nThere is no union power in my state, so I am on my own.', a user said: 'I basically did that last year. After months of trying everything to get them to listen for five funking minutes, I put everything on google classroom. Every 10 min or so, I would re-direct and tell them the assignment and urge them to do it. The best part was if parents wanted make-up work…it’s on there. No copying to be done and my butt was totally covered grade-wise. So few did any work, that my grades were current by the end of class on the day things were due. Didn’t even take my laptop home! It was awesome!'",
        "In response to 'Did that a number of years ago before I retired. Loved it when parents asked my to gather missing assignments. I just told them they could look it up online and have their kids do it. Seldom happened.', a user said: 'Exactly!'",
        "In response to 'Original Post: It's NOT \"quiet quitting!!!\" \"Working your contract,\" \"working to rule\" and \"acting your wage\" are all MUCH better terms. Why would you use the word \"quit\" to describe you adhering to your contract and doing your job? It has nothing but negative connotations AND denotation.\nI highly encourage everyone here to lose that term. We're working our contracts. We're not quitting anything. Some may STOP giving away their physical and/or emotional labor, but that's not the same as quitting!\nEdit: For those of you saying \"It's called 'doing our job'\" The implications of teachers \"just doing our job\" are:  volunteering for events, grading/planning at home, taking over other  peoples' responsibilities, adding more to your plate every year, etc...  Admin considers this \"just doing your job.\"', a user said: 'QQ implies there are things you should, by rights, be doing, but are not. I like working to contract.'"
    ]
}