{
    "username": "heavy-metal-goth-gal",
    "contributions": [
        "In response to 'I agree!! One of the best nurses on our floor kept getting passed over for internal management positions. Eventually, she quit to take a management job at another hospital. In her departure interview, she asked HR why she kept getting passed up and HR told her it was because our floor manager wasn’t willing to let her go because she was such an asset to our floor, so basically her being such a fantastic nurse prevented her from moving up in the company.', a user said: 'This happened to me many times. If you do too good of a job, no one will promote you, because they know they can't fill the position with someone who will work as hard.'",
        "In response to 'I don’t think quiet quitting is a thing. I think I’m fed up with being under-appreciated and underpaid and I’m no longer giving my employer extra time and effort that only benefits my employer would be a better choice of words\nAlso, yes I have been doing this for about a year now. I spent probably 9 years working my butt off. I worked unpaid overtime and illegally shifted work time around to make it work for my employer, I’ve worked shifts where I’ve repeatedly asked for help and received none, I was constantly coming in on days I had taken off and received very very little in return. So, I’ve started saying no and only putting in what is required of me.', a user said: 'Yes it's called acting our wage and we all need to stand in solidarity and quit giving quarter work for nickels and pennies.'",
        "In response to 'Im gonna start using “acting our wage” whenever someone says people are quiet quitting', a user said: 'Yes very good thank you!'",
        "In response to 'Original Post: What are your thoughts on “quiet quitting”? Is it something you’ve been doing for a while or something you’ve recently started implementing? For those who don’t know, quiet quitting refers to not over extending yourself and going above and beyond at work such as taking on more responsibilities or staying late. You do what’s asked of you then go home on time.', a user said: 'I think it's a bullshit term that corporate bootlickers use to guilt the working poor into killing themselves for sub par wages so that they can get richer.\nWe should all act our wage. If I'm doing boss work, I deserve boss pay.'"
    ]
}