{
    "username": "Helpful-Passenger-12",
    "contributions": [
        "In response to 'Do you think a lot of people will \"tone it down\" to punish their companies for RTO?', a user said: 'Quiet quitting isn't punishment.\nGoogle it. It's about doing the role to the best of your ability and not working for free. So I am not working extra hours for decades for free. I am not heartless.  If it life or death, I will work extra but that is a rare occasion...'",
        "In response to 'Short answer is yes. I'd argue different reasons all around - some may think of it as \"getting back at,\" some will see it as a fair trade, others will just be burnt out from returning to 5x commute per week during likely worse hours (I could leave early and finish days from home, missing the worst of the traffic since I come in early). Plenty of other reasons people will have - but we can all have our own reasons. =)', a user said: 'I work hybrid now and it's not bad. But I will never do 5 days in an office. That is living in a jail. I would definitely change jobs if I ever had to do 5 days in my role again'",
        "In response to 'My friend was very vocal about what he would no longer do. Someone quit about a year ago, and he took on that person’s work. It was the same as what he does, but meant significantly more work. Since they had to return to the office, he cancelled all meetings related to the additional work. He told his boss he couldn’t do it if he had to commute five days a week.\nIt’s been about six months now.  They haven’t fired him yet.', a user said: 'Yikes. Glad he woke up. Working free doesn't help anyone'",
        "In response to 'It’s just a term people are using to try and feel empowered. It’ll ultimately lead to termination if the lack of work is substantial enough. And the cycle continues.', a user said: 'It's not about lack of work. I was hired to do 40 hours. On the rare occasion, I work extra (life or death situations) but this is not long-term.\nI am a  professional. I don't work for free for decades. People who work 50-80 hours for years are just getting exploited because they are doing the labor of 2-4 people.\nI do exceptional work but I  am not doing the work of several people without a raise/promotion, etc.\nPeople need to stop being exploited.'",
        "In response to 'Not all jobs are 40 hour a week jobs, though fortunately some get compensated a lot more for it\nIn the end, it’s up to the individual to decide if the job’s demands are something they’re willing to do for the pay they get or if they should get a new job', a user said: 'This isn't the stone age. No job should be more than 40 hours. And if you are working more than 40, you should be a high earner.\nMaking low wage earners work longer hours is inhumane.\nAnd everyone has other work to do. Managing my house/property/land is a part-time job . I sure as hell won't sacrifice my life force and give it away to a job. They have me for 40 hours and that's it . Sometimes there is a life or death issue and I step up but I am not an indentured servant'",
        "In response to 'I truly don’t understand the concept unless you’re feeling stuck in your life somehow/for some list of reasons…\nWhy would people\nactively\nchoose to do the bare minimum, otherwise?\nWe spend way too much precious time at work…we’re better off being proactive in trying to make our situation better than committing to “malicious compliance” just for the sake of it.', a user said: 'It is not the bare minimum.  It is about doing your job well but not working for free for decades like older workers did.\nTime is precious and I am giving my literal life to work. I give them 40 hours and the rest of the time I have is for managing my house & being with my family.\nI have seen too many comments workers literally die due to being overworked. It's not worth your life...'",
        "In response to 'That sounds more like you defining your ideal work/life balance, or setting your boundaries/limits, etc.\nHow I interpret “quiet quitting” is essentially malicious compliance…an act of protest that’s misguided and mutually harmful.\nIt’s often seems like a mental weighing of pros/cons, and choosing the low road in life (given its\nimpact\n- whether or not we “like” our jobs or not).', a user said: 'I don't believe that most workers have gotten to the breaking point of protest...but keep pushing them and they might.\nRight now it's mainly a new generation not allowing the ocerlords to exploit them'"
    ]
}