{
    "username": "Heterophylla",
    "contributions": [
        "In response to 'The Richest Man in Babylon\nA core part of Arkad's advice is around \"paying yourself first\", \"living within your means\", \"investing in what you know\", the importance of \"long-term saving\", and \"home ownership\".\nIn the 1920s, US banks and insurance companies essentially did this. They distributed pamphlets with financial advice disguised as parables to increase financial literacy. It looked like a kid's picture book and I remember reading it as a child.', a user said: 'And now they do the opposite.'",
        "In response to 'It really opened my eyes how a workplace actually works and how the teachers got it so wrong. That attitude of “always be loyal and work hard for your company” or “you should be grateful that you got this job”, if you’re job is terrible there’s plenty of other jobs out there and you don’t have to be stuck in the same hateful place, that’s what I learned years ago\nA lot of people grew up poor or had poor family back in the day (think Boomers generation). So getting a job so you don't have to labour in the field or go hungry was a blessing. It meant a huge step up in terms of the quality of life you could lead.\nTheir kids (Gen X) were at the tail end of this fortune and parroted what they were told because dad and grandpa could afford a home, a car, 4 kids and a vacation on one salary. Things were changing even before the millennials came along but the philosophy of hard work and loyalty stuck with the older generation. They influenced the youth and didn't adequately prepare them.\nAnd how could they? They haven't had to experience growing up again, student debt, low paying entry level jobs they require experience and a master's degree...they are looking forward to retirement after 40 years at the same company.\nTeachers also want their students to succeed by working hard. But at school you work hard for you. At work it's for the company. At school you got an A and maybe dad bought you a toy. At work you get more work. You needed to be born in the right family with the right connections to not have to worry about money or success.\nA better analogy would be if every A you got, the teacher would get a raise. You would just get more work to maintain that A grade, and maybe some praise. But like instead of a weekly quiz it would be daily in every class so the teacher could get rich from all the A grades.', a user said: 'Even at school, you are working hard for someone else. Education only has value to capital for the most part. You get a degree , it's not doing you any good, just making you more useful for capital, and it doesn;t allow you to be self-sufficient.'",
        "In response to 'Original Post: ‘Service with a smile’ costs more than you think: research reveals becoming a happy, helpful employee takes effort and, eventually, it erodes the energy needed to do one’s job. It could lead to quiet quitting –the new term for just doing your job but not going above and beyond- or even quitting [External Link]: https://news.uga.edu/quiet-quitting-can-lead-to-burnout/', a user said: 'I'm suspicicious of people who are overly happy when serving me. I prefer stern service.'"
    ]
}