{
    "username": "Historical_One1087",
    "contributions": [
        "In response to '[Deleted or Empty Comment]', a user said: 'It's classic double speak.\nCompanies love to use fake platitudes, like good culture, they love saying work life balance when in most places it is non existent, or want you to go above and beyond but not pay you for that free value added that you are providing, or the new pressuring you to work for free OT or they will threaten to fire you.\nI've stop counting the number of unpaid OT I have worked at my last 2 jobs. They put too much on your plate that it's impossible to do during your regular shit, and complain if you don't get it down with firing you, and the only way to complete it is to work free OT. It's bullying and intimidation.\nWhy is there not a more equal distribution of income? Why are CEO's paid so much money to do nothing but cut job, and demand a smaller workforce to do more?'",
        "In response to 'If you have a kid and its time for them to start eating foods google \"baby led weaning\". It's literally just giving your kid food, also known as feeding.\nIts such a sad state that if you're salaried, you're supposed to work 80 hour weeks for a 40 hour salary or else you're not doing your part.\nIs the company somehow giving you an extra 40 hours a week to live your life?', a user said: 'I have had some weeks where I literally worked 70 hours a week for 40 hours of pay, some 60 hours a week for 40 hours of pay and once 80 hours a week of work for 40 hours of work.\nIt's unacceptable for companies to get away with white collar crime or exploit loop holes in labor laws or just be unethical.'",
        "In response to 'The term 'Quiet Quitting' drives me nuts. How is it 'quitting' to literally do your job, as per the job description? That's literally just 'employment'.\nWorkers need to go above and beyond, every day! Will they get paid above and beyond? Fuck no.', a user said: 'Exactly, they will just pile on more work to do because you have shown you can go above and beyond your job description.'",
        "In response to '\"This part of the production pipeline works very well, let's put more load here until this unit is at capacity. Worst case it breaks and we can get another one off the shelf. Check out this prospective unit, it has kids so it will naturally self-motivate to work harder and longer.\"', a user said: 'The messed up part is most companies will refer to workers as \"units\", you are not even seen as a person in the company's eyes.'",
        "In response to 'Twenty-year-old here, and I’m glad to hear it. No one is “lazy”, they’re just being exploited, and it’s long past time we realized that.', a user said: 'People shouldn't accept exploitation by companies that are using a term that was probably made up by a PR company to try and get more free labor from workers.\nIt doesn't matter if you are a Gen X, Gen Y or Gen Z, exploitation is exploitation and it shouldn't be normalized, it should be rightfully called out.'",
        "In response to 'It's literally in the article that 'quiet quitting' is actually 'working to rule' and makes it sound like the employees fault.', a user said: 'It's propaganda from the elites trying to normalize unpaid work, they expect everyone to go above and beyond their job description all the time but not be paid for it.\nIt Sounds like exploiting to me.'"
    ]
}