{
    "username": "Historical-Intern-19",
    "contributions": [
        "In response to 'Original Post: When you quiet quit/ride it out till you get fired, it negatively affects others in this community I had a teammate who had been dropping the ball for a while and was finally let go this week. His output was so bad that my manager noticed and did some digging. Turns out he barely worked at all and was clearly just coasting till he got fired.\nWell, my manager and skip are PISSED and literally called out how they think our old teammate was working multiple jobs. In my xp, they definitely were as they had many signs.\nRegardless, it’s now coming back to bite my team and me with new policies. Yes I’m pushing back on all the BS coming our way and trying to minimize it, but I wouldn’t be surprised if activity monitoring software came up soon to flag suspicious activity as well. This gig has been great for OE for years and now it’s in jeopardy because someone couldn’t just quit when they were done… I have friends (OE and not) at multiple other companies who are dealing with fallout like this as well.\nMy point being, when you pull the anti work card and coast like this just waiting to be fired (which I see recommended here daily), it’s not an isolated event. You get your bag a bit bigger and your teammates (and fellow OEers) deal with the fallout.\nIt helps to push for more RTOs that may have not as it eliminates the possibility of many of these issues. This also affects remote offerings (wayyyy down from what I’m seeing myself in new job hunts)\nHow would you feel if others put your extra paycheck(s) in jeopardy?\nGet your bag, but don’t screw others over while you do it.', a user said: 'The fallacy is that only OE quiet quit and ride it out until fired. Not true at all. Companies just latch onto that to continue avoiding the fact that they create an environment where people need to quiet quit. As evidenced by the reaction to clamp down and exert more control, rather that be introspective.\nBlaming coworkers and insisting they play the game is exactly what corp america wants...and why things never change.'",
        "In response to 'The fallacy is that only OE quiet quit and ride it out until fired.\nBut if you skim through the sub, this is what's advocated by a good chunk of people here.', a user said: 'Well, consider the source. Same people who are taking jobs only to churn and burn, not actually to do the work and are here to find justification for it.\nMost OEers are quietly doing their Js, just like no OEers. Using a broad brush only adds to the chorus these companies want us to be shouting.'",
        "In response to 'Every single point you make in this post I could use as an argument against the whole idea of OE in the first place.\nHonestly? I doubt that guy was over employed. A lot of people really are just that stupid and/or don’t care about their jobs. I’ve seen this so many times in my career. Some guy doesn’t give a shit about his job, coast collecting $, and just quits last minute or gets fired. Management freaks out for like 2-4 weeks and then just moves on. Most over employed people are a lot smarter than that. Stupid people can’t handle the stress.', a user said: 'The person at my J who 'acts OE' is actually a person with a sick parent and an inconsistent childcare situation. But folks will jump to assumptions.'",
        "In response to 'The only people that actively think others OE are people that OE themselves. 99.99% of people have no concept of OE and couldn't even fathom someone doing that.\nIt's literally on next to nobody's radar.', a user said: 'Funny: HR managers meeting last week on \"how to detect\" was hilarious.'",
        "In response to 'Agreed, that’s how it should be, but we have many imperfect managers who just want to cover their ass if they did let that happen. And now that comes back to impact me because someone else couldn’t just quit.', a user said: 'No, it comes back to the imperfect manager. Maybe the stick up your ass over it is because you don't have the stones to do the same and are looking for validation.'",
        "In response to 'For banks mandating RTO they are using a combo of badge-ins and network logons from your laptop to track that you are coming into the office.\nAt the banks I have work and currently work, these reports go all the way to the exec level for enforcement.', a user said: 'Welcome to the 1980s'"
    ]
}