{
    "username": "hisunflower",
    "contributions": [
        "In response to 'So I’ll say, I am a quiet quitter. Been so for about a year. This came off 5 years of 60 to 80 hour shifts (I’m a software developer). My worst week, was 109 hours. My worst “stretch” was 32 days straight of work, without a day off… 12 hours a day.\nAfter I learned that managers will take everything they can from me, if I allowed it. I stopped. I stopped everything. If the work wasn’t in the text of my contract I didn’t do it.\nToday, I spend my days essentially not working. I work maybe 12-16 hours a week. The rest of the time I spend on courses for training on things that interest me (like currently I’m learning statistics).\nI also fill the time with stuff that interests me. I’ve never been happier. I make a 6 figure salary and my work was evaluated… I got back “excellent” as my assessment.\nNo regrets. Living a life doing things I enjoy vs doing things that are purely profitable has been a huge boon to me happiness and mental health.\nI love being productive. I like being productive for me.\nTo each their own.', a user said: 'How is it even possible to go from that much working to very little, and still receive excellent remarks? Genuine question. I’m not in tech but I assumed it would go noticed?'",
        "In response to 'So, basically, my job currently is software development manager. The vast majority of my work is coordinating my team and decision making. I am, a very good decision maker. Ironically, that skill was developed during my grind years.\nSo during my grind years, I was made a Tech Lead. During the time, I read everything about managing software teams.\n• The Mythical Man Month\n- Peopleware\n- Software Estimation: Demystifying the Black Art\nI also got Scrum certified.\nI’m not bragging but I am very good with people. Which is something the industry doesn’t have a lot of. Software devs, tend to be introverted. I’m an extrovert as well. I also have really strong communication skills.\nAll this, on top of my technical skills I built along the way.\nSo my days are very light and lean. I only take meetings if something is on fire. I communicate through emial and slack. I don’t waste developer’s time. If they need something, I get it done for them asap and often, that’s what leads to the positive reviews. Team Member feel heard.\nI also do some side stuff like push for time off for devs that do a little over time. If they request time off I’ll coordinate and make sure they can take their time.\nA lot of it, is simply not being as asshole. I also help my boss, think about problems. So they can make better decisions (they’re new at their position too. So they often appreciate the brainstorming)\nThe key, is “be seen, be competent”. That’s it. Most of corporate America is driven by the sales mindset. You don’t need to be good, you just need to sell yourself in a way to make them think you’re good.\nI mean, I think I’m good. But it basically comes down to controlling the narrative so people don’t get too suspicious.', a user said: 'Wow, thank you for taking the time to type out such a thoughtful reply. I can see how in corporate America, your ability to clearly communicate, empathize, promptly solve issues would be adequate to convince others that you are doing more than you are.\nI mean, no one is watching you the entire time, and you still are functioning within your outlined job responsibilities.\nI have a hard time imagining all that free time in my own job.'"
    ]
}