{
    "username": "Hob_O_Rarison",
    "contributions": [
        "In response to 'Original Post: Where Are the Workers? From Great Resignation to Quiet Quitting [External Link]: https://research.stlouisfed.org/publications/review/2023/09/27/where-are-the-workers-from-great-resignation-to-quiet-quitting', a user said: 'We don't see the lack of workers in middle management and up. It's all entry level management and below.\nThe retirement wave pulled everyone up a couple rungs in the hierarchy. Coupled with the closed borders for a long time, the ensuing lack of labor drove the price of those jobs up where it could. Construction workers and kitchen staff saw huge increases in wages. Custodians, not so much (people just decided to put up with dirtier offices, or didn't need as much custodial with people not returning to work).\nBut then we had this hybrid situation thing, and I'll be 100% honest- people working from home are not nearly as productive as people in the office. It's not even close.\nAnd everybody wants to do it. Probably because you don't have to work that hard.'",
        "In response to 'I don't know. I might fuck off two hours a day when WFH. But I BS with my co-works for six hours a day when in the office.', a user said: 'That's a sign of terrible management.'",
        "In response to 'Let's see your sources. As a union electrician, we have seen wage DECREASES as a result of inflation. So no, construction works HAVE NOT seen a huge increase in wages. You could easily look at labor contacts and see that information yourself.\nAlso, people working from home are way more productive than in the office. FOH', a user said: 'Entry level positions saw the largest gains.\nPeople locked into union contracts largely did not see gains out of the contract cycle.'",
        "In response to 'So your blaming unions for people not being paid more? Lmao what a joke.', a user said: 'That's not at all what I said.\nUnions already paid better, in most cases. Especially when counting benefits.\nEntry-level job seekers were in higher demand mostly everywhere where wages were low to begin with.\nSo that didn't affect unions as much.\nWhen the increase frenzy began, a lot of unions were already mid-flight on 3 or 5 year contracts. Unless their wages were pinned to CPI in the contract (which they might have been), they usually had to wait. And then most of them made it up on the back end.\nIf you were working at McDonalds in 2020, you probably left your $11.50/hr to go work in a real restaurant for $16/hr... and then probably left that for another restaurant (or went back to McDonalds) for $20/hr a couple months later.\nIf you were a journeyman union electrician in 2020 making $42/hr.... you probably didn't leave your pension plan and kept chugging along.'",
        "In response to 'Bud.....unions are all over. I'm in the south so union contractors compete with non union contractors. ANY news of significant pay increase is immediately spread through the labor pool. I would be with a non union shop RIGHT NOW if there were raises .........', a user said: 'Are you entry-level?'",
        "In response to '[Deleted or Empty Comment]', a user said: 'I used to be able to get people on the phone when I had a need to. If for some reason I couldn't,  I could walk over to their office.\nThe remedy now is - fucking nothing. Complain up their chain how I can't get a hold of so-and-so and they're not responding to VMs or emails and it's becoming a real problem.\nI applied for a huge promotion back in early 2022, got through to the third step. I was supposed to be contacted by the company's HR representative, a WFH recruiter, \"by Wednesday\". Wednesday came and went, no call. On Friday, I called her myself (per instructions from the search firm), rousted her right out of a deep sleep at 10:15am. We were in the same time zone... she just wasn't working for some reason.\nIt's been the same for me with anyone in any organization who is able to work from home - very delayed response with very little follow-up. Even my own people, when we've done WFH during covid flare-ups or other short term illness - productivity goes right through the floor, even with careful management and targeted metrics.\nThere's a reason why there are rules about television and social media and other distractions in professional environments. People are lying if they tell you they're doing more while\ndistracted and unsupervised\n.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'You ever think it's just you? lol\nIt's literally every peer in my organization and in my industry.\nI don't care what people say, I don't care about silly little \"metrics\",\nTell me you've never been a manager without telling me you've never been a manager.\nMetrics are how we measure output.\nI'm a department head. I talk to people who need things from me, and I talk to people who I need things from, both in my department and in every other department in my organization.\nOftentimes I can't help people because I need information from them in order to help them.\nThe speed at which I can move influences the speed at which the rest of the organization can move in a lot of ways. Things have slowed to a crawl literally wherever we have a team that is working from home.\nFunnily enough, when we pulled some functions back, we saw an immediate change for the better (HR, overwhelmingly). IT went from full remote to dedicated hybrid 2 days per week, and it got a\nlittle\nbetter, but not much.'"
    ]
}