{
    "username": "hodler3k",
    "contributions": [
        "In response to 'I completed a masters of Instructional leadership after leaving (disgruntled) my work in a transformational leadership school. It's weird because these leadership philosophies do actually sound quite good, it's just that most workplaces twist them to suit their needs or the egos of their leaders.\nTransformational leadership is about empowering employees. Great. People do get value and happiness at work from that. It does not mean leaving everybody to flounder, ignoring or outright despising any feedback, and sticking to rigid hierarchies.\nWhen I brought my concerns to my boss, that we had lots of staff leaving because they were stressed and felt unheard or taken advantage of, I told her that we had at least 10 people aiming to resign at the end of term. Her response was \"only 10? Who cares, we have a staff of 50.\"\nWhen I advised that we be more transparent about decisions and let people have more say in their working conditions, of which they were experts, she said \"people look to leadership for strong direction. If they want to complain they can just leave\"\nI really do believe that good leadership philosophy in good hands can do wonders. I've seen much better since. It's just weird ego-centric people who can't imagine genuinely caring about people or letting go of any control that makes so many peoples lives hell. I was pleasantly surprised that my course content seemed to align with my philosophy (which aligns with this article) and I'm hopeful that eventually things can change.', a user said: '10 out of 50 is 20% of your workers. Any boss that's okay with that is a moron lmao. Especially from a profit standpoint. That's 20% more people you could have making a salary of  .05% of the profits they bring in. No brainer dawg.'",
        "In response to 'Insane right? I should note it's a school so profit doesn't work like that, but it's a whole other argument about the cost of training and the impact new teachers have on student outcomes (spoiler: it's not good)', a user said: 'Ohhh sorry. No profit made from them?\nAdios! Rapido!'"
    ]
}