{
    "username": "Holiday_Plan_3222",
    "contributions": [
        "I got promoted while quiet quiting My j1 is boring and has a lot of meetings, so I decided to quit and search for a new J, that was months ago. I accepted j3 and for the last 3 months I did a total of 0 commits, I just go to meetings and pretend I do some shit\nI just got off my 1:1 with my manager, and got promoted to senior backend dev. I will get a raise of 15%\nLife is funny sometimes",
        "In response to 'Please give me a few examples of what you say in stand ups. Are they not like: bro youve been on the same ticket for 3 months?', a user said: 'I just say that my yesterday was full of meetings to talk about X, Y, Z. Not lie, usually this job I have 5hrs of meetigs/day.\nI have overlaping meetings every single day'",
        "In response to 'This makes your original comment pretty pointless. If you're in meetings 5 hours a day talking, then you're definitely working and IMO that is actually worse than having to do 5 hours of technical work. You can shift and flex technical work. Do it at night or whenever you want. Not with meetings.', a user said: 'I just listening 10% of The meetings. Half of it is 100% muted, I don't need to be there. I just has to be cause they want it.\nSometimes I put on speakers and ask my wife to tell me when they call my name ( almost never). Mewhile I do code from j2 and j3'",
        "In response to '[Deleted or Empty Comment]', a user said: 'Your manager has access to commits? My does not have any idea what git is'",
        "In response to '[Deleted or Empty Comment]', a user said: 'Iam outside US. My country have a lot of laws protecting work force. If they fire my without any strong evidence I will receive about a year of salary'",
        "In response to 'I don't get it. Is this\n/r/antiwork\nor\n/r/overemployed\n.\nFrom my point of view, what your are doing is STEALING money from your employer. You think it's any different than robbing a liquor store?\npathetic', a user said: 'Yeah. My j1 is make literally billions per month exploring others ppl time.'"
    ]
}