{
    "username": "hopeinson",
    "contributions": [
        "In response to 'Original Post: Quietly Quitting and Lying Flat I have wondered over the years why we are constantly told to work harder, work harder, but then things don't always get any better. But it's super-important for Singapore to be competitive against every else, right, so we got to work hard.\nBut I also see that in other parts of the world, there is a bit of a backlash against this kind of idea:\nquietly quitting\nand\nlying flat\nWhat is your opinion?', a user said: 'I wrote a long-ass comment about the lying flat movement, but I was not happy with its overall tone, so I will write my new one simply.\nSingapore’s geopolitical survival is based on the overall productivity of its people. “Productivity,” here, means “how much are you working to earn your wage.” On a personal level, you can be either spendthrift or simply thrifty, but the Government is more interested in ensuring you earn high wages so that they can tax you sensibly, whether it is through your income tax, or the GST.\nLying flat—or, in my interpretation of it, going into NEET mode—is akin to riding a motorcycle without a helmet. Without saving enough to ensure you meet both your current and future needs, you will only harm yourself in the long run. Prospective employers looked at your gap in between your last place of employment and now, and will ask questions you might find difficulty answering (depending on whether you can be truthful in your answers or otherwise).\nAs a matter of public policy, the lying flat movement is borderline “unacceptable.”\nThe nature of Singapore’s economy is this: you need to earn high enough so that the government can tax you enough, and you can spend that cash however you want, so that there’s businesses for other people and companies to earn revenue on. This system of wanting to keep the cash flowing\nall the time\n, is the hallmark of our global economy: trade deficits happened because countries import more than they export, and so needs its people productive (i.e. “keep working”) in order for that cash to flow, and pass on the trade deficit elsewhere.\nIf a large number of Singaporeans, hypothetically, stop work in a show of solidarity with the “lie flat” movement, there are few possible outcomes:\nThe Government is forced to make populist concessions at the risk of blunting our already-blunt productivity indicators (we are not spending more on tax relief & attract more companies to our shores).\nThe Government rebuilds its public policy to favour more immigrant workforce to integrate with Singapore (the unspoken doomsday view: “replace you as a native citizen who, in their minds, have become unproductive and irrelevant to their current power structures”).\nMake “lying flat” illegal (just as how the CCP bans the term on Baidu, Weibo and all of its home-grown social network services) and enforce stricter penalties for promoting it.\nDo nothing. (The doomsday view: “You die, I die, everybody die!”)\nI, in my opinion, favour the movement as a reaction to\nr/LateStageCapitalism\n, however, I lived in a country where there are no natural resources we can capitalise so that we can pursue these personal freedoms of ours without having the daily costs of living becoming overbearing on us. Cue in your usual Social Studies textbook examples of welfarism in Great Britain causing their economy to tank, yada yada yada.'"
    ]
}