{
    "username": "horriblegoose_",
    "contributions": [
        "In response to 'Original Post: I realized today, I quiet quit grocery shopping! So about a year ago I had a breakdown emotionally. Nothing really changed. I kept my terrible job. Our chores didn’t immediately change.\nBut I stopped cooking as often, so I didn’t have to dishes as often, didn’t have to clean up the kitchen as often. Kids still eat, less healthy than I like, but they love sandwiches and the random crappy frozen food, with a fruit and veg. I cooked less so I shopped somewhat less. Then I shopped less and less. And my husband was offering to grab what we needed more. So I just keep doing less.\nToday I realized I couldn’t remember the last time I did a big grocery haul. And today I found shrimp in my freezer. That my husband bought. That I didn’t ask for. Like oh cool I will plan something for this. \nMy mental health is somewhat better. Wondering what else I can quiet quit.', a user said: 'A few years ago I straight up gave my husband the chore of grocery shopping/menu planning. This was pre baby. My argument was that he has more time during the week when the store is less busy to shop (3/12 schedule) and he often wants to make at least one fussy meal so he could just do the shopping. If there is something I want to make specifically I’ll stop by the store or request the ingredients so I can make it when he’s working. But generally I’ve accepted that we will eat whatever he wants to make and not complain. That’s the price I pay by not doing food duty.\nI still probably do the same amount of dishes, but I rarely have to waste part of my weekend standing in line at Kroger. Also, unless I’m making some thing super special for a holiday or something I just simply don’t cook. It’s marvelous.\nTomorrow I am planning on throwing a meal in the crockpot since my husband will be working Friday, Saturday, and Sunday. But, at least me and the toddler will have leftovers to get us through the weekend without turning on the stove again.'"
    ]
}