{
    "username": "HotBeefSundae",
    "contributions": [
        "In response to 'Original Post: Japan's historic work ethic is declining—45% of workers admit they're quiet quitting [External Link]: https://fortune.com/article/japan-work-ethic-declining-45-percent-of-workers-quiet-quitting/', a user said: 'Absolutely trash article. Anyone who's ever worked in Japan or has known a salaried worker in Japan or has done any paperwork or conducted business in Japan will know that malicious compliance is ingrained in the Japanese business work ethic.'",
        "In response to 'Its changing though. Thats what the article is about.', a user said: 'Here's a Fortune article from February with another trash headline claiming that Japan is moving to a 4-day work week:\nhttps://fortune.com/article/tokyo-4-day-workweek-desperate-attempt-japan-shed-title-worlds-oldest-population/\nIn the article, it claims the Tokyo Metropolitan Government, one of the largets employers in the country, is trialing a 4-day work week.\nSome things that the article just conveniently glosses over: Is this available to ALL tokyo metropolitan employees, or is it a select few to trial this (will the janitor get a 4 day work week, or is it just a couple of top executives), how many are in this trial, and how long will this trial last?\nBecause I'll bet dollars to donuts that:\nIt's a select 50-100 employees\nIt's not a permanent change\nEven if selected, employees will be reluctant to continue on this trial so that they don't look like lazy employees to their colleagues.\nThese articles that are trying to paint Japan as moving toward a more progressive work culture are technically not wrong, but people need to understand exactly what an incredibly risk adverse society Japan is from top to bottom, especially their corporate structure and work culture.'",
        "In response to 'people need to understand exactly what an incredibly risk adverse society Japan is from top to bottom, especially their corporate structure and work culture.\nYeah, that's why working hours have been significantly reduced over the past decade—because of how society now views them.\nFew major or mid-sized companies in Japan want to be singled out and end up on national news for allowing employees to work illegal overtime.\nSince long working hours have become illegal, and allowing employees to work 55–60 hours a week has gone from acceptable to extremely risky, few companies permit such long hours anymore.\nFor example, many major companies in Japan use third-party monitoring systems that detect if you use your PC after recorded working hours, making it impossible for employees to secretly work unpaid overtime.\nEven though \"risk adverse culture\" has not changed, what is considered risk is changing very fast according with public perception and law.', a user said: 'Significantly reduced is accurate, but if I'm a typical salaryman living in Chiba or Saitama prefecture commuting into Tokyo, I wake up at 6am, leave by 6:30am, commute for about 1 hour, arrive to the office no later than 20 minutes early (8:30am-8:40am), stay in the office at minimum until 6pm, get home by 7:30pm-8pm.  If I'm lucky!\nRealistically, I'm staying until 6:30PM or 7PM or whenever my manager decides to leave.\nI think there are perks and benefits to full-time employees, especially gov employees such as subsidized housing, transportation, and of course pension (年金), but we're still talking normal working hours of 9-10 hours (as opposed to working hours of 12 hours, 8:30AM-9:00PM).  Additionally, FTE positions are harder to obtain and many contract workers have become semi-normal.\nThe best scenario is to be working in Japan for a foreign organization (earning foreign salary levels), otherwise the working conditions in Japan are still too behind the rest of the world at the moment.'"
    ]
}