{
    "username": "HotSauce2910",
    "contributions": [
        "In response to '[Deleted or Empty Comment]', a user said: 'Those things are still important. It may be stuck in the past, but that’s because the policy is stuck in the past.\nIt’s unfortunate that Biden didn’t try to restart normalization with Cuba though.'",
        "In response to 'Omfg for real.  The rant about not swearing bc “we” don’t talk like that, we want to bring the best out of people, it’s our magic secret sauce or whatever he said, and we wouldn’t talk like we do in a sports bar sent me.  Like wtf?  You think those people in a bar aren’t good enough? Or you’re protecting me from coarse language in 2024?  Jfc.  It was so patronizing and it’s clear he couldn’t hear how he sounded. Yikes. No wonder they lost rural and working class dems. And I started the interview liking him but had to do a double take and remember he is Silicon Valley and I’m cow valley.', a user said: 'Not even just rural or blue collar workers. Everyone who isn’t super religious swears. Even Silicon Valley tech workers swear a bunch. Hell, I’m pretty sure the PSA guys swear a ton too. It’s a weird position to hold that crosses a lot of demographic lines'",
        "In response to 'He was also super anti capitalist which is almost certainly why the FBI had him assassinated and almost everything we were taught about him in school was a very white washed version of him.', a user said: 'Most of the big name civil rights leaders were full on socialist or commie.\nPeople don’t realize that at the time opinion polls HATED the civil rights movement. Black Americans were in favor 85/15, but I’m pretty sure white Americans had a negative view by like 40 points (someone can fact check the actual numbers, it’s a pain on my phone rn).\nMLK did preach nonviolence, and it’s deservedly a big part of his legacy. But we can’t pretend that the CRM was purely nonviolent. If Favreau was alive at the time, he probably would say “I get the message but they’re going about it the wrong way.”\nI also find it kind of dumb that the way civil rights non violence was taught (at least to me) was that if you don’t resist and let yourself be oppressed people will eventually realize it’s wrong.'",
        "In response to '“I’m just like you, listener! My dad was a plumber teacher steelworker nurse and I once had a loan!” Nobody is challenged, much is proposed but there is no follow through\nI mean this was Trump's strategy in podcast trail. Not getting too deep, no challenges, just shooting the shit for the most part. The problem is most of these people don't have the chiasma to hold people's attention.', a user said: 'The problem is that many democrats aren’t shooting the shit. They’re trying to make canned sales pitches. But I think it’s fine, and often preferable, for boring people to be politicians.\nIt makes this interview a bit cliche and boring, but that’s not really a big deal.'",
        "In response to 'On an unrelated note - favs and Lovett being quiet every time Tommy brings up Gaza is infuriating, even if the idea of Biden changing strategies now is ridiculous', a user said: 'It’s kinda funny seeing how quickly they try and change the topic though'",
        "In response to 'Is there any better evidence that these people cannot meet the moment than their discussion on daylight savings time?\nNow I have actually, like I used to think, yes, of course we should switch to permanent daylight saving time. That used to be my position. I really dug into it for a while. I did a lot of interviews, did a lot of, did a lot of reading about it, and I have a more nuanced view on it\n...\nIf you pass the Rubio Marquee Murray bill, then everybody's gonna be on permanent daylight saving time. But if you pass a law that just allowed states to choose between, just add the third option, letting them choose permanent daylight saving time about 20 states, their their laws would go into effect. And then some states would either choose to keep switching or stay on permanent standard time.\n...\nBut no, this is the compromise. The whole country doesn't have to switch and the whole country doesn't have to have one policy. It won't be complicated because you go through a period of transition over a year or two, which people can choose which time zone they want. And then basically you just end up with a new time zone map. And we never have to deal with this again.\nBro, you've found the nuance to the daylight savings time discussion? Instead of 1 national discussion and fix we need to have 50 discussions and 50 different fixes? Instead of just doing something about it, we need to have a period of transition? And what we're transitioning into is a country which is a patchwork quilt of timezones?\nIt's so emblematic of the problem with Dems that our opponent says \"You know how you hate leaping forward? I'm going to get rid of that\" and we respond with something like this', a user said: 'Wait so does that you can’t just do time zone conversion in your  head and will need to look up each state’s individual law to figure it out? That sounds awful ngl, tho ig not too many people are too concerned about doing those conversions frequently.'",
        "In response to 'I thought the same thing for a long time until I really started thinking about it. I'm gonna go out on a limb and say I've actually really come around on preferring the switching back and forth because you really do get the best of both worlds with an admitted tradeoff a couple times a year (but really like once a year, I'll never complain about an extra hour in a day).\nThis is one of those issues where I feel like most people probably do think that just picking one would be nicer, but then if we were to do that it would actually kinda make at least one month worse than what we're used to, particularly if you live in the northern half of the country.\nNot that I'll die on this hill but I'm tired of hiding in the shadows haha', a user said: 'Is it weird that my strongest feeling on the issue is that I’m too lazy to want to change the time on my microwave and oven😭'"
    ]
}