{
    "username": "houdinikush",
    "contributions": [
        "In response to 'Wage compression:\nWhen companies offer higher starting salaries to attract new talent without adjusting the pay of current employees\nBasically, the minimum wage jumped in my state, and now they need to offer higher pay to attract new employees, but they didn't adjust the scale for existing workers. I started at this job making $12/hr, which was $3 over minimum wage at the time, and now, after 9 years, I'm making $19/hr - which looks good on paper, except the state minimum wage is now $16/hr, so I'm still making $3 over minimum wage.\nThe worst part is that I'm expected to train kids walking in the door, making as much or more than me, who were in middle school when I started here.', a user said: 'This is exactly why I am leaving my current employer as soon as I find an agreeable offer somewhere else.\nWe have new owners at the business and they have told me in no uncertain terms that if I am given more responsibilities (they call them “tasks” to downplay the severity but if I’m responsible for purchasing and they want me to start managing our social media, that is not a freaking “task” that is a new responsibility) I should\nnot\nexpect more wages in return.\nSo fuck this place. Let it burn to the ground once I find someone who values my skills the way the previous owner did.\nEdit: similar boat as you. Started working here 7 years ago. I make about $6 more than minimum wage. But that’s only because the previous owner valued me as an employee in a way that these new owners do not. I do not expect any more pay raises for a long time. So I am trying to leave.\nEdit2: Also, hilarious coincidence. But my long-term girlfriend works at this business with me. Her job is processing our credit card receipts and depositing money into the bosses’ bank accounts so they can pay expenses. The bosses\ndo not know how to do this\nand if/when I pack up and leave she is quitting, too. Because these asshats don’t want to pay me what I’m worth they are about to lose two of their 3 most valuable employees. I purchase, she does deposits. They have no idea how to do either of our jobs so the place might literally close if we leave. At least for a few days until they watch some videos and make some phone calls trying to figure out how to get that stuff completed.'"
    ]
}