{
    "username": "hoybowdy",
    "contributions": [
        "In response to 'Original Post: It's NOT \"quiet quitting!!!\" \"Working your contract,\" \"working to rule\" and \"acting your wage\" are all MUCH better terms. Why would you use the word \"quit\" to describe you adhering to your contract and doing your job? It has nothing but negative connotations AND denotation.\nI highly encourage everyone here to lose that term. We're working our contracts. We're not quitting anything. Some may STOP giving away their physical and/or emotional labor, but that's not the same as quitting!\nEdit: For those of you saying \"It's called 'doing our job'\" The implications of teachers \"just doing our job\" are:  volunteering for events, grading/planning at home, taking over other  peoples' responsibilities, adding more to your plate every year, etc...  Admin considers this \"just doing your job.\"', a user said: 'Volunteering, no.  Not my job.\nTaking over new responsibilities that are part of the job description for other people, no. Not my job - literally someone else's.\nGrading/planning at home...yes.\nThis isa salaried job, not an hourly one, and we do not WANT to be treated like clock workers- it's bad for kids, and bad for professionals.\nIf you're being asked to write LONGER plans than before, you negotiate it as a salary bump.  Same with adding to our plates.  Our job is not \"working as long as we are in the building\".  That's not what salaries do - and our contracts\ndistinguish\nclearly, and on purpose, between \"in building hours\" and responsibilities, and sometimes we do a few hours of that at home - just like lawyers and doctors do.'",
        "In response to 'You can't negotiate because of step ladders. We are salaried 40 hours non except. They need to give us our office hours back as its amoral to ask your employees to work more then their paid hours. Lawyers and doctors get paid a ton more and don't get summers unemployed.', a user said: 'You misunderstand.  Salaried workers work to the task, not the clock.  Most of your contract is negotiated tasks.  The hours - not work hours, but \"in building\" hours - are part of that negotiation - just one thing we negotiate, not at all, by contract, the time in which those tasks are expected to fit.\nLow pay is a separate issue.  If you want it to stay lower than it should be, the fastest way to do that is to keep claiming we work to the clock.  Then no one will ask us to do professional tasks - they'll just can everything and say we are overqualified.'",
        "In response to 'They say shot about us anyways I'm not worried anymore about what they say, the truth is we are overworked, they ask too much and don't deserve the labor we have given them at what they pay.', a user said: '\"They\", in my country, is the taxpayers - that is, you and your neighbors.  Are you out of the US?\nAlso, of course, I agree, and said so: we\nare\noverworked, and my point is that claiming we are hourly workers on a clock doesn't make it any better because it leads to micromanagement, not you, prioritizing your tasks during those hours and hurts kids; the better bargaining position by far is to negotiate that set of tasks, and audit them first to get a realistic sense of their time and value so you can negotiate effectively.'",
        "In response to 'Have you ever worked in the private sector? I have -- for almost 20 years. And working at home after a full day at the office was the exception, not the rule.', a user said: 'Salaried vs.hourly has nothing to do with private vs. public sector.'",
        "In response to 'I don’t know of any doctor that works outside of the hospital or any lawyer that works at home but doesn’t bill the client for those hours. I also don’t know of any lawyer or doctor that makes less than 50k with 10 years of experience. That’s why the term “act your wage” is appropriate. I’m not going to put in 60 hours at home for <50k job that’s mentally, emotionally, and sometimes physically abusive.', a user said: 'You seem to be making an argument for getting paid more, not for doing less as a general, ideal case.  In other words: you are advocating for a work to rule as a bargaining technique long term, yes?'"
    ]
}