{
    "username": "HumanEjectButton",
    "contributions": [
        "In response to 'I've managed quite a few people and currently teach apprentice electricians, and I've told all of them that quitting by no-call-no-showing or ghosting does exactly as much damage to your rep with your boss as going out in a blaze of glory, so you might as well hire a band and do it right.', a user said: 'Our quitter in this video was a member of the band, so there are less expensive options for those already in brass bands.'",
        "In response to 'anyone know what the song is?', a user said: 'The band playing the song in the video is called What Cheer Brigade from Providence RI. A 19 or so piece queer marching band. Our dude quitting was a member. This is actually a real quitting and not staged. The band has antics and often show up in odd places for a marching band to show up, like town hall meetings and the like.\nI've seen them perform twice live and it was the best show I've ever seen both times. That's a large compliment because I grew up playing shows and have seen at least a thousand different acts take the stage, especially because my professional life of building festivals, it may be well over a thousand.'",
        "In response to 'lmao is this real?', a user said: 'It actually is real. Notice the tell signs of it being a 20 year old video. The early internet was a more classy place.\nThe band playing in the video is a queer marching band from Providence RI called What Cheer? Brigade. The fellow quitting was a member at the time. The video was used as a promo for the band/events. I belive it was a hotel job if memory serves. Just good old fashioned leftist anti work propaganda and punk rock ethos injection into a marching band promo for the internet of the early 2000s.\nSide note, I've seen the band perform live twice. Once at a house party located at an off grid anarcho queer sanctuary in the hills of Tennessee, the other in Providence RI at a street band festival called Honk. Those were two of the best live performances I've ever seen, and I've been a professional musician, and I've been a stage hand building festivals for years now. I've likely seen two thousand separate acts live and those two sets are my number one and number two of all time.'",
        "In response to 'What Cheer Brigade doesn’t exist anymore. They had drama and infighting over racism allegations and many members quit the band. Joey one of the leaders left. They rebranded as “Undertow Brass band.”  Original crew is long gone.', a user said: 'I absolutely loved them. Best live shows I've ever seen. Saw them twice.'"
    ]
}