{
    "username": "hydrospanner",
    "contributions": [
        "In response to 'Ding ding ding. This is why I had to get out of tech sales after almost a decade. No matter how well you do, no matter how hard you work, some board member somewhere is going to look at your success and decide that means the goals weren't high enough and you made too much commission, so then you spend a few quarters at unreasonable goals and they put you on a PIP cuz you never stood a chance at hitting these numbers to begin with. Then they point to the Silicon Valley sales reps who wake up at 12 pm to respond to the blue birds that flew in their window while they make money hand over foot doing absolutely no day to day work.', a user said: 'At my last job, we had a profit sharing program but it was so obviously rigged.\n​\nIt wasn't \"here, you get a share of the profits\", but rather , \"here, you get a share of the profits (above and beyond a threshold we set based on what we think is achievable plus an extra percentage that we decide based on the max we think you knuckle-draggers might beat our expectations)\".\n​\nWe had some of that company's absolute best years vs the market while I worked there, yet most quarters we didn't meet threshold...or in one insulting quarter, the margin was so slim that my \"profit sharing bonus\" was literally like a $21 check.  One guy that I wish I'd have emulated, literally opened his check in the meeting, saw the pathetic amount, and threw it in the trash as he left the room.\n​\nThe last two quarters I worked there, our market was absolutely tanking.  In the first of those two quarters, somehow we not only avoided tanking but turned a profit and beat our threshold.  The company responded with some shit about \"due to market uncertainty, we're holding these bonuses until we see how the next quarter plays out.  Also, we project that the market overall will contract by another 8-10%...but since you were able to buck that trend this quarter, not only are we not reducing our targets, but we are\nincreasing\nthem\".\n​\nWhen we held steady that next quarter as the rest of our market contracted...but didn't meet their ridiculous targets, they basically said, \"See, you didn't meet expectations, so we're not distributing the bonus from last quarter...and we're taking a hard look at your location's performance.\"\n​\nI left a month or two later...but I heard that corporate basically set unreachable targets intentionally, then used the failure to meet them as justification to permanently close our office, and gave the employees the option to quit or relocate to another site 45 miles away (to avoid laying anyone off...and being on the hook to pay them unemployment).'",
        "In response to 'It doesn’t help that the article was written by a CEO lmao', a user said: 'Of course it was.\n​\nIt basically completely absolves management of any shortcomings.\n​\nBasically, it's just saying, \"If you're undervalued that's your fault, and instead of leaving a company that doesn't care about you and finding one that values you...or at least values you\nmore\n...maybe instead you should cater to the company that doesn't, and let them decide what you're worth, and be happy with it.\"\n​\nIt\nmight\ncarry a little weight if this piece were written by a CEO that stayed with the same company since they graduated, worked their way from the ground up on their hard work and getting noticed by superiors, and was (and is) significantly underpaid by their company and still stays loyal to them.\n​\nIt might...\n​\n...except that this never happens.  And if it did, that person would be considered fantastically stupid for staying.  Yet somehow they think it's sage advice to suggest that others do it.'"
    ]
}