{
    "username": "IamJoyMarie",
    "contributions": [
        "In response to 'Original Post: What's your opinion on quiet quitting? Been doing it for almost a fortnight now, and it's changed my life (for the better).\nInterested to hear others' thoughts.', a user said: 'Friends are telling me to do this.  I don't create the amount of work or the deadlines.  I'm good at dropping something to work on what is more important, and getting back to what I dropped, and prioritizing, but I am finding myself in an endless churn of trying to catch up.  I'm readying myself to retire this May, this December, or October 2026.  I feel the sooner the better for my emotional/mental health, but I'm still figuring it out financially.  I don't know how I could slow down without just not doing my job.'",
        "In response to 'Original Post: I think my remote team mate is quiet quitting And it's ticking me off. Need advice if I should say something?\nMy team is fully remote,  spread  across the US. Our individual and team metrics are tracked by the amount of tickets we process on a weekly basis. This is a FULL time job and I've found that a member of our team is only logging about 4 hours a day - if that! Meanwhile, the rest of the team is putting in 9 hr days just to keep up with the volume.  We've also had to log in and work the last two Saturdays just to clear the backlog.  If this person would just work a normal day,  it would lighten the load on each of us. Our manager hasn't seemed to notice that this  person's \"numbers\" are half of what the other team members are producing. Do I speak up or keep my trap shut,  silently seething all day?\n**Thank you everyone for your input! I'm not going to do my managers job for them,  if they don't care,  I won't care either.  I'll hit my targets and focus on my career advancement in 2025.', a user said: 'We have a person in finance who is very slow. So, they have her more work.  She's still very slow. I would NEVER complain about her to anyone b/c she supports her family and needs her job. Let management figure it out.  They will.'"
    ]
}