{
    "username": "Iftanrafca",
    "contributions": [
        "In response to 'As someone who is 5 years into the industry, they are a bunch of psychos. I used to keep getting attacked because - \"You only do what you are given. You don't have initiative, you should go above and beyond and voluntarily take up more projects.\"\nBasically, here is the deal - they cannot reduce the salaries. Hence, they are firing people and overworking existing people, expecting them to do additional work. Ie, reduce a team of 10 to 6 and expect the same total team work for the same individual pay. Hence, they are asking us to \"go above and beyond\" and do other people's jobs.\nOh also, meanwhile, they can fire you at anytime with zero justification, and have the security clear out your desk within 10 minutes.', a user said: 'Gawd I WISH I had 6 people left when they did this to me. It was a team of 8-10 and then it became a team of manager and me... then just me. Then day shift got MORE people and still somehow did LESS work so I was stuck doing overtime all the time every day. No pay increase though. However they DID take the time to tell me no more breaks allowed because of all of the shit to do.'",
        "In response to 'It's also not a new idea by a long shot. \"Doing the minimum required to not get fired, while avoiding negative attention\" is an idea that every worker will figure out at some point. It's popular at almost every organization. It's popular with Gen X, it's popular with Millennials, it's popular with Zoomers.\nIf you're really looking to curb it not treating employees like a consumable resource helps as lot. As does giving them a stake in the outcome of the company with things like stock bonuses for all employees, employee unions, or coop employee ownership.', a user said: '\"If you hate your job, you don't [quit]! You just go in every day and do it really half-assed. That's the American way!\"'",
        "In response to 'Original Post: Quiet Quitting is the only response acceptable to Quiet Firing [External Link]: https://i.redd.it/rhhn62s8a13e1.png', a user said: 'There's no reward for hard work anymore so why do it? Do the minimum and find fulfillment in your life outside of work.'"
    ]
}