{
    "username": "IKnowWhoYouAreGuy",
    "contributions": [
        "In response to 'Original Post: what's up with quiet quitting? I've heard this term \"quiet quitting\" over the last year, indicating that people doing their jobs are somehow not doing enough. If the minimum requirement isn't enough, shouldn't the minimum be reset?  I feel like I'm misunderstanding the meaning of this term.\nhttps://www.investopedia.com/what-is-quiet-quitting-6743910', a user said: 'Answer: It depends on the audience- for workers is the concept of not staying after hours for unpaid work, not answering calls after hours or working on weekends, and not going above and beyond your job description because the company will likely just lay you off the moment it gets the chance, as most employment is actually underemployment and working conditions (including mental health as a result of working conditions) have deteriorated since Deregulation in the Reagan era.\nFor employers and corporate news stations, its the sudden withdrawal of workers from the \"one company\" mindset and the loss of a sizeable amount of free capital and production from those workers. As much of corporate media is right-leaning, the \"tough guy/ just deal with it\" mentality of the Gen X and Boomer owners and leadership are not observing mental health as a result of working conditions but instead a byproduct of \"woke culture\" to put a boogeyman out there instead of the very real dangers of overworking and undercompensating. Since the pandemic provided opportunity for corporations to grossly inflate prices (in line with, but then far exceeding any supply chain disruptions) and reclaim and cement those higher prices by blaming a \"worker shortage\" which is actually just a failure to find workers to exploit for the previous underemployed wages. By providing the news cycles with a term that takes away blame from the corporation, they can begin to lay off sizable percentages of their workforce \"for cause\" and replace them with lower paid, less experienced workers. These new workers are typically just entering the workforce and less likely to stick around when work conditions suck, because it sucks EVERYWHERE.\nThus, quiet quitting in whole is actually the grassroots beginning of the new workers rights movement.'",
        "In response to 'Since the pandemic provided opportunity for corporations to grossly inflate prices (in line with, but then far exceeding any supply chain disruptions) and reclaim and cement those higher prices by blaming a \"worker shortage\" which is actually just a failure to find workers to exploit for the previous underemployed wages.\nThis is a very Reddit/\nr/antiwork\ntake.\n​\nNo different than the car prices or house prices, labor cost what it cost based on demand and supply before the pandemic, and it went up because the supply shrank not because workers magically became better informed and demanding overnight. Millions of people left the labor pool overnight through retirement or fear regardless of what they were offered to work. The idea that they would have come back if they had just been compensated more is a fallacy. A lot of them were dead, or sick, or filling in for someone who was dead or sick, or taking new positions from the older people who were dead or sick. That disruption was not due to the wishful thinking about labor value.\n​\nCompanies had a tough time getting applications even at much higher wages, and big tech and many other industries are now shedding people who were hired during the pandemic to stop hemorrhaging, but were grossly overcompensated for the weight they were actually pulling.\nLots of sick time off, an environment of fear/paranoia discouraging people from showing up to their jobs, the lockdowns making shortages worse and demand higher, and work-from-home drops in productivity drove, in combination with the social movement of lying-flat and attempts at grass roots worker compensation movements that have already came and went, those drove big pay increases for new hires, drastically driving up labor costs, drastically driving up product costs, drastically driving up inflation.\nWe talk about 'record profits', but often the other half is ignored - the market is still competitive, companies are generally sticking to their % margins, but if you have a fixed % margin and a cost that doubles, your raw $ profit goes up even though you didn't do anything unethical or untoward.\n​\nWhat is happening now is the readjustment and normalization to the market back down. It's happening with houses and cars and labor now all together. It's expected to happen with profits and inflation as well.', a user said: 'You should really include PRICING POWER in your assessment.  Leaving it out makes it seems like the world runs on a tidy little algorithm with no greed or politics (which I'm sure you hear often, is grossly inaccurate).\nAs for the rest of your comments not factoring in the pandemic or amplifying war machines, the \"economy\" of the western capitalist world is literally defined by how much profit a company can take before crashing the market. Your approach forgets that until we lost regulations, there was a fully balanced economy with employment paying livable wages because the things required to LIVE were regulsted to be either provided for or attainable by the average worker. Now, since the market is SATURATED with companies that should not be in business because they cannot afford to pay their workers living wages and won't take less profits, so they price gouge instead.\nI don't subscribe to\nr/antiwork\nbut I share the ideology of regulation over greed and think its the duty of the country to protect their citizens from exploitation.'"
    ]
}