{
    "username": "iligal_odin",
    "contributions": [
        "In response to 'Original Post: Companies Decide to Keep Four-Day Workweek After Finding It's Better | So-called \"quiet quitting\" could decrease if companies move to a four-day workweek, an ongoing UK study finds. [External Link]: https://gizmodo.com/four-day-workweek-remote-work-tech-jobs-1850139680', a user said: 'Quiet quitting DOES NOT EXIST, people are doing their job and just their job. People care way more about the separation of their personal and work life'",
        "In response to 'It’s doing the bare minimum to keep yourself from being fired. That’s why it’s called quiet quitting. The person has essentially quit trying to do a good job. In many cases that makes the person more of an obstacle than if they actually just quit.\nFor example, I’m a software developer. If I task someone to write a method, they take a long time and write code that is bad quality, then that’s a problem. If I had known they were useless I could have tasked someone else instead\nE: be mad, but you doing the bare minimum hurts all of your coworkers too, not just your boss', a user said: 'Just doing your job could still be doing a good job. \nBare minimum is different from \"just doing your job you're being paid for\"\nFor example im a ux design specialist, if i task someone to research and design a wireframe. I expect them to do their job. If they take longer than id estimated id ask them what the struggle points were. If they act maliciously by not doing their job (a.e. Taking their sweet as time knowingly, and or restraining progress on purpose) ill notify higher ups.\nQUIET QUITTING DOES NOT EXIST.\nOne is doing their job the other isnt,\nThey're not quiet quitting, they are purposely getting in situations to get fired.\nDoing your job does not warrant a termination.'",
        "In response to 'Okay so I’m hired to be a software engineer right? I get given tasks to complete. Say I know that it will take me 5 hours to do a task. But instead I work from home and play video games for 5 hours and then do work for 3 hours. The next day I play video games for 6 hours and then do work for 2 hours.\nI could have completed the task at a normal rate, but I chose to intentionally slack off and cheat the company time. A lot of people do this!\nPerhaps your crappy effort is on par with other low performers and therefore goes unnoticed.\nThat is what is meant by quiet quitting. Knowingly slacking or producing sub-par work because you don’t view it as worth it to actually give it a normal amount of effort. And yet again. It’s a symptom of hard work going unrewarded.', a user said: 'Thats not quiet quitting though, that literally not doing your job and would be up for review.'"
    ]
}