{
    "username": "Indrigis",
    "contributions": [
        "In response to 'And the other side of the coin is employers paying the minimum amount contracted to keep them from quitting.\nWhat a talking point.  Even if I accepted this is true (very clearly it is not), how does that impact the statement I made?  When you do something for yourself, do you always exert the minimum amount of work required?  Or do you do good work that goes above the minimum?\nThere's one guy on instagram who did the whole \"quiet quitting\" thing, because he had been the best performer at his company, for two years running, and the company refused to give him a raise or bonus. In response to their refusal to give their best worker any sort of raise, that worker decided to stop giving 110%, because there was no point. Then, in his next annual review, the company that refused to give him extra money had the audacity to complain about him not giving them the extra effort.\nWhile a cute anecdote, it really shows how wages and work interact.  If you are working the minimum, why would you be expected to receive more than the minimum salary?  If you show that you are doing more than the minimum, then you would be rewarded with a raise.  Effort is rewarded, no effort is not.\nYeah, because they asked for it in 4 weeks, and if they did get it done in 1 week, they'd be given another task immediately. No bonus for doing things faster than expected, not even a \"here's a week of light duty, as a reward for getting it done early enough for robust and comprehensive testing.\"\nBecause that's not how they're being paid.  If you are being paid by project then it would make sense that you'd get paid more for the next project after finishing the first.  But you're talking about wages, which are paid no matter if there is a project to work on or not.  You should not expect to receive extra compensation for completing a project in a timely manner.', a user said: 'When you do something for yourself, do you always exert the minimum amount of work required? Or do you do good work that goes above the minimum?\nWhen you do something for yourself any extra effort and good work is equal to paying yourself forward by avoiding future problems. Thus, when doing things for yourself extra effort is rewarded.\nWhile a cute anecdote, it really shows how wages and work interact. If you are working the minimum, why would you be expected to receive more than the minimum salary? If you show that you are doing more than the minimum, then you would be rewarded with a raise. Effort is rewarded, no effort is not.\nThe cute anecdote did show that it's not true. Effort was not rewarded, so \"no effort\" was chosen by that one guy, with no expectation of more than already agreed upon. And the employer took offense for some reason.\nbut in a quiet quitting scenario you'd wait until the day it is due to finish, waiting the full 4 weeks.\nYou should not expect to receive extra compensation for completing a project in a timely manner.\nTimely manner\n, exactly. Taking the full 4 weeks is\ncompleting the project in a timely manner\n. If completing a project in 1 week is not treated as going above and beyond the call of duty and not compensated appropriately, there is no reason to do it any quicker. Thus\nquiet quitting\n, as described by you, is the optimal choice.'"
    ]
}