{
    "username": "iNeedOneMoreAquarium",
    "contributions": [
        "In response to 'Original Post: CMV: \"Quiet quitting\" is not only hypocritical & nonsensical, but the very existence of the term marks a deplorably unequal economy. Recently, many major corporations have started to use the term \"quiet quitting\" to refer to employees whose productivity remains consistent, implying that not continuously increasing one's output at work is akin to stealthily quitting one's job. This is, to anyone who wasn't born into the top 0.5% and then went on to become a CEO who never worked a job below $60/hr in their life, a ridiculous idea. The entire point of working a job under a capitalist system is that you are exchanging your labor for a contractually agreed upon wage. While the tenets of capitalism fundamentally require that you be paid less than your work is worth to the company, this CMV doesn't aim to touch on the fundamental inequalities of capitalism, but rather the bastardization of the capitalist system that Westerners in 2023 are forced to face.\nWhen a laborer agrees to work for an employer for a wage, the principles of ideal capitalism dictate that the agreement between the laborer and employer is mutually beneficial: the laborer is happy performing the required labor in exchange for the offered compensation, and the employer is happy reaping the profits of said labor in exchange for paying said compensation.\nEvery single nation employing this style of capitalism also uses fiat currency: currency which is inherently inflationary and will always reduce in value (at varying rates, but always tending towards a reduction in currency value through inflation). In the US, the proprietor of the global reserve currency and the most influential capitalist republic in a world brimming with capitalist republics, the rate of inflation has significantly exceeded the rate of wage increase for over a year now; that's not including the even further blown-out cost-of-living skyrocket nor the record-breaking strides in the efficiency of labor thanks to technology.\nIt has been shown time and time again that, while the economic stagnation brought on by the pandemic surely did inhibit the global economy, more than half of the increase in both inflation and cost-of-living in advanced Western economies has been solely due to greed-driven exploitation of global unrest by corporations who have posted record profits despite devastating drops in demand through pure price gouging and exploitation.\nThe use of the term \"quiet quitting\" betrays the not-so-secret key to maintaining profitability for shareholders despite negative economic trends: employers have always expected workers to sacrifice whatever necessary in their own lives for the increased profits of their already exorbitantly wealthy shareholders. For the past few decades of increased productivity and prosperity, this has been fueled by laborers' belief that hard work and blind dedication will result in financial advantages: work hard, provide more value to your company, and you get paid more: capitalism at work. Except now, we live in a world where even the most generous of incentivized bonuses still amount to a reduction in wages according to purchasing power.\nIf your wage is not actively adjusted for inflation, you are taking on a recurrent decrease in salary.\nTL;DR a laborer under a functioning capitalist society exchanges an agreed-upon quantity of labor for an agreed-upon wage. The economy under which most of the Western world currently exists has become vastly preferential of business owners and corporate elite through pure corruption, and the idea of \"quiet quitting\" is just a small yet potent example of how the wealthy have been actively and increasingly exploiting the working class for decades, inevitably trending towards record-breaking profits for the top 1% regardless of wider economic factors, and a consistent degradation of the wage, purchasing power, and political representation of the workers actually creating value.\nPlease change my view because, as a highly politically and economically educated person who was born into a problematically socialist society and raised in another, now living in the US, I desperately want to be able to support the widespread prosperity afforded under a capitalist system, but the US has already easily passed the threshold from capitalism to oligarchy.\nAs an immigrant US resident who believes in this country but can't vote, I desperately remind Americans that you're allowed to vote for someone who isn't a corrupt geriatric billionaire - please just stop watching CNN, FOX, and MSNBC, and maybe actually read a campaign platform or two. You have competent politicians, you just refuse to give them power for some reason...', a user said: 'You were on a roll until you brought capitalism into the equation because we do not have free market capitalism in the USA.\nIt's an important distinction as fighting against something we don't have is a sure way to ensure we end up with more of what we don't want.'"
    ]
}