{
    "username": "Inevitable_Silver_13",
    "contributions": [
        "In response to 'This post: Tell me you don't have a union without saying you don't have a union.', a user said: 'Yes I'm thinking \"don't you just have to tell them that working outside of hours is a violation of your contract?\"\nStill good collective action in the absence of a union.'",
        "In response to 'In our contract it clearly says \"and other duties outside of contract hours, as specified by the principal or designee\"', a user said: 'That's terrible contract language which only benefits the district. Mine says it's limited to two nights per year and 90 minutes per night with the exception of high school graduation .'",
        "In response to 'Original Post: Quiet quitting Update: wow, the support!  Thank you all!\nWill now only refer to this as \"Just doing my job\"\nStarting today, I quit working for free.  I won't manage the school food pantry, sew for students or school programs ( uniform alterations, letter jackets, CTE jackets, prom dresses), work the gate or track meets, cover hall duty for others, support fundraisers, sponsor or coach teams, provide snacks to students, participate in staff potluck meals.\n I will arrive 2 minutes before my designated duty time and leave 2 minutes after hours.\nI will take off every Friday to help my family, and take off every PD because I have yet to attend a worthwhile PD (I have only been teaching since 2001, a valuable PD is unlikely to occur in the next year).\nI have 80+ days of leave accrued, and I will leave as few on the table as possible. \nThere is no union power in my state, so I am on my own.', a user said: 'Great! Can you really take off every Friday, though?'",
        "In response to 'Original Post: Is anyone “quiet quitting” this year? I’m curious if anyone else is doing this and how it’s going. My mental health was a mess after last year and my home life is messy— my daughter has a chronic illness that is not in remission. I decided at the end of last year that I was done overextending myself for this job.\nSince then, I’ve just said no, over and over. Can I help take tickets at a football game for four hours and $30? No. Can I lead a PLC? No. Can I mentor a new teacher for an extra plan bell? No, because I’ll just get called to sub for free every day— learned the hard way last year. I’m contracted to work from 7:45-3:15 and so that’s when I arrive and when I go home. If I have to stay extra for any reason— like my daughter’s late practice— I watch Netflix on my school computer and get a Pepsi.\nIt’s been a real relief so far— knowing there’s no pressure for what else may be lurking ahead. It doesn’t matter, because I’m not doing it anyway.', a user said: 'I try my best but I did join another committee... I also do after school work which I am compensated for, but I need the money.'",
        "In response to 'Original Post: Students refusing to do work because they're \"quiet quitting\" Has anyone experienced students not wanting to do any work (not necessarily \"extra\" work, but any work really) and mentioning something related to \"quiet quitting\" as a reason when asked?', a user said: 'Cool, the bare minimum should be an improvement from doing absolutely nothing 🤣'"
    ]
}