{
    "username": "InfiNorth",
    "contributions": [
        "In response to 'Original Post: It's NOT \"quiet quitting!!!\" \"Working your contract,\" \"working to rule\" and \"acting your wage\" are all MUCH better terms. Why would you use the word \"quit\" to describe you adhering to your contract and doing your job? It has nothing but negative connotations AND denotation.\nI highly encourage everyone here to lose that term. We're working our contracts. We're not quitting anything. Some may STOP giving away their physical and/or emotional labor, but that's not the same as quitting!\nEdit: For those of you saying \"It's called 'doing our job'\" The implications of teachers \"just doing our job\" are:  volunteering for events, grading/planning at home, taking over other  peoples' responsibilities, adding more to your plate every year, etc...  Admin considers this \"just doing your job.\"', a user said: 'Inflation adjust productivity.'",
        "In response to 'Try “work to rule”. This is the proper term, Google it!', a user said: 'I prefer \"inflation adjusted productivity.\"'",
        "In response to 'I'm a second year teacher and I already do the \"figure it out in the morning\". Works everytime actually lol', a user said: 'I think it up on the way to work, and get it ready by the time I arrive.'",
        "In response to 'Original Post: Is anyone “quiet quitting” this year? I’m curious if anyone else is doing this and how it’s going. My mental health was a mess after last year and my home life is messy— my daughter has a chronic illness that is not in remission. I decided at the end of last year that I was done overextending myself for this job.\nSince then, I’ve just said no, over and over. Can I help take tickets at a football game for four hours and $30? No. Can I lead a PLC? No. Can I mentor a new teacher for an extra plan bell? No, because I’ll just get called to sub for free every day— learned the hard way last year. I’m contracted to work from 7:45-3:15 and so that’s when I arrive and when I go home. If I have to stay extra for any reason— like my daughter’s late practice— I watch Netflix on my school computer and get a Pepsi.\nIt’s been a real relief so far— knowing there’s no pressure for what else may be lurking ahead. It doesn’t matter, because I’m not doing it anyway.', a user said: 'I've been a work to rule person since day one. I do not volunteer. I do not go above and beyond. I do not offer my opinions at staff meetings unless called upon or if there is something that is pissing me off personally. I do not spend a penny of my own money on resources. I do not work outside of my contract hours. I don't ever accept requests to cover supervision. I refuse to cover for EAs (Paras) when I am a substitute, that's not my job. I do not speak fondly of the employer and I don't allow teaching to take over my identity. End of the day I put on my OutKast or whatever the soupe du jour is for the bus ride home. No need to quiet quit. My salary has decreased every year since I started, so I don't give them anything back. Oh, and I make sure to use my extra time allowances to\nvery\neffectively not have to show up more than thirty seconds before the bell the next day.'",
        "In response to 'Tiktok has rewired their brains to be ADD and unable to focus without constant stimulus.\nJust a pet peeve of mine, but I'm sure you were just being hyperbolic; ADHD is not a personality description, it's a hereditary neurobiological disorder of the prefrontal lobe. It can be tricky to diagnose and our understanding of it has evolved over the decades, but it's not something you can just \"catch\" or develop yourself. I know this seems like a pedantic response--and I guess it technically is--but I just feel like it's important to stick up for ADHD kids because they already constantly deal with the pressures from others to \"just try harder\" when it's really more complicated than simply having discipline.\nWhat's happening with TikTok (and has been ramping up since the dawn of the internet)\nis\nclearly impacting peoples' ability to focus and show restraint, but it's a problem with a solution that will be different from treatment of ADHD. Though of course I don't necessarily blame the students themselves for the effect this all has on their development, of course, no matter how obnoxious they may be in the moment.', a user said: 'Thank you. I have ADHD and it pisses me off to see someone, especially someone who claims to be a teacher, co-opting the name of my disability for the sake of describing social-media addicted teens.'",
        "In response to 'It kind of reminds me of one of the things mentioned at a PLC meeting. Tiktok has rewired their brains to be ADD and unable to focus without constant stimulus.\nThey then say we need to adjust our teaching to this. My rebuttal is that we need to help fix this. We shouldn’t be caving to their craven need for entertainment at every moment, we should be helping fix their brains the rot has produced.', a user said: 'Please stop passively using ADHD as a mindless expression for being distracted. It is a disability. Tik-Tok doesn't cause ADHD. It causes addiction. Please don't go painting a disability that genuinely affects millions of people on kids because they are doing something that you don't like (rightly so).'",
        "In response to 'What truly terrifies me about this generation is that they are the next workforce and they just... don't want to do anything. Like they are all so anti school and haven't realized that life is work, honey.', a user said: 'kids these days\nFixed that for you there, bud. Look, our current group is growing up in insane times - the first generation raised by people truly fucked over by capitalism worse than their parents were, first generation bombarded by the torments of non-stop, always-at-your-fingertips addictive social media (lol I'm on Reddit while typing that), a climate catastrophe that even as an adult with set goals, a partner, a home, and decent success in life makes me wonder why the fuck I am alive... I don't blame the current generation of kids. I blame their parents. I blame the century of insane, unfettered materialistic capitalism finally reaching a boiling point like never before. I blame the billionaires who necessitated the existence of the media phrase \"quiet quitting\" (I prefer \"inflation-adjusted productivity and I am happy to say I proudly engage in it). I blame our governments for taking shit all action, and I mean\nshit all\nto remedy\nany of this.\nThey are realizing how shitty the world is at a much younger age. In high school I was still under the illusion that equality and hope existed beyond graduation. Kids how are all too aware of how fucked up the world is, how unfair it is, how broken ever system we have is. It makes our jobs a nightmare. I don't know how to deal with it but whining about insubordination isn't going to help.'"
    ]
}