{
    "username": "Initial_You7797",
    "contributions": [
        "In response to 'Original Post: Robyn's been quiet quitting for yrs. I've just listened to Ace and Katelyn's pod and they hit the nail on the head about Robyn and Kody's main income coming from the Sisterwives show.\nIt's been annoying me for a while that Robyn's input in the show has slowly been regressing each season. She gives less and less every season. They won't even let the crew in the house now.\nShe has been quiet quitting the show for years. Puts in minimal effort because there's no other way she can earn $. Soon she'll just zoom her talking head into production. 😆', a user said: 'also with the land. the og 3 were paying from their pockets. until christine walk away. kody and robyn are paying from family fund. kody and robyn get 1/2? and they get 1/2? (maybe if not less) plus their 250k in bad art: jewelry galore and guns? the 1.5m dollar home. the new cars. IDK i can't even girl math that right. kody saying i paid for one lot on my own. with family money? no baby you didn't. those trailers are full of failed business... yip, bet they are.'",
        "In response to 'Drives me crazy! They don’t get half they get 1/3. If they break up, they split the entire thing. Why do they think Robyn gets paid twice? Why wasn’t his money split 4 ways with each household getting an equal share?  He had four families to support. If I were Meri and Janelle, I’d ask how it was possible for Robyn to pay her mortgage, buy her kids cars, pay for college, and buy all the crap in that house. It is insane.', a user said: 'i could see kody getting 3%- his truck, clothing, grooming, daddy dates, wives gifts, the grouping getting 35% for savings, and each wife 10% and the other 22% being split (for each minor child 4 parts, 2 parts for each college child and 1 part for each adult child.) then savings could pay for the property, part of college, part of cars, part of weddings- a set amount for each thing with inflation added in. Kody doesn't need an equal share- he doesn't have a household. but all kids deserve the same. i could see boys getting less for weddings, bc traditionally girls' parents pay.'",
        "In response to 'Or did he have a secret bank account that he was hoarding? Cause either ain’t a good look mate. \nThat means you weren’t actually contributing 100% of the income as the only person who actually had the responsibility to. \nDon’t get up Janel from not putting her side income in to the pot now if you weren’t doing that what? 10 years ago?', a user said: 'plus janelle's \"side money\" was paying for their kids.'"
    ]
}