{
    "username": "Inner-Today-3693",
    "contributions": [
        "In response to 'It's definitely not uncommon for people to subconsciously or consciously \"check out\" of a relationship before actually doing so, especially if they've realised they're being abused.\nAll the best to you going forward OP.', a user said: 'Yeah I’m being heavily gaslighted… and he has stopped for now because we have cameras and I said okay let’s watch the camera so we can see who’s the one doing 99% of all the cleaning in the house.'",
        "In response to 'Didn't camera - but\ndid\nbreak up with a few year boyfriend in my early 30's because he was insistent that I needed to CLEAN HIS HOUSE even though I owned my own house and needed to keep that clean, what the fuck.\nSo I broke up with him. And then about five years later I realized he had photographs that we had taken on film and asked him if I could come get copies because they were of myself and my child and he said sure!\nLadies. I walked into this house that I broke up with him over to retrieve the photos, an overall pleasant transaction. And he had the exact same piles of shit on top of his shit from the day I broke up with him. Maddening if it weren't so ridiculous', a user said: 'OMG! Mine has so much stuff the house is filled with his crap. All my stuff fit in a single small bedroom. I moved in with him. And he jokes I’m he’s mom. 🙃I’ve told me no. He calls himself my first born…'",
        "In response to 'Wow thats quite the boner killer.', a user said: 'I know. If you want a more sad sorry you can ready my post history. He’s his own birth control is all I’m going to say…'",
        "In response to 'Has he seen this study. Caregiver drive suppresses our sex drive.\nhttps://www.vice.com/en/article/88q3qk/man-child-scientific-term-new-research', a user said: 'Thank you. I’ve asked him to seek help. I’m giving the end of the year. Plus looking for a second job so I can likely move out.'",
        "In response to 'My abusive ex doubled down and tried to propose 4 months before I finally left him lol. I don’t know on what planet someone realizes their partner is checked out and thinks that a flashy ring will somehow fix the problems that lead to them wanting to leave in the first place. Solid logic.', a user said: 'I think he’s too lazy to try to do that. He’s asking me to wait 3 years. I’m 30… not doing it. Making my exit plan.'",
        "In response to 'Oh man. I feel like your current experience is acting as my ghost of Christmas future.\nMy hubby grew up in a cat family, which nothing wrong with that I LOVE cats! He met me when my youngest pup was 2.5 y/o. \nRecently he tried to convince me to get a kitten from his friend whose cat recently had a litter. I told him no. Absolutely not.\nWe currently have 2 big dogs. one is very much getting closer to crossing the rainbow bridge (which will absolutely shatter me) and the other just turned 11 and has always been super needy/demanding. I told him no I don't want the added responsibility of cleaning litter, keeping track of cat food/treats, plus another basket of problems if cat doesn't have perfect health. He says he will take care of all the cat's needs. I know thats a load of shit since I currently take care of EVERYTHING related to our dogs. Food, health, grooming, ect. He is good at making sure the younger gets walked (ya know, the fun parts!) whether it be by walking him himself only on the weekends or guilting me into it because he works full time and I'm currently home during the week. Doesn't matter that I have terrible insomnia and may have only fallen asleep like 2 hours prior... I should still get up (and stay up) literally before dawn (summer in AZ so morning is the only time where pup won't burn his paws) to ensure pup gets his walk. PS pup doesn't go crazy if he's not walked everyday so it's not a crisis if he skips a day.\nI told him if he wants to get a baby pet we are getting another dog. He has NO IDEA of the amount of work that goes into raising a puppy into a well behaved dog. It's like training for a human baby and if he can't deal with everything that comes with raising a puppy then raising children with him may be off the table. He already thinks he's too old for a human baby (hes only 37 btw) and I know for a fact it didn't even cross his mind that maybe his idea of being too old for kids at 37 is insulting to me because my parents were 39 and 40 when I came into the picture, until I told him that...\nSorry for the rant.\nOP- How old are your kid(s) and how did infancy go with someone like your husband?', a user said: 'Cats are easier… I’m confused.'"
    ]
}