{
    "username": "iNSANEwOw",
    "contributions": [
        "In response to 'Bei der Defintion bin ich mein arbeitslebenlang Vorreiter.\nWarum sollte ich auf Arbeit irgendwas tuen für das ich nicht bezahlt werde?', a user said: 'Bei meinem Bruder in der Firma war auch die Verwunderung groß, hat monatelang Überstunden gesammelt und seinen Job übererfüllt. Außer Lob und auf die Schulter klopfen ist wenig bei rum gekommen außer noch mehr Stress. Als er nach Auszahlung der Überstunden und Gehaltserhöhung gefragt hat kamen erst die Ausreden - da sie ihn aber unbedingt für ein Auslandsprojekt brauchen bei dem er fest eingeplant ist hatte er halt alle Karten in der Hand. Was er verlangt hat war auch absolut nicht übertrieben sondern wirklich nur angemessen, auch auf meinen Rat hat er sich da nicht mit leeren Versprechen abspeisen lassen sonder hat es halt ausgesessen und dann einfach gesagt er unterschreibt die Erkärung für den Auslandseinsatz erst wenn das geklärt ist. Sein direkter Chef und Abteilungsleiter waren auch auf seiner Seite von daher weiß ich garnicht woran es dann so lange gescheitert ist.\nEnde vom Lied er kriegt die Überstunden ausgezahlt, wurde arbeitstechnisch etwas entlastet, kriegt mehr Gehalt und ist bald für 1.5-2 Jahre im Ausland und hat jetzt auch die Zeit sich darauf ordentlich vorzubereiten.\nWieso man manchmal wirklich bis kurz vor der Kündigung das was einem zusteht einfordern muss werd ich nie verstehen. Er hat sich vorher auch Jahre lang den Arsch aufgerissen und dann lässt man das bei einem der Leistungsträger wirklich so weit eskalieren. Naja gut jetzt ist langsam Gras über die Sache gewachsen und er ist zufrieden wie es läuft.\nEin anderer Kollege von ihm hat sich da vor mehreren Jahren mit leeren Versprechungen abspeisen lassen und wartet bis heute auf die versprochene Gehaltserhöhung - da gibts wohl alle 6 Monate einen anderen Grund wieso es jetzt gerade schlecht ist und er doch noch die ein oder andere Bedingung erfüllen müsse.'"
    ]
}