{
    "username": "INVERT_RFP",
    "contributions": [
        "In response to 'Super immature I agree. If you want zero progress ever then sure be exactly what you're worth but if you want upward ability you have to play by upward rules.', a user said: 'Only until you realize that the \"oh, we will look a raise in the future\" is usually bullshit, just so you go away. Definitely always put out a good, even great, work product. But if you figure out they are just dangling a carrot that you will never reach, you can find a better job. Then leave them wondering why they lost a good employee.'",
        "In response to 'I agree with most of this. Except part of getting what you want is knowing how to get it. It used to drive me insane when as a contractor a lead position would open, the bosses drinking Budd would get it. The old timers would go fucking nuts saying \"I've been busting my ass for x years, never calling sick, doing extra blah blah blah\" and it's like OG, obviously that shit keeps you hear, to get over there obviously the drinking buddy job is that the requirement is', a user said: 'You are right there. The \"good 'ol boy\" network is absolutely a real thing. I have seen it happen to me. I choose to do my job extremely well, but I am not there to make friends. I got passed over for a promotion to field work, but my boss's pal that had only been there 6 months. When I found my current job (doing field work), they had to hire 3 people to replace me. The guy that got the job hates it, but I now work about half my original hours, for slightly more pay, and now have awesome bosses. Turns out, I was way better off not getting that promotion!'",
        "In response to 'It well know only way to move up here. And people still complain about getting screwed and call me a jerk for condoning it. I don't condone it may all it's a horrible way to legitimize leadership roles, but that's how you get a leadership roles, everyone knows it. Then it's a question of how bad do you want it or do you just like to complain when someone else gets it?', a user said: 'Yep. 2 things: 1. there is a big difference between someone who's title is Manager, vs. someone who is an actual leader. I have experienced both, sure you have to. And 2: i spent a while in the Army, and while it shouldn't be, it's just as bad there. Moral of my story: do what's best for you, regardless of what's best for the company. If you die, your former job will be posted before your obituary.'"
    ]
}