{
    "username": "irrationalweather",
    "contributions": [
        "In response to 'This breakdown is so important, thank you for explaining it so succinctly.\nThe expectation to go above and beyond in the service of your employer while they simultaneously minimize your importance and suggest you’re replaceable at any moment is so degrading.\nThe dynamic they cultivate is one that is commonly seen in abusive relationships.\nHigh value of the person in the beginning. As the honeymoon phase ends and people start to get comfortable and confident in the security of the dynamic, the person with power attempts to push the person off-balance, with degradation, humiliation, threats, coercion, and manipulation. They move quickly into devaluation, keeping you in a position of deep insecurity and fear that prevents you from gaining the confidence to leave. We end up accepting much less than we deserve for more work to appease an unrelenting, critical and unforgiving power.\nWe are expected to be grateful for their kindness and deference when it is given, yet it becomes increasingly fleeting, with more and more strings attached.\nThe pandemic flipped the power dynamic and everyone got to collectively witness this shift and gain a clearer understanding of their value in this society beyond just their labour contribution to some insatiable machine. I just wish we maintained more pressure on these exploitative systems to prevent it from moving back so quickly to the abusive relationship that was normalized.', a user said: 'simultaneously minimize your importance and suggest you’re replaceable at any moment is so degrading. The dynamic they cultivate is one that is commonly seen in abusive relationships.\nMy very first job out of college was for a small business in the front office. I didn't realize it until the very end, but my employer had a pretty consistent routine with how he treated his front office employees. The following is my experience, but experienced almost exactly by the previous employee and the one who came after me.\nStep 1: Hire them\nStep 2: Joke with them, invite them to family holidays (bonus if their family and friends are on the other side of the country), invite them to your church, introduce them to people their age to gain a sense of community\n(during this step, perform the following steps to their coworker so you always have 1 employee you like and 1 employee you hate)\nStep 3: Subtly start to undermine their confidence by blaming them for things out of their control\nStep 4: Outright undermine their confidence by yelling at them in front of everyone and threaten their job and livelihood daily\nStep 5: Overhear their plans to quit once their lease is up, so you now fire them more than a month before their lease is up to teach them a lesson\n...\nStep 1: Hire them'"
    ]
}