{
    "username": "isecore",
    "contributions": [
        "In response to 'As a recent grad who started a career this year, I'm so confused by \"quiet quitting\" and why anyone would be upset at it. I do my 40 hours and then my computer's off, isn't that the agreement? I work 7-3:30 M-F and you pay me...', a user said: 'Because American capitalism and work culture is incredibly toxic and weighted to the employer, who will constantly try to gaslight you into doing more than you're paid for, while holding the chain connected to your neck and simultaneously having the power to fire you at a whim for whatever reason.\nAs a worker you create the value for the employer but the system is rigged to treat you like a commodity and replaceable resource.'",
        "In response to 'Original Post: The Flipside of \"quiet quitting\" is quiet paying. Don't forget this. Somebody older I know asked me why young people are \"quiet quitting\" their jobs and not trying to work hard. I told them that quiet quitting is a bullshit term that describes doing what was outlined in your contract, and not more. He started to tell me how you need to hustle and do more than the minimum if you want to succeed. I told him that the difference compared to many years ago is that now hard work is not met with commensurate rewards or opportunities. Then I asked him the following question:\nIf it is culturally acceptable to push people to go above and beyond what is outlined in their contract, why does the company always only pays what was agreed upon? Why doesn't payroll ever go above and beyond what was agreed? Shouldn't it also be culturally acceptable to expect extra salary in this case? Aren't my company quiet paying me?\nHe had nothing to say and just looked uncomfortable. He didn't really agree but he has no good answer either.', a user said: 'The rewards for going above and beyond have evaporated, along with the ridiculous expectations that have steadily increased. What was \"exceptional effort\" 40 years ago have been skewed into being the normal expectations, which is fucked up. Especially since wages have stagnated and not kept pace with the prouction output.'",
        "In response to 'Nowadays you get rewarded with more tasks when you perform beyond expectations...which means you now get more for doing less, and company are stupidly wondering why', a user said: 'Yes, these days the only reward for hard work is more hard work.\nIt's ludicrous. Our production output per person is roughly 5-7 times someone in the 1970s, yet we're still expected to work 8 hours a day, five days a week at 110% capacity. We should be starting to wind down the concept of \"work\" and moving towards automating a lot of things, but puritan capitalism can't allow that.'"
    ]
}