{
    "username": "isettaplus1959",
    "contributions": [
        "In response to 'Yep, seems to be the case, even if it is subconscious.  Our elders thought the memorial invites would bring back pre pandemic in person ministry levels.  It didn’t.  Only up slightly.  We had hundreds of unplaced invitations.\nCouple that with lower pioneer hours and most of the regular pioneers getting most of their hours on construction projects or killing time behind a cart, and there is just no fire anymore.  Happy to see it.', a user said: 'You hit the nail ,ive been in since 1963 its a dead religion now  as you say no fire, i think after the 1975 disappointment thats when it started, but the biggest reason is the dead watchtower studies overthe last 10 years or so ,there has been a change in content ,there is no longer any prophecy or history ,no proper study of scripture,  its just recycled repeat of \" obey the GB\" obey the elders \" \"worship the organisation \" Jesus is being shunned ,at the memorial talk we were told we are not allowed to speak to Jesus , it has become the very thing they warned against years ago , an on line trash TV religion with emotional manipulation and constant demands for money and sacrifice with nothing being given back .'",
        "In response to 'are you still in? LOL', a user said: 'No im faded out and have not been to hall for 3 years,  my jw wife does zoom,  i somtimes sit in for 30 min public talk just to keep her happy ,'",
        "In response to 'When did public talk become 30 minutes, when I was a JW it was an hour and then an hour of watchtower. Is the watchtower study still an hour long?', a user said: 'Public talk 30 min WT about an hour. Been like that for years.'",
        "In response to 'add another 10 minutes for the closing prayer from the brother who won't shut the fuck up!!', a user said: 'Exactly'",
        "In response to 'Thanks, I left in late 1970s.', a user said: 'Its a different religion now ,what you remembered has long gone .i recommend a look at the book \" my beloved religion and the governing body \" writers  name is Rolf  cant remember second name it like Fiorly.its available on pdf'",
        "In response to 'Only started to look into JW on YouTube a few years ago and I can see that they've changed. I remember having lots of debates with elders and others, but in 74/75 when WT were screaming 1975 from assemblies and written in the WT, one elder kept saying remember it is written no man knows the day or hour, thank you Bob he's probably dead now. Then WT blamed the rank and file, well that was my first reg flag. Between the watchtower study and going out in service we'd sit in back room having lunch and great arguments aka discussions in those days and now we'll it's no more, and that Kingdom hall is no more - sold. You have to refer to the book of acceptable questions to ask if you don't want to be disfellowshiped.', a user said: 'Back in1960s we used to go to the pub and debate doctrine ,it was acceptable then ,now it would get you requested to meet the 3 stooges.'",
        "In response to 'This. So much! I have very few friends because the jw’s that I did try to befriend always ended up stabbing me in the back. It was always for stupid things and they’d twist my words around and then gossip, which would in turn get back to an elder.\n99% of the time, it was their fault for misunderstanding and jumping to conclusions because they only got a small portion of the full picture. So now, all I do is smile and rarely ever say anything personal, about myself or anyone else. I’m too old for that kind of drama. All I want at this point in my life is peace, which I have plenty of now that I’ve stepped back from JW Land. I just cannot tell you how much happier and less stressed I am since I’ve stopped attending meetings and service. It’s amazing!\nLooking back, I used to be one of those gossiping PIMI’s, so glad I woke up and decided to change. I no longer judge any of the friends either. I see them for them, and many of them struggle to keep up the PIMI game but just can’t admit it. My heart hurts for them and I always try to be very sympathetic towards their struggles.', a user said: 'I suffered depression and anxiety eversince i came off the servant team in the early 1980s ,on antidepressants, tried to carry  on thinking it was my fault i failed ,took the field service mid week group for 6 years after the elder died ,no elders helped , eventually one morning i had a total panic attack because of the bickering over who would work with who and one sister went to another part of town ,it was all too much i just said to my wife \"im done with this \" we went home and just left them on the territory,  i refused to take the group after that ,at the convention when they showed that video of the parents refusing to answer the phone call from their own daughter  i realised that i no longer wanted to be a part of this unchristian organisation ,i woke up properly about 7 years ago and started to fade ,covid helped me finish my fade ,i have not been in a kingdom hall for 3 years, my depression  has gone i am off medication, i now go to a proper Christian church and love it ,im a much happier person ,'"
    ]
}