{
    "username": "Itchybootyholes",
    "contributions": [
        "In response to 'People who get smart stop working as hard\nLearned that lesson early in my career. Sadly, I kept forgetting it starting out.\nWould get the \"Cost of living\" increase of 2% every year. More than many get, but was not matching what I saw in the store.\nBusted my ass, 80 hour weeks. Leading multiple projects. Would get an A+ review and a ... 4% raise.  I mean, it'd double the previous year but again but at best matched the price of a gallon of milk.\nSo I did the math. Looked at all the extra work outside 40 hours I was putting in. Divided it by the extra 2% (exceptional raise - normal raise) and found out that I was getting less than minimum wage for those extra hours.\nAnd before someone chimes in. Yes, I did bust my ass and got a 'raise' that basically made up for the cost of living misses I had before.\nAnd yeah, I did end up changing jobs. And that's only way to get a real raise but you are also a bit limited in how often you do it. (can't do it every 6 months typically forever)', a user said: 'I’ve done it every year for the last six years chasing raises and I’m finally in a comfortable position that I don’t care if I get only cost of living increases.\nAt some point, my mental health and work life balance means more than chasing another $20k. But what’s great about accepting my fate is that I’m very firm with my boundaries.\nSometimes I have the bandwidth to help someone out here or there, or just do their job for them. Sometimes I get really busy and I need other people to do their jobs because I don’t have time. Ultimately, I never volunteer for work or fill a need unless it has visibility, people know it’s a one-off, it’s unblocking me from getting other work done.\nIt’s a relief to stay in my lane and not obsess over everything. I can meet my deliverables, turn off my computer, and have a life outside of work.'",
        "In response to 'They aren’t making enough millions…they need more millions', a user said: 'Billions friends, these are MAANGS'",
        "In response to 'Profit means revenue less cost. To keep profits high while revenue is not getting anywhere… their only way is to cut.', a user said: 'Found GE'",
        "In response to 'It feels really weird in the corporate world right now. My company is making record profits but is cutting costs wherever they can. We had layoffs, and benefits have been reduced significantly, all while our sales have been growing exponentially.', a user said: 'Yeah everyone has been prepping for this ‘recession’ while stock and profit is way up. It’s bizarre to say the least. They trimmed the fat in my team which has been nice because those folks were literal dead weight just causing more work for everyone else. I’d like to think they were OE but probably just drunks playing video games all day more like'",
        "In response to 'Original Post: You’ve Heard of Quiet Quitting. Now Companies Are Quiet Cutting Layoffs are down, but employers are still finding ways to cut jobs -  Is this normal or economy tanking? More problems expected in late 2023 or 2024?\nWorkers are waking up to emails and team-meeting requests with a jarring message: They aren’t fired but their jobs are gone.\nPeople on the receiving end of these memos describe running through a range of emotions, from relief that they’re still employed to a sense of dread that their bosses secretly want them to leave.\nhttps://archive.ph/cYXyk\nhttps://www.wsj.com/lifestyle/careers/youve-heard-of-quiet-quitting-now-companies-are-quiet-cutting-ba2c326d', a user said: 'I’ll say it again if it’s your only job\nhttps://en.m.wikipedia.org/wiki/Constructive_dismissal'"
    ]
}