{
    "username": "itsmelorinyc",
    "contributions": [
        "In response to 'Original Post: I didn't get the promotion. Should I quit or quiet quit? A few months ago everyone in my team was let go apart from me. I was then told I could apply for my old manager's role. I applied but have now been told I didn't get the role and they are going with an external candidate.\nFor these past few months I have basically been doing this promotion role (and have received really good feedback from lots of senior people). I have not gotten a payrise to do all this extra work.\nI want to leave before this candidate starts because I'm tired of giving them essentially cheap labour. I was told if I didn't get this promotion, another role would be made available for me (in the same team), so I would probably have lots of leverage to negotiate a payrise. But I really don't want to have to essentially train this new external candidate who will be making more than double what I earn in the role I didn't get.\nShould I hand in my notice now, do a shitty handover and let the new person flounder? Or should I stay in my role with more money, but be looking for jobs on the side (it could be months and months before I find a good job). If I do immediately quit, I do have savings I could live on for 6+ months (took me years to save this amount).\nWhat would you do? Any advice?', a user said: 'Why was your team let go? Sometimes companies that are in financial trouble bring in external management and overpay them to basically do the dirty work of continuing to make cuts. There may not be raises and promotions on the table if that’s the situation your employer is in. Either way though it sucks and you should look elsewhere. Whether you should quiet quit or not depends on your relationship with them—there may have been a reason they didn’t let you go with the rest of your team, like they actually like you.\nIf this is the case, and if you’re in a profession where the good will of your past colleagues means anything, continuing to be professional and delivering until you leave could be a good thing. I’ve been through something akin to this—company was in trouble, everyone above me and lateral to me was let go, they kept me on, I continued to try and deliver good work. I was in management so I was trying to do right by my team anyway. They tried to convince me to stay claiming they would figure something out, but I left anyway on very good terms both upward and downward. Overdelivering has always served me well, tbh. But when it’s time to move on I do that, too.'"
    ]
}