{
    "username": "Itsnottreasonyet",
    "contributions": [
        "In response to 'Original Post: Can we talk about quiet quitting again? Hi,\nI’m a middle-aged associate professor in the humanities at a private university that is thriving as far as these things go. I used to be quite active on this sub, and it helped me both through and past a long period of burnout in 2021–23. Due to some poor thinking and carelessness on the part of administrators, my salary declined last year because I didn’t get as much summer teaching. Downloading my W2 this past week and seeing the impact has kinda wrecked me. I can’t believe at my career stage I earned less in 2024 than in 2023.\nMy immediate reaction is “they pretend to pay me and I’ll pretend to work.” So I’d like to stop saying “yes” to service requests, pushing scholarship through conference presentations to publications, and freeze development on my pedagogy. The issue is that if I pull back from giving a full effort, none of the people who caused this—my unit-level head, staff and admin in the budget office, the senior leadership of the school, and the finance-bro board of trustees—will even notice. But people who have done me no wrong—my students, my colleagues, my department chair—would be impacted. They’d have to pick up my slack, rope others into doing what I currently volunteer to do, get less interaction with their instructor, etc.\nI know this issue has been raised a million times, but please indulge me: what’s the appropriate response to falling salary when for personal and profession reasons switching institutions isn’t an option? How do you frame a decision to pull back to colleagues or chairs you respect?', a user said: 'Admin has made a number of decisions in the last two years that have amounted to several pay cuts and huge demands for more work. My response has been:\nTake service commitments only if they come with course release or stipend.\nSay yes to students but no to admin unless there is extra money involved (no volunteering for their pop up committees, town hall meetings, etc).\nRespond, but don't be proactive, especially if admin is about to shoot themselves in the foot. I've been around long enough to know when they're about to hurt themselves, but they don't want to hear that their idea isn't brilliant, so I just sit quietly while they break things.\nSkip everything optional.\nResearch what would be interesting to me anyway, even if it wasn't published.\nUse every perk of the job to comfort myself: all the CE money, any scheduling flexibility, etc.\nRemember that this isn't forever and have a back up plan.\nI hope we all find a way through!'",
        "In response to 'Can you share your backup plan?', a user said: 'I train healthcare workers and am also licensed in healthcare. Currently I would like to continue teaching because of loan forgiveness and flexible scheduling, but I can bail to doing clinical work. I know I kind of have it \"easy\" in that regard'"
    ]
}