{
    "username": "j4ckbauer",
    "contributions": [
        "In response to 'First time this has ever happened. I'm like...is this a trick. I'd prefer to stay in the company and keep collecting checks versus waiting to be let go. I have no idea what will happen in the upcoming weeks.', a user said: 'When you have spent your whole life working hard for not much, it can feel weird when this happens.  Do not get used to it.  Do not expect it.\nBut yes, it absolutely can happen that you get paid to literally do nothing.  Hint:  It happens more often to those higher up in the organization.'",
        "In response to 'I find this funny because it assumes only OE people do this. The most useless people I knew that got fired it wasnt realated with oe, they are just incompetent', a user said: 'I find this funny because it assumes only OE people do this.\nYes exactly.  This post has identical energy to 'An accountant at my workplace murdered someone.  I am an accountant and now this is generating fallout for me and other accountants.\nFellow accountants, you are making us look bad and you need to stop murdering people!  Otherwise everyone will constantly associate accountants with murderers!\n''",
        "In response to 'I understand your point, but honestly I dont see the issue. Sometimes if the job sucks people coast. That will always happen. The issue is management that doesnt do anything when a situation like this happens', a user said: 'Edited:  Replied to wrong comment.  Sorry\n/u/lordrelense'",
        "In response to 'Nowhere did I say only OE people do this? I just know for sure this guy was and the ride it out advise is posted here every damn day, so plenty of OE people do', a user said: 'You deny singling out OE and yet chose to post this to /overemployed\nand not to other career or remote-work subreddits\nYou employ the debate tactic of arguing \"Well\ntechnically\nI did not say -only- OE people do this\".  But you only ranted in the /overemployed sub.\nA person would be justified in thinking your problem is with OE in particular\nbecause you are ranting about damage done to your by OEers\nand not damage done to you by slackers, incompetents, and quiet quitters in general\nAnd finally, your post history shows this isn't your first \"I never said it was just OE\" rant only posted to the OE sub.'",
        "In response to 'The fallacy is that only OE quiet quit and ride it out until fired.\nBut if you skim through the sub, this is what's advocated by a good chunk of people here.', a user said: 'This is false.  It's advocated by a lot of 1-line comments.  Virtually nobody who provides details of their OE experience brags about doing nothing and collecting jobs from which they get fired in a year.  They talk about managing the stress of meeting expectations.\nAlso we have moderators now and it's in the sub rules, this isn't /antiwork.  The crap you're talking about is subject to getting removed if it were a top-level post.'",
        "In response to 'Every single point you make in this post I could use as an argument against the whole idea of OE in the first place.\nHonestly? I doubt that guy was over employed. A lot of people really are just that stupid and/or don’t care about their jobs. I’ve seen this so many times in my career. Some guy doesn’t give a shit about his job, coast collecting $, and just quits last minute or gets fired. Management freaks out for like 2-4 weeks and then just moves on. Most over employed people are a lot smarter than that. Stupid people can’t handle the stress.', a user said: 'OP has internalized all the concerns of his boss' boss and has absorbed the propaganda that those people cared if he lives or dies, until a meanie worker 'ruined it' by slacking and now the boss 'has no choice' but to crack down.'",
        "In response to 'Original Post: When you quiet quit/ride it out till you get fired, it negatively affects others in this community I had a teammate who had been dropping the ball for a while and was finally let go this week. His output was so bad that my manager noticed and did some digging. Turns out he barely worked at all and was clearly just coasting till he got fired.\nWell, my manager and skip are PISSED and literally called out how they think our old teammate was working multiple jobs. In my xp, they definitely were as they had many signs.\nRegardless, it’s now coming back to bite my team and me with new policies. Yes I’m pushing back on all the BS coming our way and trying to minimize it, but I wouldn’t be surprised if activity monitoring software came up soon to flag suspicious activity as well. This gig has been great for OE for years and now it’s in jeopardy because someone couldn’t just quit when they were done… I have friends (OE and not) at multiple other companies who are dealing with fallout like this as well.\nMy point being, when you pull the anti work card and coast like this just waiting to be fired (which I see recommended here daily), it’s not an isolated event. You get your bag a bit bigger and your teammates (and fellow OEers) deal with the fallout.\nIt helps to push for more RTOs that may have not as it eliminates the possibility of many of these issues. This also affects remote offerings (wayyyy down from what I’m seeing myself in new job hunts)\nHow would you feel if others put your extra paycheck(s) in jeopardy?\nGet your bag, but don’t screw others over while you do it.', a user said: 'You are overlooking all the non-OE people who quiet quit or, just as commonly, get fired.\nYou're speaking as though only OE people fuck things up for their co-workers.  When people talk like this it leads me to wonder.... have you....  had a job before?  I've encountered many people full-time in-office who 'barely work at all' and more than half the time, they are in management.\nYou seem to have internalized the concerns of those above you on the hierarchy, which is troubling and ultimately self-defeating.  They don't give a shit about you and will always misrepresent their failures, incompetence, and laziness as the fault of someone below them.\nI 100% believe your co-worker is as bad as YOU think he was.  The fallacy is that your life being made harder as a result is his fault.  It's the fault of your superiors for not empowering you to work around the problem, replacing him sooner, and designing the organization to be less dependent on a single person.'"
    ]
}