{
    "username": "Jadenyoung1",
    "contributions": [
        "In response to 'Yep, quiet quitting doesn't do what people thinks it does.    It just makes you look like you might have time to do other things.', a user said: 'Thats bullshit and you know it. They would have dumped the extra work on em anyway, no matter how much they did. Do what you’re paid to do and for as long as agreed. No more, no less.'",
        "In response to 'I'm asking out of ignorance here.\nIs quiet quitting acting your wage or doing the minimum possible? I don't seem to get the concept', a user said: 'if i understand it correctly, its just working and doing what you agreed to. No more, no less. You clock in on time and do the things you agreed to in your contract and you leave on time. Thats it.'",
        "In response to 'Alright, in that case, I quet quitting my shitty job on April.\nI've seen also people say we should do the least possible, which doesn't sound so cool IMO', a user said: 'Just do what you agreed to. Simple as that. If they want more from you, they have to pay you more. Why would you work for free? And also why should you work your ass off at all? And for what? You just get more on your plate for the same pay. More work gets rewarded with more responsibilities and more work. Rarely you get more pay. Or the classic „alrighty, you work 55 hours instead of 39 now and get.. let me check.. 1.2 % more pay. Isn’t that great?!“ Yeah.. Fuck that noise'",
        "In response to 'If you are asked to do something not listed in scope of job, thank them for the promotion and ask what your new pay will be. No promotion? You just want me to pick up the work of the manager you just fired with no additional compensation? I was under the impression that it's so difficult they get extra money and benefits. What gives?', a user said: 'yup. Never work for free. They get exactly what they pay for. No more. Its a fairly simple transaction. BuT lOyAltY. No.. Loyalty is something to be earned. I owe them only my work for pay. Nothing more. Its really not that hard. Im a number to them. A cog im the machine. So they are an means to an end to me.'",
        "In response to 'I totally agree on this, that's what happened to me with my with last employer', a user said: 'From what i have seen the best course would be to get into a job, do normal work. After some time you ask for bonuses, not promotions. If you don’t get them, apply to the next jobs and haggle for higher pay due to working experience. I know that this is a theoretical situation. Reality looks different. But its way more likely to get screwed over by a raise than bonuses..'",
        "In response to 'I thought that the goal behind quiet quitting was to do absolutely as little work as possible without getting fired.', a user said: 'As far as i know, no. The articles i have read and people i talked to say the following. „I have worked over what i was paid and then stopped doing that and did only what i was paid to do, because i saw no merit in it“.\nBecause you drop to normal lvls from a dizzing hight, the company sees you doing barely enough. Because they were used to you burning up. At least thats i how i see it. Its a dumb term anyway'"
    ]
}