{
    "username": "JamesMcGirthy",
    "contributions": [
        "In response to 'That's just being an asshole. It annoys your employer, but really screws over the other employees. I hope I never have to interact with you IRL. \"Lol\"', a user said: 'Yeah it's one thing to bail post-training when there's no one responsible for keeping track of where you are at all times, but trainers are the most overworked and underpaid people in most fields. They don't need the extra stress of having to deal with not knowing where you are because you couldn't take the half a second it takes to say \"I quit\" on your way out the door.\nGot social anxiety? Send an email with those same two words. It's seconds of your time that you're still being paid for until you physically leave the building.'",
        "In response to 'That's what I took it to mean too\nAnd it's totally a thing. I've hired at least 5 new employees in the last few months who accepted the job and then just didn't show up for their start date and never replied.\nThey accepted the terms then changed their mind and couldn't be bothered to tell me leaving me without staff I thought wanted the job.\nHow people think this is appropriate or support this is fucking baffling.\nThey should be ashamed of themselves. It's a sign of our fast food culture. It's happened to personal relationships via tinder and its now happening in professional relationships', a user said: 'I don't know if you've been through the hiring process recently, but finding a job is no longer a simple \"submit a resume / application and do an interview.\"\nNowadays pretty much everyone hires exclusively online, and many have their own online application where you have to register an account, fill out all the information that would normally be... you know... on your resume that you can't just attach to the application, or have it autofill answers with.\nThen if you\nare\nselected for an interview there's always a ton of bullshit hoops you have to jump through, and a number of additional questions that should have just been included in the application (such as \"can you work weekends?\")\nI recently applied for a position that\nrequired\na 4 hour unpaid interview process to just be\nconsidered.\na 1 hour initial interview, if you qualify you then do an hour of skills demos, an hour of shadowing, and then a final hour interview.\nI didn't tell anyone I wouldn't be showing up to my interview because 2 hours of those 4 are effectively unpaid training. Should I be ashamed of myself?'"
    ]
}