{
    "username": "JaneAustinAstronaut",
    "contributions": [
        "In response to 'Original Post: I didn't get the promotion. Should I quit or quiet quit? A few months ago everyone in my team was let go apart from me. I was then told I could apply for my old manager's role. I applied but have now been told I didn't get the role and they are going with an external candidate.\nFor these past few months I have basically been doing this promotion role (and have received really good feedback from lots of senior people). I have not gotten a payrise to do all this extra work.\nI want to leave before this candidate starts because I'm tired of giving them essentially cheap labour. I was told if I didn't get this promotion, another role would be made available for me (in the same team), so I would probably have lots of leverage to negotiate a payrise. But I really don't want to have to essentially train this new external candidate who will be making more than double what I earn in the role I didn't get.\nShould I hand in my notice now, do a shitty handover and let the new person flounder? Or should I stay in my role with more money, but be looking for jobs on the side (it could be months and months before I find a good job). If I do immediately quit, I do have savings I could live on for 6+ months (took me years to save this amount).\nWhat would you do? Any advice?', a user said: 'I'm in this exact position, with the added cherry on top being that while this person has more years in the industry, they stayed mid-level while I got to a higher level, so they frequently ask me for help on things they should know.  They got the job because they personally knew the hiring director, the other team members, and the person who left the position was their cousin.  While I was doing the job, they were aggressively courted by my company, to the point that they gave her a salary package of over $50k more than the previous employees in the role, who had MBAs, while she has an AS in veterinary care.  I at least have a BA in Liberal Arts.\nI basically do my job functions and anything they ask of me, but when they ask my opinion on higher level stuff, I direct them to ask their boss.  I let their boss see how incompetent they are.  When they drive the team members crazy with their micromanaging (the same team members who recommended them for the job), I'm empathetic, but I reiterate how I would do things differently, then shrug and say, \"but that's not what the company wants in this position, so idk what to tell you.\". I'm nice to my boss and coworkers, but I don't go above and beyond for them like I have at previous companies.\nI've essentially let her do the hard work on her own, to sink or swim as best she can.  Meanwhile, my job is way less stressful, while I'm still making more money than at my previous company.  I don't handle ANYTHING work-related outside of my work hours, and I use ALL my sick/vacation/personal time.  All while I keep an eye on my industry and try to get my company to pay for me to obtain lucrative work certifications.  I'll then take those certs with me when I eventually leave here.\nSo quiet quit, don't do the boss's work anymore once they are onboard, try to grab any freebies from the company that you can, and take all your PTO time, especially the ones that don't pay you when you leave.  Take your time looking for something else, and relax at your job.  They're the boss now - let them work late since they want it so badly.'"
    ]
}