{
    "username": "Janus_The_Great",
    "contributions": [
        "In response to 'Original Post: What is the difference between \"quiet quitting\" and working exactly/only according to your contract? [External Link]: /r/TooAfraidToAsk/comments/yr6tin/what_is_the_difference_between_quiet_quitting_and/', a user said: 'there is no difference.\nOne is a factual description: \"working your wage\".\nthe other a manipulative vulture cry of neo-liberal exploiters, to coerce you to do more than they pay for, aka. wage theft: \"qUiEt QuItTiNg\"\nIf a company, a boss, manager, a supervisor outs themselves as exploitative ass please remind them, that what they are actually proposing with their \"quiet quitting\" is literally them asking you to work without compensation, which, unless you are a convicted criminal (13th amendment), is prohibited.\nAsk them directly, if they are proposing that you work without compensation, and if they might give you that in writing, so you can sue their asses, if not they should shut the fuck up about \"quiet quitting\" and pay you more for additional work, responsibilities, etc.\nDon't feel intimidated, stand your ground. Social interaction is still based on nature, thus presentation, perception and intimidation, being scared or unimpressed and standing your ground/ stand up for rights is still as essential as in the depth of the forest or savanna. We've been humans for over ~300'000 years. and office workers for less than ~3000 years.'",
        "In response to 'Original Post: Corporations Are Worried About Disengaged Employees \"Quiet Quitting\", But Nobody Talks About The Underpaid Workers That Have Been \"Quiet Fired\". [External Link]: https://i.redd.it/a7btgkkkgp5e1.png', a user said: 'Five years? I'm gone after latest two years without raise.'",
        "In response to 'Original Post: How is performing your job duties “quiet quitting?” Are you penalized for your efficiency & preventing burnout? [External Link]: https://i.redd.it/02qwb6ziqvi91.jpg', a user said: 'neo-liberal propaganda.  thats why. The rich want to scapegoat working people so they arbitrarily fire you.  with it being accepted.\nThat's why.\nIn their eyes they pay you minimum wage for you to to become a loyal pet and slave to them.'",
        "In response to 'Original Post: \"Working to Rule\" NOT \"quiet quitting\" [External Link]: https://imgur.com/a/LAimDzs', a user said: 'alternatively \"acting your wage\".'"
    ]
}