{
    "username": "JavaVsJavaScript",
    "contributions": [
        "In response to 'Literally decades of not matching inflation in wage growth, and increasing workloads. Constant denials of requests for additional headcount. Paying market rate for the clueless new guy but punishing those who favour stability despite them having valuable knowledge and skills the business depends on. Increasing expectations of availability and reduced response times. Why didn’t you read the email I sent at 6:30pm last night before our 8am stand up meeting? Layoffs at the slightest hint of a recession. Refusal to invest in tools and training needed to be efficient. Constant requests to just “spend less” but no reduction in targets.\nWhy the fuck would anyone go the extra mile these days?', a user said: 'The layoffs thing really amuses me. At two of my jobs, we laid off a ton of people a few months back due to market conditions. For some of them, 30 days didn't even pass before recruiter contracts went out to replace them as we had lost key skillsets we decided we once again required.'",
        "In response to 'That is a clear indication of bad management.\nIt affects the remaining employees in a negative way.\nThey should mutany and get rid of managers making such poor decisions.', a user said: 'Even with losing no people, my team has 1/3 of the productivity. It is absolutely wild.'",
        "In response to 'Lol, that happened with the bookkeeping company I worked at. Wasn't even April 2020 and they suddenly axed 60 new hires out of a work force of a 300. Month later they're recruiting and I had people reach out to me about rejoining. I don't even know why I was fired, since I had some of the best metrics on my team. Told them to fuck off and it felt fantastic.', a user said: 'Should have demanded remote work and just coasted until fired.'",
        "In response to 'Work-to-rule is a job action in which employees do no more than the minimum required by the rules of their contract, and precisely follow all safety or other regulations, which may cause a slowdown or decrease in productivity, because the employer did not hire enough employees or pay the appropriate salary and as such does not have the requirements needed to run at the level they desire.[1][2] Such an action is considered less disruptive than a strike or lockout, and obeying the rules is less susceptible to disciplinary action. Notable examples have included nurses refusing to answer telephones, teachers refusing to work for free at night and during weekends and holidays, and police officers refusing to issue citations. Refusal to work overtime, travel on duty, or sign up to other tasks requiring employee assent are other manifestations of using work-to-rule as industrial action.\nHas nobody really heard of this before?  Used to happen all the time to TDSB schools in the 00's.', a user said: 'Yeah, what to think of this trend depends on whether it is just an employee scaling back hours or whether it is an employee basically only doing what they feel forced to do.\nI am a quiet quitter of the 2nd type. At one of my jobs, there is a bug that costs 50K a year. I don't care enough about my employer to even write the title of a Jira ticket about it. I can see why this is devastating to companies.\nI literally will do nothing that my manager does not tell me to do.'",
        "In response to 'I wish I could do this... I work with animals, so if we work to rule, and follow all the safety regulations and protocols to the letter, it would take up enough time that it would compromise their care or hurt their quality of life :(', a user said: 'Why I try to avoid doing anything that matters. Ugh, you are trapped unfortunately there.'",
        "In response to 'This article talks about how concerned CEOs are about quiet quitting and whether they can rely on employees during recessions and such, and talks about AI companies who are going to try and detect it, but there's no mention of the much simpler solution of just paying workers fairly for the extra work and commitment they do and make to their organizations.', a user said: 'Or the fact that employees cannot rely on their employers during recessions.'"
    ]
}