{
    "username": "JBru_92",
    "contributions": [
        "In response to 'Kelly is the first HC to take his coaching philosophy from Office Space.', a user said: 'I'd almost admire it if it wasn't my school he was swindling'",
        "In response to 'I don't think swindled is the right word since the university seems equally apathetic to the football program.', a user said: 'Fair'",
        "In response to 'Original Post: UCLA SPORTS Analysis: After years of quiet quitting, Chip Kelly admits he didn’t want to be at UCLA https://www.latimes.com/sports/ucla/story/2024-03-05/analysis-chip-kelly-didnt-want-to-coach-ucla', a user said: 'It's a stone cold lock for next season that when we go 4-8 because of Chip's complete indifference to building a roster, the national media types will excoriate UCLA fans for not appreciating what we had with Chip and we're getting what we deserve. Bruce Feldman is going to have a field day.'",
        "In response to 'Well and the lack of NIL In UCLA. Rumor was $1 million  available for the roster, which is about 25-30% of the minimum needed to compete with top 10 teams.', a user said: 'That was the other part, Chip treated the fanbase like they were an annoyance and kept everything about the program locked up like Fort Knox. No fan engagement, no donor relations, no fundraising, nothing. All while being the worst coach on the field in the last 50 years for UCLA. Deshaun Foster has done more fan and donor outreach in 3 weeks than Chip did in 6 years.'",
        "In response to 'UCLA is such a tougher job than one would think it should be', a user said: 'It's really not. Karl Dorrell went 35-27 with 5 bowl games during the height of the Pete Carroll era.\nWhen Karl Dorrell's tenure puts yours to shame, you know you f'd up somewhere'",
        "In response to 'I mean, he was still coaching solid football, he just didn’t really try in recruiting', a user said: 'I wouldn't call getting outscored 50-14 at home by Cal and ASU as \"solid football\"\nHe had 2 good wins in 6 years'",
        "In response to 'He went 25-13 in the second half of his tenure with y’all though', a user said: 'With the 3 easiest schedules in school history.\nEven his glorious 9-4 season ended with losses in 3 of his final 4 games and 6th place in the Pac-12. This is after supposedly needing 3 years of historically bad losing to \"rebuild\" a program that went to a bowl game the year before he showed up.'"
    ]
}