{
    "username": "JC_Hysteria",
    "contributions": [
        "In response to 'Original Post: Has anyone \"Quiet Quit\" as a response to RTO? I'm not in this position, so I don't need advice, but I'm curious to hear everyone's thoughts on this.\nI work remotely, which is why I follow this sub. I've seen a lot of people in this sub who are being asked to RTO. I've been thinking about this the past few days as the sub has been full of people discussing how to respond to RTO mandates.\nLots of people, including myself, are speculating that the recent push for RTO is force people to quit their jobs. If they don't fire you then they don't have to pay out unemployment. And, you have to have significant savings to go without a job.\nWhat do you think about about returning to the office and quiet quitting so you can still draw unemployment? Anyone done this?', a user said: 'I truly don’t understand the concept unless you’re feeling stuck in your life somehow/for some list of reasons…\nWhy would people\nactively\nchoose to do the bare minimum, otherwise?\nWe spend way too much precious time at work…we’re better off being proactive in trying to make our situation better than committing to “malicious compliance” just for the sake of it.'",
        "In response to 'It is not the bare minimum.  It is about doing your job well but not working for free for decades like older workers did.\nTime is precious and I am giving my literal life to work. I give them 40 hours and the rest of the time I have is for managing my house & being with my family.\nI have seen too many comments workers literally die due to being overworked. It's not worth your life...', a user said: 'That sounds more like you defining your ideal work/life balance, or setting your boundaries/limits, etc.\nHow I interpret “quiet quitting” is essentially malicious compliance…an act of protest that’s misguided and mutually harmful.\nIt’s often seems like a mental weighing of pros/cons, and choosing the low road in life (given its\nimpact\n- whether or not we “like” our jobs or not).'",
        "In response to 'I don't believe that most workers have gotten to the breaking point of protest...but keep pushing them and they might.\nRight now it's mainly a new generation not allowing the ocerlords to exploit them', a user said: 'Big grey area, then…in my experience, it’s often challenging to discern competence from confidence, too.\nWhen remote roles can be ambiguous instead of monotonous or easily measured/attributed, who’s to say what’s considered the minimum or going “above and beyond”?'",
        "In response to 'Quiet quitting isn’t doing the bare minimum. It’s doing what you are paid to do and only that, nothing more, nothing less.', a user said: 'Wouldn’t that distinction only make sense for jobs that aren’t ambiguous, and therefore wouldn’t typically qualify for remote work?'",
        "In response to 'Uh no…', a user said: 'In my case at least, there isn’t a binary method of doing my job…it’s kinda just how I interpreted the ~5 paragraphs I applied to, and how my superiors/peers feel I’m doing.\nSo, there isn’t really a way I can “do the bare minimum”, for example.'",
        "In response to 'As I just recently commented, people typically do not like the term. It was a reactionary term against the “hustle culture”. That’s really where it comes from. So, in that regard, it can apply to any job. Do you work extra hours for no pay? Do you take on other people’s work? Those kinds of expectations from senior leadership is the impetus for “quiet quitting”.', a user said: 'I interpret the term as malicious compliance…what you’re describing, I interpret as setting boundaries and creating balance with my employer and colleagues.\nI do work extra hours and help other people, but I limit how often I do it and I’ll also weigh what else is going on. If I was paid\nhourly\n, I’d only work overtime if I was paid overtime…but with salaries, it’s usually factored in.'",
        "In response to 'I can see it being considered malicious compliance from the perspective of the employer. Even on salary, it’s typically based on a number of hours a week which is typically 40.  This term came about from expectations of employers that staff do what ever they say when they say it regardless of hourly or salary.', a user said: 'That’s why I like to clarify, given it just seems to me like it became a popular term in the media to describe the employees acting insubordinate as a result of short-term flexibility granted during COVID…\nThen, some companies rescinded those flexibility options (now even more than the last few years)…but obviously, everyone would prefer to\nkeep\ntheir newfound flexibility.\nIt makes more sense to me to delineate between an intentional “sabotage” of providing your best work for an employer, but doing so without more nuanced reasons than the scenario I just described.\nIf there aren’t additional considerations to consider like experiencing a “bait-and-switch”, moving away from the office, etc., I feel like it’s detrimental to\nboth\nparties.\nThe employee might as well spend as much spare time as possible trying to find a better situation, or improve their standing with their current employer (\nwhile\nmaintaining boundaries and benefitting from a solid two-way relationship).'"
    ]
}