{
    "username": "jcatl0",
    "contributions": [
        "In response to 'I was junior faculty in a department where all tenured faculty quiet quit. The job was so miserable that I actually quit.', a user said: 'My first tenure track job was a nightmare because all the tenured faculty refused to do most service. Nothing like starting the tenure track with a full service load, having to handle things like assessment for accreditation because tenured folks didn't want to. Thankfully I left, and they haven't been able to keep any assistant professors around since I left almost a decade ago.'",
        "In response to 'I was advising 8 MA students my first semester', a user said: 'tenured faculty \"quiet quitting\" think they are sticking it to the administration, but in reality they are just fucking over junior faculty.'",
        "In response to 'Yep, thats my situation, it's a miserable work atmosphere. They not only bail on all service, but refuse to do research or accreditation duties they are contractually required to do. Some literally get 50% of their contract to do research and service, and never show up. Im dumbfounded upper admin wont intervene and also refuse to pick up their slack. Its a dumpster fire.\nWe even had 5 assistant profs leave 1 tenure track job (in a row), and upper admin never did a FK'ing thing.', a user said: 'My first tenure track job, we had this full professor. He was Cesar Chavez in his own mind, always acting as if he was standing up for faculty against the administration.\nBecause he had reached full before 2008, and therefore had had a whole career of annual raises (as opposed to the salary freezes of the 08 and later crisis years) he made substantially more than anyone else in the department.\nAlong with other tenured faculty, he led the charge to give priority to tenured faculty for summer teaching, and to make summer teaching a percentage of annual salary (rather than a flat amount). My summers were for research, so it didn't affect me, but the lecturers were royally screwed, getting fewer classes and being paid less by class.\nAlso in the vein of claiming to defend faculty against administration, he'd reject most service committees (or simply didn't show up), would go months without answering emails from advisees.\nFunny thing, when the junior faculty had to spend a week after the semester was over getting the assessment data for accreditation together, it wasn't admin doing that work. When the junior faculty were swamped by having to advise twice the normal load, it wasn't admin doing that work.\nI left almost ten years ago, and they haven't been able to keep an assistant professor around for more than 2 years since.'",
        "In response to 'Because I did it for 8 years, I did expect to continue doing it. I never counted on it for the household budget, but it was lots of savings and extras.', a user said: 'What was the \"poor thinking\" that led to the loss of the summer class?\nWas it just fewer summer classes taught overall? Or did they assign summer teaching differently?'",
        "In response to 'Original Post: Can we talk about quiet quitting again? Hi,\nI’m a middle-aged associate professor in the humanities at a private university that is thriving as far as these things go. I used to be quite active on this sub, and it helped me both through and past a long period of burnout in 2021–23. Due to some poor thinking and carelessness on the part of administrators, my salary declined last year because I didn’t get as much summer teaching. Downloading my W2 this past week and seeing the impact has kinda wrecked me. I can’t believe at my career stage I earned less in 2024 than in 2023.\nMy immediate reaction is “they pretend to pay me and I’ll pretend to work.” So I’d like to stop saying “yes” to service requests, pushing scholarship through conference presentations to publications, and freeze development on my pedagogy. The issue is that if I pull back from giving a full effort, none of the people who caused this—my unit-level head, staff and admin in the budget office, the senior leadership of the school, and the finance-bro board of trustees—will even notice. But people who have done me no wrong—my students, my colleagues, my department chair—would be impacted. They’d have to pick up my slack, rope others into doing what I currently volunteer to do, get less interaction with their instructor, etc.\nI know this issue has been raised a million times, but please indulge me: what’s the appropriate response to falling salary when for personal and profession reasons switching institutions isn’t an option? How do you frame a decision to pull back to colleagues or chairs you respect?', a user said: 'Associate professor here as well.\nAs you very well know, any service you don't do is service someone else will have to. Telling your colleagues you don't want to do service because you didn't get as much summer teaching as you'd like probably would not go over well for you.\nThe unfortunate reality here is that absent an external offer, or intention to quit, you don't have any leverage.'",
        "In response to 'Orrrr....hear me out.... ALL professors (or at least tenured ones) stop letting administrators trample you by ceasing all service', a user said: 'If that is your goal, join a union, join the AAUP, vote no confidence in the faculty senate. You know, the opposite of the \"quiet\" part.\nTenured faculty saying no to their share of service does absolutely nothing to administration, just transfers it to the non-tenured faculty.\nPeople can downvote me all they want. But I've been the junior faculty at the university where all the tenured faculty refused to do service and then fought to take over the summer classes from non-tenure track faculty. Nothing like being the assistant professor having to single handedly handle accreditation because tenured faculty didn't care. Nothing like watching lecturers making 40k a year not being able to teach summers because faculty making 100k wanted a little bit more for their retirement.\nYou want to fight administration, then use that damn tenure for something and actually fight the administration. The \"quiet\" part of \"quiet quitting\" just means that your punching down at the folks without tenure.'",
        "In response to 'Yes, believe it or not it is my goal to be treated with dignity and respect. For the 10 years I invested in my education to pay off with a job that values their employees.\nAlso, my personal experience at a state school in a blue state showed me that some unions are completely usesless and can even make the conditions worse. My experience at that school was that the only people who stuck around long-term didn't depend on their paycheck the way I did (spouses earn much more, they're single, family money, etc). As a result, few people paid attention to important administrative/board issues, and thus no chance for change.', a user said: 'Fine, don't join a union then. As a TENURED faculty member you can use that tenure in different ways. On one hand, you can use it to speak up against the administration. On the other, you can just transfer all that service to people who invested just as much in their education. If you choose to do the latter, at least own up to it instead of acting like its a blow against the administration.'"
    ]
}