{
    "username": "jdsciguy",
    "contributions": [
        "In response to 'Original Post: It's NOT \"quiet quitting!!!\" \"Working your contract,\" \"working to rule\" and \"acting your wage\" are all MUCH better terms. Why would you use the word \"quit\" to describe you adhering to your contract and doing your job? It has nothing but negative connotations AND denotation.\nI highly encourage everyone here to lose that term. We're working our contracts. We're not quitting anything. Some may STOP giving away their physical and/or emotional labor, but that's not the same as quitting!\nEdit: For those of you saying \"It's called 'doing our job'\" The implications of teachers \"just doing our job\" are:  volunteering for events, grading/planning at home, taking over other  peoples' responsibilities, adding more to your plate every year, etc...  Admin considers this \"just doing your job.\"', a user said: '\"Working to rule\" has a negative connotation associated with work slowdowns. Teachers aren't slowing anything down, they are merely asserting a healthy work-life balance. Some work things have to give, but teachers are still working their asses off - - at work.'",
        "In response to 'The term \"quiet quitting\" isn't used consistently in the media . . . and teenagers are notorious for taking something out of context anyway . . .\nWhat \"quiet quitting\" (as I understand it) doesn't mean to do the minimum at your job, but rather not to overdo things . . . not to give yourself over to your work completely. Don't work overtime, don't stress about deadlines and obstacles you have no control over. Just do your job, within your 40 hours. If you are a teacher, that would mean no longer coming in early, staying late, working at home, spending your own money on the classroom . . .\nFor a student to \"quiet quit\" . . . if they were serious about it, it might mean not doing homework, or not pushing for that \"A\", just showing up and doing what you can during the school day.\nNot doing any work at all isn't quiet quitting, it's just quitting. And there's a lot more of that going around these days then there used to be . . . .', a user said: 'If I may make a suggestion to The Youths, \"I'm here to pass not bust my ass\".'"
    ]
}