{
    "username": "Jerking_From_Home",
    "contributions": [
        "In response to 'Original Post: OMFG. What?!? So regular working is \"quiet quitting\" now? [External Link]: https://i.redd.it/0xvxv41m8axc1.png', a user said: 'Well we all know no matter how much you do it’s never enough.  Management doesn’t want you to feel like you’re doing enough, they always want MORE.  Employees who feel like they are doing enough don’t strive to do MORE.  So the company has everyone on an endless cycle of increasing expectations.\nThink about any performance review you’ve ever had.  They never give you good scores in every category, they always pick a couple that “need improvement”.  Miss two days of work that year?  Needs improvement.  Pick up a couple days of overtime a month?  You could pick up one or two more.  Good employees get an overall score just a little above average to keep their morale up, but also to give the illusion that if they work harder their score (and raise) will be even higher next year.  Then it’s really not.  Average employees get a score a little below average to push them to get an “average” score next year.  Employees that don’t sell their soul to the company get a terrible score to put the fear of god into them that they’ll be fired if they don’t start busting their ass as hard as they can.\nThings like sales goals that continue to increase every year.  “We sold 50,000 widgets last year, surely we can sell 60,000 this year!” even though selling 50,000 involved mandatory overtime.\nStretch goals that are beyond the normal goals.  “We want you to exceed the usual target of course, but get as close to the stretch goals as you can!”'",
        "In response to 'It again makes it sound like something different.  We need to normalise doing what you are paid to do, and not doing what you are not paid to do.', a user said: 'Exactly.  OP is now doing the job that’s listed in their job description and what the company is paying them to do.  That’s it.'",
        "In response to 'Not even. This is a capitalist system. The goal of workers and labor in a capitalist system should be to do as little as absolutely possible while maximizing income.  To do anything else is anti-capitalist.\nYou want as much money as possible for as little work as possible.', a user said: 'Good point'",
        "In response to '[Deleted or Empty Comment]', a user said: '“How dare they only do what their job description entails?  Why won’t they do more work for the same amount of money?  I just don’t get it!”\n-companies'"
    ]
}