{
    "username": "jersan",
    "contributions": [
        "In response to 'Completely agree.  Even when you get promotions, or make a jump in salary, obtaining things that were once very accessible to the middle class is now next to impossible.  There's no point in killing yourself at work if all of the reasons for doing so have completely evaporated.\nI'm glad\nu/Feta__Cheese\nbrought up lying flat.  I prefer the term vs \"quiet quitting\", as people are still showing up to work and doing their jobs.  They just aren't grinding themselves into dust for incentives that do nothing to advance their quality of life.', a user said: 'we are embracing the way of Peter Gibbons from Office Space, putting in just enough effort to not get fired.\n​\n​\nPeter:  The thing is Bob, it's not that I'm lazy.  It's that I just don't care.\nBob:  Don't... don't care?\nPeter:  It's a problem of motivation, alright?  Now, if I work my ass off and Initech ships a few extra units, I don't see another dime.  So where's the motivation? And here's something else Bob.  I have eight difference bosses right now.\nBob:  I beg your pardon?\nPeter:  Eight bosses.\nBob:  Eight?\nPeter:  Eight, Bob.  So that means, that when I make a mistake, I have eight different people coming by to tell me about it.  That's my only real motivation is not to be hassled.  That and the fear of losing my job, but you know Bob, that'll only make someone work just hard enough to not get fired.'",
        "In response to 'I always felt bad for the two bobs. They're not actually a villain or an antagonist, they're stuck just like Peter is. They can make all the recommendations they want but the actual management will never go for them because it cuts into their personal profits and beliefs.\nThe bobs\nclearly\nsee the problem when the eight bosses are mentioned, you can see it in their face, they way they sit up in disbelief at the top-heavy middle management. The company's culture and management is rotten and they're being brought in by some overpaid schmuck to flatter them and make it seem like its the lower employees fault.\nSo the bobs are stuck clinging to the low-effort 'easy' answers like stock options. That's most likely to be acceptable and keep them from being fired and given a bad rep as consultants. It won't cost the company a dime because its basically giving out fun bucks as far as the board is concerned in the short term. Hell they'll probably put some clause in that quitting before x-years (as opposed to being let go) is grounds to void your options.\nit's all half-assed in the end\n.\nPeter understands this and that's why he's fully honest with them. Its more than just wanting to stick the finger to the company, it's venting to people also stuck in the bullshit rat race. Just like he was honest with the waitress.\nIsn't that movie great?', a user said: 'thanks for the perspective.  Yes, it really is a good movie.  I enjoy Mike Judge's work, he is very skilled at criticizing american culture and human nature in hilarious ways.'"
    ]
}