{
    "username": "jess3114",
    "contributions": [
        "In response to 'This is why I keep saying we need to remove the \"duties as assigned\" as something they can put on jobs.', a user said: 'I say that all the time! That gives them the ability to ask you to do anything!'",
        "In response to 'Original Post: I didn't get the promotion. Should I quit or quiet quit? A few months ago everyone in my team was let go apart from me. I was then told I could apply for my old manager's role. I applied but have now been told I didn't get the role and they are going with an external candidate.\nFor these past few months I have basically been doing this promotion role (and have received really good feedback from lots of senior people). I have not gotten a payrise to do all this extra work.\nI want to leave before this candidate starts because I'm tired of giving them essentially cheap labour. I was told if I didn't get this promotion, another role would be made available for me (in the same team), so I would probably have lots of leverage to negotiate a payrise. But I really don't want to have to essentially train this new external candidate who will be making more than double what I earn in the role I didn't get.\nShould I hand in my notice now, do a shitty handover and let the new person flounder? Or should I stay in my role with more money, but be looking for jobs on the side (it could be months and months before I find a good job). If I do immediately quit, I do have savings I could live on for 6+ months (took me years to save this amount).\nWhat would you do? Any advice?', a user said: 'I know this is an old thread, but I'm in a similar situation and looking for strength and inspiration to navigate the next few months. I've been in my position for over six years. I trained the past seven new hires. (Our job is very specific and busy. Usually takes 6 months to really be able to keep up). The company recently went through some leadership changes and as a result, my department's workload doubled. So a new supervisor position was created. I interviewed for it, but assumed it was just a formality. Of course I'd get it. Well I was wrong. It went to one of my coworkers who I trained two years ago. Now she'll be my supervisor. Oh and guess what else... I'll also have to train her replacement. 😮‍💨'",
        "In response to 'I'm sorry this happened to you! My advice would be to start looking for another role ASAP. I looked for another role and found one elsewhere with a higher salary than what I was previously on. It was the push I needed to leave that godforsaken company. Go where you are valued!!', a user said: 'Thank you. I'm hoping I'll be as lucky as you.'"
    ]
}