{
    "username": "jg_a",
    "contributions": [
        "In response to 'Da har jeg totalt misforstått begrepet. Elendig ordbruk og veldig lite beskrivende.', a user said: 'Tittelen på begrepet er jo satt av arbeidsgiversiden i USA. De som er imot at folk ikke skal jobbe gratis for bedriften utenfor normal arbeidstid. Legg også til et par PR-stunt om å få det begrepet til å feste seg i samfunnet fremfor et bedre passende begrep som \"act your wage\".\nDet at det er misvisende er jo hele poenget. For da tar folk som ikke vet hva det er å reagerer på navnet, ikke hva som faktisk skjer. Og dermed er det færre som vil støtte \"aksjonen\".'",
        "In response to 'Har hørt en del boomers som tror at quiet quitting går ut på at man ikke ønsker å gjøre en innsats på jobben lenger. Quiet quitting er jo bare at man setter en sunn grense mellom jobb og fritid, og at man ikke jobber gratis. Man kan fremdeles gjøre en utmerket innsats når man er på jobb.', a user said: 'Det er jo nesten som om de som lagde navnet på \"aksjonen\" ikke ønsket at folk skulle holde med aksjonen!'",
        "In response to 'Føler det er misforståelser om selve begrepet her.\nSåvidt jeg har skjønt, betyr \"quiet quitting\" at man har dårlig arbeidsmoral med vilje, f.eks. fordi man hater jobber sin, har null ambisjoner, eller har gitt opp \"karrieren\".\nAt man ikke gidder og jobbe gratis er jo noe helt annet...', a user said: 'Det er det de som navnga begrepet vil du skal tro. Det \"aksjonen\" egentlig er er det vi ville kalt \"act your wage\", men det ønsker jo ikke de amerikanske bedriftseierne og investorene at du skal vite. Bedre at du ser navnet og hater aksjonen, enn at du faktisk støtter dem.'",
        "In response to 'Poenget er at om vi skal ta inn et begrep på dette så er det bedre å bruke \"act your wage\" i stedet for negativt ladet og big corpa pusha \"quiet quitting\", som fort kan tolkes begge veier og skape konflikt og misforståelser fremfor å samles om at å jobbe ulønnet er bullshit.\nOg skal sies at du tilogmed bruker norsk ekvivalent \"ikke gjør mer enn du får betalt for å gjøre\" i forklaringen din på hvorfor vi skal \"quiet quitte\"..', a user said: 'Hele poenget med navnet på begrepet er jo akkurat at det skal være misvisende. Det ødelegger for at flere nettopp skal støtte den bare pga de hører navnet og tolker det derifra.\nVi kan fint bruke \"act your wage\", men det var ikke arbeidersiden som opprettet navnet \"quiet quitting\". Dermed er det også forventet at de som navna den vil forsette å bruke sitt navn på begrepet. Og da er vi egentlig like langt.'"
    ]
}