{
    "username": "jimbo831",
    "contributions": [
        "In response to 'She's a low-to-mid charisma coastal lawyer bureaucrat who skipped straight to Washington insider without any voter approval at any point in the process. I know we like to pretend it's all racism and sexism (which don't help), but I saw her bomb speaking in a room full of African-American women--lead balloon reception compared to Booker, Klobuchar, Buttigieg, every other candidate, etc... None of those people would be my first pick and they still massively outperformed her in an environment we can't make any of the usual excuses. Every time my friends in the rustbelt watched her in ads or speeches, I'd hear words like \"condescending\" and \"lecturing\". And this is from mostly apolitical people who lean Dem.\nShe'd be 64 in 2028 (she's only a little younger than Obama now and he ran 16 years ago) campaigning to be a 72-year-old president at a time everyone is sick of retirees running national politics. It's like she combines the worst traits of Al Gore, John Kerry, and Hillary Clinton. This is not the sort of candidate we have\never\nwon with even before we forced her down people's throats without giving them any say.\nAnyone thinking she ever had it never had their finger on the pulse. Anyone seriously suggesting we run her again should never try to offer political advice except on opposite day.', a user said: 'everyone is sick of retirees running national politics\nAre they, though? I know they say they are, but if you look at the people they vote for over and over and over again, I don't believe them.\nI don't disagree with your overall point. Harris should absolutely not run for President again, and I think we need younger leadership. But despite what they say, I prefer to look at what voters actually vote for.'",
        "In response to 'Considering the typical track record of California Democrats, I would expect it would be about the same.', a user said: 'Yeah, let's not pretend like California Democrats are actually doing anything. California is about to lost multiple seats in Congress because they refuse to build housing.'"
    ]
}