{
    "username": "joefabeetz",
    "contributions": [
        "In response to '[Deleted or Empty Comment]', a user said: 'Even better - for discharges it’s due at the moment of the termination (including all accruals) and it’s one day’s pay for each day thereafter. See CA Labor Section Code 203.\nThe 72 hours thing is just for if you give quit without notice (or layoffs if seasonal ag work)\nhttps://www.dir.ca.gov/dlse/faq_paydays.htm'",
        "In response to 'OP did... quit... without (2 weeks) notice...', a user said: 'Sorry, can’t find original post. Right - if the employee resigns without 72 hours notice then yes that period is in effect. If it’s “quiet quitting” and the employment is separated by the employer (i.e. termination) then it is due immediately. I see in their post history there are 7 late checks from previous pay periods — there are penalties due for that too in CA with a 1-year statute of limitations and it’s very easy to file all these with your local DLSE office\nhttps://www.dir.ca.gov/dlse/Late-Payment-of-Wages.htm'",
        "In response to 'But if the employer does not pay your salary on time, would that not be a valid reason to withhold your labour until such a time that you get paid?', a user said: 'No. Withholding labor is an extremely effective tactic when done as a group and under certain circumstances (most specifically when the labor performed is hard to replace because it’s highly specialized, there’s a shortage of other workers in that field, or otherwise). However withholding labor as an individual is never protected activity under NLRA sec. 7a (because the definition of “concerted activity” is two or more employees). Furthermore for union-represented employees to withhold labor and be protected in doing so the union must file an Unfair Labor Practice charge - then you cannot be replaced or disciplined. Without a ULP strike you would need to make sure it can’t be called a no-call-no-show or insubordination.\nE: however, yes if a group of workers filed a ULP and struck in response to this issue — for example alleging that the withholding of checks to one or more employees was in retaliation for union activity — then yes it would be protected under NLRA sec. 7'",
        "In response to 'Still a joke, given the impact on the employee', a user said: 'I agree - however for us in the USA it’s much stronger than any other state as far as I know (maybe NY or a rust belt state could be comparable). Very exploitative labor market as we all know. CA significant tho as change driver bc it’s 15% of population and culturally prominent. Shout out Julie Su, current US Sec of Labor who used to run CA dept and got her start busting human traffickers of garment workers.'",
        "In response to 'Does the employee get that money or does the government?', a user said: 'All penalties are paid to the employee (e.g. not being paid at time of discharge, late checks, or penalty pay for missed breaks and lunch which is a very popular/common area of worker enforcement in healthcare recent years). I do not believe any of them are subject to taxes though some may be reportable as income during a tax year.'",
        "In response to 'All penalties are paid to the employee (e.g. not being paid at time of discharge, late checks, or penalty pay for missed breaks and lunch which is a very popular/common area of worker enforcement in healthcare recent years). I do not believe any of them are subject to taxes though some may be reportable as income during a tax year.', a user said: 'Separate topic and again CA-specific, but I should add that penalty pay for missed breaks is a potential gold mine for folks getting squeezed. It’s one hour of pay for any missed break - either the paid rest and/or the unpaid lunch break. Don’t sign a waiver giving those up! File one or two and watch management ensure everyone gets their breaks from then on.'",
        "In response to 'You may know this offhand, can a bank directly send your paycheck to collections without warning you of garnishment or collections then mail you the remainder in a separate check? PA btw\n     Edited: answered, thanks fellas, can always count on you!', a user said: 'Good question and I do not. But I suspect they can if they attempt to warn you, even if they don’t have confirmation you received it. I know the IRS can.'"
    ]
}