{
    "username": "jolahvad",
    "contributions": [
        "In response to 'Yea even older millennials were in a nice spot, but middle to younger were screwed along with everyone else below them.\nThe whole 2010s was a mess of underreported inflation and too quickly increasing property prices.\nYounger millennials watched properties go up so much faster than their shit wages, while they’d go home and parents tell them their wages are good and they should be thankful to watch prices rise faster than their wages.', a user said: 'Uhm no. Older millennials graduated college after the dot com bubble burst. There was no work. Then we went to graduate school. Then the GFC happened.\nAbsolutely refute this notion that older millennials had it easier.'",
        "In response to 'Yup.  Older Millennials were the ones who started college right when the prices started skyrocketing and graduated right when the recession started.  The lucky ones who got jobs were either soon laid off or were working for 1/2 of what they should have been making.\nThey had a long time recovering too.  Even when the economy recovered, they had graduated 5-8 years before, so when they were trying for those entry level jobs, they were up against people who had just graduated universities, so of course, they looked better on paper.', a user said: 'Yep, graduated high school in 98 and my inner circle for the most part never caught up wage wise.'",
        "In response to 'Same, I graduated in 99.  I'm friends with people from early 40s down to late 20s, and the people who graduated college right into that recession have never recovered.\nThe biggest problem I see is that TONS of them were never able to get a job in their field. By the time we were out of the recession, they had been out of college for like 8 years.  When they went for those entry level jobs that were finally available, they were snapped up by recent grads.  So we have people with biology degrees working as line-cooks and security guards well into their 40s.', a user said: 'Exactly!!! I was sitting in my first real finance class in 2008 (I did my bachelors later) and my first day in the class the professor walked out and opened with “I hope you all plan on getting your MBAs because there won’t be any jobs” and yeah… that’s how it went.\nEven if you had a decent job you were saddled with so much debt to get the degree you couldn’t save for a house unless you had some help. That’s the reality.'"
    ]
}