{
    "username": "jrrybock",
    "contributions": [
        "In response to 'Original Post: Quiet quitting got me a bonus and a 15% raise I work from home and stopped trying about a year ago. I do monthly closing entries (10 hours of work), but other than that, I hardly do anything. I take my time responding to emails, decline meetings I don't have to join, etc. Since we were acquired and there's been turnover in management, my boss doesn't know what my job involves, and is also weirdly-averse to delegation (workaholic type), so I don't get assigned to anything.  Since I'm just chilling all day with my dog, I'm holding out here until they replace me or until kids come along, maybe in another year.\nWell my boss called me up today to tell me I'm doing a \"great job\". We exceeded targets, so I'm getting 2x my bonus (20k, target was 10k), and a 15% raise (100k to 115k).  Que sera, sera..', a user said: 'Good for you!\nI'm not an accountant, but it reminds me of one tale from early on in my career.... I am a cook (chef now), and had an a-hole sous chef. It was a shit night, dishwasher didn't show, prep didn't do the work they should have... it was frustrating all over the place, and when I brought it up to the sous, he was very dismissive. So, we're mid-service, I have a stove with 8 burners and cooking all my stuff, but I'm pissed, so am leaning back against my table - back to the sous chef expediting - and kind of stewing. But I'm doing my job. He yells out, \"Hey, John! Turn around and look like you care!\"\nSo, I turn off all my burners, turn around, and say \"I don't\" and walked out. I went to the bar around the corner I'd usually get a post-work pint, but this was about 7:45pm... bartender says, \"you look like you just finished your last exam\" (we were in a college town). I said, \"No, I think I just quit my job.\" I have several pints before getting home, and this was mid-90s, so there was a tape answering machine, and the chef left me a message, \"John, it's Jo, call me back\". Well, I was a bit pissed... in either sense of the term, so I just went to bed.\nI woke up in the morning, put on my nicest clothes because I intended to knock on doors for a new job. But first, out of respect for the chef (who I love to this day), I stopped by to apologize for walking out.\nShe said the sous called her immediately and his first words were \"Chef, I fucked up\". And she didn't blame me.\nNow, self-aggrandizing shit or whatever you want to call it that I was, I asked, \"but what will my punishment be\". She said none. I actually argued that, saying we just had two new hires, we can't let them think my behavior was proper. Ed, the GM, was our for the weekend, so she said she'd touch base with him when he came back. I worked the weekend.\nSo, Monday comes, and I ask if she spoke with Ed, and she said \"yes, and he agrees there shouldn't be any punishment.\" For whatever reason, I said, \"I just don't want to set a bad example to the new cooks.\" So, she asked me, \"well, is there a day you want to be suspended?\" And I was scheduled 6 days that week, so I said, \"Honestly, I could use Wednesday off.\" And she said, \"OK, you're suspended on Wednesday.\"\nSo, no raise or bonus, but doing something I still think was wrong of me, I did get a day off of my choice.'"
    ]
}