{
    "username": "JSA607",
    "contributions": [
        "In response to 'I keep seeing this over and over but can someone ELI5 me why won't judges in SF convict? What is the reasoning behind this?', a user said: 'Can’t convict if police don’t do their job and find evidence and if DAs don’t prosecute. About 5% of cases only ever go to trial.'",
        "In response to 'But I'm seeing that police aren't bothering to do their jobs because judges aren't convicting...so seems like it's some sort of endless loop?', a user said: 'I do not think the bit about the judges is true'",
        "In response to 'It’s not… it’s just a bs excuse.  they wanna beat up and arrest jaywalking women but can’t be bothered to arrest these folks? Cmon…', a user said: 'I just read (on SFGate I think) that we have cops long-commuting in from as far away as Texas and Arkansas?! That is simply terrifying. They hop a plane and come beat up the pansy lib’rals?! Collect $200,000 and go home?! I know a lot of our police officers don’t live in SF but out-of-state?!'",
        "In response to 'Very few cases go to trial because the overwhelming majority of criminal defendants plead guilty, not because prosecutors drop charges', a user said: 'I did not mean to imply that. I guess I was pretty unclear.'",
        "In response to 'Original Post: My cousin is SFPD and has the same take on the bikers. Are we basically just paying them 3/4 $billion a year to cry and quiet quit? [External Link]: https://i.redd.it/uhdkr8xy39ld1.jpeg', a user said: 'Isn’t it striking that now that the election is near, suddenly SFPD are stopping side shows?!'",
        "In response to 'What’s wild is everyone seems to have an issue with crime but they keep electing the same criminal loving judges. Maybe, just maybe, the next time a superior court judge is up for election you vote for any of the other candidates', a user said: 'It’s not the judges, or even the DAs. If the police won’t arrest or find evidence, the DAs can’t do anything. Police stopped working when Boudin was elected. It was a striking difference. They got tired of being called out for killing innocent young men, I guess'"
    ]
}