{
    "username": "JSmith666",
    "contributions": [
        "In response to 'Gen Z is also quiet quitting because they are\nable\nto quiet quit, which is a result of two factors that were less relevant to millennials: (1) a higher proportion of 'abstract' roles without measurable production metrics; (2) a tighter labor market, with relatively more leverage available to the workforce in terms of lateral opportunity.', a user said: 'a higher proportion of 'abstract' roles without measurable production metrics\nWouldn't this make it more difficult to quiet quit? Harder to say \"not my job\" when your job is more loosely defined. If you job is X a lot easier to say if you did or did not do X. If your job is \"in the neighborhood of X\" and you dont do W or Y...could be argued you arent doing your job'",
        "In response to '[Deleted or Empty Comment]', a user said: 'In Scenario one they either did or didnt load the trucks. If the job is load 2000 units and there happens to be an extra unit. Easy to say 'my job is load 2000 units' Loading 1950 isnt quiet quitting. Its failing to do even the basic requirements of your job.\nScenario two make customers happy. Depending what the main job functions are there are tangential functions that could have made customers happy. i.e you work the front desk of a hotel...there is a spill that a customer got annoyed about.\nNot part of your main functions to clean that spill but could be argued as part of the make customers happy it would be.\nI think when its loosely defined the knife cuts both ways. Its easier to say it isnt your job if you want to quiet quit but the employer also can more easily say it is if they want to fire or reprimand you.'",
        "In response to 'Original Post: Gen Z is quiet quitting because we've seen millennials suffer through economic hardship. Companies can't sell us a pipe dream. [External Link]: https://www.businessinsider.com/gen-z-quiet-quitting-work-ethic-millennials-money-struggles-2023-10', a user said: 'Once Gen Z becomes a larger portion of the workforce...people who do go above and beyond are going to have it really good.'",
        "In response to 'I think it will also result in Gen Z living longer with their parents and increasing the amount of multi-generational households and help with home affordability.', a user said: 'Assuming the parents put up with it. They are the children of younger boomers and gen x so its really hard to say how that dynamic will play out. Its like the Boomers bitching about millenials while also being the ones who raised millenials and allowed them to do the shit they bitch about.'"
    ]
}