{
    "username": "junie2000",
    "contributions": [
        "Robyn's been quiet quitting for yrs. I've just listened to Ace and Katelyn's pod and they hit the nail on the head about Robyn and Kody's main income coming from the Sisterwives show.\nIt's been annoying me for a while that Robyn's input in the show has slowly been regressing each season. She gives less and less every season. They won't even let the crew in the house now.\nShe has been quiet quitting the show for years. Puts in minimal effort because there's no other way she can earn $. Soon she'll just zoom her talking head into production. 😆",
        "In response to 'But isn't that just Robyn? Low effort sister wife. Low effort business owner (mswc). Low effort parenting (thus Mykelti and covid nanny).', a user said: 'True but she has even less input and looks as enthusiastic as I do turning up to work in the last week of my employment before quitting.'",
        "In response to 'This season has been interesting. Seems like Robyn is more present this season but I suspect it’s because she had no choice. After what happened with Garrison I’m sure she panicked and said we have to do something to not look bad. Hence the scenes we’ve gotten like her telling Kody go be with your other kids. Only problem is her acting and credibility is so far down the drain she has absolutely no credibility or sympathy.', a user said: 'Like a hostage video. She's forced to provide content'",
        "In response to 'also with the land. the og 3 were paying from their pockets. until christine walk away. kody and robyn are paying from family fund. kody and robyn get 1/2? and they get 1/2? (maybe if not less) plus their 250k in bad art: jewelry galore and guns? the 1.5m dollar home. the new cars. IDK i can't even girl math that right. kody saying i paid for one lot on my own. with family money? no baby you didn't. those trailers are full of failed business... yip, bet they are.', a user said: 'They're just not as good at prioritizing and saving the grocery money like Robyn. 🙄\nShe hates that the viewers dislike her and she's performing under sufferance because now there's only 2 of them bringing in money for her 4 wife income  lifestyle she's become accustomed to.'",
        "In response to 'What if Robyn’s version of putting in effort is so painfully minimal that it just looks like the equivalent of quitting?', a user said: 'She's tired after all the effort of keeping her best customer happy'",
        "In response to 'She was told she was too pretty to do anything.', a user said: 'Ha, diesel model'",
        "In response to 'Sobbyn was full metal effort when she was preaching to the kids and basking in Kody's choice to be with her anytime he could. She happily denied Meri and opportunity to go to college; she gleefully painted Christine and her kids (literally) out of a family portrait with Kody and inserted her own; she made sure Janelle's kids knew that the food in a family owned fridge and the food paid for by the other wives was hers. She happily accepted Kody melting down Meri's wedding ring.', a user said: 'She was showing first year employee effort the first few seasons as she embedded herself as favourite wife.\nShe's now showing long term employee fatigue.'",
        "In response to 'I'm not saying she isn't trying to pull back as much as she can, but they do film in the house. The staged scene about the Tenders wanting to go to church and the Meri coming over a couple of times this season were all inside.\nBut, yes, I do wonder if she wants out. She has long known that the audience widely dislikes her, and it's only gotten worse over the years rather than better. She clearly cares about that, or she wouldn't have argued with people on Twitter about it, trying to get them to understand her.', a user said: 'I'm sure if they had a better steady of income she'd be out. \nShe's shows all the enthusiasm and effort of an employee in their last week of work.'",
        "In response to 'Quiet quitting? No way, dude. She went in knowing she had Kody wrapped around her dick. She never had any intention of anything else.', a user said: 'What I mean is that she's provided less content and with less enthusiasm as the seasons have progressed. \n Watching the earlier seasons she's far more vocal and animated.'",
        "In response to 'Agree with you until this current season. To the point it was annoying that she was allowed to get away with it but .. She’s all over this season. I wonder if production gave a stern talking to ala “film or else” or if they changed how the remuneration works based on air time maybe. Like I think Housewives or “friends of” don’t get paid if they don’t appear.', a user said: 'The family involvement in the show has shrunk since most of the kids have moved away or decided they're not interested in publicising their lives. \nShe's been forced to take on more. Is that why her adult tenders are being pushed forth ? She doesn't have the other wives to carry the load now.'",
        "In response to 'I think alot of this is becuase of the hate,/she cannot win the audience over,espcially since covid,and Christine calling out the nanny situation.\nI think she is \"quiet quitting \"Kody too.She wants to free herself before he gets too old and she gets stuck \"haffing\"to take care of him.\nShe has been taking notes,and planning her financials I actually am not sure how far she would go,but we all saw how Kody cut down that tree,and the fact he works with fire arms is terrifying,just wonder if he ended up in a fatal accident,she would end up with alot more and sympathy too.\nIm just not sure how far she would go,I wouldnt put anything past her but i know she is no longer star struck,she is very much hated much to her surprise.This redemption attemption didnt help,so yeah,she really is giving us the minimum,just keeping the contract,the thing is she calls the shots with production too,by not sharing anything real.\nShe sounds so mumbly in some of her talking segments,like i wonder if her anxiety is so bad she is on a benzo,and maybe she had some clinical anxiety issue she uses to get easy edits.Yeah,I think she is starting to realize all dreams dont come true,and she cant wait to live out of the public eye.', a user said: 'Reality has settled in now'",
        "In response to 'Ace and Katelyn don’t want to be on Reddit! Y’all be nice to them, they’re going through it.\nI haven’t finished today’s (last nights) podcast, but yeah, it does seem like Sobyn’s not been invested in the show. Or the family. Or anything other than junk journals and dolly clothes.\nSplish splash', a user said: 'Nothing but nice comments for them. They watch  so I don't have to. \nI have nothing but eternal gratefulness to all the Sisterwives pods out there.'",
        "In response to 'Prepared for the downvotes but I really don’t get all of the hate for Robyn..', a user said: 'So what don't you get. I'm interested.'"
    ]
}