{
    "username": "JustmyOpinion444",
    "contributions": [
        "In response to 'She's codependent and a fixer and didn't/doesn't want him to be alone.', a user said: 'What she doesn't understand is that he will find another willing partner in short order. If he doesn't already have one waiting in the wings'",
        "In response to 'Can’t stand these older individuals who are so fixated in their ways that they can’t accept change. Super frustrating', a user said: 'I am an older individual who stands with you. WFH rocks. Some people need to be in the office, most of us do not.'",
        "In response to 'What age is older? I'm Gen X, not 50 yet, I haven't worked a traditional schedule in 28 ish years. My schedule was always flexible because I was raising kids and it had to be.\nIt would completely stress me out not having a steady job.  I'm lucky to be in a 2 income household, which has been the only way to live a non-traditional work week, as well as having family helping with child care. We are also not materialistic or live beyond our means.\nMy daughter does gig work, she's lucky to have extremely low rent. She was able to save enough living with us to not work for 2+ years. She no longer has any savings and lives check to check. It's not my business but it makes me sad.\nI think the 'older' people don't understand it. I started working when I was 12. Most people I went to high school with had jobs. We had to work, we had no choice. I was dropped off at the mall by my mother and was told to call her when I had a job. Then she would pick me up.\nInstead of getting frustrated, give us old people some grace and help us understand.\n--no, I have never given her a hard time about working. I worry, but it's none of my business. Not having any financial security in today's climate makes it extra hard to understand. Just my old ass $.02 ✌🏼', a user said: 'I am early Gen-X at 53. I work in local government, and it is the Boomers and cusp Gen-X who are the \"older\" people.'",
        "In response to 'Trust me, as a millenial, and although not in a leadership role, as I prefer to just do things vs work out everyone's bullshit, but if I were I would not care because I'd only care about whether or not the person working under me got the task I assigned them done. Now obviously would I review it? Sure, but so long as their is no obvious deficiency or lack of productivity why tf would I care?\nI deal with this from my higher ups as well, I think both of then would be considered Gen X and yeah whole lots of \"collaboration\" talk being beneficial in person and it's like \"bulllllllllshit. Collaborate just fine remotely. It's bullshit.\"\nSo it isn't just Gen Z that rejects this archaic crap.', a user said: 'Where I work, more collaboration went on over Microsoft Teams in 2020 than had EVER happened in the nearly 2 decades prior.'"
    ]
}