{
    "username": "JustAHippy",
    "contributions": [
        "In response to 'Original Post: I’m quiet quitting my PhD I’m over stressing about it. None of this matters anyway. My experiment failed? It’s on my advisor to think about what I can do to still get this degree. I’m done overachieving and stressing literally ruining my health over this stupid degree that doesn’t matter anyway. Fuck it and fuck academia! I want to do something that makes me happy in the future and it’s clear academia is NOT IT!\nEdit: wow this post popped off. And I feel the need to address some things.\n1. I am not going to sit back and do nothing for the rest of my PhD. I’m going to do the reasonable minimum amount of work necessary to finish my dissertation and no more. Others in my lab are not applying for as many grants or extracurricular positions as I am, and I’m tired of trying to go the extra mile to “look good”. It’s too much.\n2. Some of yall don’t understand what a failed fieldwork experiment looks like. A ton of physical work, far away from home and everyone you know for months, and at the end of the day you get no data. No data cannot be published. And then if you want to try repeating it you need to wait another YEAR for the next season.\n3. Yes I do have some mental and physical health issues that have been exacerbated by doing this PhD, which is why I want to finish it and never look back. I am absolutely burnt out.', a user said: 'You can quit. It’s fine. I quit my PhD the first time around. But I can pretty much promise you that you won’t just stumble into a PhD degree by “quiet quitting”'",
        "In response to '“It’s on my advisor to think about what I can do to still get this degree”.\nI’m going by to plainly tell you that you are responsible and accountable for your own outcomes. If your words are true, your advisor is not only completely absolved, but also every future relationship where you blame your outcome on them. Professional and personal.\nIt’s fair to quit. It’s fair to decide something’s not for you. It’s morally reprehensible to blame that on someone else.', a user said: 'I agree. If OP “quiet quits” a PhD, their advisor will probably take over the experimental design and thought. But, I can almost guarantee will not be focused on making sure OP graduates.'",
        "In response to 'their advisor will probably take over the experimental design and thought\nReally? That seems unlikely. Advisors in my program would just say “okay, leave.” Especially if they are tenured.', a user said: 'If it was a professor who was motivated to publish papers, I could see them taking over. But definitely not true of all professors.'"
    ]
}