{
    "username": "justhisguy-youknow",
    "contributions": [
        "In response to 'It can also get worse as time goes on. Say a business requires X number of tasks done in a year. The team do it well.\nThe next year X is increased. The teams struggle a bit, but it's completed just in the nick of time.\nThe next year X is increased again. The teams start working longer, skipping breaks, but for whatever reason at no point to do they push back, they almost become martyrs, being proud that they've worked to exhaustion, looking down at peers who took their lunches and so on. With the additional hours they've worked they just about manage it.\nThe business doesn't necessarily know about this struggle, all they see is that the target was met again. Guess what happens the next year?', a user said: 'When I started warehouse had 2 people ina company of 15.\nWe are now 55 people and 6.5 people in warehouse , more work and more bigger work. We technically have 8.5 people but 2 are office. And infact its more like 3 people as other are still new and the rest are general support. Hell I'm not doing my actual job and haven't for a long time.\nThe ratio works but we need at least 5 more people to clear what we have as daily churn.'",
        "In response to 'Similar here, we had 12 staff in our dept 5 years ago when I started.\nWorkload has measurably tripled since then.\nWe now have 13 staff, 5 of which are new to replace the 4 that have quit in the last few months.\n\"we've hired more people just like you keep banging on about\".\nNo, dipshit, you hired different people and a temp.\nAnyone need a grounds maintenance op?', a user said: 'I have no standing in my place. I'm the longest running employee almost. I know how it works and yet they don't listen. I don't want to be a manager cause our owner is a prick and expects me on call 24/7. But it's not for trying to get people, the new people are good but it's not like you can just get new people and job done. We estimate 3 months to start 6 months to run and 12 months to be 100% good and self Managed.'"
    ]
}