{
    "username": "justtrashtalk",
    "contributions": [
        "In response to 'Original Post: Is anyone in the process of “quiet quitting”? I’ve been at my job for 9 years. I work in a department where I get swamped daily and have been under staffed since covid. I’m burned the fuck out. I’ve asked management and HR for help to no avail. I dread every day I wake up knowing I have to go to work.\nI’ve tried to pare back my work load myself but my work ethic is too strong to just go in and dog it but now I’m to point where I don’t care. I make great money and the benefits are probably some of the best in the country but I’m not happy at all. I’ve looked at applying other places and have had call backs but I couldn’t pull the trigger and leave.\nI’ve heard of quiet quitting where you just go in and do the bare minimum. Knowing my employer they either won’t bat an eye or they will come to me and wonder why I’m not laying waste to any and all tasks like I used to which would be a mistake on their part as that would piss me off lol. Has anyone done quiet quitting or currently doing that?', a user said: 'quiet quitted my job at the local water two years ago and never looked back. it started out as a dream job (it was my dream job), but eventually I replaced the team, my original boss left, and it turned toxic fast. I was there 7 years, the only reason no one noticed is because the project was at a close AND the owner told me he no longer needed me (told me a year and a half before so I knew how much time I had). fast forward, I am still in recovery from burn out, I was suicidal and needed OUT bad. I'm happy now. I'm happy and working on new things, learning, and in a supportive environment.'",
        "In response to 'Original Post: Guys, did you realize quiet quitting was over?! [External Link]: https://i.redd.it/6357ek17i7w91.png', a user said: 'but also, if you are not happy where you are at, I would jump before the recession hits and the real lay offs start, if you can. I left for a much better company; higher pay, company car, better culture, and bigger company with waaay more projects that urgently need people'"
    ]
}