{
    "username": "just_anotherflyboy",
    "contributions": [
        "In response to 'Not specifically related but I worked in very greedy wide chain thrift store for about a year. They made a big deal about giving us $25 gift cards to a grocery store for thanksgiving. They took it out of our next paycheck.', a user said: 'pretty good idea which chain that is, the ones I'm thinkin' of have an utterly shite reputation for very good reasons.'",
        "In response to 'Not specifically related but I worked in very greedy wide chain thrift store for about a year. They made a big deal about giving us $25 gift cards to a grocery store for thanksgiving. They took it out of our next paycheck.', a user said: 'Sally Ann, I'm guessing.  they've got a well-earned shit reputation.'",
        "In response to 'Also refusing to link to work accounts so that email can be checked or join meetings on days off.', a user said: 'yeah, fuck that noise.  my job refused to give any pay raise at all, so I strictly worked to rule.  fiver minutes after, my ass is gone for the night.  never did give them mofos my cell number, oh hell no.  not on a bet.  not for all the money in Vegas.  they can kiss my hairy old arse.'",
        "In response to 'Having a work life balance is a problem to these employers. If you aren't crying yourself to sleep at night stressing about work, they think you are a problem. The capitalists can get fucked as far as I'm concerned. I am not doing extra work for no extra pay. Fuck you, Pay Me needs to be the mantra of Gen Z if this shit is ever going to change because us Millennials dropped the ball and let the Boomers fuck us real good because most of us didn't realize our parents set us up to fail until it was too late.', a user said: 'even a bunch of us boomers didn't stop the arsehole boomers from fucking us all over.  busted my balls my whole life, got jack shit to show for it.  well, we own our house, but it's old and smol, wouldn't sell for anywhere near enuff to buy elsewhere, we only managed to pay it off at all cos it was cheap.  but pensions?  not a fuckin' dime, only my Social Security and Medicare.  thank you FDR and LBJ.'",
        "In response to 'True loyalty deserves true loyalty.  Most employers are not truly loyal to their employees, yet expect true loyalty from them.  They try to fake loyalty and call employees \"associates\" or \"family\", but nobody is fooled.  It is rather insulting, really.', a user said: 'or, like my last job, endless bullshit emails about what a great team we are, but never so much as a penny in raises, ever, even after 6 fucking years.  so fuck 'em.  I hit 65 and I fucking dropped the entire fucking rat race in the garbage.\nI make more now sitting on my ass than I made working 60+ hours a week.  plus, no more heartburn and a lot less insomnia.  and I no longer utterly hate the entire world, just the fuckheads I used to work for.'"
    ]
}