{
    "username": "justasianenough",
    "contributions": [
        "In response to 'Original Post: Quiet Quitting: What is it Really? Quiet quitting is a confusing term to me, but maybe I just don’t understand it. I have rarely ever given 120% to a job… maybe when I was fresh out of college when I had that mindset. But the years have jaded me. What people call “quiet quitting” (doing the minimum) is what I just call doing my job lol. It’s not like I refuse when they ask me to do more work (tho rarely do they ask), but I don’t SEEK more work out unless I’m just bored. For example, in my work, we work in Sprints and get assigned stories to do for those sprints. I just do those stories — not more or less — unless I’m just bored and have finished my stories weeks in advance, then I may grab a story for the next Sprint. I get paid by the hour so no work means no pay. But it’s not like I can ADD more stories to the current Sprint because someone else still needs to test them and THEY may not have capacity. So, a lot of times I just do things around the house since there always seems to be something to do at home. Have I been quiet quitting for years and just didn’t know it or is doing the minimum not really what quiet quitting is all about?', a user said: 'I think I quietly quit my job (I’m actually in the last week of work at my current company) but I took it to mean slowly pushing responsibilities off to coworkers/refusing new projects.\nI knew I was leaving for over a month but only wanted to give my two weeks because I had a week off scheduled and if I put in that I was leaving my vacation days would have been cancelled by my boss. As soon as I was signed with the other company I stopped doing revisions to a project and let my teammates handle them. Then I stopped handling samples. Then I stopped taking new projects by saying I was going on vacation and with our typical 2 week turn around I wouldn’t be here for the second half of the project so I’d handle finishing out other projects/revisions…that I had already passed to other people. Finally put in my two weeks and have had next to nothing to work on because I’m supposed to be “finishing out any ongoing projects” but I already finished most things so I’m really just answering a few emails and making sure other people have all the stuff they need for when I’m officially done.'",
        "In response to 'Now this makes sense. I hate the “new definition” because it makes it feel like doing the minimum for your job is somehow a bad thing', a user said: 'I think it’s doing the minimum and trying to do even less. Like do the minimum and still try to pass your work to others or let things slide.'"
    ]
}