{
    "username": "JWTom",
    "contributions": [
        "Is Quiet Quitting now a thing for Jehovah's Witnesses? So many posts here related to Memorial Season for the Jehovah's Witnesses Organization make me feel like many \"active\" JWs are simply engaging in Quiet Quitting. These JWs are not DA, DF'D or PIMO even but they are just doing less....not showing up for in-person activity....not very engaged as a JW anymore. It is great to see this and the growth of this EXJW Sub too.\nReally the most effective thing that can be done to damage the harmful Jehovah's Witness Organization is to simply stop supporting it with your time or energy. Stop volunteering, stop showing up at as many meetings, stop participating if you can.",
        "In response to 'Again, 💯!\nAdults (not children because they often really don't have a choice), often complain that they are helpless.  They have to comply for this or that reason. In their perception, these reasons are valid - perception is reality.\nHowever, the reality actually is that the more people stand up for what they believe in, and stop getting bullied into supporting what they don't, the faster and harder the WT corporation would crumble to its own peril. It's a sad case of people unwittingly breathing life into the monster they detest.', a user said: 'Well said......if you have no volunteers to run a volunteer organization.....they you are no longer running a volunteer organization.'",
        "In response to '....stop donating!', a user said: 'stop donating!\nI agree! I stopped long ago.\nI say stop volunteering or giving your time as the quickest way to make an impact since this is immediate. A lack of willing volunteers to provide free labor would crush the Jehovah's Witness organization. A lack of volunteers (especially males) is kryptonite for JWs as they would not be able to operate congregations.\nI believe that even if 100% of donations stopped tomorrow.....the Watchtower Corporations have a large enough war chest of funds to keep things running for years.\nBut at some point....an organization with no people working.....is no longer an organization.'",
        "In response to 'My friend who’s PIMR (relaxed), was crying the other day about they don’t enjoy being around witnesses anymore. They felt bad about the fact that they don’t enjoy meetings, memorial, assembly.\nThey know that I’m PIMO, about to be POMO. They do just about everything that I do even though they still believe. Maybe it will catch on to them that they’re wasting their life in the org. It’s clear being in the hamster wheel is not doing them any good, but they just need “something to believe in”.', a user said: 'was crying the other day about they don’t enjoy being around witnesses anymore\nInteresting comment and thanks for sharing that. Me and the PIMI spouse have talked about this for a really long time now. Basically, that many of the JW relationships we have are very shallow and the people that we can choose as friends in JW Land have so many problems that is difficult to really be friends with anyone.\nJWs are either taking depression medication, alcoholics, mentally unstable or in many cases trying to survive while basically living in poverty. How are you going to develop close friendships if the people you are picking from have an endless number of problems.'",
        "In response to 'I think it's different from fading because they still belive they just do not dedicate themselves to it like they used to.', a user said: 'just do not dedicate themselves to it like they used to.\nYeah, this is kind of the point I am making.'",
        "In response to 'What I don’t understand is that they say they are growing. But in my area they are shutting down and combining kingdom halls, because congregations are so small.', a user said: 'Interesting and thanks for sharing that. Do you mind sharing what part of the world you are in? Just curious where this is happening. It is also happening in some of the less populated areas of the central US.'",
        "In response to 'Tennessee. My grandma who is in her 80s drives 90ish miles round trip to her closest KH now that they sold off the one in her town.', a user said: 'Okay, very interesting. Also happening in other areas of the central US as I have family scattered about and hear the same.'"
    ]
}