{
    "username": "Ka_aha_koa_nanenane",
    "contributions": [
        "In response to 'Thank you. I have already done some work on myself but I definitely have a ways to go. I've intentionally lost a lot of weight -and definitely have gotten some looks and door openings from the opposite sex as of late (as if I would want to touch another male with a ten foot pole), gotten more active, and got treatment for my anxiety. Once people started telling me how pleasant I was after the anxiety treatment it started to put into perspective that maybe I'm not so awful. I'm going to start doing even more of the things I want to do like puppy training class, attend  community events, etc.', a user said: 'I had the ten foot pole mentality too - for a while. After I actually left, things got interesting.'",
        "In response to 'Probably a while, I'm kinda the type of person that brings meals to people if I found out they had a baby so it will take some time for me to truly be selfish.', a user said: 'You obviously do not want to be a selfish person. Setting boundaries with your annoying (and apparently not-so-loving) spouse is not selfishness. You don't have to have the same boundaries with everyone.\nKeep being a good friend to people!'",
        "In response to 'Your husband is an ass and your expectations of added responsibility would be equally or at least partial shared is not unreasonable. Schedules change. A puppy was brought into the family....this wasn't sprung on him. It's not a surprise. He just wants the fun parts without all the work. I'm curious as to how long it take him to notice you have clocked out.', a user said: 'To me, he sounds very checked out, himself, and the puppy thing was like a litmus test.'",
        "In response to 'I did the quiet quit and things just got worse. When I started standing up to him is when it got tolerable, as weird as that sounds. I can’t leave, I have no way out. No friends, family, resources etc and of course there’s trauma bonding, a gift from my childhood.\nWe got 3 puppies and 2 years later they are the major reason I stay…no where to go with 2 dogs and I’m not leaving them as I’m too attached. I love them but they were a big mistake. But they’re also the only reason I get up some days.\nJust wanted you to know you’re not alone. You do whatever coping method you need. For me, there is only one way, to leave. I just haven’t been able to figure it out yet. But now I stand up for myself more.', a user said: 'Yep, same here (details in another post). During that phase, we moved again - and we moved close to my family, so that the quiet quitting could eventually become actual separation. Moving in with my parents was going to be hell on earth, as well, but I did do it - as the relationship deteriorated further. It got really bad. We also had a dog and a cat, who initially stayed behind because my parents wouldn't allow them at the house. It was terrible. He moved out of the house himself (leaving the animals) and it seemed it was so that the girls could have their rooms back and go to their regular schools easily. So we moved back in (and he immediately moved back in too, and it was awful and scary - I kept my phone in my hand at all times, but fortunately, I was able to save enough in a month to move out on my own). That meant I was no longer paying my portion of the very expensive mortgage he had insisted upon.\nThe house went into foreclosure, etc.\nSo yeah, quiet quitting is still quitting and there's still a divorce/separation looming ahead.'",
        "In response to 'Original Post: Quiet quitting my nearly decade long marriage. As the title says  I'm considering quiet quitting my marriage. I AM NOT ready to have the divorce discussion. He seems truly oblivious to the strife either that or has me questioning reality enough that I think he is.  We got a pet this weekend, I've wanted one for quite some time but resisted getting one for years because my plate was too full being a remote worker and a primary parent (my job is flexible) and I accurately felt Id be the one doing all the work. .\nI've been doing the night wake ups for the young puppy, and he stated I should get some rest when he gets up for work. I infered that he would be taking the dog outside while I rested the one remaining dog bathroom trip of the overnight. Not enough to be a 50/50... But sure I'll take it. I recognize that my point of view may be different than his and that I may truly be \"playing the victim\" as he so kindly put it.  I did infer it and assumed it was the case, but did also \"just spring it on him\". I agree I did spring it on him. At 3 AM I scheduled a text to him with the time of the next bathroom break, the location and flavor of the dog treat, as well as loose instructions to positively reinforce. I get a call asking for the location of the dog treat and he says it just looks like a cookie. My kid loves cookies but I had put them all away because well... Chocolate and dogs is no good.  Annoyed, I get up and check the packaging to confirm, yes this is the dog treat and I indicate the brand on the package shows a brand name that refers to tails and wagging. I go back upstairs and get another call 5 minutes later because surprise dog won't go to the bathroom and this is inconvenient to his routine .... In the 5 minutes since I was last present. Treat... Was left inside by the door so pup motive was not there. I take over, clearly annoyed. Dog uses the bathroom immediately. I'm pretty icy while he gets ready for work and takes a shower that is pretty long or it at least is to me because a long luxurious shower for me is 15 minutes, not 30+.\nHe comes out, I state that if he isn't able to fit in any bathroom breaks into his schedule then I would like to know because then I can set my expectations instead of assuming I will get a break. This turns into an argument about me springing it on him and how he no longer has time to do his morning schedule now because of this and the fires through the things he does in the mornings; workout, shower, dressed, breakfast, leave. Note: at least 40 minutes of this is shower. I ask when it will ever be my turn to not do the bathroom breaks. And get told I'm playing the victim and he will get up even more early so he has time.\nI just can't do it any more. I literally just wanted the opportunity to sleep 3 hours straight instead of 2 and I couldn't even have that. I try to be considerate because I've always thought that's what a person should do? I only buy groceries the entire house approves, buy foods specific to his tastes, do things like clean out the coffee maker when I'm done using it so it's not a nasty surprise at 4 am, let him sleep in on weekends unprompted despite parent of early riser, hell every now and then I'll even purchase a video game console accessory or game just because. But I'm not doing it any more. I've decided I'm no longer going to make an effort to be considerate or accommodating which will be very very difficult for me, If I'm going to do everything anyways why go out of my way even more for someone who so very clearly does not even consider me or my feelings?\nSorry for the wall of text and formatting. If I am TA please do let me know because I do agree springing the bathroom break on someone was a lousy thing to do, however I did think that a break was me not doing that bathroom trip.\nEdit: Bad formatting and grammar are bad.', a user said: 'Well, then, welcome to the world of a rapidly disintegrating marriage. I guess the point is to let it deteriorate at its own rate, as that's what quiet quitting does.\nI did it, too. My ex was...very problematic (mental illness) and even when in between episodes of acute illness, was pretty much an AH when it came to sharing, or even talking about lifestyle issues. He had to have final say on nearly everything. His \"final says\" would be changed to some other decision at will. It was chaos. We moved 18 times in 16 years (with 20 months being the longest at one place). He was physically, emotionally and financially abusive.\nOur final year began with me telling him I would leave if he didn't go regularly to psychotherapy and stay on his meds.\nA year later, he had complied, but there were more incidents of physical abuse and he started to turn on our oldest daughter (age 9) as well. Throughout that year, I stopped doing a lot of things I'd always done for him. I still cooked. He started leaving the house before the kids got up and coming home either after they were asleep or right at their bedtime.\nThat was the non-quiet part of the quitting. But there's a big Elephant in the Room called Sex. Needless to say, since I felt like ending my marriage (strongly) I did NOT want to have sex with him. It was painful and completely unenjoyable for me. I think I had two pleasurable experiences in 15 years. And neither of them involved him directly doing something pleasurable, it was my own effort. This area of life is the most difficult to manage.\nI did not feel like having sex with him (so he started having sex with me while I was sleeping which was completely non-consensual, with me trying to push him off me, so it was marital rape). The depth of my anger at him was deep but so concealed - I wore a smile whenever anyone was around. Only my therapist knew how depressed I was. The laws on marital rape had not been in place for most of our relationship - nor did I even know the concept until those final two years (during which California changed their statutes and put marital rape in the same felony category as any other kind of rape - I think the reporting about that change is where I first learned that yes, I had the right not to have sex with him).\nOP, I suspect that there's way more going on in your relationship than just time management problems and a new puppy. You can stop doing all the little nice voluntary things - but eventually, the sex thing is an issue as well. It should be obvious to the other party that one person has quit, if that person is avoiding sex. I eventually moved into our guest room (or tried to - things really went to hell in a hand basket at that point).\nBecause sleeping separately and ending the sexual relationship is not 'quiet quitting,\" it's damn loud. Oddly, I figured I'd just never have sex again, seemed like a fine solution to me. During the last couple of years, he begged me for sex, saying it was the only thing that \"calmed him down\" so he could sleep. We both should have known to end the relationship, but we were stubborn and both of us had been raised with a lot of religion.\nGood luck to you! The quiet quitting phase can go on for quite some time, and it allowed me to get a good job and have enough money to move out. I documented everything I could, and both of our therapists knew what was going on - I got 75% custody of the girls, mostly to reduce his child support a little (he had delusions of poverty), he had them more like 10-20% depending on his mental health.\nThere's a lot to work out, mentally, about the actual dissolution of a marriage where there are children. My waiting also allowed the girls to be old enough for school and therefore much less around him.'",
        "In response to 'If he cannot grasp that you taking a break means he takes over completely, and he also cannot recognize dog treats, I'd say your treating him appropriately 🤷‍♀️\nHave you tried telling him to pretend he's at work and figure it out? 😉\nI'm sorry, that's probably not helpful. But unless he recognizes what his part in a marriage is, quiet quitting sounds like a workable solution. \nI stopped washing my husband's clothes for a while because he \"didn't see\" the mound of laundry. He ran out of underwear a couple of times until his vision improved 😉', a user said: 'I'm going to go out on a limb here and say that from his point of view, he wants treats as well. The \"treats\" may be those little things she does (like put up with his incompetency issues) but he doesn't see it that way. He's entitled to have her help him.\nI bet his treats lie in a different direction (he probably wants a regular sex life). The problem with quiet quitting is that if a person truly is inching toward the exit door, sex with the former romantic partner is the last thing on one's mind.'",
        "In response to 'quiet quitting a marriage is pathetic\ngrow up and use your words. tell him exactly how things are gonna be', a user said: 'Both can occur at the same time. My ex noticed the \"quiet quitting.\" We did have a talk and he promised to change. I continued the distant relationship for a year, just as I said I would - I gave him a year, and said I would leave immediately if he didn't go to psychotherapy (and a psychiatrist). He did go. A year later things were, if possible, even worse.\nAnd so after a couple of years of \"quiet quitting\" (which he reacted to with increasing displeasure but had to be done as I was absolutely not going to be his minion any more), it became a divorce. It wasn't terribly acrimonious, in part because he had finally accepted that if he had a flat tire, he would have to call AAA himself and then go buy a new tire - himself. So in that sense, it prepared him for what was to come next.\nI did tell him I would leave if things didn't get better and his response (until I left) was \"You always say that, you'll never leave.\" I could NOT leave without my own income, though. And since he moved us around the nation frequently, it was not until I managed to get back \"home\" (near my family) that I had the ingredients needed. I actually tried to leave (with the kids) one time - and just getting back home was going to use up all my money in gas and motels. We had very little in savings - I could have taken all of it and still not been able to set up a new life for myself.\nNow, we are both retired - but I'm the one who has a pension, a modest home, and bills that I can afford to pay. He is, as usual, in financial crisis. Good thing the woman he eventually married has a very nice house, as he has not been able to hold onto any of the houses he purchased.'"
    ]
}