{
    "username": "KamaliKamKam",
    "contributions": [
        "In response to 'They're going to TRY stopping it by slamming us with a recession and massive unemployment.\nThat might kick the can down the road a bit, but only pisses everyone off even more, long term.', a user said: 'They'll also try throttling internet and abolishing net neutrality.  Which they've already started working on.'",
        "In response to 'Shit where I live in Michigan we have one option for internet (well cable, I hate DSL) and it's Comcast. I wanted to get their 100mb data plan but they limited the number of devices I could hook up to my router to 6 so I had to get the 1 gig plan to have unlimited devices connected to my router.\nI don't see how that should be legal, if I want to have 1000 devices on my network using the internet that should in no way impact my ISP. Set a bandwidth max and fuck off.\nEven with the 1 gig speed plan, my total amount of data is capped and once I go over the cap it's something like $10 / X amount of data per month. FUCK COMCAST and internet should be government regulated and treated like any other utility.', a user said: 'Or how they throttle access to certain websites to try and force you to use their sponsored alternatives (aka the alternative that pays them the most).'",
        "In response to 'Original Post: What leaders need to know about quiet quitting… aka the labor rebellion [External Link]: https://v.redd.it/xravs6qh8ot91', a user said: 'Especially with most jobs requiring online applications nowadays,  internet absolutely should be treated as a utility; you get x speed, do whatever.\nThe ISPs took in some big money for \"infrastructure upgrades\" and we still don't have a majority of the US with fiber internet.   Hell,  a lot of more rural areas don't even have an option for internet at all (or the one option is crappy satellite internet).  Where did all that infrastructure money go?\nBut oh, we should definately trust them; net neutrality shouldn't be set in law because\nof course\nthey wouldn't abuse it not being a set law to make more money! They would never think about offering tiers of internet like paid cable channels that limit what you can access (one \"plan\" for gaming,  another for online shopping,  another for sportscasting, for example). /s'"
    ]
}