{
    "username": "Karpyy24",
    "contributions": [
        "In response to 'Original Post: there's no such thing as \"quiet quitting\" People simply don't want to do any more than what they are paid and expected to do anymore because wages aren't keeping up with prices and income inequality is at an all time high.\nCEOs are getting richer while workers are getting poorer. With inflation our jobs cannot afford us a decent life anymore. Also if I'm not being paid for my efforts, why should I put in more effort? If I'm not getting paid for my work, I'm going to do minimum work. If I get paid for my work, I'll be more productive. Pay employees more and give them a better chunk of the profit instead of it going to the top and people will work harder', a user said: 'It depends what the reasons are and what you define as \"quiet quitting\". For example, my dad (54m) works for a company and he makes a good amount of money which I will forever be grateful for, however, on Mother's Day earlier this year he had a heart attack. Up to this point in time, because he is fairly high up in the company, he would often have a heavy responsibility to keep the company afloat. He would get to work at 7am and leave 12 hours later. He didn't have any specific work hours but he would often come home after work only to continue working from home. It got to the point where he would stay up until 1am finishing up things on his laptop. When he finished and went to bed, he couldn't sleep because of stress from work.\nAnyway, he had a heart attack not that long ago and the Cardiologist he saw told him that it was work/stress related. When my dad went back to work 1 1/2 months later, he \"quiet quit\" because his job and workload literally almost killed him.\nSo even though my dad's case was a little more severe, there is such thing as quiet quitting imo and sometimes the reason isn't because people don't feel like doing work. Sometimes, \"quiet quitting\" is necessary to continue working at all.'"
    ]
}