{
    "username": "Karsticles",
    "contributions": [
        "In response to 'Original Post: It's NOT \"quiet quitting!!!\" \"Working your contract,\" \"working to rule\" and \"acting your wage\" are all MUCH better terms. Why would you use the word \"quit\" to describe you adhering to your contract and doing your job? It has nothing but negative connotations AND denotation.\nI highly encourage everyone here to lose that term. We're working our contracts. We're not quitting anything. Some may STOP giving away their physical and/or emotional labor, but that's not the same as quitting!\nEdit: For those of you saying \"It's called 'doing our job'\" The implications of teachers \"just doing our job\" are:  volunteering for events, grading/planning at home, taking over other  peoples' responsibilities, adding more to your plate every year, etc...  Admin considers this \"just doing your job.\"', a user said: 'Corporations created the term \"quiet quitting\" to normalize unhealthy work habits. Don't play into it folks!'",
        "In response to 'So convenient how it started just as the \"worker shortage\" came about.\nWe don't pay enough to attract more workers and the workers we have won't pull double duty. They're all sooo lazy. Wah...', a user said: 'I think it's largely tied to the anti-remote work movement within corporate. People have a lot of money tied into office buildings. It's a great way to raise suspicion about your remote workers. Are they\nreally\ndoing enough?, etc.'",
        "In response to 'Got any proof of corporations inventing the term quiet quitting? I definitely saw it on tiktok early on where people were using the term to mean \"doing nothing at your job until someone notices and fires you\".', a user said: 'Perhaps not the original term, but the propagation of the notion in articles all around the internet suggesting that it's some kind of fashionable movement. The vast majority of the internet wouldn't know of the term if these billion dollar media conglomerates didn't decide to \"make it a problem\". It's in that sense I say \"creating\", and not \"originating\".'"
    ]
}