{
    "username": "Kaybarr17",
    "contributions": [
        "In response to 'Why is showing up doing what you need to do and going home such a bad thing? Lol\nI don't get this quiet quitting thing. You have a staff member working in the assigned position doing what they need. It's just about employers wanting to violate your boundaries', a user said: 'idk why boundaries are seen as rude or irresponsible. I have a group chat with my boss and most of my coworkers where the schedule is posted and other information is exchanged, and on my days off I mute the entire app and refuse to check it until a few hours before I actually go to work'",
        "In response to 'My manager and store director wanted me to work 6 days consistently until they could \"find someone to work\". I told them it wouldn't be good for my mental health. You have to stick up for you.', a user said: 'I discovered that I can’t work more than four days a week due to disability, so I told my boss I was no longer available to work mondays. the very next monday he asked me to come in (even when he has days of advance notice, he always fails to get coverage for someone calling out or anything) and in the course of his begging he said it would only be that “one time.” obviously I knew he was just tryna see how far I’d bend for him, but I agreed to take the shift (and specified again that it can only be that once) basically for brownie points, to show team willingness or whatever. predictably, he asked me two or three more times after that to come in on my days off, and each time I just said “no, I’m not available.” he’s only asked me to cover a shift once in the last 6 months or so lol\nsimilar situation back when I was first hired here, I signed up for xyz days at 123 time and made it clear that that’s strictly my only availability. he scheduled me for a shift AND day that I said I wasn’t available, I pointed it out, and he said I’d “have to take an abc shift to complete some training,” which was just untrue because the “training” was some modules on the computer and a senior coworker on my own shift showing me things. I reiterated my availability and pointedly asked “what training cannot be completed during my scheduled shifts?” to which I never got an answer, and again he’s rarely asked me to come in when I’m not available since'"
    ]
}