{
    "username": "KidBeene",
    "contributions": [
        "In response to 'Original Post: I think my remote team mate is quiet quitting And it's ticking me off. Need advice if I should say something?\nMy team is fully remote,  spread  across the US. Our individual and team metrics are tracked by the amount of tickets we process on a weekly basis. This is a FULL time job and I've found that a member of our team is only logging about 4 hours a day - if that! Meanwhile, the rest of the team is putting in 9 hr days just to keep up with the volume.  We've also had to log in and work the last two Saturdays just to clear the backlog.  If this person would just work a normal day,  it would lighten the load on each of us. Our manager hasn't seemed to notice that this  person's \"numbers\" are half of what the other team members are producing. Do I speak up or keep my trap shut,  silently seething all day?\n**Thank you everyone for your input! I'm not going to do my managers job for them,  if they don't care,  I won't care either.  I'll hit my targets and focus on my career advancement in 2025.', a user said: 'Talk to the co-worker.  Everyone has ebbs and flows in life and something may be going on.  DO NOT RAISE IT TO THE MANAGER.  You can not take that back and the manager is obligated to do something.  Most likely it will be a \"group punishment\" style management with quotas and micromanagement.'",
        "In response to 'Original Post: Quiet Quitting: What is it Really? Quiet quitting is a confusing term to me, but maybe I just don’t understand it. I have rarely ever given 120% to a job… maybe when I was fresh out of college when I had that mindset. But the years have jaded me. What people call “quiet quitting” (doing the minimum) is what I just call doing my job lol. It’s not like I refuse when they ask me to do more work (tho rarely do they ask), but I don’t SEEK more work out unless I’m just bored. For example, in my work, we work in Sprints and get assigned stories to do for those sprints. I just do those stories — not more or less — unless I’m just bored and have finished my stories weeks in advance, then I may grab a story for the next Sprint. I get paid by the hour so no work means no pay. But it’s not like I can ADD more stories to the current Sprint because someone else still needs to test them and THEY may not have capacity. So, a lot of times I just do things around the house since there always seems to be something to do at home. Have I been quiet quitting for years and just didn’t know it or is doing the minimum not really what quiet quitting is all about?', a user said: 'Depends on the industry.\nMany positions have metrics.  Quiet Quitting would be always doing the targeted goal, never exceeding. Never volunteering.  Always a \"meet\" never a \"exceed\".\nAs an owner and manager of people, these \"meets\" are valuable for 4-8 years.  Every 4 years you change the titles of the workers from \"Line worker\" to \"Inspection Engineer I\".  Then you can \"eliminate\" the need for positions of the older \"Line Worker\" when you restructure and hire a batch of cheaper \"engineers\".\nPeople's knowledge and contribution become stale after 8 years if they are not working on individual development. Those who \"exceed\" you can shift to a new team and retitle them so they are safe.'",
        "In response to 'One word, union.', a user said: 'Ew.\nLike wanting an HOA... how about NOT adding another layer of non-producing leeches onto your administrative overhead.'",
        "In response to 'Ahhh late stage capitalism, where doing the job you're paid for makes you a lazy, expendable resource.', a user said: 'False. Makes you un motivated.  Thats the managers fault. Blaming the worker is bad management.'",
        "In response to '“Meeting expectations” really shouldn’t be considered quiet quitting. Unless it’s extremely good bonus pay or something, why would anyone give these companies more than what you are paid for, when they will quite literally immediately replace you without second thought. Working to live, not living to work.', a user said: 'Why?\nDepends on industry #1.\nWork Ethic environment. #2,\nMy generation (X) was told / taught / saw / experienced: \"No matter what you are going to do, give it 100%\".  That was everything from relationships, sports, work, and even entertainment...\nMovies\n\"Top Gun\" (1986) - Maverick didn’t just fly jets; he lived at Mach speed. The \"need for speed\" line and Tom Cruise’s cocky grin screamed total commitment to the bit. The whole movie’s a love letter to going all out.\n\"Jerry Maguire\" (1996) - \"Show me the money!\" wasn’t just a catchphrase—it was Tom Cruise betting everything on passion and hustle. The whole movie’s about going full throttle for what you believe in.\nCatchphrases & Slang\n\"Go big or go home\" - This phrase started picking up steam in the '90s, perfectly summing up the decade’s obsession with maximum effort.\n\"All that and a bag of chips\" - Meaning you’re the best and then some, it’s peak '90s over-the-top confidence.\n\"Take it to the max\" - Pure '80s—everything had to be bigger, louder, more extreme.\nWe are hard wired with meet and exceed expectations as a thing.'",
        "In response to 'How do you not burn out? I was that overachiever kid throughout my entire life in school. But I saw the rewards for doing so. We were ranked. I was always at the top. It was easy to continue doing so. At work? Nope. Apparently, that’s not how it works in the corporate world. You have to kiss a** to get to the top and that just seemed exhausting.', a user said: 'I did burn out.  I was working 80-90 hours a week.  I sacrificed family, social connection, and my health for money and power.  I built a really decent company and ran it like a madman for a solid 5 years.  Then my dad died.  IT hit me like  ton of bricks- what is left when I die?  A company? Big deal.  I was divorced twice. No kids, No legacy.  So I sold it all and started a new career in a new field. I met a like minded hard charging broken woman, where the two of us broken people decided to get better together.  We did. We now have three kids a solid portfolio and a real future.  I wouldnt change a thing.  I learned a ton being a company owner and people manager.  I think I learned something most people dont ever learn.  Who I am.'"
    ]
}