{
    "username": "Kientha",
    "contributions": [
        "In response to 'Climate scientists disagree, they say the only way to deal with climate change is for everyone to seriously reduce their consumption. Companies, governments and ordinary people.\nYou’re just taking part in what the climate deniers want - a big, messy, emotional argument about how unfair it all is, and who can we blame, rather than listen to the science and actually act to cut our consumption.\nIt’s funny that you think they had\none\npr policy, and that you’re one of the smart cookies who sees through it. When in fact you’ve seen a way not to make the hard decisions to act to deal with the problem, while being able to act as though you’re serious.\nYou’re just a part of the industry astroturfing campaign, as you earnestly spread a meme about how people don’t need to cut their consumption of industry products to deal with a problem that specifically requires a massive cut in the consumption of industry products.', a user said: 'You're not wrong about consumption and how we need both large scale industrial change and individual change to reduce carbon emissions, but the term carbon footprint was coined and spread by that industry astroturfing campaign to make people think it is individuals responsibility alone.\nIt also led to the scam that is carbon offsetting being popularised as an alternative to reducing consumption when most of the popular offsetting schemes had negligible impacts on reducing carbon in the atmosphere.'",
        "In response to '“Quiet Quitting” is the phrase the American employers came up with to shame their employees.  They call it that because they are implying that because you just do your job as it should be, rather than going above and beyond and dedicating your life to it, then you are basically a quitter without actually quitting.\nIt’s tremendously fucked up and I do hope it doesn’t catch on here.  I’ve not actually heard  it said here yet but it’s probably only a matter of time.', a user said: 'It's been a regular feature in certain right leaning newspapers over here for a few months. The less ridiculous articles make reference to work to rule (usually with a dig at young people trying to invent things that already exist) and it's posted about on LinkedIn by those \"my entire personality is being a middle manager\" types.'"
    ]
}