{
    "username": "kincaidDev",
    "contributions": [
        "In response to 'Yeah, no OE here but my company is quiet cutting right now (allegedly close to 2k jobs in the past month with more to come in the coming weeks/months).\nNational company, strategically laying off in waves as to not trigger a WARN violation. Letting FTEs go without severance, but telling them they have until x date to find another job within the company (all while making sure their soon-to-be previous duties are handled by someone else) and they have to sign an NDA to make it to that date.\nNot trying to be anti-work, but it's a fucking dirty game.', a user said: 'Eliminating jobs solely for the illusion of an increase in profitability is pretty anti-work IMO'",
        "In response to 'I'm trying not to be the guy who lands on \"fuck corporations\" , \"worker bee GOOD, company BAD\" ... But it's getting more and more difficult to not land there.', a user said: 'I got to that point when I saw virtually every tech company behaving the same way at the exact same time, then realized they're all essentially owned by a handful of investment firms which are run mostly by mediocre people.\nIts hive mind fascism.'",
        "In response to 'Tech is 100% this.  Get one senior lead dev, who has no life and works until 1am everyday, and pair him with 5 juniors with under 3 years experience, you have an all star team.  They will outperform a group of 10+ mid developers.  Every. single. time.\nCompanies really don't like this though because that one dev has so much power, and if they take their ball and go home, it can absolutely wreck an entire department.  My company has really been pushing this \"swarm\" mentality.  Where they don't want leads or anything anymore.  They want tasks to just be worked on simultaneously by all so that knowledge is always shared so there is never a knowledge gap because they are absolutely terrified of the lead dev power dynamic.  Every task is a paired task.  It's terrible and simple tasks take entire weeks.', a user said: 'Ive seen this combatted by the lead constantly doing major refactors that include a lot of unsused and poorly worded code, no comments and bypassing of the review process'"
    ]
}