{
    "username": "KiwiKerfuffle",
    "contributions": [
        "In response to 'I said a quiet fuck-you to my employer when I learned they were checking badge reader logs for RTO compliance. Some days I don't do a damn thing but answer a few emails.', a user said: 'I never get this level of micro management. If your performance is doing well and all your tasks are getting done, what's the fucking issue?\nAlthough at the same time, I see bad management everywhere. Constantly watching for mistakes and anything they can complain about, to \"keep you in check\" I imagine. Never any praise or concern for their employees.'",
        "In response to 'See I quiet quit because I don't even know when my performance is well. They set such a high quota and expect accuracy and if I meet both its likely to just be \"meets expectations\". There's no way for me to go \"exceeds expectations\" at my job. Even when I push past the quota its to make up for the days I dont.', a user said: 'Yup, and that's a good way to know they only see you as a number. I know it's easier said than done, but I'd recommend finding a better job.\nHell, I could coast easily at my current job and it's decent pay. Not good, but enough to keep living in my shitty apartment and never save much money. But I don't want that, I want a job where I'm valued, productive, expanding my skillset, not just a butt in a seat.\nGetting into the mindset that I'm an asset, not just a number, had been difficult and I'm still working on it, but it's gotten me much farther in my career. If I never realized that, I'd still be working half my wage at any retail job that would take me.'",
        "In response to 'Original Post: How many of you have \"quiet quit\" and when did it start for you? I got to say for me I quiet quit my last job 5-6 years into it after realizing I didn't have a future with that company, but I never left because I was at least getting paid and now have a decent savings account because of it. I legit started my new job early this year and I've already quiet quitted. I hardly do the bare minimum since I gave them a whole summer of hard work and not a single fucking praise. Or even any kind of \"hey keep it up you've been doing an awesome job\". The moment I make a mistake I feel like it destroys everything i worked hard for so what's the point anymore? I'm just going to keep working enough so I don't get fired, but if I do I doubt I'll be upset over it. It also just seems the way 2023 has went if the economy and housing market continues to stay awful next year I can already see people quiet quitting for 2024 and it hasn't even started yet!', a user said: 'Started a few weeks after I started. Not really intentional, but I was put in a position where I was supposed to be getting trained and received maybe 10% of what I should have and left alone 90% of the time. I started taking longer breaks, turned into just not showing up some days. Eventually they caught on to the breaks(but not skipping days...), So I had to cut way back, but I was still only trained for roughly 10% of the job and had to bug the hell out of coworkers asking a ton of questions.\nI've since been told by upper management we shouldn't discuss pay, been \"talked to\" about my breaks, leaving minutes before end of shift (don't even make it to my car before end of shift), talked to like I've no idea what I'm doing, expected to know the ins and outs of job duties even though it's highly technical (and somewhat of unique procedures) and I, again, received little to no training.\nYeah, nah. I'm already looking for another job. My coworkers are nice, but company structure seems very flawed and very anti employee rights/benefits.'"
    ]
}