{
    "username": "KJBenson",
    "contributions": [
        "In response to 'Post-COVID my work decided to keep Mondays and Fridays as teleworking days and reschedule all meeting to Tuesdays-Thursdays when everyone is supposed to be in the office. Not only did it reduce my home productivity, as I used to do chores like laundry and dishes while listening in on meetings, it reduced my productivity at work as now I have days full of back to back meetings. Because everyone spread out over different worksites due to COVID, most meetings are still online anyway. So now, instead of keeping my hands busy while I listen and fold laundry or whatever, I'm just sitting at a desk staring at a screen either zoning out or answering emails - not listening to the meeting.', a user said: 'I have a new business idea for a productivity doll. Send us your picture and we’ll make a lifelike car board cutout to put in front of the camera while you do real work!'",
        "In response to 'I structured my workdays to do exercise and chores\nonly\nduring work hours. Off hours are for relaxing and hobbies.\nMy previous two years was a similar job that gave me a lot of downtime. I am sort of used to it.', a user said: 'What’s funny and beyond the understanding of corporate is this actually makes you a better worker.\nIf you take time to exercise and get chores out of the way it stimulates your brain and removes distractions like thinking about crap you have to do after work.\nThey’d want to fire you if they found out, but they stupidly don’t realize you’re a better employee for it.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'I love how commitment only goes one way to these people.\nThey don’t think a workforce that is willing to stick around deserves a piece of the cake too? Fuck off manager.'",
        "In response to 'They also write 99% of our laws.', a user said: 'Name one law they didn’t write.'",
        "In response to 'The avg take home pay was higher in 1967 than in 2014……', a user said: 'I’ve said this before. But someone working at a gas station in the 60’s could own a house, car, and a family.\nCan you?'",
        "In response to 'You mean the people who are pushing everyone back to in person work so their commercial properties don't tank in value?', a user said: 'Also, the people who own all the houses so you can’t have one.'"
    ]
}