{
    "username": "km89",
    "contributions": [
        "In response to 'I'm a millennial. I believed the lie that of I went over and beyond my job description, it would be rewarded with promotion and better pay. Instead it was rewarded by laying off my colleagues, so I could do their work as well for the same pay.\nGen Z just figured that out sooner than we did.', a user said: 'I believed the lie that of I went over and beyond my job description, it would be rewarded with promotion and better pay\nAlso millennial. I was rewarded with a mental breakdown, a trip to the hospital for suicidal thoughts, three months of not being able to drive due to random panic attacks, six months of disability pay, and a lost job.\nIn my current position, I'm happy to go above and beyond, but only because there actually\nis\na culture of respect--and a huge part of that is them telling me outright to limit the kinds of \"above and beyond\" things to emergencies and necessities. I had to be told explicitly that checking my emails after hours is not encouraged.'",
        "In response to 'Sounds like a fantastic working environment you’re in now. What are you doing? And do you have any other pointers on what red / green flags to watch out for?', a user said: 'I'm in software, same as I was at my last job--and even within the same sub-industry, though not a competitor.\nThis obviously isn't comprehensive, but the red flags at my last job basically came down to how work/life balance was (not) prioritized. My mental breakdown came after over a month of being woken up multiple times almost every night due to alerts or other on-call issues; at the time, I was on a team of two handling a specific subset of the issues my larger team had to handle. Sleep deprivation is more dangerous than you'd think, and the only thing keeping me going was WFH that allowed me to take brief naps over lunch. When I got a RTO order, I was so strung out that I just snapped.\nSo red flag number one: when your job is fine putting you in that position. When issues are identified and identified as causing after-hours work and aren't fixed. When you're asking for time to fix issues and you're told to prioritize other stuff. When there's so little cross-training that a small group of people are held responsible for managing these issues to the point where they're basically on call 24/7. When your management has no problem putting in long hours--hell, I remember speaking to my director at the time, who had spent a solid week basically eating, sleeping, and working. Yeah, he complained about not being able to see his wife much, but the implication was \"this is what we need to do, even if it sucks,\" and not \"so we need to fix it so we don't have to anymore.\" When it's\nalways\ncrunch time.\nRed flag number two: when you start showing signs of too much stress. When others are telling you that you're stressed all the time, but you feel like you need to step up because your team needs you. When you refuse to leave home without some way of being able to jump into work on a moment's notice (for me, I was unhealthily attached to my phone and wouldn't leave the house without bringing my work laptop because I'd get a text and would need to be online within 10 minutes or so, period). When you're tired all day and can't sleep at night. When you start getting angrier and angrier.\nSide note: pay attention to these signs. When burnout hits, it hits\nfast\n. I remember calling out of work a few days telling my manager \"I don't know what's happening to me.\" Two or three days later, I got the RTO order and that escalated to sobbing to my family that \"I can't go back there.\" A few\nhours\nafter that, I realized that I was seriously intending to kill myself that night, and the instant I realized that I got up, walked downstairs, and demanded that the nearest person take me to the hospital right the hell now. That's the only thing that saved my life, but by that point I had started to spiral so hard that every bit of anxiety I'd had in the previous several years came out at once. I spent a solid two or three weeks just in bed sleeping, barely getting up to eat or go to the bathroom. It was three months before I felt safe driving, because I'd just randomly freak out and start crying. It wasn't until earlier this year,\na full two and a half years later\n, that I finally felt like I was back to normal.\nOn the other hand, the rejection of all of that is a giant green flag. My current position has told me outright that they do not expect us to check emails after hours. That yeah, the customer responded at 4:55, but that sucks for them and it can wait until Monday. That sometimes off-hours work needs to be done, but if they can't get volunteers they pull names out of a hat and remove the name from the hat until all the names have been pulled. When your manager goes about his day like it's his job to coordinate your efforts and unblock you when something's causing issues, not to ensure that you're working.\nHonestly, switching from the bad job to this one was such a night-and-day experience that I very literally didn't believe it until after I'd been there for over a year. I was like a skittish cat who was always on guard for the next bad thing to happen until they just\ndidn't\nfor months on end.'"
    ]
}