{
    "username": "kopibot",
    "contributions": [
        "In response to 'Original Post: Quietly Quitting and Lying Flat I have wondered over the years why we are constantly told to work harder, work harder, but then things don't always get any better. But it's super-important for Singapore to be competitive against every else, right, so we got to work hard.\nBut I also see that in other parts of the world, there is a bit of a backlash against this kind of idea:\nquietly quitting\nand\nlying flat\nWhat is your opinion?', a user said: 'No challenge is insurmountable as long as you have a healthy body to hone and a harmonious home to return to  everyday.\nYes, working hard is no longer enough to \"ride the rainbow\". That has been true a long time ago when being a degree holder was no longer synonymous with elite membership. It just means having to work both hard and smart now.\nThe real problem isn't competition. It's when you are plagued by chronic illnesses or highly dysfunctional social circumstances that sap your energy. If life is a game, it will be like changing the difficulty level from normal to nightmare. (with no improved rewards, unlike your typical RPG loot system!)\nYes, life is unfair, but self-pity is useless. So no matter what lousy situation people find themselves in, I hope people can find the patience and strength to do whatever is necessary to survive and eventually to thrive.\nI must admit I never understood the point of lying flat or the Hungarian attitude towards suicide.\nWhen it comes to lying flat, I understand it as the giving up of the pursuit of power while stuck with a low income. When people say they no longer chase wealth, qualifications or social influence, they are either saying it is lower on their priority list or implying something else. (I don't think being middle income or higher but no longer seeking more power qualifies as lying flat. In fact, it is highly disingenuous for middle or high income earners to pretend to identify with low income earners lying flat. You can be gentle with the less fortunate, but at least continue to point them in the right direction!) \nWell, guess what, these sources of power are still needed if you want a good life. Being poorer is really not great no matter how you try to console yourself. You need to join longer queues for medical treatments, the food is less fresh and tasty, nonperishables tend to break more easily and have poorer functionality and you can never afford to take risks. I only accept \"lying flat\" if the implication is a more benign pursuit of power: the resolve to find alternative ways of gaining power without ruining others' lives. I reject lying flat by getting comfortable with living like a hermit; I think people who think like that are quietly miserable.\nAs for suicide, unless you have unsolvable problems that are so awful as to occupy your every waking moment, surely there are things to explore in life that would make your existence preferable to a return to nothingness.'"
    ]
}