{
    "username": "kungfukenny3",
    "contributions": [
        "In response to 'I remember when I was getting burnt from work. I started doing the \"bare minimum\" doing exactly what my responsibilities and nothing more, timing everything so it'd take the whole day, same reaction. Was very weird, Ive been using that strategy for years now and... it works?', a user said: 'in a post scarcity world a lot of our working hours are unnecessary and pretending they aren’t makes bosses giddy. This is doubly true in service or financial sector economies\nthat’s why the appearance of working hard becomes more important than the output. The work that needs to get done always gets done and for the rest you might as well pretend to be working or they’ll start thinking of “trimming the fat”. Really anything to not confront the fact that sometimes you pay people to do nothing because you pay for time instead of output and that’s just how it works.'",
        "In response to 'Do you think we are effectively post scarcity? Obviously not the ideal definition but post scarcity in terms of needs vs. Availability of resources to meet those needs?', a user said: 'As far as America and most of Europe go yes I do. People will retort that logistical issues are why disparity exists, which has some\ntruth to it, but that doesn’t acknowledge that solving these logistical issues haven’t been a top priority even on paper for some time.\nFor example, a lot of people know that the US ends up throwing away about half the food it produces. A lot of that is somewhat unavoidable, being down to personal choice, quality, preservation, restaurants, whatever; But also it is simply not true that that percentage could not be lowered at all through a nationwide effort to do so. We just don’t put in that effort because it’s not the cheapest option.\nThe average american person consumes far, far more resources than the average global citizen, even if we choose to exclude the 50 poorest countries. The idea that people here still starve, or have shitty clothing, or can’t afford medicine because we don’t have the material or the work ethic is ridiculous. As time goes on less and less of the money that we call the economy is at all related to manufacturing or making anything at all, as they’re not even in demand here really.'"
    ]
}