{
    "username": "kx____",
    "contributions": [
        "In response to 'I  learned the term \"quiet quitting\" last year, I've been doing that my entire working life, 20+ years. Doing pretty good, work hasn't stressed me in 15 years since changing careers.', a user said: 'To work more than the bare minimum is wrong on multiple levels, I delve into why in my post:\nhttps://reddit.com/r/antiwork/s/SAYXE5cuUE'",
        "In response to 'That's more capitalism corporate bullshit.', a user said: '?'",
        "In response to 'I misinterpreted your comment comment. Thought you were pro above and beyond.', a user said: 'The opposite.'",
        "In response to 'Original Post: I've been \"quiet quitting \" for a week and have never been more relaxed. I work in a high stress medical setting and have been for 8 years now. I've always been talk to go above and beyond for work. Over the last 4  years I've been increasingly burnt out and my paychecks do not seem to match my effort.\nHowever this past week, after a particularly nasty mental breakdown a few weeks ago, I've been doing the bare job requirements and it's been lovely. I now feel like I have more energy for my life outside of work, and more energy to further myself personally.\nRemember it's only a job, do what you have to and clock out.\n***edit: as many have said it's \"acting my wage\" I was using \"quiet quitting \" ironically', a user said: 'That should have always been your approach and more Americans need to learn to work in this manner.\nI talk about this in detail in my post here:\nhttps://reddit.com/r/antiwork/s/SAYXE5cuUE'",
        "In response to 'My j1 did this which pushed me to j2. funny enough, j1 is a very yuppy employer that doesn’t shut up about work life balance and its status as a community builder bla bla… throw people out on their ass so they can move on or stand with your employees like the mother theresa you are pretending to be…', a user said: 'Companies all got the memo from the US federal reserve to slow down hiring. On a more serious note, the goal of the fed raising rates was this, to spook companies into a recession potentially coming and thus act in this manner.'"
    ]
}