{
    "username": "kyabupaks",
    "contributions": [
        "In response to 'Original Post: Had a fight with my parents over this “quiet quitting” trend. Somehow refusing to answer emails/phones outside of work hours is a trend and my parents think it’s just us being lazy. I can’t seem to make them see the reality. When they were young and working you could leave work behind by walking out of a building, not so anymore.\narticle', a user said: 'I did this shit long before this was a thing. Over a decade ago. I'd just ignore texts and emails from my manager when I was off my shift.\nOne day, freezing temps caused a water main to rupture in the non-heated foyer of the restaurant. I wasn't scheduled to work that day, and my boss texted me to demand that I come into work to help them clean up the mess (four inches of water throughout the entire restaurant). I told her I'm not coming in on my day off and good luck with that.\nPeople from corporate had to come in to help with the dirty work of cleaning that shit up, along with my manager and co-workers. I ended up getting written up for disobedience and refusing to be a team worker.\nI scoffed and contacted an employment lawyer, had him write a letter threatening that if they didn't remove the write-up from my personnel file, there would be legal action taken.\nCorporate forced the manager to rip the write up sheet in front of me. She was red in the face while doing it. She told all of my coworkers about my \"insubordination\" and how I \"threw everyone under the bus that day\". They all hated me and I had to transfer to another restaurant because of the toxicity and hostility towards me.\nI quit a couple years later in 2015, because they underpaid and overworked me. No appreciation.\nFuck you, Kim.'",
        "In response to 'Being \"written up\" is BS. Who cares? The only people who will see it are your employer and they already know, so who cares? Such an empty threat', a user said: 'Kim loved to write me up over every little excuse. That was the second write-up I got for that year, and a third one meant termination. Although I wasn't paid enough and overworked, it was during a very poor job market - long before the pandemic happened.\nBeing deaf automatically made me unhireable in this oppressive pre-pandemic market, where employers had the upper hand because of the scarcity of the job market. Being disabled was a scarlet letter to employers (still is, but less so under current circumstances) and that got me stuck in between a rock and a hard place. I had a lot to lose at the time.\nI had a family with a teenager and a young child at the time, along with a wife that was unemployed and studying full-time to become a marriage/family therapist while taking care of the kids.\nBills had to be paid and if I had gotten fired... that'd have been game over for my family.  Times were very different when the majority of the working class was blind and complicit pre-pandemic.\nSo please don't assume it was the same as it is now. Times have changed, but the way things were... it truly was almost hopeless back then. Thanks.'"
    ]
}