{
    "username": "Kyrond",
    "contributions": [
        "In response to 'I quite agree with the general feeling of your post, but I think that it cannot apply to all companies.\nI see at least two kind of companies where \"just doing your job\" cannot be expected:\nThe first one would be the companies that are temporarily running under profits margin. Think for example of a kindergarten that got its subventions cut/late for whatever reason and will go bankrupt, leaving tens of children without daily care if employees don't go an extra step to make sure the structure survives those difficult times.\nSecond one would be start-ups. When you sign for working in a startup, the un-written rule is \"\nwork as hard as you can, till your stocks makes you a billionaire\n\". That's not something that can be contractually written, as it's a fuzzy requirement, but everyone that sign there know about it. If some colleagues start \"quiet quitting\", that could mean that the extremely hard work from all others members of the startup can go to the drain just because some decided to stop following the implicit rules. Basically, don't do startups if you want a personal life, but if you choose not to have one, you can't change your mind in the middle of the growth period.', a user said: 'Interesting perspectives.\nFrom the people I know, they would most likely stay, sacrifice themselves for the benefit of the children and kindergarten. But it's fully within their rights to quit, they might have their own family to care for.\nWhy is it an unwritten rule? Just put it in writing and be honest. \"This pay isn't amazing given the work hours, but you get X stocks\".\nBoth are about expectations. We all should expect people to not go beyond, and just work to what's written in their contract. So that we can admire them for exceeding expectations. But to exceed expectations, the expectations have to be conservative.\nIf you expect every startup employee and kindergarten employee to work whatever happens, it's not admirable and praiseworthy, it's just what they \"signed up for\". I don't expect that, so I can and will praise them and applaud them for it.'",
        "In response to 'Do you think people should learn new things? Educate themselves on current events and new technology? Be curious and inquisitive while searching to grow as intellectuals? Do you believe in life long learning?', a user said: 'Yes. But there is difference in learning for my own sake, and for companies benefit.\nSure, some of my self-learned skills translate to work, and vice versa, but I might not be interested in what my company wants me to pursue. That's what our contract is for - I do things I wouldn't do on my own, and company pays me.'"
    ]
}