{
    "username": "l4mbch0ps",
    "contributions": [
        "In response to '[Deleted or Empty Comment]', a user said: 'Boy, good thing you didn't read the article, or your ENTIRE comment would just look silly.'",
        "In response to 'Maybe it's a difference in what we do professionally, but there is definitely a difference in doing your actual job and doing the minimum to squeek buy in my field.', a user said: 'This is the entire point. You've been convinced of some kind of work ethic value system that your company is exploiting. Have they ever paid you above and beyond the work you did? Then why tf should you do work above and beyond what they pay you for?'",
        "In response to 'To me it seems more like quiet self-sabotage.\nI’ve been with my employer for 19 years and a hiring manager for 6.\nCautionary tale:\nAn employee of mine has been there 8 years and has been using the quiet/quit, work-to-rule approach from day one.\nThey have now forwent $7/hr in wage increase by failing to meet raise expectations. Instead of making $26/hr, they are just below $19/hr.\nNew hires are now starting at a higher wage because COL has increased faster than this person’s wage increases.\n1) 8 years in, makes less than first-day employees.\n2) Will take 7 years of slightly more than bare minimum and no more write ups just to get to the wage they should already be at today.\n3) This person has a 45 minute commute one-way just to work hard at not working hard… at an employer’s discount.\n4) oof', a user said: 'You sound like a completely incompetent and vindictive manager. Weird flex but OK.'",
        "In response to 'No that’s the employee. The whole management team have been working to motivate this person to not only support their peers, but to simply not lose their job.\nIt’s tough because even getting them to wear their mask would result them disrespecting managers and the covid protocols.\nI’ve mentioned it to other people in the conversation that HR would let us issue a write-up for insubordination.\nThat write up would’ve resulted in 2 consecutive calendar years of failing to meet expectations, which is immediate termination.\nHR saved their job despite multiple covid infractions, poor performance, and insubordination\nThis person is likely carrying trauma and has demonstrated self-sabotage behavior for the duration of their time with us.\nHolding themselves back financially is just another item on the list.', a user said: 'It's telling how often you cite lack of respect.'",
        "In response to 'I know, they have a deeply emotional issue with authority. They lash out over masks. They don’t respect covid protocols, their peers, or the managers. I think they are struggling with respecting themselves as well because this isn’t the behavior of a self-respecting person. They hinge their dignity on not doing what’s asked of them because they view it as oppressive or uncalled for.\nIt’s sad, yet I struggle to remain sympathetic because they are choosing this for themselves.', a user said: 'You have an incredible lack of self awareness. It's staggering.'"
    ]
}