{
    "username": "l94xxx",
    "contributions": [
        "Reddit was so hot on \"quiet quitting\" but now when you talk about using slowdowns to interfere with the fascist takeover, all you hear is crickets We are at a pivotal moment, where either we choose to plunge the system into darkness on our terms temporarily, or the oligarchs drive the system into darkness on their terms for the foreseeable future.  And yet, so many people seem willing to just continue, business as usual, even as our protections (worker protections, immigrant protections, social services) evaporate before our eyes.\nThe ruling class may own the companies, but the working class still runs them, and we have a chance to use that to help ward off the darkness.",
        "In response to 'If you want to sabotage the fascist machine at work you need to work for the fascist machine\nYou're not gonna like to hear this but if you really want this to work you're gonna need to scrub your existing social media presence and start posting slurs on Twitter so you fit in with The Boys and can get a job at DOGE where you can actually start sabotaging the fascist machine', a user said: 'The rich feel pain from many directions, because their assets are not in one basket'",
        "In response to 'Please explain to me how slowly stocking groceries at Wal Mart helps prevent Congress from passing a law abolishing OSHA', a user said: '[It's weird, 99% of the time people complain about how rich people have Congress in their pocket, and then suddenly posts like this come up and they forget]\nBut yeah, if it ain't stocked, you ain't selling.  And if you ain't selling, you ain't making money.  And if you ain't making money because people are protesting, you're going to start listening to what they're protesting about, and you're going to try to fix it so you can make money again.'",
        "In response to 'That's because reddit doesn't qualify as labor organization.\nBesides, Trump and Apartheid Mini-Me is busy turning the US into Ancapistan - this is far beyond what quiet quitting and work slowdowns can fix.', a user said: 'Agreed, slowdowns alone will not be enough'",
        "In response to 'Why don't you tell us what you're doing maybe that'll encourage more of it', a user said: 'I get that you were just being snarky, BUT today was actually a great example, so:  I had two sets of documents I needed to review, one for our friends in Europe (please get it to us by Fri!) and one for work stateside (can we get this by the end of today?).  Wouldn't you know, the European papers took longer to review than I thought, and I couldn't get them back to Europe until after the end of their business day, so now it's going to be delayed until Monday.  And darn it, because I spent so much time on the European docs, I couldn't get the stateside docs turned around by the close of business today.  So now they're not going to get sent out until Monday.\nIt's little things like that, with plausible deniability (or sometimes even anonymity, depending on your work environment) that can throw extra pauses into the workflow, that are especially impactful when there are multiple steps downstream dependent on it'",
        "In response to '[Deleted or Empty Comment]', a user said: 'There's a big difference between us bringing down their production and them bleeding us dry.\nBesides, evidence thus far indicates that normal procedural checks and balances can't be counted on (e.g., the Goon Squad in the Treasury)'",
        "In response to 'Was just talking about him today. Micro shut downs, randomized, all over the country! Maybe AI can help us learn the best way to create maximum pain for the oligarchs.', a user said: 'Just-in-time supply chains create huge vulnerabilities for manufacturers'"
    ]
}