{
    "username": "Lasivian",
    "contributions": [
        "\"Quiet Quitting\" is henceforth returned to \"Working to Rule\". [External Link]: https://i.redd.it/zyuip9dwb68a1.png",
        "In response to 'Actually, Work to Rule is also known as \"malicious compliance.\"\nIt's following every rule and regulation to the letter, regardless of common sense, and not taking any shortcuts at all even if those shortcuts do nothing but make your job easier and faster.\nWork to Rule is stuff like, if the policy says you have a tool you need many times a day that's supposed to live in a specific tool cabinet that's to be kept locked at all times when not in use, and the key to that cabinet is supposed to never leave the shift lead's posetion, then\neach and every time you need the tool\nyou go to the shift lead, inform them you need the cabinet unlocked, sign all paperwork to check the tool out, ensure the cabinet is re-locked, go do the work, go get the shift lead\nagain\n, check the tool back in, then go back to your station to continue working until you need the tool again.\nMost people would check it out at the start of your shift and returning it at the end, and nobody would say anything because you use it so often common sense indicates it's \"in use\" the whole shift... but that's not what the actual rules as written say to do, so you do exactly what the rules say.', a user said: 'Yes, and it's up to management to change the rules if they don't like people following those rules.'",
        "In response to 'station liquid plough airport racial truck cough mourn offbeat plucky\nThis post was mass deleted and anonymized with\nRedact', a user said: 'Getting fired is not the point. The point is to do exactly what you're supposed to, and nothing more. Because your employer is only going to pay you what they agreed to, and nothing more.'",
        "In response to 'jeans stupendous joke person consist arrest fuel ossified different cows\nThis post was mass deleted and anonymized with\nRedact', a user said: 'What you are describing is my ideal employee. Do your job and don't do anything else.\nAn employer that wants that is the exception to the rule. When I was an Engineer with Skidata they would constantly ask me to do tons of things outside the scope of work. Once they stopped giving me raises I stopped doing anything except my scope of work. They were not pleased.'",
        "In response to 'Original Post: \"Quiet Quitting\" is henceforth returned to \"Working to Rule\". [External Link]: https://i.redd.it/zyuip9dwb68a1.png', a user said: 'Share this with your friends not in the sub.\n(Reposted because I forgot to remove social media information. Ooopsie.)'",
        "In response to 'I don't think they are the same thing.  A work to rule strike is an attempt to slow down as much as possible without violating the rules, often by using the rules that are otherwise ignored because they slow things down.\n\"Quiet quitting\" is a boss complaining an employee isn't go above and beyond their job duties.  Not working free overtime, etc.   Someone just doing their job normally isn't performing a work to rule strike but can still have a boss complain they are quiet quitting because the boss wants more from free.', a user said: 'Well, if it's a problem because people are actually following the rules that management has written and management does not like that they should change the rules.'",
        "In response to 'Citation needed.\nI want to spread this everywhere but need good sources.', a user said: 'https://www.jstor.org/stable/40862200'",
        "In response to 'Citation needed.\nI want to spread this everywhere but need good sources.', a user said: 'https://iea.org.uk/wp-content/uploads/2017/06/IEA-Working-to-Rule-June-2017.pdf'",
        "In response to 'At will states beg to differ. You are cattle that can be fired or transfered for no reason', a user said: 'Eventually companies will run out of workers they can abuse.'"
    ]
}