{
    "username": "LastStopWilloughby",
    "contributions": [
        "In response to 'Original Post: Robyn's been quiet quitting for yrs. I've just listened to Ace and Katelyn's pod and they hit the nail on the head about Robyn and Kody's main income coming from the Sisterwives show.\nIt's been annoying me for a while that Robyn's input in the show has slowly been regressing each season. She gives less and less every season. They won't even let the crew in the house now.\nShe has been quiet quitting the show for years. Puts in minimal effort because there's no other way she can earn $. Soon she'll just zoom her talking head into production. 😆', a user said: 'Robyn is very much like my aunt. Both want to play the martyr, and if anything gets tinest bit hard, they act like no one ever has gone through what they have gone through.\nThey also refuse to listen to other people. You can tell them the reality of a situation, and they will then call you a bully or an awful person (or monster in my aunts case), and then expect you to still come around and do the heavy lifting.\nBoth also refuse to do any type of work, and expect others to provide for them because they somehow deserve it? But also the very little work they do do (such as maintaining the home or helping family members with menial tasks) is “really hard.”\nBoth are emotional vampires.'",
        "In response to 'Have someone in my family like this too. It’s exhausting! Always needs help with the most basic of tasks, incapable of work and does the barest minimum to help anyone else. Needs help moving - you show up and nothing has been packed. She is so overwhelmed and just doesn’t even know where to start {{dramatic dry crying!}} Also has men rushing in to rescue her when she bats her eyelashes and wide eyed pleads for their help, until they burn out or she gets bored and then moves on to her next victim.\nIt took me a few seasons to realize that’s why Robyn gives me such ick. I’ve lived this and it’s zero fun', a user said: 'I feel so bad for Robyn’s children. You can definitely see the effect living with Robyn and Kody has had on them.\nI truly hope being involved in a church community will give them a bit more freedom and ability to spread their wings.'",
        "In response to 'I can't help but feel like them trying to push to be allowed to go to church is them trying to come out of the isolation they were forced into, even before COVID.', a user said: 'I feel the same way.'"
    ]
}