{
    "username": "lateralus1082",
    "contributions": [
        "In response to 'Screw this.  I've learned in life nobody really gives a fu*k about you.  So you gotta do you boo boo.  You best believe I'll screw a so called coworker over anytime if it comes down paying bills for my family.  sorry yall.  Love ya..but you're not more important than myself or family.  Management should have managed better, screw them and their corporations.', a user said: 'Yep. No one else puts food on the table and a roof over your head. That’s why you care about yourself and none of your coworkers. Because at the end of the day, they’ll do the same.'",
        "In response to 'Original Post: When you quiet quit/ride it out till you get fired, it negatively affects others in this community I had a teammate who had been dropping the ball for a while and was finally let go this week. His output was so bad that my manager noticed and did some digging. Turns out he barely worked at all and was clearly just coasting till he got fired.\nWell, my manager and skip are PISSED and literally called out how they think our old teammate was working multiple jobs. In my xp, they definitely were as they had many signs.\nRegardless, it’s now coming back to bite my team and me with new policies. Yes I’m pushing back on all the BS coming our way and trying to minimize it, but I wouldn’t be surprised if activity monitoring software came up soon to flag suspicious activity as well. This gig has been great for OE for years and now it’s in jeopardy because someone couldn’t just quit when they were done… I have friends (OE and not) at multiple other companies who are dealing with fallout like this as well.\nMy point being, when you pull the anti work card and coast like this just waiting to be fired (which I see recommended here daily), it’s not an isolated event. You get your bag a bit bigger and your teammates (and fellow OEers) deal with the fallout.\nIt helps to push for more RTOs that may have not as it eliminates the possibility of many of these issues. This also affects remote offerings (wayyyy down from what I’m seeing myself in new job hunts)\nHow would you feel if others put your extra paycheck(s) in jeopardy?\nGet your bag, but don’t screw others over while you do it.', a user said: 'I care more about what I’m having for lunch than my coworkers. When you’re that disgruntled to where you do below minimum work, it’s game over. At the end, your feelings after he left, means nothing to him or your boss.'",
        "In response to 'Yup, he gets away just fine save for the burned bridge.\nI wouldn’t expect to be prioritized over him, but when you directly act for your benefit at the expense of others (especially when it’s not necessary) that speaks to your shitty character.', a user said: 'No one cares about what others think of their character because when they are done with the job, they’ll never talk to you again. Everyone working is there to support themselves and/or family. We all act for our benefit, and if it’s at the expense of others, oh well, better you than me.'"
    ]
}