{
    "username": "LaughableIKR",
    "contributions": [
        "In response to 'I do IT security for the government. We used to get emergency firewall change requests which 99 percent of the time are due to people waiting until the last minute.\nI told my manager we get a slew of these changes Friday afternoons that are due Monday morning…. \nSo we changed the requirements for emergency requests that the government employee had to be on hand ready to test the firewall change.\nFriday afternoon emergency change requests dropped considerably to 1 a week if that.', a user said: 'This is exactly the reason I don't have meetings on Fridays.  Ever.  It's for the last-second bullshit they waited all week to tell me about.'",
        "In response to 'Original Post: Why is “quiet quitting” even a thing? Quiet quitting is defined as someone only doing what’s in their job description and nothing more. My question is: why the fuck is there even a term for this, and why does said term involve “quitting?” Why is it apparently an expectation that someone should do more than what they have been hired to do? This is something that has always appalled me, ever since my very first job.\nIn one of my first jobs, my boss would give serious side eye whenever I refused to do something that pretty clearly wasn’t part of the job I was hired to do. I wasn’t particularly successful in that job and quickly realized that part of doing the corporate dance is doing whatever people ask you to do at all times no matter what.\nThe thing is, doesn’t the term “quiet quitting” imply that you’re inherently not doing part of your job? Shouldn’t that be the proper definition? Not “not doing things that already aren’t part of your job?” What the fuck is happening lol', a user said: 'You do your job.  Takes 6 out of the 8 hours roughly to get the job done.  Your coworker leaves.  You get his work while they 'find someone' and that takes months.  Maybe never.\nYou find yourself stressed out trying to rush through 12 hours of work to get it done in 8 or 9 hours.  You do this every day and you are just tired.  Burnt out.  Stressed.  No relief in sight and your boss's boss doesn't care 1 bit.  The company is claiming record profits but they can't staff your position correctly.\nSlow the hell down.  Put it on management to fix the problem.'"
    ]
}