{
    "username": "LaughDarkLoud",
    "contributions": [
        "In response to 'Original Post: What to do if my counterpart has \"quiet quit\"? One of my coworkers has been quiet quitting for a long time. But we're basically in a workplace where people are unfireable (government job). His boss does not seem to want to confront him about slacking, so instead, she gives his work to me and makes everything about \"we\" and \"us\" instead of \"him\".\nInstead of telling him directly, for example, \"hey PERSON X, why aren't you responding to my e-mails?\" She'll e-mail both of us and say \"Hey Team, why aren't you guys responding to my e-mails?\" (When it's very obviously him, not me.)\nWhen he decides not to do his work, she just gives his work to me.\nHonestly, I don't care if he quiet quits -- that's his business. But when his refusal to do work is falling on my table, that's where I start to see things getting problematic. How would you deal with this situation? Telling on him is not a good option, we are equals in the workplace and he considers me a friend.\nEDIT: Wow, so many responses! Yes perhaps my use of \"quiet quitting\" wasn't the right choice of words. My coworker came into my office on Friday and told me he doesn't \"give a f***\" about this job but he feels powerful because he feels \"unfireable\". He spends the entire day working on his own stuff (he has a few side jobs that he does). Our boss seems to be intimidated by him and takes the easy way out - instead of giving work to someone who's going to push back, she'll dump it on others instead. Firing someone is an extremely complicated and long process here, and probably not something she wants to go through. The boss is in her third trimester of pregnancy and getting ready to go on maternity leave. My coworker and I have similar job descriptions so it's easy to give his work to me. Addressing the \"friend\" issue: yeah, I don't really know if \"friend\" was the right word here either. But we're equals and I guess you could say \"friendly\" to each other. Coworker brings me baked goods sometimes, has invited me to get-togethers, things like that. Situation really sucks.', a user said: 'You can be fired from a government job, probation or not. It's just that your manager doesn't want to go through the process of doing so. People are removed all the time, although it is less common than private sector'"
    ]
}