{
    "username": "Laughing_Man_Returns",
    "contributions": [
        "In response to 'top down\nThe other way.\nUnless you mean top falling down.', a user said: 'no, it in Japan this can only happen from the top down. if the boss goes home at 5pm, then the workers can do home at 5pm. seniority matters way too much and that will not change until the last Japanese person dies alone on a now deserted Island.'",
        "In response to 'Or the winners in next revolution will wave dakimakura instead of a flag.', a user said: 'not even then. even the daki wavers grew up within that system, they will never know any different.'",
        "In response to 'With a work culture as strenuous and quite frankly insane as Japan’s, it’s about time they started throwing their hands up and just saying fuck it.\nI don’t like the term quiet quitting. It’s a pedantic attempt at gaslighting by the rich and corporations to make us work harder for less.', a user said: 'they have been quite quitting for decades now. this is at best the willingness to talk more openly about it, instead of everyone knowing but still pretending like they are actually working all the time.\non the \"upside\" just sleeping at work \"because that is how hard you work\" is sort of normal.'",
        "In response to 'At least they’re starting to talk about it. Work is literally killing them.', a user said: 'One can only hope something changes, but considering how long it took between Karoshi becoming a word and even somewhat talking about the reality of the situation... I am only mildly hopeful. maybe in another 60ish years?'",
        "In response to '\"Work ethics\"\nMeanwhile, Japan is headed full throttle towards a societal population collapse due to ridiculously low birth rates.\nGovernment and corporate:\nWhy is this happening!?!?', a user said: 'Women whose career opportunities end with making coffee and men who stay so late they might not even go home between workdays:\nit's a mystery us lowly peons will never figure out.'",
        "In response to 'Let's not forget wages so poor, they don't allow a couple to afford a house and car in this day and age, let alone\none\nperson.', a user said: 'considering the context here is Japan, while wages are low, or rather haven't risen since the 80s or something, abandoned houses are all over the place, so that is less of an issue. and the biggest barrier to getting a car should you need one, is getting a parking space... Urban Japan is wild.\nfun fact: the yen has become so weak, Japanese people have mostly given up on the idea of going abroad, leading to further deterioration of their second language skills, which where terrible to begin with.\nit's a very strange dystopia, not gonna lie. but at least the food is nice.'",
        "In response to 'Original Post: Japan's historic work ethic is declining—45% of workers admit they're quiet quitting [External Link]: https://fortune.com/article/japan-work-ethic-declining-45-percent-of-workers-quiet-quitting/', a user said: 'if they are quite quitting, then they are still there... which means nothing changes. Japan did not have a \"work ethic\" problem, it had a \"appear like you have work ethic\" situation since forever. it's nice that more are willing to speak up about it, but at the end of the day it was always about being first one in, last one out, didn't matter what happened in the 14 hours in between.'"
    ]
}