{
    "username": "Laval09",
    "contributions": [
        "In response to 'That's what I took it to mean too\nAnd it's totally a thing. I've hired at least 5 new employees in the last few months who accepted the job and then just didn't show up for their start date and never replied.\nThey accepted the terms then changed their mind and couldn't be bothered to tell me leaving me without staff I thought wanted the job.\nHow people think this is appropriate or support this is fucking baffling.\nThey should be ashamed of themselves. It's a sign of our fast food culture. It's happened to personal relationships via tinder and its now happening in professional relationships', a user said: 'Personally I've never done that. But i can understand the circumstances that would prompt something like that.\nWithout criticizing anything you did, i'll tell you about a time i quit drastically because the \"terms\" had been misleading on the employer side. There was 2 shifts up for offer. 8 to 5 and 1 to 9. I took the 1 to 9 because they were critically short on it. I was told that the evening shift had the same two 15min breaks as the day one. I specifically asked.\nWas Wednesday of my first week when i was out on the second 15min break and they came out to tell me theres no second break for evening shift, only day shift gets two breaks. I took it again the next day and they came out to tell me id be fired if i did it again. So Friday at that \"breaktime\" i got in my car and left. Got my last cheque in the mail a few weeks later lol.\n2 breaks per shift was the deal. I would have declined to be hired or declined to be on that evening shift if i was told upfront that it was only 1 break. Im a smoker and its important for my composure. They lied upfront because they were shorthanded.\nI used an example from myself cause im not saying youre a bad employer or anything.'",
        "In response to 'It's classic double speak.\nCompanies love to use fake platitudes, like good culture, they love saying work life balance when in most places it is non existent, or want you to go above and beyond but not pay you for that free value added that you are providing, or the new pressuring you to work for free OT or they will threaten to fire you.\nI've stop counting the number of unpaid OT I have worked at my last 2 jobs. They put too much on your plate that it's impossible to do during your regular shit, and complain if you don't get it down with firing you, and the only way to complete it is to work free OT. It's bullying and intimidation.\nWhy is there not a more equal distribution of income? Why are CEO's paid so much money to do nothing but cut job, and demand a smaller workforce to do more?', a user said: 'Twice I worked for a place where i did unpaid overtime. Was a contractors cutting grass  in municipal parks as their main operation.  There was also corporate customers and community centers, apartment blocks and rural customers, ect.\nThe deal was he doesnt count overtime and in return if its a rainy day its a day off paid. To their credit, both of them made good on their word during that one week of 3-4 days of rain we get every summer. Which counts, because on a week like that, anyone who didnt get their grass cut that week writes it down and gets a credit at the next contract renewal. Paying the crew to stay home, paying insurance on idle trucks and equipment, and writing off the days revenue, ect. I accepted the deal as fair.\ni now work for a mega corporation that asks you do to overtime one week just to negotiate with you the next week on how much overtime you should be paid for.'"
    ]
}