{
    "username": "learnedbootie",
    "contributions": [
        "In response to 'You've learned a valuable lesson: Your employer is not your family, an acquaintance, or even a disinterested stranger on the street saying a polite 'Hello!' as you pass each other.  Employment is a financial transaction; you get money for your labor. And in every financial transactions, the principals are always trying to improve their side of deal.  Employees look for raises, education, and advancement; employers look to reduce costs and increase productivity.  It's adversarial; and toxic companies will do anything to tilt the playing field in their favor.\nDo you keep your signed job reviews on file (you most definitely should...)?  What do they show?  If you are meeting expectations, that's all that matters.  You did your job for the money they offered.  The management trick is getting you to 'exceed expectations'.  A few words on your review that mean absolutely nothing, but allows them avoid properly compensating employees for the additional labor you provide.  In that financial transaction you got a worthless 'Attaboy', and they got money.\nAs for what you should do: Don't go out of your way to seek out more work unless you are being properly rewarded (overtime, salary increase or advancement.)  Be polite but firm: You have a full plate, and you can't take any more on. There should be no shift in attitude for *you*; your *company* has to adapt to the new reality, and that is not your problem. You have and always *will* be a hard worker; you just refuse to be taken advantage of by fellow employees and management.\nYou also need to leave your employer ASAP.  They have already shown they do not respect you, or appreciate your contributions. This may mean lowering your sights to something less 'suitable'; but there are ways of ameliorating the impact of a voluntary job change in a down employment market.\nHere are some\nrecommendations\nyou should consider implementing to improve your career path,  protect your professional reputation, and seek new employment.  I've used them myself to great success. The key is to make a *plan*; to prepare yourself to either stay or leave a company on *your* timetable. To have a fall-back position already prepared in case of hard times (lay-offs, firings, workplace abuse, etc). To control your own destiny. This plan should be regularly updated and ready to go at a moment's notice.  Again: In a financial transaction, the best negotiators are the ones who not only strike a good deal, but are ready and able to immediately walk away from a bad one.\nHopefully this helps.  You're doing good work; just don't let them take advantage of you.  We're the CEOs of our own careers; so we have to act appropriately.', a user said: 'Genius. Thanks for this advice.'"
    ]
}