{
    "username": "leftier_than_thou_2",
    "contributions": [
        "In response to 'It's bizarre how it spread so quickly and people are just acting like it's a real thing instead of corporate propaganda. I swear I hadn't heard the term until like a week ago and now every news outlet and subreddit won't shut the hell up about it.', a user said: 'It's a weird time. It's cheap and effective to astroturf. There's no real safeguards against it. No laws against it. The tech companies are not doing a good job of policing it since they have a libertarian bent and right wingers are loudly chanting they are being censored.\nTraditional media has a conservative, corporate bias too. Their viewers are very old and regressive at this point, their newsrooms are filled with privileged trust fund kids and right wing ideologues who think they need to take back media. And their owners are billionaires who think progressives are insane.\nThose conservative billionaires are carefully funding a right wing social media propaganda machine too to try to claw control back. Turning point and project veritas aren't running profitably on truth, they're being paid to promote propaganda that the billionaires like.\nAnd thanks to the Christian bias in this country, it's always been easy to convince a lot of people they just need to work hard for rich people.\nFinally, the different camps are self sorting, which makes it even easier to spread a lie like \"quiet quitting\" without resistance. Subscribers to WSJ only talk to other conservative business people. Fox news viewers only talk to other fox news viewers. The q Anon people are in an echo chamber.\nIn other words, this is not \"bizarre\" it's an intentional exploitation of changing institutional power to try to turn back progress towards a minority rule Christian corporate oligarchy.\nThe good news is this is the best they've got, and it won't stop the fact that uneducated white right wing Christians conservatives are going to be a tiny minority in the near future.'"
    ]
}