{
    "username": "Leirfold",
    "contributions": [
        "In response to 'Eeeugh bragging about the hours is one that was chronic when I was a chef. You’re not a real chef unless you’re working 16 hour days for 2 weeks without a day off apparently. The only person they’re mugging off is themselves.\nThe trouble is companies know a lot of chefs have this old school mentality and exploit it, putting them on salaries and making their situation impossible unless they pull stupid hours.\nThe last place I was a head chef at before I quit, my contract was 45 hours. So that’s what I worked one week just to make a point. I came into work on Monday and left packed up for a long weekend off at the end of service on a Wednesday leaving them without a chef for 4 days till I came back on Monday. Weirdly, immediately after that he hired 3 more cooks.\nFortunately I got out of it just last month after years of mental anguish which at one point put me in hospital lol.', a user said: 'Absolutely second this from another chef. You werent really working unless you did 60+ hours a week for some reason. Most of us were heavily smoking, exhausted and depressed. Made for a great work enviroment as you can see.'",
        "In response to 'Yep, me too. Thankfully had an epiphany early on and realised what a negative, toxic and overworked environment most kitchens were and got the hell out of dodge. Heavy smoking, drinking and rampant speed and caffeine consumption was normal across the board, and I worked in an AA rosette establishment. Working through splits was normal, and you basically signed up to never have a weekend off ever again in your life or a decent Christmas.\nI really hope things have changed nowadays.', a user said: 'I cant say for sure but i dont think so. I dont think ive ever worked in a kitchen where someone wasnt on drugs. Speed or coke to get throught the shift and normally weed after. Majority of us just smoked our lungs to pieces but theres a significant minority. Fact is youre so overworked, sleep deprived and socially isolated that kitchen becomes your life. Your house is just where you go to sleep. You never have time or energy to even look for another job or career. Thats how i got trapped in it for 9 years till covid forced me to stop.\nIm not going back. Not for anything.'"
    ]
}