{
    "username": "letsgouda",
    "contributions": [
        "In response to 'Original Post: How to Approach Annual Review After I Quiet Quit Almost a year ago, my boss pulled some power move BS and I made two changes as a result: I took work email off my phone and stopped working more than the expected hours. No more extra from me - if an opportunity for a conference proposal comes and she doesn't mention it at the weekly meeting, neither do I. If she has a \"good idea fairy\" moment of something she's really like to see happen I just...don't.\nMy boss's boss knows my boss is a piece of work and after I confided in a colleague that I was thinking about leaving, I was rewarded with a raise.\nSo now we're at the year-end and I put together the end-of-quarter metrics. To do so, I pulled from last year's annual report, and holy hell while we've hit our metrics most of the \"extra\" stuff has fallen away.\nIt will be time soon for my annual review and next year's goal-setting. I'm wondering if anyone has any advice for the discussion. I'm thinking that no good comes of telling her that I'm done doing more than what's required, but I have to think it will be fairly obvious. Anyone have any good advice?\nFWIW we are a team of three, and we replaced the other team member last year, had someone for a little over a month who didn't work out, so I think I can play it off like some of my time was spent mentoring? I also want to stay in this job at least 5 more years because of some specific benefits and the hopes that my retirement-aged boss will quit in the next two years. Thanks!!', a user said: 'People in the comments seem to think that quiet quitting means actually quitting but slowly. What it means is doing your job without going overboard, losing your boundaries, doing 110%, killing yourself for work. It means doing 85% regularly on average while maintaining work life balance and mental health. It doesn't mean you can't continue your job or even get promotions, raises, etc. It just depends on how good your 85% is I guess.\nIt sounds like you are normally a hard worker who goes above and beyond to get it done. This is the time to see if your 85% equals other peoples 100%. If you're worried about your results and preparing answers you're probably still coming out ahead of the field.\nI agree with other comments about leading with the successful metrics, and answering asks about anything above and beyond that your goal was to prioritize meeting the metrics. If they come back with \"everything should be a priority moving forward\" you're going to have to say that not everything can be and start a conversation about what can be de-prioritized next year if they want to shift focus.\nHopefully you can bring up some efficiencies that could buy you some breathing room on the key metrics so you don't have to say a hard no to whatever their additional goals are. Doesn't have to be much especially if they don't also do your job (a new report or system of organization, or automation). Or discuss moving your \"focus\" to different aspects of the business at different times depending on your leadership's goals. Like a snowball plan focusing on the biggest problem area first, and moving on when that is up to snuff. Keep your boundaries but stay positive.\nA lot of times in reviews I make my goals things I'm already working on or are in progress so I can get credit for them. Maybe you already have something you did this year or is mostly done that you could make a goal so you don't have to commit so much time.'"
    ]
}