{
    "username": "Levers101",
    "contributions": [
        "In response to 'Original Post: “Quiet quitting” academia Due to the current funding environment, my research career is in the tank. My university says they will continue to pay me for 6-12 months (I’m in a soft money faculty position but they are finding money to pay those of us with terminated grants), and they want me to continue to submit grant proposals. In no way do I want to waste my energy writing grants that will not get funded, and for so many reasons I am ready to put this part of my life behind me and get out. Is it unethical to let my university continue to pay me while I build out my exit plan? What do I say to them when they press me to keep submitting grants and I know I am not going to?', a user said: 'I'm also in a mostly soft money position but have been lucky (so far).\nMy guess is that Universities doing these sorts of things are 1) hoping that something will turn around (e.g. Congress/SCOTUS intervene, etc.) and terminated grants will be reinstated or 2) understand that folks are in a tough position and are giving a bit of a soft landing because if (1) somehow magically happens, they benefit, or 3) they also benefit if someone with a grant in review gets funded in the 6-12 month period.\nNo Dean or Vice President of Research should be so naive to think that with the current federal chaos and intense competition at the NGO/foundation funding trough that everyone being offered 6-12 months bridge funding are going to hit new funding sources. Even in the before times, turn around on submission to award was often >6 months (NSF states up to 6 months). The last full proposal I wrote for a DoD-led FOA was stating in the FOA to budget for explicit dates nearly 1 full year after full proposal submission for a start date. With contracting headaches that would most likely have been closer to 15-16 months. Now with program officers being axed, everything will take even longer even if you have an outstanding panel review.\nBut 6-12 months is an awfully wide window. I'd push to get expectations in writing if you have even the smallest inkling in staying. All it takes for 12 months to go to 6 months (or in 2 weeks if nothing is in writing) is a prestigious TT faculty member with a large group getting funding cut and any money budgeted to non-TT faculty will go to feeding those mouths.\nFinally, half-assing proposals also wastes the time of any pre-awards staff that spend time helping out in things like budget checking, and any considerable paperwork demands for a proposal submission, etc., etc.'"
    ]
}