{
    "username": "lewisluther666",
    "contributions": [
        "In response to 'Original Post: How do people feel about the ‘quiet quitting’ trend? From an employers and employees POV. I’ve seen lots of articles about this recently and it’s made me curious.\nI personally don’t think you should have to go over and above your job description should you not want to, and you shouldn’t be looked down on for not doing so.\nI did some research and found some resources that support people with quiet quitting such as saying no professionally and setting boundaries (I can link if anyone is interested) but it just made me wonder about this from an employers point of view too.', a user said: 'Might be a bit of an unpopular opinion, but...\nIf you are doing it, absolutely fine. More power to you. It shouldn't be looked down upon to just want to come in, do your job, no more, and go home. \nI am currently doing this, myself. In fact I have asked to be taken off of some extra duties that I have been given over the last year.\nHOWEVER...\nIf you actually want to progress within your job and make it a career, don't be surprised if you do \"quiet quit\" and you get overlooked for promotion.\nTaking initiative, helping other people/departments, going above and beyond are all things your employer will tend to look for, just to make their shortlist.'",
        "In response to 'Going \"above and beyond\" rarely gets rewarded. Workers are just exploited for doing more work and taking on more responsibilities than they're paid for in the hopes they get a pay rise or are promoted. Employers dangle this carrot with zero intention to actually reward them because they get extra work for free without having to employ more people.\nThat is literally why people end up \"quiet quitting.\"', a user said: 'I think you are misunderstanding my meaning.\nThere is a difference between doing extra because it's expected of you and doing extra to shine.\nNow I'm not saying that there are shitty bosses, where the only way to move up is to kiss arse etc etc.\nAll I'm saying is, if you take the quiet quitting route as your standard for life, ie. You will never go above and beyond for any job ever, then you will certainly get overlooked  when the time comes with a good employer.\nYou also need to consider that, you might be going above and beyond with a good employer, but something else gets you turned down. And I think there are many people that are in this situation, and the response in their own mind is \"I do so much for this company, but they never promote me\" or whatever.\nThey don't take the time to consider it could be something else.'"
    ]
}