{
    "username": "LiamTheHuman",
    "contributions": [
        "In response to 'Just replying to the TLDR - title does not match the summary you provided. Title blames a worker for job-related behaviors and/or poor performance though you say later* in the TLDR that capitalist countries like the United States are oligarchies.\na laborer under a functioning capitalist society exchanges an agreed-upon quantity of labor for an agreed-upon wage.\nThere are many ways to enforce labor and wages that are not being described here. \"Functioning\" is also a relative term for a social system. How is something functioning or who is it functioning for?\nThe economy under which most of the Western world currently exists has become vastly preferential of business owners and corporate elite through pure corruption,\n\"Business-owning\" is not synonymous with \"corporate elite\" - even through a Marxian analytical lens, there are members of the petit-bourgeois and haute bourgeois. \"Corruption\" is not really descriptive for if you mean that it might be difficult to become an active player in a market (owning your own means of production and distribution etc.) Are banks corporations?\nthe idea of \"quiet quitting\" is just a small yet potent example of how the wealthy have been actively and increasingly exploiting the working class for decades\nThis isn't a new idea, just new terminology for a phenomenon that's been described as worker fatigue, burnout, mild sabotage, slacking off, etc. There's also things like strikes, which are \"organized slack-offs.\"\nPlease change my view because, as a highly politically and economically educated person who was born into a problematically socialist society and raised in another, now living in the US, I desperately want to be able to support the widespread prosperity afforded under a capitalist system, but the US has already easily passed the threshold from capitalism to oligarchy.*\nOligarchy is a term used to describe the demographic make-up of a legislative or governmental/state apparatus/body/etc. (the connotation is negative or incendiary, unlike, maybe, \"plutocracy,\" in social science texts I've read so far) and not necessarily an economic term. It sounds like you could probably start a business or a charity or something if you feel inclined to share something that you feel \"non-capitalist\" countries lack.', a user said: 'This post doesn't really try to change OPs view, it just attacks it.'",
        "In response to 'It's not really clear what OP's view is.', a user said: 'ya I guess that's fair'",
        "In response to 'Inflation currently is almost entirely supply side driven\nThat's 100% incorrect.  Supply cannot drive inflation as it's not the item being chased.\nAmerica actually has a lower inflation rate than most other countries and all western countries are experiencing high inflation regardless of how much demand they induced by Covid stimulation\nThis is a particularly bad handwave of the problem by ignoring that most economies are reliant on US dollars for their economy and also printed large quantities of money to hand out to people.  So they compounded their problem by printing off more dollars to chase the same amount of goods and then using a trading currency that is doing the same.\nI am unsure why anyone thinks that inflation is a supply issue of anything but dollars.', a user said: 'Because inflation can be caused by low supply. This is well established. It's also pretty well established that we are in a time of low supply for many things. So it's about as reasonable as saying printing money caused inflation. I don't know enough about economics to know why one is more a cause than the other but acting like supply shortage couldn't cause inflation is ridiculous'",
        "In response to 'Because inflation can be caused by low supply. This is well established.\nIt most certainly is not.  Inflation is about the amount of dollars chasing goods, not about the goods themselves.  When technology improved and the cost of flat screen TVs went down, we didn't call that deflationary, because it isn't.  The natural increase of the price of goods isn't what inflation is.  That is established.\nSo it's about as reasonable as saying printing money caused inflation.\nWhich is incorrect.  Inflation is explicitly the amount of money chasing the same amount of goods.  We have massively increased our monetary supply chasing the same number of goods.\nI don't know enough about economics to know why one is more a cause than the other but acting like supply shortage couldn't cause inflation is ridiculous\nYou don't know enough to tell me why, but you speak as an authority to tell me that it is?', a user said: 'I have enough knowledge to know that short supply can cause inflation but not enough to know which is the cause in this case. It was pretty clear.\nP.S.\nInflation is defined as 'a general increase in prices and fall in the purchasing value of money'. if everything goes up in price because of issues impacting global supply then your money now purchases less. If you still don't get this then you are likely just suing your own definition of inflation.'"
    ]
}