{
    "username": "liesancredit",
    "contributions": [
        "In response to 'Trust me, I understand. I live in Austin, Texas. University of Texas is here with 70,000 students. In the last 6 years, Tesla, Oracle, Charles Schwab, Amazon, Google, Samsung Semiconductors, Intel, and Indeed have all joined Dell, National Instruments, and others here. Apple just completed its second billion dollar facility. And every one of them have filled their positions and are now hiring on a ‘as needed’ basis. Oracle tore down 5 apartment complexes and built there own little city.\n(This has also double property values and almost doubled rental rates. We sold a 1,500 sq ft 3-2 modular home for $300,000 but had to move 45 minutes north to find something we wanted without the inflated price. Found a 1,750 sq ft brick 3-2 for $200,000.)\nBut, all that has pulled a lot of people to Austin looking for tech jobs even though they are filled up.', a user said: 'And people thought Austin was hipsterized before all those tech companies moved there because Twitch Streamers and lefties lived there.'",
        "In response to 'False. If your business requires a commodity and you don’t invest into that commodity, it’s just poor management.\nShortages imply factor outside of your own control. This isn’t that. It’s a result of extremist capitalist ideology, a long know contradiction of capitalism.', a user said: 'Exactly. Also the so called \"shortage\" is the ideal. That's what people also forget. It's ideal there are more job openings than people looking, and more jobs than workers. The only alternative is more workers than jobs, which implies high unemployment.'",
        "In response to 'And yet all I see on reddit is people complaining about how they can't afford anything. If I was strapped for cash the last thing on my mind would be to work less hours. Maybe the economy isn't that bad, people just complain more because they got used to a higher standard of living during covid.', a user said: 'Most people don't have a lot of free time. If you're home by six you still have to cook, do chores, shopping, that leaves only an hour or two that one could work extra. Most people don't do it because it feels dystopian.'"
    ]
}