{
    "username": "Link462",
    "contributions": [
        "In response to 'That doesn't support the narrative though...\nThe unfortunate reality is that for it to be doable for most companies it would require other companies to also be doing it because responding to customer needs is not only good business, it's likely a contractual requirement.\nI say this coming from a large public company which offers permanent \"flex Fridays\". If you have your work in a good spot and no meetings you can sign off early. And most people follow it. Even if they are working they don't schedule meetings so others can take it. I don't think I've had a single friday afternoon meeting (after 1pm for my time zone) in at least the last 6 months and regularly shut down myself between 1-2pm.', a user said: 'No one said that they have to give everyone the SAME 4 days.  Your argument is a non-starter.  You're asserting that the company would only be open/responsive 4 days week.  A company could easily distribute the days off for individual employees across all 5 weekdays.\nThe only thing that would require would be potentially hiring more 4 days employees to fill in the 20% attendance drop.'",
        "In response to 'Yes… 20% more employees is a non-starter for any economic plan. The US is at 3.4% unemployment and you think forcing companies to hire 20% more people is going to be reasonable? It doesn’t even make sense just on basic math.', a user said: 'That's why i said attendance, not productivity.\nThe likely need to hire more people is going to be significantly less than 20%.\nIf I'm managing a team of 5 people for example, having one of them off every day and everyone else covering the communication needs probably isn't going to require another hire.  Depending on the workload redisribution you might need to hire only 1 extra worker. Each case is obviously unique, but in this hypothetical growing a team from 6 people (including me) to 7 people is a 15% increase.  The more people on the team, the smaller that number becomes and the need for more employees lessens.\n​\nEven at 3.4% unemployment that's still hundreds of thousands of people looking for jobs.'",
        "In response to 'Love this quiet-quitting bullshit. Like doing only the contractually obligated amount of work is somehow cheating the system. Am I being quiet-fired everytime my employer only pays me for as many hours as I worked?', a user said: 'yeah it's an insidious idea that doing only what you're asked is somehow less than the job requirement.  It doesn't make any sense that the default mode is \"above and beyond\" that completely negates the point of \"above and beyond\" if \"everyone\" is doing it as a baseline.'",
        "In response to 'I think of quiet quitting more as a mentality. No drive to promote or improve performance review. It’s not good and it’s more than just doing your job.\nIt’s like the guy who takes his lunch in the lunch room and won’t let anyone ask him questions. “Bob the computer system is about to crash what do we do?”  “I’m on my lunch and still have 15 mins”. Sure he is owed his lunch but is letting the system crash doing him any favors?  He’s the one who runs it and is going to have to fix it so not interrupting his free time is not only hurting the company but hurting him.  And now everyone thinks he’s kinda a jerk.', a user said: 'Nope\n\"Sure he is owed his lunch but \"  No buts.\n\" He’s the one who runs it and is going to have to fix it \" - not his problem. If the company doesn't have the foresight to hire a backup to do any given job, that's not the employees problem. That's bad management and planning.\n​\n\"  And now everyone thinks he’s kinda a jerk.\"  - \"Everyone\" should recognized that the company created the issue, not the employee.  This is how time/job creep sets in.  The company paid the person to work 9 hours a day with a 1 hour lunch break, I'm assuming.  He's entitled to that time.'",
        "In response to 'Original Post: Companies Decide to Keep Four-Day Workweek After Finding It's Better | So-called \"quiet quitting\" could decrease if companies move to a four-day workweek, an ongoing UK study finds. [External Link]: https://gizmodo.com/four-day-workweek-remote-work-tech-jobs-1850139680', a user said: 'This article doesn't say it, but other articles about the study state:\n​\n\"A total of 61 British companies with around 2,900 workers were enrolled\nin the trial, with employees working an average of 34 hours across four\nday between June and December 2022, all while keeping their existing\nsalary.\"\n​\nSo it's 4 x 8, not 4 x 10.'"
    ]
}