{
    "username": "Lithogiraffe",
    "contributions": [
        "In response to 'My ex bought me an expensive designer handbag thinking it wld fix everything.  Bc for him he wld stay in a relationship for material goods.  Definitely projection on his part.  For me, it was confirmation that he really had no clue who I was bc material goods don’t mean much to me. Lol', a user said: 'I would use that reasoning to be selfish and keep the bag. And so that it teaches him --no,  relationships should not be based on material goods, and a purchase Will not buy forgiveness or contractually buy someone to you.'",
        "In response to 'It never fails does it?  They're such idiots.  Don't stress.  This guy is obviously too dumb to get it.\nEDIT: The beauty is, anyone with half a brain is going to know why you backed off on the extra little fun stuff, and no one will blame you.  They'll blame him.  And guess what, that's going to add up.  You might not still be there to see the karmic avalanche, but it WILL catch up with him.', a user said: 'Wait, will they know that it wasn't OP's fault and blame the boss?\nEspecially since OP has learned that it doesn't safe to vent in the office. They probably don't want to vent and complain about being written up.'",
        "In response to 'It sounds as if they're pretty tight with OP seeing as how, prior to this, they felt safe to vent to her.  Clearly that's all going to end now and I can't imagine why OP wouldn't subtly let it be known why.', a user said: 'I don't think OP should even let it be known subtly. It reads like their boss legitimately was listening at keyholes. I'm not sure if you want to even subtly complain in that environment.'",
        "In response to 'No idea, he gets in these moods sometimes. Part of me wonders if he's been getting crap from higher up and it's just seizing an opportunity to try and look better. Like if our evals go from ok to fantastic in a few months it will give him some kind of benefit on his next eval?', a user said: 'What do you mean?\nLike he is purposely underselling evals so later it looks like there was growth?'"
    ]
}