{
    "username": "livelearnplay",
    "contributions": [
        "Hey guys, I was “quiet quitting” until I got fired , now what? So I just got fired and they recommended me to file for unemployment insurance. HR was surprisingly nice. She basically told me they don’t contest the claims, so I think if I use the right words in my unemployed application,\nI might be eligible for unemployment insurance.\nHas anyone successfully received unemployment insurance benefits in this situation before and lives in the state of Illinois? One of the questions is below:\nAccurately report your reason for separation from your job when you initially file your claim for benefits.\nEDIT: I  shouldn’t have used the term “quiet quitting” on my post because I used the term incorrectly, my apologies. I meant to say, I was really underperforming on my job, barely doing any work for the past year or so. I did the bare minimum. I was  then placed under an improvement plan for a little over 6 months or so. They saw some improvements, and I was doing okay, until I mislead my manager with 2 assignments. I stated that I had completed the assignment but in reality I used last year’s data to mark it completed, while I attempted to catch up over the weekend.\nI never fixed the assignments and my manager found out what I did. That’s when she went to HR for the next steps. I emailed HR for a written confirmation on why I was fired and she responded “unsatisfactory performance.”",
        "In response to 'Damn, I bet that whole thing was hard to deal with.', a user said: 'I cried hard for a good 5min letting it all out, but feeling better now'",
        "In response to 'I used something similar.\n“Released with no misconduct”\nMy manager who let me go actually helped me brainstorm. Long story short, my partner was caught stealing, and it was on my shift. If I was more detailed on my documents, I should have caught it, and I was in charge at the time. The whole team was let go, and the offender was charged with theft. (It was a lot of cash stolen.)', a user said: 'I like this - I think I will use it. I was in fact terminated and didn’t breach any company policies that the state of Illinois would count as misconduct.'",
        "In response to 'Stop using that bullshit term for the rest of your life. You were doing your job.', a user said: 'Naw i was actually slacking off and trading on the side, so i was bad'",
        "In response to 'That’s not quiet quitting, FYI. Quiet quitting means literally “only doing your job.”', a user said: 'Oh i  meant like ghosting on the job, I misunderstood the quiet quitting'",
        "In response to '\"No reason provided.\" I mean it's the truth, right? They didn't give you an explanation when they fired you? If that's the case, then it doesn't matter what you were doing that you think earned you termination. All that matters is that whatever it was, the company didn't bother telling you.', a user said: 'So Hr just verbally told me it was due unsatisfactory performance. Should I state this on my unemployment application?'",
        "In response to 'NO!\n\"No reason provided!!!!!!\"   You have the best advice handed to you on a platter.  You continue to question it.  I get that you are internally freaking out, and want to do the right thing.... But... Man... \"No reason provided\" is the best option.\nThey got you on a video stealing boxes?  No reason provided!\nYou slapped your manager?  No reason provided\nGot caught snorting coke im the break room? No reason procided\n...get it?', a user said: 'Got it! I will go with no reason provided and go from there!'",
        "In response to 'Not in writing = wasn't said/didn't happen. They can claim they said that but if they don't have it in writing that that was the reason and that they told you it was, then you have no reason to list it.', a user said: 'I email Hr to get something in email and she responded I should state as unsatisfactory performance, i do have proof in writing.'",
        "In response to 'The 'no reason provided' thing can make you look dishonest, so I do not recommend that when you would qualify with the truth.', a user said: 'Right! I feel it will get denied and I will have to jump through hoops and appeals to try to get them to approve me as opposed to just being honest and saying they didn’t like my job performance. It’s wasn’t my fault and it’s honest. I’m going with this reason, i will update you guys later on.'",
        "In response to 'Tell them you were fired with no reason provided.\nWhen I filed just a month and a half pre-Covid shutdown toward the end of Jan 2020, they ended up calling me for clarification. Told them there were no disciplinary issues leading up to the termination and all my termination letter said was they were choosing to go a different direction with the position. I ended up initially getting denied, and I shit you not the denial letter said the company choosing to go in another direction indicates I was fired for misconduct. If something like that happens to you, stay the course. Keep doing your certifications and take it to the next step of appeal. Here in Illinois, that is a \"referee\" who will re-evaluate the claim. So in my request to have my case reviewed by the referee, I put on there that my termination letter indicates that the company will not contest my unemployment claim and also that my last corrective action had been almost two years prior and the behavior wasn't repeated. I didn't even get a phone interview that time, they just passed me and back-paid me for my eligible weeks that had elapsed during the process.\nKeep in mind that from the state's perspective if the termination sounds \"iffy\" they will probably initially err on the side of denial. After all, if they pay out and the company contests the claim and the judge rules in the company's favor it will be a huge pain in the dick for them to recover the funds paid out to you which you probably have already spent. On the flipside, while you may be temporarily broke for a few weeks, backpaying you is easy peasy for the state.\nThose with temporary layoffs and a set return to work date, those with seasonal work (farm hands, school bus drivers, etc), those whose companies did an RIF or closed altogether... they'll get approved without hassle. Fired with no reason given, or at least a shitty vague reason? You may have like one minor hoop to jump through but stay the course its worth it.', a user said: 'Thank you for your response! So i didnt get a termination letter or signed anything so that’s good. I emailed HR yesterday to clarify their decision and they responded I should state on the application their decision for firing me was due to unsatisfactory performance. In the eyes of the state, is this considered misconduct? I wonder if I go your route or just say a long the lines “employer no longer thought i was a good fir for the role”'",
        "In response to 'What did your employer write on paper?', a user said: 'No paper, didn’t have to sign anything else, employer just said verbally unsatisfactory performance. Would that still grant me unemployable benefits?'",
        "In response to 'They are lying by the way. They will contest it lol', a user said: 'Naw man doubt it they were actually really good heart people. My manager was actually crying when she delivered the news, which actually made me feel bad. It felt like disappointing a mother and she was really sad. Not all people are bad'",
        "In response to 'You can just write “unsatisfactory performance”. Illinois doesn’t really care unless you are fired for misconduct, I.e., actual breach of the law or deliberate violations of company rules. They may call you to conduct a phone interview to confirm, but it sounds like you’re in the clear.\nBeing fired because you suck at your job doesn’t disqualify you.\nSource: literally just did this myself.', a user said: 'Aaah great thanks for replying 😄. Others here want me to lie like saying laid off but because i sucked at my job I should be able to collect some unemployment'",
        "In response to 'You just stop going in to work or doing any of the work. You never tell anyone anything. It’s like ghosting someone on tinder but for work.', a user said: 'This'",
        "In response to 'Did the exact thing! Colorado. Getting unemployment', a user said: 'What did you put on your application for reason for termination? HR just verbally told me it was due to unsatisfactory performance. Would this work?'",
        "In response to 'Quiet quitting you mean not working or working 8 hours as intended by contract ?', a user said: 'A combination of both, HR confirmed i was fired due to unsatisfactory performance'"
    ]
}