{
    "username": "livebeta",
    "contributions": [
        "In response to 'If working hard is the sole precursor to success, all the farmers will be fking millionaires.', a user said: 'some farmers in the USA are millionaires. farmland as big as towns in Singapore, and of course, federal subsidies to ensure they're profitable.'",
        "In response to 'Most times negotiation won’t work. Look for another job first. Even if you want to negotiate, you can ask the current company to match the new offer.\nIf they adjust your pay without you having another offer, you may talk to your colleagues and they all want the same thing, whether or not they are good enough to secure a higher offer elsewhere. So it won’t happen. You have to have another offer as a bargaining chip and “proof” that you’re worth that much.', a user said: 'never take your employer's counter offer. use that as a counter for the company you want to work at next.'",
        "In response to '5) Mary someone rich also do the trick', a user said: '6) Appointed as Mayor. frankly an appointment that does not seem to bring value to taxpayers'",
        "In response to '[Deleted or Empty Comment]', a user said: 'hawker center signboards\nsome of us have been getting by with\n這個, 那個\n(this, that)'",
        "In response to 'I always thought lying flat is the result of the lack of opportunity for upward mobility (be it in society, work, or any other aspects)\nWho in their right mind wouldn't want to excel at life and be recognized for the effort they put in? It's only when you feel like your effort have no impact then you'll tune out and lie flat/do the bare minimum.', a user said: 'Who in their right mind wouldn't want to excel at life and be recognized for the effort they put in?\ni used to think like that. and i went all out and maxed out my modest stats . Still pretty tiring, and the top of the ladder is just another place to fall off'",
        "In response to 'I'm kinda skeptical of the existence of a job that will pay millions but won't require being corrupt in some way', a user said: '*cough Keppel Corp offshore directors managed to do it what. they totally not corrupt.'",
        "In response to 'Working and exchanging one's time and energy for money/currency is actually quite a new concept in the grand scheme of human history.\nThink back and think bigger, what do humans do back then before the invention and proliferation of currency? They spend most of their time finding food, processing food (I have always wondered how humans of different regions stumbled upon variations of cooking and accidentally created so many kinds of cuisines, it's almost miraculous), building shelters, exchanging stories (creating myths, folklores, and in turn cultures/identities/religions etc), playing music, wonder about/observe nature (thus deriving the marvel that is natural sciences and mathematics).\nMaybe those who have a proclivity towards taking it easy and tang-ping just so happens to think things in the grander scheme of things and what life is, or rather, what more life can be. Some people are lawyers, some people are doctors, some people are business owners and so there is a possibility some people are more spiritually gifted who strives on different things that aren't so obvious in our money-minded society... No right and no wrong.\nMaybe, by inadvertently engaging in capitalist societies, we humans are so tunnel-vision'ed in this so-called default mode of existence, thus depriving ourselves of so much more explorations that could have made humanity so much more vibrant and healthy than just facing excel sheets all day, replying to emails, sitting around in cubicles all day for 5 ludicrous straight days (with only 2 paltry days to be yourself and do your own things), shiny skyscrapers, fancy cars, vacuous job titles and etc.\nWhy is capitalism the default, why everyone just accepted it as it is and why can't there be something else?\nHahahaha, irony as I type these at my desk at work.\ndreams', a user said: '(I have always wondered how humans of different regions stumbled upon variations of cooking and accidentally created so many kinds of cuisines, it's almost miraculous)\nponder the evolution of mushroom eating. 3 outcomes: delirious behavior ending with enhanced / tweaked cognition; delirious behavior ending with death; or delicious edible mushrooms.'"
    ]
}