{
    "username": "Livid-Dot-5984",
    "contributions": [
        "In response to 'Low effort on religion too which cracks me up. She thought those women not sleeping with other men and pretending to be \"in harmony\" with Kody was enough to keep God happy enough to give her her forever planet.\nSo that's why she still \"advocates\" for the family and \"hopes\" and says all the right things without actually doing a thing. Her ass is covered so who cares about everyone else's immortal souls.', a user said: 'Idk why I totally forgot about this belief but it enrages me that she actually thought there was a situation in which she’d get an entire planet to herself as well'",
        "In response to 'I feel like I missed it. I had watched until around season 11/12 then restarted at the second to last season when Christine had left and Janelle and Meri were working on leaving. I just missed why we all dislike Robyn so much. I went back to catch up and even in season 12 Christine is crediting Robyn for her relationship with Kody getting better.\nShe seems to be genuinely devastated by the events in the family. She said from the beginning that she was marrying Kody because of the situation with the other wives. I feel bad for all of them that this is how it’s turned out.', a user said: 'I didn’t get the hate either until I watched the series in its entirety and then later did a rewatch. I honestly don’t think that she’s intelligent enough to have puppeteered the whole situation but you can see that she fairly quickly takes a head wife type position early on. She speaks up first and often as the authority of polygamy etc. She makes sure that Kody has every reason to prefer going to her house which is a lethal combination when she’s the new cute one. She monopolized Kody’s time over the years so much so that she went too far and this is where you see the true cracks start to form in the other marriages. Robyn might not have been doing this intentionally to break the other marriages but she truly was awful at being a polygamist wife in that sense.\nHaving Kody keep trailing Meri along was the absolute cruelest thing she’s done. It’s very quick but in one of the last few episodes Kody accuses Robyn of not allowing him to let Meri go. I think this was him being the most honest about the situation. I mean we saw it ourselves. They say loneliness for a person is as bad as smoking or a substance addiction. People have their own opinions on Meri but keeping her on the line and giving her hope, that was horrific in my opinion. Robyn even says herself in one of the Vegas episodes, not wanting Meri to go to\ncollege\nffs: “I don’t want her to meet other people, make new friends and then leave us which is common in families like ours”'"
    ]
}