{
    "username": "Livia-is-my-jam",
    "contributions": [
        "In response to '51 and yeah pretty much the same.', a user said: 'Just turned 50 (f), left home at 17, lived with flatmates until I was 34, then I lived on my own in a tiny studio flat, quite often could not afford rent and food. Walked everywhere as I did not have a car (lived in London). Did not get married until I was 40, never wanted children. The boomers NEVER let us in to good jobs, we are the cynical generation for a reason, and where I work now the 70+ year olds are still gripping tightly to shit. Not that I want their jobs, have no interest in that, it looks fucking awful. I am good at what I do, do just enough to earn my wages and do what I enjoy the rest of the time. Don't go on vacations, don't waste money on stupid shit, enjoy my friends.'",
        "In response to 'Left home at 19.  Lived with grandparents for a bit then moved in with boyfriend and got pregnant at 20.  Left after 13 years of domestic abuse.  For 13 years worked more than my fair share of dead end jobs sometimes 2 or 3 at the same time because he hardly ever worked.  And now almost 20 years later and another shitty long term relationship and finally landed a decent job as a bookkeeper.  Which after record breaking inflation it might as well be a welfare check.  All I can say is FML. And FTW!', a user said: 'I am sorry that you went through all of that. I hope that you are able to find some space to heal. From one Gen x female to another, sending love..........'",
        "In response to 'Gen Xers were the first gen to get screwed by boomers. In the 90s, the term \"Gen X\" was synonymous with being a POS. When we were kids, they had us raise ourselves & when we came of age, they undermined, gaslit, & swindled us.\nAlso, we had phones, lol', a user said: 'All of this, I was a latch key kid at 5. I sometimes wonder if we get forgotten or not talked about in generational narrative because our experiences would just blow their bullshit up.'"
    ]
}