{
    "username": "LJNeon",
    "contributions": [
        "In response to 'Set your limits. 8hrs (maybe 8.5 if you want to be generous) do what work you can and call it a day. Someone calls after hours, direct them to the other person as youre past your limit.\nWork isnt getting done,.. tell the manager to hire someone else. Cant afford it in the budget, well thats the managers job to figure out.', a user said: 'Funnily enough this is what quiet quitting actually is! It's sad seeing corporate interests manipulate the term to be a negative thing when it should be common sense.'",
        "In response to 'Soft disagree.\nQuiet quitting is doing only enough to avoid being fired. What i am saying is more in line with work to the rule. Put forth effort work hard, but hold the hard line divider on what is work and what is not.\nIn situations like this (saw a co-worker go through this in a govt job; they and their team mate were FTEs and i was a contractor) there is a tendency to just do all the work no matter how long it takes. Cancel vacations, work weekends all that crap,.. and you cant do that to yourself. The boss knows whats going on, but the bosses boss likely doesnt. You put in your 40-45 hrs and fet done what you can. Things fall behind,..? Well then you can say im working 40hrs and look at all the work i do. We need more people if you want more work to get done.', a user said: 'Actually, quiet quitting is when you stick to the job description without going above and beyond or working crazy hours. As you can see in the original post, the coworker is doing far less than that and is still apparently doing enough to avoid being fired. And on the contrary, there are many businesses where sticking to the job description will still get you fired for \"not being engaged enough\" or some other nonsense. Overall the line you have to avoid crossing in order to not be fired is quite variable and by no means part of the definition of quiet quitting.\nHowever you are entirely right in your last paragraph, people tend to let themselves be taken advantage of far too often in this day and age.'"
    ]
}