{
    "username": "lm1670",
    "contributions": [
        "In response to 'This is so funny, “cancel debt for borrowers who earn less then 125k” so, essentially everyone then? Yeah, never gonna fucking happen, just spewing more bullshit, what else is new?', a user said: 'Less than $125K is definitely not everyone, especially for those who live in major cities. In a major city, $125K is enough to just barely get by.'",
        "In response to 'Original Post: Biden getting in on this whole 'quiet quitting' thing. [External Link]: https://i.redd.it/2w7qh0ipwcj91.png', a user said: 'Why not just make the interest rate reasonable so that we can actually pay off our principal?'",
        "In response to 'Original Post: Is anyone else “quiet quitting” or just completely burnt out? I’m just completely over it. I used to be so “hungry” and now I’m catching myself doing the bare minimum, and I genuinely don’t care if I get fired.\nI think the largest factor is that I’m not getting paid until equipment ships and we’ve been on a year+ lead-time, so the carrot is essentially gone.\nI don’t have an ounce of ambition left in me, and it sucks because I have “golden handcuffs” to this job because I have over $50k in commissions waiting for me.\nIs anyone else feeling the same?', a user said: 'Yes. I’ve been experiencing burnout for years. I used to be incredibly tenacious and motivated. I did eight internships in college (graduated in 2008) and got my MBA a few years ago in hopes that I could get out of sales and into something more strategic. Here I am… a sales manager with two reports and the entire Midwest territory. I am constantly on a plane or holding someone’s hand and I am just so. Incredibly. Over it.\nI feel like my $70K MBA was a complete waste and I will never be able to escape this miserable profession. Taking a week or two off won’t do anything to help me out of this ongoing feeling of misery. I used to have so much motivation and I think this changed when I saw corporate for what it is. It’s all politics and optics. No thanks.'",
        "In response to 'Your last statement on corporate is exactly how I’m feeling. I’m realizing more and more how much corporate is all politics and optics. I’m so burnt out trying to please others while hitting my KPIs & quotas. I’m realizing this isn’t the grind I want and I’ve turned into a shell of my former, happy self.\nI’m considering switching careers entirely and gong into something that isn’t controlled by the corporate ladder.', a user said: 'When you figure out what that looks like, please let me know. I’ve been trying to find my way out for about six years now without any luck. I am also a shell of my former self and feel so incredibly stuck. The realization of possibly having to do this the rest of my life makes me want to die.'",
        "In response to 'What did you get your MBA in? Your experience as a sales manager could open lots of doors for you, good on you for making it this far.\nAlso a former shell of myself, I’m beginning to work extensively with a therapist once a week until I find myself. Some career paths I’ve thought about are sports psychologist, physicians assistant, computer science. I love health so much and it’s ironic because sales has destroyed both my physical and mental health. I’m also a problem solver who’s more introverted so I think becoming a developer has potential as well, they don’t stress, make good money and can work their own hours.', a user said: 'I’ve done the therapy thing and the result is that my core values don’t align with what I do. To align my values with a profession would mean I need to take a MASSIVE pay cut. Even then, my therapist warned me that most companies have a way of turning your passions into stressors. She also told me that we are all cooking in the same soup; there is chaos all around us and we are doing what we can to survive. When you’re in a constant state of fight or flight, you’re going to inevitably burn out. The human brain has not evolved much beyond what it was thousands of years ago and we just weren’t meant to live the way we do in modern society. Unfortunately, she doesn’t have the answer. Late stage capitalism has most of us kind of stuck.\nMy MBA was focused in marketing and I have tried at length to get into marketing roles within my field. For whatever reason, I’m only seen for sales which absolutely kills me. Im also an introvert at heart, so the performance of sales is exhausting. I got sober 4.5 years ago, so the entertaining that we are required to do is no longer fun for me. I hate it.\nI hope that you and I can figure it out eventually because I can’t imagine going on like this for much longer. Something has to give.'"
    ]
}