{
    "username": "LondonIsMyHeart",
    "contributions": [
        "In response to 'Original Post: Quietly quitting When I first heard the term 'quiet quitting' I needed to understand more of what that meant. Now that I know, I think that's me right now.\nI've been working the same job for 10 years at a major global electronics company, a name all of you would know instantly. It's a good job, it pays well, it's low stress with great benefits. I am good at what I do and my co workers are cool.\nAnd I don't give a fuck anymore.\nI stopped trying to advance. I stopped going the extra mile. I stopped being the one offering input at the weekly meetings. It just doesn't get me anywhere after all these promises of working your way up the ladder.\nI realized I hit a peak a few years ago and no matter what I do, or how hard I work, it doesn't matter. Upper management are mostly ambitious borderline sociopath MBA career climbers who are all young enough to be my children. They all give a creepy vibe almost like a politician who acts like they care about you, then they talk shit behind your back.\nSo I still do my job but I do the minimum amount required not to be noticed. I don't report errors on our website, I don't correct people when they are wrong. I just don't, period. The biggest thing that put a target on your back here is attendance, like even clocking in 1 minute late gets you on the tardy report that goes out once a week but I never have a problem with that, and quite honestly it blows me away how many co-workers just can't seem to get here on time because we aren't in a giant metropolis with lots of traffic. Usually the younger co-workers are the late one.\nI am in my early 50s and I've spoken with my immediate supervisor who is two years older than me about this, and we're both in agreement that we're too old and lazy to want to start over, so we'll just coast here as long as we can.\nAnyone else feeling this?', a user said: 'The youngs at work have made it EXTREMELY clear that they don't care about anybody's input if you're over 40. We are the enemy as far as they are concerned. Fine, make stupid, expensive mistakes because you don't want to listen to the olds tell about the four other times we tried the same thing. Don't care anymore, I guess they they can figure it out for themselves. Or not. Whatever.'",
        "In response to 'I switched jobs but in the same area. All the people I worked with left after they got a new, terrible, manager. I tried to help, I offered up training, I pointed out errors before they went live, but I was ignored. I recently got a talking to about an email I sent pointing out some egregious errors that went live that were brought to my attention by clients. I was told my tone was aggressive.i pointed out that it wasn’t my tone, it was the person receiving it reading tone into it because they were tired of me pointing out mistakes.  I was then told that it’s been a long time since I have done the job and a lot has changed (it hasn’t, as we are heavily regulated and regulations have been the same for at least a decade) and that processes have moved on. So I stopped. Our reputation within our organization has already tanked since this manager joined, so fuck it, let it leak out into the open. Not my houses, not my rodeo. But when we get audited my ass is covered and I do not give a single fuck.  But hey, what do I know? I just invented half the processes they follow.', a user said: 'That is infuriating. You're right, fuck it all, let it burn. The important thing is that you CYAed yourself. Let the others swing in the breeze if they're not smart enough to either listen or CYA themselves.'",
        "In response to 'It’s been fun watching them make the mistakes I put systems in place to mitigate or eliminate. But hey, I’m just a middle aged lady, what do I know? I am just going to keep sweeping my side of the street.', a user said: 'It IS fun to see them fail until they blame it on the old people who didn't advise them against it hard enough and probably did something dumb. Because it just COULDNT be the youngs. They know everything.'",
        "In response to 'I see that with a lot of engineers in my company. Most are fresh out of college and their turnover rate is pretty high. Most last 2-3 years and they're off to the next gig. The OG engineers as I call them have been here for 30 years and they know their shit.', a user said: 'Oh, yes. Fresh from college, so they OBVIOUSLY know more than everybody else. Sigh. They are exhausting.'",
        "In response to 'Yeah my 20-something coworker has made it clear in no uncertain terms that she thinks both me and my boss are dumb and out-of-touch. She said she’s a new grad, up on the latest and greatest, and “fresh”. In fact, she’s not fond of most of the workplace (it skews older) and has called some people lazy. I watched her argue for 20 minutes the other day with a seasoned, highly-educated staff member in a higher-up management position as to why she was right about something.', a user said: 'Sounds like my work. Except the youngs include the boss, so of course she keeps hiring ones like her. They roam the hallways loudly talking about how the \"old people just can't learn new programs\". So not only are we old and stupid , we're also not high enough up in the pecking order for them to even pretend to listen. It was a lovely place to work until the new regime/youngs took over.'",
        "In response to 'Fortunately there are very few youngs in my department. The only other one I can think of is learning quickly to keep her mouth shut and does her college schoolwork during downtime. She also seeks out advice and wisdom from us olds. I’m hoping the aggressive youngster gets a clue eventually and pipes down.', a user said: 'She sounds like she may be trainable! That's one, at least...'"
    ]
}