{
    "username": "Loofa_of_Doom",
    "contributions": [
        "In response to 'Original Post: My Boss Met With Me About \"Quiet Quitting\" So I'm going to preface this with a brief description of my work ethic. Just about everywhere I've worked, you could consider me as the \"anchor employee.\" I show up during my scheduled shift, on time and unless it's an actual emergency or death in the family, I always show up. I'm more reliable than death and taxes. On the other side of the coin, I don't usually take extra shifts. I do my 40 hours reliably so I don't have to.\nMy company has been pretty short handed lately because they bit off more than they could chew with a contract. They tried supplementing it with temps (instead of hiring more people) and obviously that bit them in the ass in the long run. Now they've resorted to reducing the number of required workers in departments and taking volunteers for double shifts, extra days and weekends.\nThe other day I'm coming back from my lunch hour and my boss waves me over to his desk. He's also accompanied by the regional site manager that goes to different locations. They tell me to have a seat and the boss goes on about the personnel issues. So I finally address the elephant in the room.\n\"So, you're going to hire more people, right?\"\nThe boss and the regional look at each other and the regional chimes in that they're working on it. They reminded me of the $250 referral bonus if I bring someone in and they stay for at least 6 months. I've recommended people, but they don't like the work schedule and never applied.\nAnyway, the boss starts going on about \"quiet quitting.\" I know what it is and it's absolute bullshit, but I decided to humor him and let him continue his explanation. I waited for an opening and decided to get to the point.\n\"What does this have to do with me?\"\nThe boss brings up my schedule and passive aggressively laments that I'm working 40 hours every week. Then he pulls out the volunteer overtime sign up sheet.\n\"Okay, then do you want me to work more days or something?\"\nThen he goes on the defensive. That's when I remembered that my union contract says all overtime is exclusively voluntary. The boss continues going on circles trying to weasel in that he wants me to take more shifts by reiterating that I'm only working 40 hours.\n\"If you want me to take more shifts, then tell me you want me to take more shifts.\"\nThe boss looks over to the regional who kind of shrugs in a \"fuck it, we tried\" type of way. Then he takes his glasses off and starts massaging his temples in a frustrated manner. I start to get up.\n\"If you want me to take more shifts because you're short handed, all you have to do is tell me.\"\nThen I leave and go back to working my job within my scheduled hours.\nEdit: Since I didn't expect this to get so popular and everyone is asking the same question:\nThe overtime is compensated, very well. You work overnight for 12 hours, from Saturday evening to Sunday morning. So that's overtime, overnight pay, and Sunday premium. I did it for Christmas weekend and had more than enough spending money for my vacation I took a couple weeks later.\nManagement isn't allowed to ask or request anyone to work overtime because to my understanding (this happened before I started working there) management used to play favorites with people on who got to work overtime, even making them do extra work as a way to \"get in good\" so they could get the shifts. It apparently got so bad that the union stepped in and made it voluntary only, with a sign up sheet so that everyone gets a fair chance. Lately less and less people have been volunteering because they're busy working overtime during the week since the temps were all laid off.\nI don't usually take the overtime unless I'm saving up for a vacation or something. That's why management tried to \"ask me\" to work overtime without actually asking me. My 40 hours of work is enough to pay my bills and a bit of spending money. I live a pretty humble life now compared to when I used to have ambition.', a user said: 'Just smile and recognize your boss just TOLD you you can get a better job elsewhere.'",
        "In response to 'Original Post: And they wonder why we quiet quit.... Worked at a this place for about a year, did a major systems overhaul with them where I was the front runner for work completed for the project, which helped us finish on our deadline, got praised and honored for my work, then I was told I'd get a nice raise, my raise was less than a fucking dollar in software development... I got a 2% raise when inflation is absolutely ravaging the country and prices have gone up much more than 2%.. works a fucking joke...', a user said: 'Work your wage.    Keep looking and good luck finding the job that treats you well.   When it comes time to give notice, remember the lies about the 'raise' and do what you feel is appropriate.'"
    ]
}