{
    "username": "lost_signal",
    "contributions": [
        "In response to 'Original Post: Anyone else's departments like completely falling apart due to people quitting / quiet quitting? We are a growing business, as such we went from supporting about 300 people and 100 servers to 1500 people and 200 servers, multiple office locations, and 1000 azure resources.\nOver the last two years, our sysadmin / cloud team went from 3 to 2, to 3, to 4 (for only a few weeks), to 3, to 2, to basically 1.\nThe candidates we are getting want 120k+ fully remote and aren't even that knowledgeable.\nInstead of letting me build a team how i see fit, and giving me a director role, the current VP and director seem to think we can just get through this... They are rolling the dice and think that it will get better by 2023 somehow.\nCompany implosion coming... which will probably result in me losing my job. HA.', a user said: 'The candidates we are getting want 120k+\nI was making that with 7 years of experience and that was 7 YEARS ago before inflation and more demand for skills. I'm seeing old sysadmins with 1 year of SRE on their resume getting 200K+ TC offers.\nfully remote\nYou have multiple office locations and 1000 cloudy things in a data center you physically can't enter. WTF are you going to be picky on what city they are in. My price to move to where our HQ is would be a 400K signing bonus and an extra 400K a year. It doesn't make sense for me otherwise (my HQ is in one of the most expensive cities in America where median homes are 3.2 million).\naren't even that knowledgeable\nI read through some of your other posts and it sounded like you were quizzing someone on service names in the 2nd most popular public cloud. Look, if they know what RDS is, they can probably figure out what the various DBaaS offerings in Azure are. Don't test if someone knows enough to hit the ground and do everything on day 1, test if they can figure it out on a REALISTIC time table. We hired a Jr. person on a team I was on and I told the manager \"It will be 18 months before they will be useful at all\". He ok'd it, we made the hire and they've been great. You want someone ready at day 0? Go hire a consultancy that's why you pay them $200+ an hour. Also note if you internally are bad at hiring and retaining a staff pay a MSP to do it for you. It's more expensive but there's not really a better solution to bad management. If you don't want to nurture talent, you gotta pay the tax.'"
    ]
}