{
    "username": "Lost-Pineapple9791",
    "contributions": [
        "In response to 'Original Post: The Flipside of \"quiet quitting\" is quiet paying. Don't forget this. Somebody older I know asked me why young people are \"quiet quitting\" their jobs and not trying to work hard. I told them that quiet quitting is a bullshit term that describes doing what was outlined in your contract, and not more. He started to tell me how you need to hustle and do more than the minimum if you want to succeed. I told him that the difference compared to many years ago is that now hard work is not met with commensurate rewards or opportunities. Then I asked him the following question:\nIf it is culturally acceptable to push people to go above and beyond what is outlined in their contract, why does the company always only pays what was agreed upon? Why doesn't payroll ever go above and beyond what was agreed? Shouldn't it also be culturally acceptable to expect extra salary in this case? Aren't my company quiet paying me?\nHe had nothing to say and just looked uncomfortable. He didn't really agree but he has no good answer either.', a user said: 'People worked hard bc they had pensions to lose and wanted to retire after they put their 25 years in as well as making money to comfortably afford a house, cars, vacations\nThat’s gone now\nNo companies offer 25 years and you’re out pension plans, they just do 401K matching\nNo one has savings and is retiring\n“Working hard to succeed” is the biggest bullshit propaganda I’ve ever. Does the janitor who no ceo would do that job not work hard? They’re busting their ass! So many physical labor jobs work extremely hard and get paid pennies\nBoomers loved and ate up the capitalism Fox News bc it worked for them getting paid etc and now a days it’s not even CLOSE to the same\nWe get paid the same, an accountant in 1990 making $50 is probably only $60-70K now…but houses, cars, grocers etc have all more than doubled. There’s new bills like cell phones and Internet, corporations are hoarding profits more than ever before on top of it.\nWhy should I want to work? I’m supposed to work to be able to provide and enjoy happiness in my life.'"
    ]
}