{
    "username": "lostintransaltions",
    "contributions": [
        "In response to 'Why would your over performance become the new baseline? That only makes sense if you got promoted to a higher level. And even then they shouldn’t hold you to a different standard than others at that same level.\nI think your best bet is to slowly scale back. Are you working evenings and weekends? If so I would start by refusing to do any work on the weekends unless it’s critical. Then the next month stop working in the evenings as well. When management asks about it, just say you were working on the evenings and weekends but now you’ve started to seek a better work life balance.', a user said: 'The line that was fed to OP is something my last job did as well. They literally gave promotions to ppl with general lower performance but that had one good quarter than to give it to the one that was always high performing..\nTheir “logic” was that to get promoted you needed to deliver more than your usual, not your levels usual but what you personally set as normal for you. So if you were unlucky and had a manager that didn’t fight for you when you were performing higher than the other ppl on your level and you didn’t get promoted suddenly your high performance was seen as your standard performance for that level.\nIt is a lazy manager that uses that excuse imo. It is not fair to the employee and will lead to high performers leaving the company as they are pushed to a burnout.\nFor OP I do think a slow decrease in work done might be the only way that could work, if he drops immediately down in his performance his manager will have questions.\nWhat I learned from my experience was setting boundaries better, saying things like “what tasks can I offload should I take on this new task” and never ever to go to 100% of what I can do.. I stay at 60-70% of what I know I can do, still my manager at my new job is impressed with how much I manage to accomplish in a week/month.\nI apply the same for my team. At least once a month I check in with them on workload and mental load of what they are working on. Make very clear that it is important not to consistently run at 100% capacity. There will always be times where suddenly extra projects or tasks show up unplanned and we need to not go above 100% when that happens.\nInitially my team was confused, but in the 2 review cycles they now have had with me I got 25% of the team promoted, they get feedback how valued the team is and other managers and directors have made clear how much they like that my team can ramp up fast when something unforeseen happens and help out.\nI think especially in the US we are used to push ppl to 100% capacity at all times and ignore that this leads to burnout, not being able to firefight when needed without creating fires in other areas.\nA well rested team with appropriate workload will deliver higher quality work and faster than an exhausted team.\nAlso, OPs manager should have moved him up to full management or at least gotten him a good raise and bonus for the work. Sometimes we can’t promote due to outside reasons but having someone move to a hybrid role and not at least get a raise and nice bonus will just create frustration in the employee you rely on to do more.\nAnd if the other lead is really doing so much less he should have been removed and replaced by someone who performs better, which likely would have helped not to overload OP with work as well.'"
    ]
}