{
    "username": "LowBeautiful1531",
    "contributions": [
        "In response to 'Original Post: What leaders need to know about quiet quitting… aka the labor rebellion [External Link]: https://v.redd.it/xravs6qh8ot91', a user said: 'They're going to TRY stopping it by slamming us with a recession and massive unemployment.\nThat might kick the can down the road a bit, but only pisses everyone off even more, long term.'",
        "In response to 'Right, because that’s what has to happen to slow inflation.  We could all make $500,000/yr but if a loaf of bread costs $20,000 your salary doesn’t go too far.', a user said: 'And it's always the wage slaves who get pummeled, because doing ANYTHING to touch the ever-increasing record corporate profits is anathema.'",
        "In response to 'The problem with this (And I do in part agree, the FED has to attack inflation), is Powells policies completely ignore companies experiencing record profits (not just in absolute terms, but as %'s ).\nIf you are going to take the stance that wage increases have been substantial and beyond a sustainable level, you also have to look at the whole picture where profits have exploded too (under crazy wage increases) and attack both fronts.\nTalking about people being able to afford homes, without discussing how we're going to reduce the prices on commodities all humans need, will miss the mark and the \"steel manned\" argument you are making.', a user said: 'And wage increases have been basically nonexistent for\nthe last half fucking century.'",
        "In response to 'Thanks for posting; I didn't realize this distinction.  For anyone interested, here's some wiki info:\nhttps://en.wikipedia.org/wiki/Work-to-rule\nWork-to-rule is a job action in which employees do no more than the minimum required by the rules of their contract, and precisely follow all safety or other regulations, which may cause a slowdown or decrease in productivity, because the employer did not hire enough employees or pay the appropriate salary and as such does not have the requirements needed to run at the level they desire.\nhttps://en.wikipedia.org/wiki/Quiet_quitting\nQuiet quitting is an application of work-to-rule, in which employees work within defined work hours and engage in work-related activities solely within those hours. Despite the name, the philosophy of quiet quitting is not connected to quitting a job outright, but rather doing precisely what the job requires.[1] Proponents of quiet quitting also refer to it as acting your wage.', a user said: '\"Work to Rule\" is a powerful phrase that cleverly juxtaposes rule-following with\ntaking power\n. It is linked to a historical legacy of\neffective\nlabor victories.\n\"Quiet quitting\" makes it sound weak. It's talked about as if it's some new, silly trend with no context.\nI promise you, some Orwellian assholes had a fucking\nmeeting\nabout making sure that shift in wording gets etched into the discourse.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'That was always the promise of technology.\nToo bad sociopathic exploitation always eats any tiny step ahead we ever get.'",
        "In response to 'I think you meant capitalism.', a user said: 'Tomato, tomato...'",
        "In response to 'Yeah …. There’s nothing in this video.  As someone who manages hundreds of people, I’m not sure what she means by ‘manufactured chaos used to control people’.   I just wanna build software.  I’ll pay a competitive wage to get top talent. It’s on me if I’m not paying enough.   And all I’m looking for in return is to do the job we agree on upfront.  Recession isn’t going to change that for me…. If someone wants to work, has the skills I need, I’ll make it worth their while.  And there are a lot of people like me trying to build something.   I truly don’t understand what the giant conspiracy is that she seems to think is occurring.', a user said: 'Not sure if you're genuinely clueless or just another manager who simply assumes such concerns are beneath you?\nYou might want to study some historical context. There's a whole lot happening around you, the same forces that led to the rise and fall of despotic aristocracies from Rome to Versailles.\nIf you want to understand what \"manufactured chaos used to control people\" means, the book\nShock Doctrine\ndoes a very good job of breaking that down.'"
    ]
}