{
    "username": "lowkeyenigma",
    "contributions": [
        "How to quiet quit without being detected after being known to be an extra-mile person at work? Firstly, I know - quiet quitting is just doing your job and nothing extra. Stop repeating the chant.\nSecond, I was known to be THAT person, who goes out of his way to help. I guess I associated my self worth with how company values me.\nIt took a couple of a years and being passed over a promotion to wake up.\nI cannot quit at the moment, or change jobs, I have been looking and nothing suitable on the horizon yet.\nThe question is how do I make the shift in attitude without getting so much attention especially that I am known to be a hard worker.\nEdit: Thank you everyone! Very useful tips! Read every single one! 🙏",
        "In response to 'I quiet quit a while ago, and for me it boils down to doing my job at an adequate enough level to not be fired.  Do what you’re supposed to do and nothing more.  Learn to say no to requests that go over and above.  Work your required hours and nothing more.\nWhat not to do: pout or act like what you’re doing is a form of protest.  Make your attitude/psychology seem totally well-adjusted and normal.  Be respectful to authority.  Just tone down your need to win every day and seek acceptance.  You’d be surprised in the long run, like I was, how good this is for your long term mental health.', a user said: 'Thank you!\nI am interested to know more about your second paragraph. I was also advised to be “pleasant” and not act like a protester, remaining normal and well adjusted. Why is this important? And any examples of bad protester behaviors you’ve seen?'",
        "In response to 'So I quiet quit because I was actually offered certain promotions by managers that then magically seemed to be overturned in favour of less competent co workers who were usually charismatic.  The first few times I kind of stomped my feet and asked “why”.  This didn’t go well.  They’re not going to turn around and say, “Yeah you’re right!  What we did was totally unfair and we’ll change it right away!”  They’ll give you a bunch of weird explanations, ascribing (or exaggerating) characteristics to the person that got the job that are mostly untrue.  Fact is they just like the guy.  Then off record someone will tell you that they kiboshed your advancement because you’re too valuable where you are.\nWhen you decide to quiet quit, I would warn you that it’s a totally different direction.  You have to be okay with just being a nobody.  Heck, I even actively promote talented colleagues that I used to be in direct competition with (your co workers will love you and they’ll be asked to do extra work instead of you).  When I pass the people that passed me over for promotions, they get an enthusiastic smile and “hello” now.  I’m now more likeable than ever, while doing way less and working at a way slower pace.  They will put up with this behaviour because they’re so snowed by this “mature attitude”.  If this isn’t for you then you have to find another job asap.', a user said: 'Valuable lessons here!\nWere you able to be OK with being a nobody overnight? Or was it a process until you became this person? Does this mean you stopped growing and learning?'",
        "In response to '[Deleted or Empty Comment]', a user said: 'Interesting, could you please elaborate on why maintaining likability is important? Any examples?'",
        "In response to 'You've learned a valuable lesson: Your employer is not your family, an acquaintance, or even a disinterested stranger on the street saying a polite 'Hello!' as you pass each other.  Employment is a financial transaction; you get money for your labor. And in every financial transactions, the principals are always trying to improve their side of deal.  Employees look for raises, education, and advancement; employers look to reduce costs and increase productivity.  It's adversarial; and toxic companies will do anything to tilt the playing field in their favor.\nDo you keep your signed job reviews on file (you most definitely should...)?  What do they show?  If you are meeting expectations, that's all that matters.  You did your job for the money they offered.  The management trick is getting you to 'exceed expectations'.  A few words on your review that mean absolutely nothing, but allows them avoid properly compensating employees for the additional labor you provide.  In that financial transaction you got a worthless 'Attaboy', and they got money.\nAs for what you should do: Don't go out of your way to seek out more work unless you are being properly rewarded (overtime, salary increase or advancement.)  Be polite but firm: You have a full plate, and you can't take any more on. There should be no shift in attitude for *you*; your *company* has to adapt to the new reality, and that is not your problem. You have and always *will* be a hard worker; you just refuse to be taken advantage of by fellow employees and management.\nYou also need to leave your employer ASAP.  They have already shown they do not respect you, or appreciate your contributions. This may mean lowering your sights to something less 'suitable'; but there are ways of ameliorating the impact of a voluntary job change in a down employment market.\nHere are some\nrecommendations\nyou should consider implementing to improve your career path,  protect your professional reputation, and seek new employment.  I've used them myself to great success. The key is to make a *plan*; to prepare yourself to either stay or leave a company on *your* timetable. To have a fall-back position already prepared in case of hard times (lay-offs, firings, workplace abuse, etc). To control your own destiny. This plan should be regularly updated and ready to go at a moment's notice.  Again: In a financial transaction, the best negotiators are the ones who not only strike a good deal, but are ready and able to immediately walk away from a bad one.\nHopefully this helps.  You're doing good work; just don't let them take advantage of you.  We're the CEOs of our own careers; so we have to act appropriately.', a user said: 'Thank you! Your recommendations link is also very relevant.'",
        "In response to 'I'm 42 years into my industry as of today and it was also my official last-day employed. Yay me! I should've read these comments years ago.', a user said: 'Wow nice. Lessons learned?'",
        "In response to '[Deleted or Empty Comment]', a user said: 'I relate to that. I also feel like it takes trial and error, small disappointments, to get to not caring anymore. It’s not just a button.'",
        "In response to 'Respond to emails rapidly so that it seems like you are visibly on top on things. Don’t volunteer for anything. Don’t notice opportunity for process improvements.', a user said: 'Love the last sentence. Don’t notice opportunities for process improvement, care to elaborate a bit? I relate to this because I am always suggesting ways to do things more efficiently.'",
        "In response to 'Ur gonna have a hard time quiet quitting if u don't understand why u go out of ur way to help in the first place. I say that from a place of personal experience. Is it that ur a ppl pleaser and don't want to cause conflict, or is it because ur actually being assigned responsibilities that are beyond ur job description? Or a combination of both. I recently quiet quit to my coworkers lol... I told my boss because he isn't the cause of my added work stress, and he agrees that I've basically spoiled my coworkers. One thing I can say with relative certainty is that ur GOING to be detected. The ppl who rely on u to carry them will be the first to notice, and will likely complain. Don't engage in office politics. Let them have their little tantrums. If they confront u directly, flat out tell them that if THEY did their jobs, then u wouldn't have to...then walk away 🎤🫳', a user said: 'Nice. \nWhen you say people who rely on you, are you referring to your subordinates/team or superiors?'",
        "In response to 'Don't say anything. Make sure not to volunteer when a problem is brought up. Start withdrawing from any group that you volunteered for but isn't part of your job.\nMake a list of what you have to do and de-prioritize what can wait. Make sure you get asked about something a few times before you get to it. Overestimate the time needed. I used to gather data and stopped bothering to do it until asked because no one cares enough on a regular basis.', a user said: 'Liked the tip on waiting till you’re asked a few times before doing it! I feel like most tasks die away on their own if you ignore them.'",
        "In response to 'Start by taking any breaks that you’re entitled to. Then, don’t volunteer for anything. If the feeling hits you go to the bathroom until it passes.\nIf anyone comments, talk vaguely about how you’re swamped and struggling to keep your head above water.\nPlan to take time off. You don’t have to use up all of your vacation time, but look ahead at your calendar plan time for events, activities, and rest. Don’t be around all the time to pick up the slack.\nWhile you’re right-sizing  your role,  continue to be pleasant while doing nothing but the job you’re paid for and going home.\nYou won’t believe how quickly doing this will bring down your stress levels.', a user said: 'Loved the tip of plan activities in your calendar. That could actually serve as reminder as well not to prioritize work. I’ve been told previously the importance of being “pleasant” at all times. You also suggested the same. Why is this important?'",
        "In response to 'Refer them to those that were promoted as by company standard they are more experienced.', a user said: 'Haha yeah, as satisfying as this sounds, it’s a declaration of war here. More shit comes to my way.'",
        "In response to 'Appearance is everything.  If you continue to appear to be a hard worker you can coast on your reputation.  Part of that is marketing yourself.  Accidentally finish something early?  Every now and then, admit it early!  “Hey Boss, I pushed to finish that job early so I could get your feedback before it’s due”.   Are they asking for volunteers?   If it’s better than what you’d be doing otherwise, step up. “I’m swamped but I can do that if someone helps with <task you hate>”.\nBtw, you’re always busy but don’t be too vocal about it.  No one trusts someone who’s never to busy to tell you they’re too busy.', a user said: 'Loved the swap task you hate with something you don’t mind tip. Never thought about it this way!'",
        "In response to 'This is actually easier to do in your situation...  if you look occupied, people will assume you're occupied.  Pick and choose your spots to shine for a few hours or a day or two every now and then.  If done correctly, in a 2080 hour work year, you should be able to browse the internet for 2000 of those hours.', a user said: 'Nice -  How would you choose your battles to shine? Any suggestions?'",
        "In response to '“great question, I’ll have a look into that” “ thanks for the reminder, I was waiting to hear back from somebody on this” etc basically don’t do anything until somebody follows up with you, that way you’ll figure out what of your work is actually important', a user said: 'I love that. Don’t do anything until someone follows up. I always thought most tasks die on their own if you ignore them properly. The trick is not to be rude while doing this I guess?'",
        "In response to 'Why do you mind if people notice? I made a sudden snap when told I was being passed over and stopped doing all the extra. People actually did notice when I stopped doing all my little things that I felt made work better for everyone. They came around and started treating me fairly and I started putting in more effort again. I also had 2 fairly blunt conversations with my manager asking what I had done wrong specifically and she had nothing.', a user said: 'If I suddenly snap, my worry is that there are 2 possible scenarios, it either becomes a pity party. Or they take it personally and consider this a retaliation. If they like you enough, you might get away with the first scenario. If they don’t, I wouldn’t want to be the black sheep.'",
        "In response to 'How is you doing your job retaliation? If anyone tries to talk to you about it, pull up your job description: \"Which of my job duties is being neglected?\"\nCan't be a pity party if you don't let it be. I don't discuss it with people besides my bosses. If you really mind being the black sheep I'm not sure what to tell you. Not being beloved by coworkers never bothered me at all. My life is outside work.', a user said: 'Sorry I misread your first post.\nYou stopped doing the extras. Not stopped doing the job altogether. Makes sense now. Thanks!'",
        "In response to 'How is you doing your job retaliation? If anyone tries to talk to you about it, pull up your job description: \"Which of my job duties is being neglected?\"\nCan't be a pity party if you don't let it be. I don't discuss it with people besides my bosses. If you really mind being the black sheep I'm not sure what to tell you. Not being beloved by coworkers never bothered me at all. My life is outside work.', a user said: 'Sorry I misread your first post.\nYou stopped doing the extras. Not stopped doing the job altogether. Makes sense now. Thanks!'",
        "In response to 'For me, i started saying “your gonna have to escalate this” they eventually get it and stop asking you for the extra', a user said: 'I thought of the same thing.\nSomething like if this is really important, go to my boss.'",
        "In response to 'There are many good suggestions here already.  Any change of process from the company is an excellent time to slow down.  “I’m still learning the new way”.\nAnd start really driving the priorities with those above. Only work on the high priority jobs. And if you run out of hours in the day with much not done … that’s the plan', a user said: 'Yeah I noticed high flyers in the company also check in regularly with those above.\nThey don’t get involved in everyday things. Only the things that matter to the bosses. I guess this applies here too.'",
        "In response to '\"I'm just a team player, and i was doing things the team wasn't, so I am realigning myself to the team's standard again.\" But only if anybody asks.', a user said: 'Nice, not too rebellious, but delivers the message. I need to learn to say this without appearing sarcastic though 👀'",
        "In response to 'Initially, be heard to say things like ‘gosh it’s hectic’ and ‘if only I had two pairs of hands’ while keeping up to your previous levels, then gradually, start the apologetic ‘oh, look, I’m project A and then B is tomorrow- I could give you 15-20mins on day 3 if that’s better than nothing…over the course of a month, scale back your willingness to your job description.\nIf you routinely work late, reduce it over the same period and be leaving on time.\nIf people notice, just say you’ve been scheduling things more carefully/accurately or thanks for noticing my efficiency (with a shit eating grin)', a user said: 'Haha thanks for noticing my efficiency. Love this!'",
        "In response to 'Out of curiosity, what is it about your job that makes you feel like quiet quitting? Is it the work itself, or maybe just the overall vibe? Would love to hear what pushed you to that point!', a user said: 'Bad management, rigged promotion system and unfair forced ranking appraisals.'",
        "In response to 'Quiet quitting made me become a better actor.', a user said: 'Nice - how so?'",
        "In response to 'I worked in a job where we would frequently have to work on weekends. I had a younger coworker who always seemed to have plans for every weekend when he should have been there.  He saved face by being seemingly gung-ho at all other times, and frequently would offer recommendations to us more experienced people.  He was maddening.', a user said: 'Tell me more…would you say he’s a quiet quitter? Are you suggesting I follow his approach?'"
    ]
}