{
    "username": "loyalisalie",
    "contributions": [
        "In response to 'Original Post: You’ve Heard of Quiet Quitting. Now Companies Are Quiet Cutting Layoffs are down, but employers are still finding ways to cut jobs -  Is this normal or economy tanking? More problems expected in late 2023 or 2024?\nWorkers are waking up to emails and team-meeting requests with a jarring message: They aren’t fired but their jobs are gone.\nPeople on the receiving end of these memos describe running through a range of emotions, from relief that they’re still employed to a sense of dread that their bosses secretly want them to leave.\nhttps://archive.ph/cYXyk\nhttps://www.wsj.com/lifestyle/careers/youve-heard-of-quiet-quitting-now-companies-are-quiet-cutting-ba2c326d', a user said: 'Adidas,\nAdobe\n,\nIBM\nand\nSalesforce\n, among others, have reassigned employees as part of corporate restructurings. Mentions of reassignment, or similar terms, during company earnings calls more than tripled between last August and this month, according to data from AlphaSense, a financial-research platform.\n“Reassigning is definitely a huge part of the dynamic right now,” said Andy Challenger, senior vice president at Challenger, Gray & Christmas, an outplacement firm.\nAdvertisement\nFor companies that spent several years—and significant money—to hire top talent, reassigning workers to new roles can be a way to fill jobs vital to future plans while trimming costs associated with old strategies, say human-resources executives.\nIt can also be a waiting game. Employees to whom it would be costly to pay severance or months of unemployment benefits might decide to leave on their own if they feel stuck in a job they don’t want, executive coaches say.\nU.S.-based companies announced 42% fewer job cuts in July than they did in June, Challenger said. July job cuts were also 8% lower than the prior-year period, marking the first time this year that monthly job cuts were lower than in 2022.\nIn interviews and online forums, many workers said they worried whether their reassignment meant they would eventually be pushed out the door. They also wondered how to work their way out of job purgatory and back into a position they actually want.\nSignals to look for include reassignment to a job that is far below the pay or skill level you currently have, Matuson said. Other warning signs: Being offered a role that requires relocating when your boss knows moving isn’t a viable option for you, or being reassigned to a division that’s rumored to be on the chopping block.\nEmployees suspicious or nervous about a reassignment should ask their managers why, specifically, it’s happening and what the reassignment means for their career path, said Naomi Sutherland, a global lead of talent development with\nKorn Ferry\n, a consulting firm. The answers could reveal whether a job transfer is personal. \nWithout good information, “people are going to fill a void of information with whatever story they’re going to tell themselves,” she said.\nAdvertisement\nMost of the time, there is little legal recourse for workers if their company reassigns them, employment lawyers say.\nOne exception is when a worker can demonstrate the reassignment was retaliatory, said Angela L. Walker, an employment attorney with Blanchard & Walker in Ann Arbor, Mich. The bar is high, she added. The employee would have to show prior evidence of discriminatory treatment or that they were unfairly singled out.'"
    ]
}