{
    "username": "LucilleBluthsbroach",
    "contributions": [
        "In response to 'Original Post: Is Quiet Quitting now a thing for Jehovah's Witnesses? So many posts here related to Memorial Season for the Jehovah's Witnesses Organization make me feel like many \"active\" JWs are simply engaging in Quiet Quitting. These JWs are not DA, DF'D or PIMO even but they are just doing less....not showing up for in-person activity....not very engaged as a JW anymore. It is great to see this and the growth of this EXJW Sub too.\nReally the most effective thing that can be done to damage the harmful Jehovah's Witness Organization is to simply stop supporting it with your time or energy. Stop volunteering, stop showing up at as many meetings, stop participating if you can.', a user said: 'I chose to fade, I'm not playing by their idiotic rules anymore so why should I write a letter to them or even call. They certainly forgot all about me with the quickness once I became disabled and had to use the phone hook- up pre pandemic. That made fading extremely easy and I no longer have anyone still in the cult, so it turned out to be lucky.'",
        "In response to 'That's exactly what happened with me, after a bad car accident I was dealing with chronic pain and started just listening on the phone, my husband\nnever\nhad his heart into being a JW (he pretty much got baptized bc he wanted to marry me lol) it was so much easier to disappear when we had already been physically missing from meetings and just like you I quickly learned that all my \"friends\" people I'd known my entire life and even my own family who all knew what I was dealing with couldn't any of them bother to be there for me:-/ in fact many of them used my medical issues against me saying things like I was a drug addict for taking prescription painkillers etc! I'm so much better off without them! Sorry to hear you had health troubles and were failed by the \"loving\" borg too tho :-/ (Edit spelling)', a user said: 'Thanks, your situation doesn't surprise me at all, I've heard it more times than I can keep track of, if you're sickly or too old to slave for the cult they drop you like a bad habit. I used to practically beg for literature, someone to do letter writing with me, and help getting groceries. No one wanted to bother. I once had the neighbor ask me where the hell my fellow Jehovah's Witnesses were and why they abandoned me when I couldn't get groceries because I couldn't physically get to the store I was so badly hurt and couldn't do it. I was embarrassed for her to know how unchristian and inhumane JWs were and yet I still remained pimi like a complete idiot.'"
    ]
}