{
    "username": "LucidNight",
    "contributions": [
        "In response to 'Step one: Promote someone to their level of incompetence\nStep two: Watch them fail at their job\nStep three: Put them on PIP. Lay them off. Or fire them.\nOP clearly doesn't want further responsibility. But now they have been promoted. Which means more responsibility and more visibility in the organization.\nVisibility in terms of how much they make and how much the company could save in headcount.\nMore visibility with counterparts and direct reports.\nAnd even if their boss loves them, their boss could get moved to another group or laid off or there could be a reorganization underneath a different manager in the same group.\nAnd all of those things increase the possibility of getting let go or forced to work more than OP wants.\nI think others understand what I am saying since the original comment was upvoted so much.\nIf you want to OE, it's often better to have an individual contributor role at a lower level than a 15% pay bump because you can more easily OE multiple jobs. Two or three jobs at 100% pay is better than one job at 115% of pay.', a user said: 'As someone who has been managing a long time, had to fire people, and deal with tons of random HR shit....this feels like a way to just take the usual ways of getting rid of people and making it take 4 times as long. Promoting someone and then putting them on a pip would take ages with most HRs. You would have to extend documentation of failure so much longer and it would just make you look bad by saying you promoted someone that shouldnt have been.'",
        "In response to 'I didn't say place them on PIP.\nI said one of the three.\nI have no idea about OP's situation.\nI don't know his company or manager or their culture or any of that.\nBut in some companies you have to do some BS to get rid of an employee and keep budget.\nOr you have to play games to promote someone so that you can let them go later when it's time to give up one of your staff to budget cuts.\nThe person asked for clarification on why a promotion could be a set up by management to let them go. So I gave them just a lot of random ideas.\nWithout any more information, I couldn't tell what's happening in OP's situation. But it is odd that he gets a random promotion without doing anything. Not saying it isn't possible, but at most companies it isn't probable. And giving someone more responsibility is an easy way to get them out on performance rather than cutting a headcount or position.', a user said: 'A pip is usually required for firing less there is gross negligence which generally makes the manager also look bad. Lay offs are not simple things to plan around and you generally don't get backfill for a lay off meaning getting rid of higher level positions is worse if it's even the managers decision who to lay off.'"
    ]
}