{
    "username": "machstem",
    "contributions": [
        "In response to 'Family is supportive and I have some cancer support groups. Wife will chip in if I ask, but doing so makes me feel like a burden and sets my anxiety off more than it already is.', a user said: 'I'm the caregiver for my wife, both bipolar and cancer.\nIf your wife is not doing the minimum then she's not being mindful to your needs.\nI assume she's suffering through caregiver burnout, nothing to mock or make fun of because it can look exactly like this.\nShe will need her own breaks but she will need to care for you, but it's her choice\nI'm sorry you're dealing with this'",
        "In response to 'Not sure what she is dealing with as she refuses to talk. She never really has been a caregiver. I don’t own things and manage my own care. Wish I could understand where her head is, but she won’t have communication.', a user said: 'I'm sorry dude.\nI remember having this conversation with my therapist and one thing that hurt was when she said, after I mentioned <I'm always the first to help someone..>, she replied, <..and why should you expect anyone to always help you?>\nShe didn't mean it as an insult, she wanted to let me know that not everyone is cut out to helping someone in need, and it then becomes our choice whether we want to be with someone like that or what to do mentally when we wonder where all the help is now, years later.\nI found that the cancer support groups and medical team were more than useful but ultimately there is nothing you can really do to help with someone that has cancer, so doing the very minimum should be the default, yet here we are.\nSorry you're dealing with this'",
        "In response to 'Damn. I needed to hear your therapist's advice too.\nOP, I'm so sorry. I haven't read very far into the thread, but no matter the circumstances, your situation sounds awful. I'm thinking of you, and hope that you can find peace.', a user said: 'My mom has the same empathy as I do and she hates how true that lesson is.\nIt's important to be kind, helpful when YOU CAN BE HELPFUL\nLots of folk either aren't helpful or just refuse to be helpful in any capacity if they don't gain something from you or it\nSad realities but it does help find the right people in your life.  Easier to find the nice folk'",
        "In response to 'I never want to stop being giving and helpful. It’s one of my favorite things about myself.\nI think it comes down to managing expectations. I read this the other day - “expectations are premeditated resentments”.', a user said: 'Yeah having reasonable expectations is important\nIt's one of the expectations we speak out loud, <through sickness and through health>, meaning you have to remove yourself from yourself and give the other person what you had initially promised; unconditional care through sickness.\nIt's a shitty thing to happen, it's not the life I wanted to live but it is the one handed to me and the one I worked to gaining.  A lot of people have things a lot worse than me, there are a lot of lonely people out there, burning bridges along the way.\nI'd like to think I've gained more than I assume I've lost by being a caregiver'",
        "In response to 'White blood cells.  Getting blood red blood cells and/or white is platelets.  Which chemo kills all the blood more or less but white blood counts is the dangerous one being low due to the increased risk of infection and getting sick.\nBut there are shots for boosting wbc/neutrophils called neupogen, neulasta etc. Filgrastim is the active ingredient.  Daily shots that boost WBC.   I had nearly 100 neupogen shots.  Plus red blood infusions and platelets.  Chemo gets delayed from low blood counts all the time, but with the shots and infusions counts can recover quickly.\nSo yes, new blood can help.  But there can also be a lot more involved and it isn’t as simple as just getting some new blood.  And typically the line drawn for completely stopping chemo is if it will kill you faster than the cancer and if it is working.  Because chemo is essentially the Drs killing all the fast growing cells, cancers are typically fast growing cells compared to “healthy” cells, same as hair.  Why hair typically falls out.\n(I can’t speak for all cases, not a dr)', a user said: 'You have this mostly what I experienced as caregiver for my wife but some cancers simply won't react to the chemo and nothing you can do will help, especially given other side effects that you should never have.'",
        "In response to 'Yeah, that is the line of stopping it.  If it works or will kill you first, essentially, obviously plenty of nuance to this and I’m being blunt about it.  I can only speak to what I went through as well, which was a stage 4 cancer and chemo (mostly “salvage” chemo, don’t think they call it that anymore, HDCT now I think).  It is some seriously rough stuff.  And I wouldn’t want to wish it on anyone, I’m just extremely lucky that was all more than 20 years ago.  And it is a surreal conversation with your Dr (I was 20 at the time) when they say “we are basically going to take you to the edge of dying with chemo, we know exactly where that line is and that is the only way to kill the cancer”.\nAlso, sorry you had to go through that.  I can only speak from a patient perspective which I honestly believe is easier to go through than a caretaker.  Because I witnessed how that is for the caretakers, the fact that you wish there was something you could do but just have to watch.  As a patient, I was almost oblivious to a lot of things if that makes sense, I think as a patient our brain kind of blocks out a lot of that.  And we are just doing what we have to do, so I can’t imagine how it would be to watch and not be able to do anything.  But I can say that the things that those who cared for me did will never be forgotten, even the smallest of random things.  Just sitting and watching tv.  Or telling jokes.\nAnd I don’t want to pry or anything so don’t share anything you aren’t completely comfortable sharing, but did your wife have Adriamycin (aka The Red Devil Chemo aka doxorubicin)?  I only ask because I know what cancers that is used for, most commonly at least.  But it was one that I had as salvage chemo and that one was terrible to put it mildly.', a user said: 'I don't recall the chemo name.\nIt was actually two variations, and her cancer is genetic (chk2) which means both my kids have a 50/50 of getting it so as a caregiver, the process never really ended.\nThank you for the consideration as a caregiver.  It took a long time to face the facts, so to speak, but having to contend with being the dad of two amazing children, watching mom suffer for nearly 2 years now (she's finally on the mend), it's nothing short of emotionally draining.\nI burned out fast but luckily my union had in place a program that paid the remainder of my caregiver leave, meaning I was able to care for things in the worst times, with nearly no loss to my financial income, given that she was off work.\nI think that's got to be one of the worst aspects beyond watching your loved ones hurting, seeing how quickly a family can suffer fiscal insecurities just by being sick.'",
        "In response to 'Couldn’t they give you more blood?', a user said: 'That wouldn't work\nYou're doing blood work test to see if rhe chemo is doing the work, but they need to maintain a proper blood cell count so they'll stop the treatment if you aren't benefiting (e.g. cancer isn't shrinking, symptoms still presentl)\nMore blood won't stop the cancer cells from spreading through the lymph nodes as well.'",
        "In response to 'I'm going to schedule and insist on Monday, Been thinking about it, but as a result of this post, I definitely am.  I'm 40 with 5 kids, youngest is six.', a user said: '35-40 is 100% a great time to get all that checked\nGood luck'"
    ]
}