{
    "username": "MackingtheKnife",
    "contributions": [
        "In response to 'Roughly 7 percent. But use among young people has doubled in recent years.\nhttps://thehill.com/policy/healthcare/4054255-magic-mushroom-use-by-young-adults-has-nearly-doubled-in-three-years/#amp_tf=From%20%251%24s&aoh=16957316275472&referrer=https%3A%2F%2Fwww.google.com&ampshare=https%3A%2F%2Fthehill.com%2Fpolicy%2Fhealthcare%2F4054255-magic-mushroom-use-by-young-adults-has-nearly-doubled-in-three-years%2F\nThe use of psilocybin can definitely alter your perception of what is, and is not, important. An uptick in use would be bad for the \"hustle and grind\" culture I would imagine. Framing it as a bad thing is the corporate world spewing propaganda against work/life balance.', a user said: 'Psilocybin changed my life. Not in some ethereal divine way but it breaks my ego down and helps me let go of things that I’m perseverating on uselessly. I use it therapeutically about once a month at a normal dose (1-2 grams) and sit out in nature with my thoughts.'",
        "In response to 'My personal experience was similar. Helped me to let go off some of the nonsense that was eating at my mental well being.\nThat being said, I know people who have had their whole lives upended by taking psilocybin. Dedicating your existence to something that is then revealed to you as maybe not as important as you thought can have dramatic consequences.\nMy opinion is that the world would be a better place if everyone got to experience this type of \"perspective awakening\" in a controlled environment.   Most everyone I know whose tried them is better for it, but it would bring about some radical changes in society as well. The Hippies in the 60s started this movement but the powers that be crushed all that, making hallucinogens a schedule I drug, demonizing counter culture, etc. before too many people started \"free thinking\"\nOf course, that's just an opinion but looking at what was happening in the 60s when LSD use was somewhat more widespread, I think a better society would be possible if we all could get some new perspective.', a user said: 'I agree with all of your points. A massive change in perspective can be a dangerous thing if not handled correctly\nI think psychedelic guided therapy has huge huge potential and I’m still holding out hope we see that in our lifetime.'"
    ]
}