{
    "username": "MadRockthethird",
    "contributions": [
        "In response to 'Original Post: \"Quiet Quitting\" is a bullshit gaslighting term. Don't let it become an acceptable term [External Link]: https://i.redd.it/fwj0foce59k91.jpg', a user said: 'I'm an IBEW member and every local has their own working rules and agreement that we go by. We also have a saying a fair day's work for a fair day's pay so if a contractor wants us to go beyond that you can be sure we're getting compensated for it. In my local we work a 7 hour day with a 15-20 minute coffee break in the morning that the boss pays us for and a half an hour lunch off the clock anything after that is overtime.'",
        "In response to 'Anything after 7 hours and 45 minutes is overtime? That’s awesome.', a user said: 'Actually 7 hours 30 minutes coffee break is on the bosses time. So normally jobs start at either 7 or 7:30 am and you're done at 2:30 or 3 pm respectively. If they want us to come in early it's OT if they want us to leave later it's OT. I should also add that roughly 30% of my hourly rate goes into retirement benefits and we get full health, dental, and vision on top of that.'",
        "In response to 'Eventually full time will be down to 4 hours per day', a user said: 'Not if they want to finish the job in a timely manner'",
        "In response to 'They already don’t.', a user said: 'What finish jobs on time?'",
        "In response to 'Yes.', a user said: 'I'd estimate 90% of jobs come in on time or earlier. The others are poor estimation, engineering, or job coordination problems. Unionized trades get paid so well because we're very well trained, quick, and diligent. Right now I'm doing fiberoptic splicing and we're an outside contractor for a worldwide ISP that has their own in house techs. We deal directly with their director of fiber for the  NE USA and he keeps us on because their techs can't do what we can in the same time and quality. Some nights he won't have any work for us but still pays us our 7 hours overtime anyway. When he has an emergency and I get called my time starts once I answer that phone.'"
    ]
}