{
    "username": "Major_Barnacle_2212",
    "contributions": [
        "In response to 'Original Post: I didn't get the promotion. Should I quit or quiet quit? A few months ago everyone in my team was let go apart from me. I was then told I could apply for my old manager's role. I applied but have now been told I didn't get the role and they are going with an external candidate.\nFor these past few months I have basically been doing this promotion role (and have received really good feedback from lots of senior people). I have not gotten a payrise to do all this extra work.\nI want to leave before this candidate starts because I'm tired of giving them essentially cheap labour. I was told if I didn't get this promotion, another role would be made available for me (in the same team), so I would probably have lots of leverage to negotiate a payrise. But I really don't want to have to essentially train this new external candidate who will be making more than double what I earn in the role I didn't get.\nShould I hand in my notice now, do a shitty handover and let the new person flounder? Or should I stay in my role with more money, but be looking for jobs on the side (it could be months and months before I find a good job). If I do immediately quit, I do have savings I could live on for 6+ months (took me years to save this amount).\nWhat would you do? Any advice?', a user said: 'Just went through this a few months ago so I’ll share what I decided.\nI tried to decide between quitting and quiet quitting. I’m doing a hybrid.\nFirst, I’ve stopped doing all the ‘extra’ things I did before. Started directing everyone who came to me for help to “our new supervisor.”\nThen I started taking my lunch breaks again. Started leaving when the day was over. Stopped checking my email when I walked out the door. Started taking vacation and sick time. It was very freeing and made me less angry about not getting the job.\nI’ve provided help when asked but am certainly not going above and beyond. I’ve gotten praise for my handling of the situation, weirdly.\nI joked over the weekend that it feels very Office Space. The more I back off from my work, the more people think I’m succeeding.\nAnd I know the perfect job will come my way where my value is really seen. When it does, I’ll leave.\nThat’s my advice. Take some time to let the emotions die down and wait for the perfect gig. Strategize. Don’t rush.\nSorry you’re going through this. It’s extremely unpleasant. Keep your head up and remember that your coworkers are probably talking about what a mistake management made.\nEdit: clarity\nEdit 2: Clarity/spelling'",
        "In response to 'Thank you for this kind response', a user said: 'It’s a crappy time, and I know your pride is a little shot, but you’ll get the last laugh when you leave. Just play the long game. \nDon’t forget to treat yo’ self a little right now. You deserve it.'",
        "In response to 'I love how you're lobbing everything at the \"new supervisor\".\nThat is just quality entertainment.', a user said: 'Half my day has opened up with just that one sentence. I feel 2% bad to leave everyone with this guy, but they’re getting paid for it so….'",
        "In response to 'Have you found a new job yet?', a user said: 'Yes! It’s funny reading this post knowing now where the next few months went. Two great jobs came to me - picked the one that paid less but would make me happier.\nLife has been sweet ever since! Hope if you’re looking that you have similar luck. It was about 4 months after this post.'"
    ]
}