{
    "username": "Malnurtured_Snay",
    "contributions": [
        "In response to 'If I found out one of my team members was protesting something by taking a lunch break, my first question would be, \"You weren't going to lunch?\"\nDo people think being a good employee means not taking vacation?\nI've been in the workforce for three decades. I'm interested in finding out when vacations, lunch breaks, and not working after leaving work became bad things.', a user said: 'If I found out one of my team members was protesting something by taking a lunch break, my first question would be, \"You weren't going to lunch?\"\nProbably the same people who don't like taking their vacation time....'",
        "In response to 'Original Post: I didn't get the promotion. Should I quit or quiet quit? A few months ago everyone in my team was let go apart from me. I was then told I could apply for my old manager's role. I applied but have now been told I didn't get the role and they are going with an external candidate.\nFor these past few months I have basically been doing this promotion role (and have received really good feedback from lots of senior people). I have not gotten a payrise to do all this extra work.\nI want to leave before this candidate starts because I'm tired of giving them essentially cheap labour. I was told if I didn't get this promotion, another role would be made available for me (in the same team), so I would probably have lots of leverage to negotiate a payrise. But I really don't want to have to essentially train this new external candidate who will be making more than double what I earn in the role I didn't get.\nShould I hand in my notice now, do a shitty handover and let the new person flounder? Or should I stay in my role with more money, but be looking for jobs on the side (it could be months and months before I find a good job). If I do immediately quit, I do have savings I could live on for 6+ months (took me years to save this amount).\nWhat would you do? Any advice?', a user said: 'You should polish your resume and start interviewing. Ingratiate yourself with your new manager in the hope that when you start a new job and give notice they'll be so upset at losing you that you might be able to turn that into a contract role for some nice greenbacks.'"
    ]
}