{
    "username": "Mamacitia",
    "contributions": [
        "In response to 'Yup. Because you become too important as a contributor that it becomes hard to move you out of your role cuz while busting your ass turns out you do the work of 3 people, lol.', a user said: 'oh.  oh wow, that makes a lot of sense.  when you become too efficient at your job, you become too valuable in that position.'",
        "In response to 'Exactly. The shitty part is that companies don't give you the paycheck of 2 or 3 people.\nFunny enough every bachelor's and masters degree in business administration would teach you to freaking value your employees. One of those disconnects between ideal and real life.\nAnd the crazy thing is it causes huge amounts of brain drain. Google and other corps be promoting engineers to managers while they are sucky managers but genius coders.\nIt would be way more efficient for the org to give them a raise and let them be coders and mentor other coders rather than go actual manager level.\nI wish I become C level at some point in my life to make these decisions. Because too much talent goes to waste in management level. Some people just prefer being contributors and if they are elite they should get compensated adequately.', a user said: 'this is so true.  I'm good at what I do (dental insurance shenanigans), but I'm no good at managing nor do I have any desire to be.  I'd rather solve problems than oversee the work of others and tell them what to do.  I hate confrontation in person, which is why I get it out by fighting insurance and making them pay me.  (delta dental knows what they did.)'",
        "In response to 'shrill forgetful sip wine tub panicky spectacular ancient clumsy quiet\nThis post was mass deleted and anonymized with\nRedact', a user said: 'yeah, I absolutely canNOT tell my manager when she's made a mistake, even when it's staring her in the face.  you gotta seem like it just happened and idk I didn't do it until she figures it out.'",
        "In response to 'Where can I send my resume? Lol', a user said: 'same question'",
        "In response to 'Original Post: I got promoted while quiet quiting My j1 is boring and has a lot of meetings, so I decided to quit and search for a new J, that was months ago. I accepted j3 and for the last 3 months I did a total of 0 commits, I just go to meetings and pretend I do some shit\nI just got off my 1:1 with my manager, and got promoted to senior backend dev. I will get a raise of 15%\nLife is funny sometimes', a user said: 'how do you people get promotions while not working????'",
        "In response to 'Original Post: New dumbshit media buzzword just dropped! (Spoiler: It's just a combination of quiet quitting and rage applying). [External Link]: https://i.redd.it/shqpdu0ns7qd1.png', a user said: 'Teturn'"
    ]
}