{
    "username": "mamiesb2001",
    "contributions": [
        "In response to 'Original Post: Quiet quitting Update: wow, the support!  Thank you all!\nWill now only refer to this as \"Just doing my job\"\nStarting today, I quit working for free.  I won't manage the school food pantry, sew for students or school programs ( uniform alterations, letter jackets, CTE jackets, prom dresses), work the gate or track meets, cover hall duty for others, support fundraisers, sponsor or coach teams, provide snacks to students, participate in staff potluck meals.\n I will arrive 2 minutes before my designated duty time and leave 2 minutes after hours.\nI will take off every Friday to help my family, and take off every PD because I have yet to attend a worthwhile PD (I have only been teaching since 2001, a valuable PD is unlikely to occur in the next year).\nI have 80+ days of leave accrued, and I will leave as few on the table as possible. \nThere is no union power in my state, so I am on my own.', a user said: 'Some  of my fellow “teacher friends” call working to contract “acting your wage”.\nWhen I started easing up on unpaid/unacknowledged work, I was shocked at how much I had been doing. Good luck!'",
        "In response to 'Hate that term. It ties a number to my effort and implies I'm not doing stuff because I'm not getting paid enough. No, I'm not doing extra duties because it's not in my contract, not because of money. If you tripled my salary today, I still wouldn't volunteer to chaperone the school dance if it's not in my contract.\nWork to rule is such a better term.', a user said: 'I do prefer the term “work to contract,” because it’s specific and accurate. But  I actively dislike the term “quiet quitting.” Nobody’s quitting — they’re doing the job they were hired to do. They just aren’t sacrificing unpaid time and labor to perform work not in their contracts.'",
        "In response to 'Yes, quiet quitting is worse. Both terms suck. Luckily, I only need one term to describe following the terms of my contract, and Union members smarter than me coined \"work to rule\" a long time ago.', a user said: 'Just one more thing we can thank a Union for taking care of for us.'",
        "In response to 'Yeah, I had a meeting with my admin recently, because I felt overwhelmed with my duties (breakfast, car, and lunch) on top of being on-call behavioral all day at the school.  They told me the reason I'm overwhelmed is because I'm doing too much for our kids and not sticking to job description and that my extra duties would remain the same.\nShrugs\n. They weren't WRONG, but it still kinda sucks they won't pay this HIGHLY overworked position more.  People at Taco Bell make more than me, but I LOVE my kids.  🥹', a user said: 'Yeah, it sucks that they didn’t really listen to you. :-(\nThey told you to stick to your assigned duties and contractual obligations, so do that.\nFirst thing you need to do is take your lunch, duty free, every single day at a predetermined time. Find a place to hide if necessary, and do anything but work. I read in a courtyard where there’s no phone (or kids). Notify admin that you’ll be taking lunch at x time and will not be available. (I case manage very high risk kids, so I know how hard that will feel.)\nIf you can’t do that at first, force yourself to come in two minutes before your AM duty  and leave every day one -two minutes after your PM duty (as soon as your contract permits). Come on at 7:28 if you have a 7:30 duty, for instance. Leave at 3:05 if your contract says you can. Remind them that your duty day has ended if there’s my pushback (there probably will be). Good luck!'"
    ]
}