{
    "username": "mantism",
    "contributions": [
        "In response to '[Deleted or Empty Comment]', a user said: 'Employers who have a hard worker that asks for nothing is playing HR on easy mode. There's really no reason to be that guy anymore when you could be a reasonably-effective worker who look like they might jump ship or need additional 'motivation'.'",
        "In response to 'IMO this is probably some psycho-social issue that is also linked to a couple of overlapping issues such as inequality (labour’s share of income in the econ argot but that’s for another day), involution and even fairness.\nSaw a chart a couple of days back showing how the average age of CEOs, world leaders etc have risen over the years, which mirrors the improvement in life expectancy across the globe. Not a bad thing per se but you can also see how this breeds discontent and disgruntlement among the millennials today', a user said: 'For me it was all this consumerism and how hyper-focused the contemporary world is at looking up to luxury, which inflates the ideal 'standard of living'.\nGotta buy that landed property, travel the whole of Europe every year, go for 20-course omakase dinners, buy this television, buy that car, yada yada. How ads are everywhere now and everyone wants you to buy something.\nIt just overloads me and make me want to do nothing in that regard instead.'",
        "In response to 'As a middle aged person, i feel fortunate to have grown up experiencing the tech revolution that fueled this\ngrowth\n. It can be hard to self regulate for the younger folks because you guys grew up over stimmed and constantly bombarded with messages from every corner of society/corp/govt/individuals... old fucks like me learned to switch off the media and march to our own beat early on and that helps to preserve some sanity.', a user said: 'I missed those days where I don't get messages and advertisements constantly shovelled onto me. It's a big reason why I quit social media - when they started making me view more ads than posts from my friends, what's the point? The first few years of Facebook was so much better. Can't imagine being born into the current state of media.'",
        "In response to 'As 100% of my uni friends (we graduated 4-5 years ago) like to lecture me (throughout the past 7-8 years), hustle now, relax later. If you don't chiong while you're young, you're wasting your time.\nThese are the same friends who on top of studying full time (back in uni), held a part time/weekend job. Now they're working 60+ hour weeks while trying to invest on the side. And it's not like they really need money but rather \"more money is always better\".\nTheir logic is simple, trying to trade a low quality of life NOW for a higher quality of life in the FUTURE.\nSo yeah, apparently \"money\" is the cake that is more precious than time.\nSide Note: These \"friends\" all come from low-middle to high-middle income families (me included) so I don't presume to speak for anyone else.', a user said: 'I thought of this approach too but looking at the current older working generation now, it doesn't look pretty. Even in their 40s-60s they are still working, still chiong, they can't separate work from leisure, they spent so much time working that they don't know how to relax. Or they can't, because work is the only thing they know by now\nNot saying that it's impossible to chiong now and then relax later, but I just don't see it happening often, especially now. Life was supposedly easier back then, when things were cheaper and jobs didn't require as much qualifications, yet the OT culture started from then.\nWhat is great now, however, is that people are generally more financially savvy and willing to invest or plan for long-term savings. So that's some justification for 'hustle now, live later'. The harder part is probably making the decision to finally let it go and start living.'"
    ]
}