{
    "username": "markokane",
    "contributions": [
        "In response to 'You also get paid for the kind of effort you put in.', a user said: 'No.  You get paid for the perception of the work you put in.   And I would even argue that today you are only paid what the company wants to pay you and your overall productivity isn't the biggest factor in you pay.   Unless you are working in an environment where success metrics are tied directly to performance, most of us are paid under the limits of budget and perception if you are doing a good job.\nYes there are positions we're output can be tied and measured but for most white color jobs it's how well you so the fact that you're doing your job.'",
        "In response to 'No.  You get paid for the perception of the work you put in.   And I would even argue that today you are only paid what the company wants to pay you and your overall productivity isn't the biggest factor in you pay.   Unless you are working in an environment where success metrics are tied directly to performance, most of us are paid under the limits of budget and perception if you are doing a good job.\nYes there are positions we're output can be tied and measured but for most white color jobs it's how well you so the fact that you're doing your job.', a user said: 'I think the article sends the wrong message in an effort to jump on the current messaging that people don't want to work.    People don't want to work without being rewarded for their efforts.    While there are some who are unrealistic about their value to the company, I think the majority of workers want to be paid fairly, have decent benefits, and have some sense of security if they perform and work for and with people who are not abusive.   While COVID sped up the process, I think we were already headed for a new mentality for the everyday worker.   Millennials were already viewing work as a transaction and balancing ha they got versus what they gave.    We have a couple of generations who are also including other factors like the Social Awareness of the company.   People want to work with others who are like-minded and think as they do.    Compensation has really been flat for many of us, and only those tied to revenue-generating type jobs were seeing the payback.    I would also argue that the business theory of maximizing Shareholder Value created many issues over the last 30 to 40 years.  Companies don't grow forever and the steps that leaders are taking to maintain the perception of growth have impacted the front lines of most companies.   And enough has been said of Jack Welche's performance management model that was embraced by companies to demonstrate that growth at all costs isn't as successful as thought.\nI think \"Silent Quitting\" is a clickbaity way to encapsulate an issue and it is not helping identify the real issue or what is really happening.   Workers are still putting out the effort, but they are not going above and beyond because they know it's not going to make a big difference in their future income.    There is a bigger return on their income by switching companies after demonstrating short-term success.    Workers know that \"The Company\" isn't going to take care of them, as it did their Parents or Grandparents, so they are focusing on looking out for themselves.    Because the advantages of the generations of workers before them don't exist anymore and they need to find a new path.\nEdit:  Just so it's clear:  I was born in 1964 so my view of work is still rooted in the Baby Boomer vision, but my last 10 years have been closer to what we are seeing today than my first 40.    I still work hard, but I don't work 60 hours or 7 days a week like I did in the past.'"
    ]
}