{
    "username": "MarlinMr",
    "contributions": [
        "In response to 'Det har ingenting med \"quitting\" å gjøre heller. Det er et tullete begrep laget for å gi negative konnotasjoner til det å ikke yte 110%.', a user said: 'Quiet Quitting må vel være å ikke gjøre noe på jobb før du blir fortalt om å gjøre det. Det er shitty.\nMens å\nikke jobbe etter arbeidstid\n, det er jo bare vanlig.'",
        "In response to 'Quiet quitting er strengt teke berre å ikkje ta på seg meir enn ein er tilsett til, og får betalt for. Om det er å arbeide ut over arbeidstid, eller å gjer arbeid som ikkje ein har betalt for å gjere er det same.\nDet vert som ekstralekser fordi ein er flink på skulen. Og så verte sur når eleven vel å ikkje gjera dei.', a user said: 'Quiet quitting er strengt teke berre å ikkje ta på seg meir enn ein er tilsett til, og får betalt for. Om det er å arbeide ut over arbeidstid, eller å gjer arbeid som ikkje ein har betalt for å gjere er det same.\nKan da ikke være det? Jeg er ikke på St. Olavs for å hjelpe med underbemanning av sykepleiere akkurat nå. Men jeg jobber heller ikke som sykepleier. Quiet Quitter jeg nå?\nJeg sitter heller ikke hjemme nå, på pinsemandagen, og jobber med det jeg jobber med til vanlig. Quiet quitter eg nå?\nMen det finnes en haug med jobber som ikke krever at du faktisk jobber 8 timer hver dag. Men du må gjerne møte opp. Feks er det masse IT jobber som er sånn. Hvis man da er ferdig med det man skal gjøre, og har timevis med betalt tid som man strengt tatt ikke trenger å gjøre noe. I denne tiden kan man feks hjelpe noen kollega litt med det de holder på med, lese seg litt opp på noe fornuftig, eller surfe reddit. Surfer man da reddit, så føler jeg at det er det som er quiet quitting. Jada, du har teknisk sett gjort jobben din, men i og med at du har betalt for å sitte der, så kunne du gjort noe fornuftig.'",
        "In response to 'No trur eg du misforstår meg med vilje, og set ting på spissen for å \"bevisa\" noko.\nPåstanden her er jo at \"quiet quitting\" er eit begrep oppfunne for å gje dårleg samvit for å ikkje gå ut over grensene for arbeidstid/mengd enn ein er betalt for, for å vera ein \"god arbeidstakar\". Det gjeld ikkje å \"hjelpa ein medarbeider\" dersom ein har tid til det, men å hjelpa den medarbeidaren sjølv om ein IKKJE har det, for å vera \"flink\"\nEG seier ikkje at det er quiet quitting, eg likar personleg ikkje uttrykket, men det er det \"dei\" legg i det. Eller som andre her har skrive, \"act your wage\"', a user said: 'Ja nei asså hvis de har funne på en term for å forklare noe som betyr noe helt annet, så må det jo være dems feil at folk misforstår. Du kan jo ikke quitte en jobb du ikke har.'"
    ]
}