{
    "username": "martphon",
    "contributions": [
        "In response to 'Seeing the change in the W-2 sounds discouraging.\nYou don’t mention your broader financial picture. When I was an associate professor in my 50s (I’m past 60 now), I would have killed for a tradeoff that says “I do less work and earn less money.”  As it was, I struggled with my R1 research expectations, which meant heavy summer work whether I got paid or not.  (I got paid if I got grants to pay myself.)  Even so, I enjoyed my “research-only” summers a lot.  If I had had to teach year round, it would have broken me.\nWhat do you want out of the next 10 years of your job?  Is “less teaching for less money” an attractive option for you?\nAs for your specifics, if you freeze your pedagogy for a year or two, no animals will be harmed.  And unless you supervise PhD students, declining to push your work all the way uphill to publication harms nobody and nothing except you and your possible chance for future promotion.  But if a year off from publication would make a material difference, I would be surprised. (Like lots of my colleagues, I opted out of the “more, more, more” required to go from associate to full at our private R1.  We have world-famous faculty who are associate.)\nYour colleagues and your department chair can put on their big-kid pants for a year while you figure out what you really want.', a user said: 'You don’t mention your broader financial picture.\nIt sounds as if they didn't fully realize they made less money until they saw their tax form. So the actual money amount didn't matter so much. Plenty of people are in much worse shape.'",
        "In response to 'I hear you on this. The change in income did not take food from my children's mouths. The impacts are in college savings, retirement savings, and feeling that I can buy stuff we don't need. So it is more a question of dignity, and there's definitely some \"breadwinner\" issues here that I have to work through. I know you can't eat dignity but that doesn't make it worthless.', a user said: 'Of course. I just focused on the W-2. For my part, the longer I taught, the more cynical I got. I hope my students didn't suffer.'"
    ]
}