{
    "username": "Mashaka",
    "contributions": [
        "In response to 'Most of the recent inflation was due to the Biden administration inventing and printing and dumping $10 Trillion dollars into the economy in a few weeks .\nSome people have the opinion that the reason wages are depressed is because of immigrants coming to the US , who are willing to work for lower wages .\nBut I am intrigued , since it’s \nKinda confusing to see someone who immigrated to the US complaining about the wages and politics .\nIt’s good to see someone who understands that a workers value to the company must be more than the worker costs the company in Wages , benefits etc .', a user said: 'Most of the recent inflation was due to the Biden administration inventing and printing and dumping $10 Trillion dollars into the economy in a few weeks .\nThis doesn't match federal spending data, and I googled without success for any hyperbole you could be drawing on. What were you referring to here?'",
        "In response to 'All the free money the fedgov handed out in the last three years .', a user said: 'What are you referring to by (10 trillions of) free money?\nI'm gonna assume you meant a few years instead of a few weeks in your OC, no worries about copy-editing.'",
        "In response to 'Ha\nGotta love auto correct\nGonna get worse too\nThe fedgov borrows a full 50% of the money it spends .\nAnd that’s AFTER taking one third of the money that people who are still stupid enough to work for a living earn .\nThe fedgov steals 1/3 of people money and then borrows that amount again , and spends it .\nIt’s mathematically unsustainable .\nIt can’t go on forever .\nAt some point it’s going to collapse .\nThe fedgov will NEVER cut the spending , they simply can’t and won’t since they use the spending to buy votes and pander to certain groups .\nBut the borrowing and printing money simply can’t go on forever .\nAt some point it will have to stop .', a user said: 'Was the 10 trillion you mentioned just all federal spending since Biden took office? I'm about to hit the sack so I'm not going to check the data again but the number seems plausible if that's what you mean.\nWhat portion of that is the free money, invented or printed, you're worried about? Off the top of my head, I'm not sure that we could characterize expenditures of tax revenues, or (at least the principal of) Treasury Bonds, as free money.'"
    ]
}