{
    "username": "Massive-Exit-1751",
    "contributions": [
        "In response to 'Original Post: I got promoted while quiet quiting My j1 is boring and has a lot of meetings, so I decided to quit and search for a new J, that was months ago. I accepted j3 and for the last 3 months I did a total of 0 commits, I just go to meetings and pretend I do some shit\nI just got off my 1:1 with my manager, and got promoted to senior backend dev. I will get a raise of 15%\nLife is funny sometimes', a user said: 'Wait till you get to architect you can just throw out that you need more time to conceptualize throw in a buzz word or two and that buys you at least 3 to 4 weeks at 2 of my Js. J3 will give even more time and offer up a junior resource eager to learn to basically be a lackey or ask do we need to add a headcount to take some of the \"low hanging fruit\" off your plate.\nInterestingly enough, I get to see both sides as my bread and butter is a Fortune 500 level leadership role. I smile, nod and play along when I hear architects use lines on me that I use when I switch chairs to other J's for IC roles.'",
        "In response to 'You think business will keep quiet when you buy 2 to 4 weeks while they are paying you architect salary?', a user said: 'Yes, if not longer and it will continue to happen. You get to a crossover point in your career where it's less about time but more about relationships and getting decisions worth millions to the company right.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'College days worked a 3rd shift factory job got accused of sleeping on the job. I was new but still faster than all the old timers. One boomer we'll call him Bob pulled me to the side and said a combination of look kid you're working too hard and to slow down. I knew it wasn't a long-term gig or even in my desired field. However, I still wanted to do my best and leave a good impression.\nFew days after the Bob conversation above, the manager hits me with the anonymous some folks told me blah blah the sleeping part. I was so pissed rest of summer I'd clock in immediately go to my car and actually sleep for my entire shift then clockout. Same manager before I went back to school, it was a pleasure to have you, thanks for being coachable and welcome back anytime. The icing on the cake manager goes I know you're good with computers we may even have a back office internship as well next summer 😂🤣'"
    ]
}