{
    "username": "MassivePsychology862",
    "contributions": [
        "In response to 'I feel like MLK Jr's quote about the white moderate is very prescient about the DNC and most liberals today:\n\"...but the white moderate who is more devoted to order than to justice; who prefers a negative peace which is the absence of tension to a positive peace which is the presence of justice; who constantly says, \"I agree with you in the goal you seek, but I can't agree with your methods of direct action\"; who paternalistically feels that he can set the timetable for another man's freedom; who lives by the myth of time; and who constantly advises the Negro to wait until a \"more convenient season.\" Shallow understanding from people of good will is more frustrating than absolute misunderstanding from people of ill will. Lukewarm acceptance is much more bewildering than outright rejection.\"\nBit of a long copy/paste chunk from his letter from Birmingham jail but every line feels like it still applies today. People like Favs feel way more focused on order and the process than justice.', a user said: 'I need to reread that letter. I feel like growing up in the American education system we were only exposed to MLK in the context of nonviolent peaceful protest, with none of his more pointed writing directed at moderates and liberals.\nOf course we also only learned about Malcom X from the perspective that he was a radical.'",
        "In response to 'He was also super anti capitalist which is almost certainly why the FBI had him assassinated and almost everything we were taught about him in school was a very white washed version of him.', a user said: 'Of course. I just learned about Fred Hampton and COINTELPRO. I had a friend argue that censorship in Russia is worse than the United States because we don’t imprison journalists. When I said we kill activists she accused me of spreading Russian propaganda. When I told her i learned about this from reading history books she had no answer. I’m not saying the us is worse than Russia. I was just arguing that trying to compare propaganda and censorship between different super powers is pointless. We shouldn’t trust any super power or state media (or bought media in the case of the United States).'",
        "In response to 'It feels like Biden has been quiet quitting for the better part of two years. I can’t remember what he’s done since the midterms. And if I can’t remember and I listen to every episode of this podcast, it’s no wonder half the electorate couldn’t remember either.', a user said: 'He’s been ailing for a long time. He is purposefully being hidden and other people are running the show, especially Blinken.'",
        "In response to 'Always remember the press conference he did on the plane and Blinken standing off to the side with an expression like he was extremely wary and ready to drag Biden away from the cameras if he slipped up.', a user said: 'I’ll always remember blinkens face when Biden mixed up Zelensky with Putin. Austin also couldn’t hide his cringe. It’s been painful. Every time Biden is on screen I pray that he doesn’t drop dead… what a weird thing to think about your own president.'",
        "In response to 'Because Ro Khanna is an incredibly boring politician. Another elite school educated lawyer who is trying to engage in kay fabe populism but has no cred to do it. Akin to when Mitt Romney rapped ‘who let the dogs out’', a user said: 'Forgot about that Romney bit. Thanks for that, I needed the laugh today.'"
    ]
}