{
    "username": "mastrait48",
    "contributions": [
        "In response to 'Original Post: I didn't get the promotion. Should I quit or quiet quit? A few months ago everyone in my team was let go apart from me. I was then told I could apply for my old manager's role. I applied but have now been told I didn't get the role and they are going with an external candidate.\nFor these past few months I have basically been doing this promotion role (and have received really good feedback from lots of senior people). I have not gotten a payrise to do all this extra work.\nI want to leave before this candidate starts because I'm tired of giving them essentially cheap labour. I was told if I didn't get this promotion, another role would be made available for me (in the same team), so I would probably have lots of leverage to negotiate a payrise. But I really don't want to have to essentially train this new external candidate who will be making more than double what I earn in the role I didn't get.\nShould I hand in my notice now, do a shitty handover and let the new person flounder? Or should I stay in my role with more money, but be looking for jobs on the side (it could be months and months before I find a good job). If I do immediately quit, I do have savings I could live on for 6+ months (took me years to save this amount).\nWhat would you do? Any advice?', a user said: 'I would have a candid discussion before you begin reporting to this new individual. Why you didn’t get it, how the company views your extra efforts, how they view your future at this point, suggested compensation for your extra efforts.\nIf your relationship is strong it may be worth candidly stating your intentions. The last statement is very subjective on your own comfort level and relationship w the leader.\nIf there wasn’t an open discussion about these things leading up to the interview, you may want to consider not taking it personally. After receiving the feedback, do what you should always do; assess your future in the position and with the firm (learning, financial, career growth opportunities). THEN make your decision.'"
    ]
}