{
    "username": "Maxrdt",
    "contributions": [
        "In response to '\"Quiet quitting\" is just a PR spin on a well-established concept -\nWork-to-rule\n.', a user said: 'Not really, work-to-rule has a long history as a protest, whereas \"quiet quitting\" refers even to people who are doing fully adequate and expected work.\nWork-to-rule is an organized, wide-spread action in a workplace.\n\"Quiet quitting\" is basically the one guy at the office who asks \"leaving early?\" when you leave at 5PM or expects you to respond to emails at any time, but elevated to having an opinion article.'",
        "In response to 'Work to rule is doing fully adequate and expected work, and no more.\n\"Quiet quitting\" to me sounds like a call to this kind of labour action, but nationally, instead of limited to one union/workplace.\nDon't blame the opinion articles writing about it for teenage tiktok leftists coming up with a bad name for a good cause, that's kinda their whole thing.', a user said: 'Work to rule is doing fully adequate and expected work, and no more.\nThat's not fully covering it though. Work-to-rule is closer to the sorts of things you'd see on\n/r/MaliciousCompliance\n. Taking FULL time for every minute task, never skipping or being quick about even the most mundane inspection or interaction. Double-checking every order, doing your inventory three times before clocking out, etc. The same way you regularly break minor traffic laws.'",
        "In response to 'Work-to-rule sounds a lot like what we in Finland call \"an Italian strike\". Which means kind of passive-aggressively doing your job 100% literally and nothing more. Which is to say that you more or less purposefully do your job poorly because your job description can't possibly cover every little detail that may happen at the work place. I have sometimes done this when I've had disputes with my employees (usually around the time that I've been about to quit) but I wouldn't encourage it as a rule to follow every day because it more likely hurts your colleagues just as much as it hurts the employer. Nothing more frustrating that having to work with a colleague who is always late and doesn't bother to check his work and correct his mistakes. If you show that you can't do even single tasks on your own, don't be surprised if you get a manager that insists on micro-managing every aspect of your work in the future.', a user said: 'It's not a great idea to do by yourself, but when your entire union does it you can have power. It's also called a\nSlowdown\n.\nSeems unions really do have all the answers.'",
        "In response to 'Completely agree.\nThere is a war on wages being waged by the elite against us. The last few Federal Reserve announcements have blamed inflation on workers wages instead of government excess spending and central bank excess money printing. Why should there be a war on workers wages instead of fixing the money elites bad decisions.', a user said: 'have blamed inflation on workers wages instead of government excess spending and central bank excess money printing\nMore corporate greed in raising prices and shrinking products, taking in record profits, and not increasing wages than government spending.'"
    ]
}