{
    "username": "McDougleTheThird",
    "contributions": [
        "In response to 'Original Post: Påstand: \"Quiet quitting\" er ikke noen ny trend, vi har bare adoptert et teit begrep for å ikke jobbe gratis Litt kontekst:\nhttps://www.dagsavisen.no/nyheter/2023/05/28/nora-vil-ikke-svare-pa-mail-etter-jobb-jeg-er-en-quiet-quitter-men-ikke-lat/\nhttps://www.nrk.no/innlandet/1.16087894\nhttps://www.aftenposten.no/meninger/sid/i/wAOOp5/jeg-er-en-quiet-quitter-men-ikke-en-unnasluntrer\nEdit: fikset lenker', a user said: '\"Quiet quitting\" er vel mer det å gjøre absolutt så lite som mulig men fortsatt ikke kunne sparkes, i.e. gjøre en dårlig jobb og bruke mest mulig arbeidstid på sosiale medier, mobilspill eller hva enn en kan fylle tiden med som ikke er produktivt arbeid.\nNoe som er litt annerledes enn hva jeg opplever ihvertfall de som intervjues her snakker om som virker på meg mer som \"act your wage\", blir man ikke kompensert for tiden man bruker på å svare på e-post utenom arbeidstid, så burde ikke det være nødvendig, står gjerne heller ikke i rollebeskrivelsen for da kan man lettere argumentere for kompensasjon, er bare noe \"en god ansatt vet å gjøre\".\nOfte er vel dumskap forklaringen, men har inntrykk av at der finnes en agenda for å spre forvirring mellom disse to begrepene, ihvertfall i amerikansk media, noe som kan gi mening da den ene er en sunn og fornuftig holdning som med fordel kan spres, mens den andre er en negativ ladet betegnelse på kollegaen som gjør at gjerne andre må ta i litt ekstra for å få ting til å gå rundt.\nHelt klart fordelaktig for de på toppen om vi fokuserer på Kevin som slasker på reddit hele jævla dagen fremfor det faktum at de forsøker å normalisere det at å jobbe litt ulønnet på fritiden bør kunne forventes av samtlige i grunn.\nEdit: typo'",
        "In response to 'Men så er det nå en gang det uttrykket som blir brukt. Quiet quitting er å ikke yte ekstra utenfor arbeidskontrakten din, da dette tillater sjefene å utnytte deg for mer arbeidskraft som du ikke kompenseres for. \"Quiet quitting\" kommer fra Big Corp og media, som mener at å ikke yte ekstra er å \"slutte\" med jobben, fordi man hele tiden har forventet at man skal gjøre ekstra.\nDet er derfor det er et så gøy begrep, fordi sjefene blir dritpissed for at du ikke gjør mer enn du får betalt for å gjøre. Det sier litt om den holdningsendringen vi må gjøre, nettopp gjennom \"quiet quitting\". Alt har en grunn vett.', a user said: 'Poenget er at om vi skal ta inn et begrep på dette så er det bedre å bruke \"act your wage\" i stedet for negativt ladet og big corpa pusha \"quiet quitting\", som fort kan tolkes begge veier og skape konflikt og misforståelser fremfor å samles om at å jobbe ulønnet er bullshit.\nOg skal sies at du tilogmed bruker norsk ekvivalent \"ikke gjør mer enn du får betalt for å gjøre\" i forklaringen din på hvorfor vi skal \"quiet quitte\"..'"
    ]
}