{
    "username": "McFlygon",
    "contributions": [
        "In response to 'Original Post: It's NOT \"quiet quitting!!!\" \"Working your contract,\" \"working to rule\" and \"acting your wage\" are all MUCH better terms. Why would you use the word \"quit\" to describe you adhering to your contract and doing your job? It has nothing but negative connotations AND denotation.\nI highly encourage everyone here to lose that term. We're working our contracts. We're not quitting anything. Some may STOP giving away their physical and/or emotional labor, but that's not the same as quitting!\nEdit: For those of you saying \"It's called 'doing our job'\" The implications of teachers \"just doing our job\" are:  volunteering for events, grading/planning at home, taking over other  peoples' responsibilities, adding more to your plate every year, etc...  Admin considers this \"just doing your job.\"', a user said: 'Has anyone had to plan during class time yet? I've said it before, but if I were still full-time this year I would be utilizing 2-3 days a week to just plan during class time so I could STOP planning at home.\nThat or teach exclusively off TPT content and adapt as I go lol'",
        "In response to 'I plan during independent work time and I teach second and third graders. It is very possible. I work to my contract.', a user said: 'That's awesome! Definitely rooting for you to have a good year 😄'",
        "In response to 'Original Post: Quiet quitting could be the best thing for education. Everyone's definition of quiet quitting is different. Mine is not working outside of your contract ours. Work from 7am to 3pm and then you're done. No lesson planning outside of class, no chaperoning, no working gates unless it involves extra pay.\nWhen you ignore these boundaries, you overwork yourself, can't sustain the position, and you end up leaving the profession and in return your students lose a great educator.\nIf you can't do all the tasks a school asks for you to do during the day, that is not the fault of you, it is the fault of your boss requiring too much of you. If you continue doing these tasks outside of your hours you are effectively telling your admin that this is okay.\nWhen you put your value in working extra hours because it makes you feel like you are \"doing it for the kids\" you are doing the opposite long term. The precedent that teachers have to put so much time in outside of work is toxic and leads to teacher burnout. A shortage of teachers is not good for any educational system.\nI'd like to blame admin, government, or students but the easiest fix is in the teachers themselves. When we overwork ourselves, we effectively hurt education. Only work your hours and if you can't get your work done, let your admin know you don't have the time. Healthy work life balance can keep us going and bring more teachers into the profession.\nEdit: Sorry y'all. I didn't realize how problematic the term \"quiet quitting\" is. I am glad though that it brought some attention to the post which led to some good discussion. I will use a different term from here on out and I am happy a lot of you only work your hours or work your contract.', a user said: 'Agreed! I couldn't handle it and quit from the burnout after 5 years. I have 2 kids and a high maintenance wife, so there's that too, but no excuses! If you are still in the profession, I endorse the idea of \"acting your wage\" or whatever you choose to call it. Keep those kids learning and put perfection on the waaaaaay back burner!\nBtw, my students didn't lose a great educator, they gained one. As a sub teacher, I will be impacting 1000s of students each year! I'm getting stoked to return to the classroom in a supporting role.'",
        "In response to 'I grade with the kids. If they are writing essays, I take an extra day or two to sit with each kid and offer suggestions right in the moment. I say, fix this and then show it to me again. They get more out of it because they are responding to the feedback, and I don't have to grade it later.', a user said: 'Do you grade a section of their rubric each time? So they can see your results in real time? I always spent too much time grading and I've decided if I ever go back to teaching (unlikely aside from subbing) I won't be assigning homework. It's a drag for me, the parents, and the kids.\nI'd say \"read the book if you want, you'll probably pass the test without it. Just review a summary.\"\nIn class we would always talk about sections that I THOUGHT were interesting or discussion worthy. I open the floor up to them to discuss as well, boom. Lesson done.'",
        "In response to 'We read everything together, too. It's the only way I can get them to read. We just do everything together. They honestly get so much more out of it. It doesn't help them become independent, but it does help them become better readers and writers, which is my goal for now. I usually have them write one paragraph at a time and I check that before they can go on.', a user said: 'I love this for them!'"
    ]
}