{
    "username": "mcove97",
    "contributions": [
        "In response to 'Du jobber, og blir betalt for, avtalt arbeidstid. Med mindre du er en av de få som har særskilt selvstendige arbeidsoppgaver er det typisk 8 timer. Ferdig med det.\nRinger noen meg og trenger hjelp så stiller jeg seff opp for jobben, men jeg sjekker ikke aktivt mail og Slack på fritiden.', a user said: 'Samme her. Blir jeg spurt om å jobbe ekstra/overtid så gjør jeg som regel det, men da for overtidsbetaling/ekstra tillegg. Som f.eks i dag ble jeg spurt om jeg ville jobbe men var helt opp til meg selv. Med tanke på at pinse betyr svært lite for meg, og jeg uansett var innstilt på en helt vanlig arbeidsdag da det er mandag (hadde helt glemt at det var pinsefri i dag til jeg ble spurt om å jobbe)  så gjorde det ikke meg noe å jobbe når jeg så får 100% ekstra betalt. Også har jeg ellers ingen andre plikter, så for meg er hver enest krone jeg kan tjene ekstra gull vært.'",
        "In response to 'Ja, omgrepet må tolkast i den samanhengen det har blitt skapt, i dette tilfellet amerikansk arbeidskultur. Der har ein arbeidstakar langt dårlegare føresetnader enn i Noreg, og det blir aktivt slått ned på fagforeiningar i store deler av samfunnet (til og med frå staten si side, ref. togarbeidar-streiken no nyleg). I tillegg brukast \"The American Dream\" som ei oppfordring til å yta ekstra slik at ein skiljer seg ut og stiger i gradene, men fleire og fleire innser at draumen om hus, bil, ferie kvart år osv. ikkje er oppnåeleg når produktivitet og lønsvekst ikkje har hengt saman sidan Reagan si tid. Visst ein i tillegg skulle finna på å få ein sjukdom så kan ein sjå langt etter å bli gjeldsfri før ein ligg seks fot under.\n\"Quiet quitting\" for ein amerikanar betyr at dei ikkje lenger let seg utnytta for ein draum som aldri kan oppfyllast.\nEin ser dei same økonomiske tendensane i Noreg, spesielt i yrker der arbeidskraft er lett å erstatta. Sjølv om me ikkje opererer med minimumsløn så er det vanskeleg å sjå føre seg at t.d. ein butikkarbeidar vil vere i stand til å både leva og spara nok til å bli økonomisk uavhengig på sikt. Spesielt visst ein er einsleg og heller ikkje har foreldre som kan hjelpa med sikkerheit på lån e.l.\nEg trur det er brei semje om at \"quiet quitting\" er eit litt tullete uttrykk, men allikevel eit fornuftig konsept. Ein skal jobba for å leve, ikkje leve for å jobba. Halve diskusjonen her kjem av at folk ikkje har lest artiklane og dermed \"kommenterar frå hofta\" om kva dei _trur_ at dette betyr. Klassisk Reddit.', a user said: 'Hva vil det si å være økonomisk uavhengig egentlig?'",
        "In response to 'Eg har alltid tenkt på det som å vere gjeldsfri, fyrst og framst, men det kan vel bety ulike ting for ulike folk. I alle fall å ha stort nok overskot og lite nok gjeld til at ein ikkje blir fastlåst i ein situasjon. For å spela vidare på den opprinnelege kommentaren: Er du butikkarbeider og tener 20-25 k netto i mnd så ryker lett halvparten til husleige og det er vanskeleg å spara nok til å kunne eige noko sjølv og dermed på sikt ha betre råd (igjen, spesielt dersom ein er einsleg og ikkje har rike foreldre). Tilbakebetaling av lån har eit endepunkt, det har ikkje leige.\nRotete forklart men eg håpar det var forståeleg.', a user said: 'Ser den. Er selv så godt som gjeldsfri, så fastlåst økonomisk føler jeg meg ikke. Har 27 netto i mnd i snitt, men løser bosituasjon ved å bo sammen med andre, og det sparer jeg veldig mye på, da mindre enn 1/3 går til husleie. Med tanke på leie.. så har jeg odel på gård, så hvis jeg skulle ønske meg bolig i fremtiden (noe jeg ikke ønsker, da det ville låst meg økonomisk med gjeld så jeg ikke har mulighet til å trappe ned i stilling hvis jeg skulle ønske å jobbe mindre/flytte til utlandet/reise osv) så er jo det alltids en mulighet i fremtiden, da foreldrene mine nærmer seg pensjonist alderen. Vil ikke si jeg har rike foreldre, men de støtter meg alltid økonomisk og med en midlertidig plass å bo og jobb på gården når jeg har vært mellom skole/jobber/studier osv.. kanskje er jeg i en noe spesiell situasjon, men penger er altså ikke egentlig ett problem.'",
        "In response to 'Å være økonomisk uavhengig e' når du kan pisse og drite på penga, uten at det har no'n påvirkning på livet ditt. Du har nok cash i banken til å klare deg uten å måtte bekymre deg om penger og all den dritten der. Sånn sett kan du si at du har ræva full av penger og føler deg fri som en fugl. Dritbra, eller hva?', a user said: 'Åja.. føler det sånn selv om jeg jobber i butikk jeg. Sløser unødvendig mye penger på drit fordi jeg tjener mer enn jeg egentlig har behov for. Hadde fint klart med med mindre å rutte med for å si det sånn. Bekymre meg over penger har jeg aldri (med unntak av da jeg studerte, så jeg slutta å studere lol) gjort og bekymrer meg ikke..ikke at jeg har ræva full av penger akkurat men føler meg fri nok til den grad det er mulig å føle seg fri med tanke på at man har en fulltidsjobb, som begrenser hva man har tid til. Kjenner flere som har penger i flust men det er heller (fri)tiden som ikke strekker til.'"
    ]
}