{
    "username": "mcpo_juan_117",
    "contributions": [
        "In response to 'I always tell my boss during reviews that I do NOT want a promotion because it comes with more responsibility and expectations of working more. It blows their minds no matter how many times I say it.', a user said: 'Same here. Thankfully though most of the time my bosses take the hint on the first no and never speak of it again. And then when a new boss is assigned to me the same song and dance happens. LUL'",
        "In response to 'We are all mercenaries', a user said: 'Buti pa mga PMCs dami pera according to the documentaries I've see.'",
        "In response to 'Quiet quitting is such a corpo bs term. When you buy 1kg of rice, you pay 1kg peso worth of money. If the vendor decides to give you extra kg, then that's called a promo. Now when employees give services for what they're paid for, they call it quiet quitting?\nEh, just call it \"quielty doing your job\". Any extra is just a promo and should not be expected as a norm.', a user said: 'It's the \"above and beyond\" culture ingrained by companies into employees. IMHO if I go above and beyond I should be compensated for that but some companies just pat you in the back or worse pizza. LOL'",
        "In response to '[Deleted or Empty Comment]', a user said: 'Had a similar situation but I got real smart early on. Declined any offer for promotions because I know what it entails. Been an agent for a decade and reached the salary ceiling for agents.\nThe thing is as an agent I can work 8 to 5 with no work to take home. Maybe the occasional paid overtime. While my co-workers who took the bait are still working when I go home and frequently have to do TY OT. Fuck that shit!'",
        "In response to 'If the company they work for starts laying off workers theyre the first to go.', a user said: 'Why? They're doing what is required of them in their contracts?'",
        "In response to 'How do you define and measure mediocrity? Slacking at work is not bare minimum. If the quality and value of your work goes below the standards, metrics, and parameters set by your working environment or field, that's not the bare minimum. You're going below the minimum.\nAnother thing. I've seen valuable team members from junior to senior positions get laid off arbitrarily on my entire career. What you're claiming about layoffs is not always true. Even if you're one of the top performing employees, you're fair game.', a user said: 'I think folks are confusing doing the bare minimum aka quiet quitting with employees who are just poor performers.\nThis going above and beyond culture with no monetary compensation for your added effort needs to die IMHO.'"
    ]
}