{
    "username": "Mediocre_Attitude_69",
    "contributions": [
        "In response to 'Kiinteällä palkalla on vain fiksua tehdä enintään niin paljon töitä, että työpaikka (palkka) säilyy. Kun ei siitä ylimääräisestä kostu mitään, on vain puhdasta masokismia ja oman työn arvon alentamista.', a user said: 'Paitsi kun tekee työnsä hyvin, niin palkankorotuksen saaminen on huomattavasti paljon mahdollisempaa. Ainakin itse sain moisen.'",
        "In response to 'Huomattavasti tehokkaampaa käyttää aikaa jonkun taidon/osaamisen hiomiseen ja hakea parempipalkkane duuni muualta ku tehä 120% töitä 3% korotukaen eteen. Toki varmasti on firmoja joissa saa kelvollisiaki korotuksia mut ne o huomattavassa vähemmistössä :P', a user said: 'No en mä kyllä piiruakaan oo tehnyt ilmaista työtä, joka tunti on mennyt kirjanpitoon. Enemmän vaan asenne, että tehdään kunnolla.'",
        "In response to 'Tämähän on lähtökohtaisesti vähän .. hassu lähestyminen.\nTyösuhde on bisnestransaktio, ja sä toimitat työtä sovituilla ehdoilla ja sovitun määrä, etkä muuta.\nEihän firmatkaan toimita ylimääräistä ja toivo että \"ehkä asiakas maksaa joskus enemmän kun sai nyt ekstraa\".', a user said: 'Firmathan 'toimittaa' kaikenlaista ylimääräistä, sillä ajatuksella että jospa asiakas jatkossakin valitsisi meidät, ja suostuisi maksamaan meidän hinnat vaikka ei ollakkaan just se kaikista halvin.\nMenet rengasliikkeeseen. Siellä on odotusaulassa nahkasohvat, kahviautomaatti, lehtiä. Niiden homma on myydä ja asentaa renkaita, tää kaikki on ylimääräistä.\nMenet markettiin. Siellä on penkkejä joille istahtaa. Sieltä löytyy kierrätyspiste mihin voit toimittaa vanhat paristot ja elektroniikat. Ei nää oo marketin businesta.\nMarketista ostat levyn Fazerin sinistä. Se on pakattu kauniiseen paperiin, sen sijaan että olis vaan ruskeassa paperissa. Ne tekee suklaata, mutta stailaa sitä pakettiakin.\nMenet ravintolaan syömään. Pöydässä on siisti pöytäliina, ja pöydällä voi olla kynttilää, kukkia tms. Ihan turhaa hömppää moiset, vois olla pelkkä pöytä, kunhan ruokaa saa.\nEsimerkkejä on loputtomiin, ja sama voi toimia työntekijänkin suhteen. Jos ei toimi, niin sitten voi nostaa kytkintä ja mennä paikkaan jossa hyvää työntekijää arvostetaan.'"
    ]
}