{
    "username": "Meewol",
    "contributions": [
        "In response to 'Original Post: TIFU and ragequit my job [Update 5 may, 12:00pm: Yes my wife is talking to me again. No, the company has not yet been in contact. I'm leaving now to drop off all my company-owned assets and badge. Wish me luck.]\n[Update 1:20pm: Thank you all for your concern, and whoever messaged the Reddit Cares folks - I'm okay. I've been working with professionals to improve my mental health for several years. This is a definite regression, but without the help I've already had, it would have happened much sooner, and much more spectacularly self destructive.]\n[Last update 7:35pm: It's the end of the day, and I'm not exhausted. I'm not short-tempered and grumpy. I'm actually in a good mood for the first time in a while. Thanks, everyone who had kind words. I'll keep reading and replying. It's not like I've got anything better to do with my time.]\n(Happened yesterday, for the pedantic.)\nI was on a Zoom call, waiting to give a presentation that was scheduled for a 15 minute slot. Three hours of listening to the presentations queued before mine, and it comes down to five minutes. \"Okay, I'll just speed through this, as nothing has changed, so it should be an easy approval.\"\nFirst slide. Second bullet. I'm interrupted.\nBy one of the committee who clearly hasn't read the proposal. Or any of the\nthree months\nof back and forth on the specific wording or implementation details, justifications and prior approvals.\nI try to drill down to the specific objection, even find the email thread where I was given that specific wording, and they ask for clarification on what, exactly, I'm looking to get approved. [What would you say... You do here?.gif]\nBackground: I'm building a script to automate some internal reporting tasks currently done manually. To do that, the script needs an API key. To approve use of the key requires this security review, to be sure the script is communicating and storing all its data securely. This final presentation,\n83 days\nafter the initial application, should be a rubber stamp. All the items in the application have been documented, action items responded to, amended, and given the go-ahead. The last change was over a month ago.\nSo, what am I here to get approval for? I need the committee's approval on my plan, because the security group who controls access to the API requires it to grant me API access, so I can build the script. The application lays out my plan to secure the data the script reports on. (Sidebar: To get the script plan approved also requires a complete review of the entire infrastructure plan of the server instance the script was going to run on. No joke.)  What am I here for? Ultimately, so the guy that grants the keys can check the box next to my request. What's the key for? Script needs it. Script needs documentation, approval. Documentation done, I'm asking for approval.\nI just want to write some code.\nYou tell me to get approval, fine. Tell me who to ask, and what assurances they need. Fine. Ask your questions, and I'll answer them. FINE. Just let me finish writing my code.\nThen, after three hours of listening to you drone on about details that are completely irrelevant to the other applicants' presentations - including questioning their business case for even building the proposed service in the first place - and you squeeze me in the last five minutes - and then interrupt me and talk over me and talk down to me (Sound familiar, ladies? Totally get it.) all because\nyou\nclearly haven't done the homework?\nI snapped.\nI said things that were inappropriate, rude, immature, insulting, potentially actionable, shouting and cursing and I don't even know what else. [I'm out of order? You're out of order! The whole trial is out of order!.gif]\nBut I've been out the door on this job for weeks. I've had my resignation letter written for a month. All I was waiting for was an offer from one of the dozens of job applications I've sent out. I fully planned to finish this project, put in my two weeks, quietly send out some goodbye emails, and fade away. [Homer disappears into the bushes.gif]\nBut nah.\nSo I clicked \"leave meeting\", queued up a bunch of emails, then went to pick up my kids from school. I was running a few minutes late.\nCareer-limiting maneuver? Absolutely. Selfish, short-sighted, impulsive. I'm better than that. I'm disappointed in myself and embarrassed. I didn't sleep last night, and ever since the call, I can't stop shaking. My heart is still beating so fast it's like some long, drawn out panic attack. I feel sick to my stomach and I can't sit still. My wife's not talking to me yet.\nBest thing I've ever done for myself.\nTL;DR: I've been ready to quietly quit my job for weeks, but a three hour Zoom call pushed me over the edge.', a user said: 'To me it sounds like your only fuck up was to not take your unhappiness more seriously sooner.\nAs much as it was unprofessional, at least you’re away from an environment that wasn’t right for you. Probably saved yourself some issues much later down the line by acting now than keep pushing on.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'Yeah that was embarrassing. What a waste of OP’s time, energy and expertise. That’s someone who strikes me as the kind who “just wants it to work” and doesn’t want to give any input or effort.\nImo he should be the one writing “TIFU by avoiding communicating with my colleague for 3 months and caused them to rage quit. Now our project is behind and it’s my fault”.'",
        "In response to 'Nah, he'll be like \"I gotta hire someone to fix everything the last guy screwed up!\"', a user said: 'Yeah you’re right! What’re the chance they cheap out and don’t invest in someone with experience? So they end up taking twice as long to get up to speed and drag everything out for another 3 months.'",
        "In response to 'What’re the chance they cheap out and don’t invest in someone with experience?\nWell it's IT, so.... 100%', a user said: 'Kinda my point. I’ve also had the experience of them taking work to local universities and having groups of computer science students do the work as a “project”.'",
        "In response to 'Hey, they're getting paid in experience!  It's a good resume builder! /s', a user said: 'Hang on I’ve got a few more buzzwords to throw in there:\nInvaluable, volunteer, networking, real world experience, rare opportunity, chance to apply to work for them....\nThere’s more but I gave myself a migraine remembering those times.'",
        "In response to 'To be honest, that kind of review meeting should have specific slots for relevant people to dial in, precisely to avoid having someone sit through all the stuff that isn't relevant to them. That way of OP has a slot of 12:45 and the meeting was running late then they only wasted 10 min of irrelevant chatter.', a user said: 'Absolutely. It makes such a difference to me when these things are well organised or moderated. This situation OP was in just sounds infuriating.'",
        "In response to 'That's the most confusing thing though... He didn't read any of the last 3 months of reports, proposals, etc.  But\nnow\nhe had something to chime in about?\nNow\nhe had his concerns?  If he was going to remain willfully ignorant all this time, he maybe should have just kept his mouth shut and let the damn approval go through?\nI'm angry for op's sake at this point.', a user said: 'I wouldn’t be surprised if it was a “everyone else is talking, I need to say something to sound like I’m worth my salary moment”. I’ve had plenty of managers chime in to say the same thing someone else said in a different way or ask if I’ve done something just so they could say they’ve “managed”.\nI think for some people silence can make them feel like they’re on show whilst others try to hide behind it.\nThis is total guesswork about a situation I know a fraction of a fraction about so.... grain of salt and all that.'",
        "In response to 'I have been working on it for a long time. Months. Been unhappy a long time, and taking steps to eliminate my anxiety and find outlets. This job finally got to the point it was clearly affecting my mental and even physical health. When I brought that up to my manager, he shrugged it off and told me to relax. I don't feel bad at all if I happen to have thrown him under the bus in my final messages to management.', a user said: 'Honestly I’m not saying you were living in ignorance until this breaking point. But the fact there was a breaking point to this degree shows you misjudged your coping abilities and limits. Which pretty much has to happen a few times to everyone before we can learn what those limits are.\nI hope your partner talks to you soon because I’m sure they’d rather have you happy in a job than miserable in this one.'",
        "In response to 'Well this comment is thought provoking.  I’ve been very unhappy in my job for a while.  I don’t want to go out in flames though, and suspect that might be coming.  I will do some deep thinking about what my coping abilities and limits are - so thanks for that.', a user said: 'Wow I’m really touched you took both the time to read my comment but also reflect and reply to me about it. I’m really glad you got something out of it.\nI sincerely hope the time to think and plan helps avoid burnout or meltdown. It takes different types of strength to make changes before things get bad vs build yourself out of a disaster. Both are difficult in their own ways but I know for sure now, after going through meltdowns, that given the chance I’d rather tackle the insecurities of “what ifs” than wait for my body and brain to yeet me out of a situation and reduce my choices and control over it.'",
        "In response to '...this is amazing advice that I'm going to let sink in, damn', a user said: 'I’m so glad it speaks to you! If there’s any disclaimer I want to tack on to it it’s to not be hard on yourself if you still misjudge things. Knowing you should put yourself first and practising it are two very different things. Hermione could barely fly a broom despite knowing basically everything there was to know on paper about it. Some things need practise as well as knowledge and managing a body and mind requires\na lot\nof trial and error.'",
        "In response to 'About that last sentence.  Be absolutely sure that is the case.  My ex told me to my face one night that she would rather have me in my literal suicide-causing job than to have me to back to school while she worked.', a user said: 'Damn that’s absolutely stone cold. I’m so sorry someone you cared about treated you like that. I can’t imagine trying to force my partner to do anything especially if it was harmful for them.'",
        "In response to 'We need to redefine \"professional\" and \"unprofessional\". For some reason, \"professional\" has come to mean \"act like a soulless robot with no feelings that can take unlimited direct and indirect abuse.\"\nThere's a lot that sucks about the age we live in, but job mobility in IT isn't one of them. Tired of someone's shit? Move on. Only worked there a year? So what. That really doesn't stand out anymore.\n(I know OP didn't mention his tenure, but just throwing that out as a constraint we impose on ourselves to limit our options)', a user said: 'I see that a lot as well. Anything less than “yes sir no sir” is called unprofessional. My rainbow bandana was called unprofessional and the best option they came up with was to ban bandanas and not provide hats or hairnets in a place where I handled food. The system is running to keep certain people looking better not feeling better or working happily.'"
    ]
}