{
    "username": "Megnuggets",
    "contributions": [
        "In response to 'Did this for Walmart all the time. Started out as a cashier.  Started doing \"Backup CSM\", basically still a cashier, just doing a Customer Service Manager's job.  Became a CSM finally after 6 months by busting my ass off.  At one point I was 1 of 2 CSMs on the front end when there should have been 6 to 8.  Busted my ass for years because turnover is high, then applied for a higher management position.  Got passed over for an 18yo kid who was there for the store remodel.  His first job ever.  Found out his Mommy and Daddy worked at the Home Office.  Same kid got to move up to Assistant Manager training within 2 years.  We would have these yearly surveys and one of the questions basically asked if moving up in the company was based on work ethic or by who you know, every time after that I'd answer \"by who you know\".   This was at Store #1 near the Home Office itself.\ntldr; \nWalmart does this shit, Fuck Walmart!', a user said: 'I live in rogers/bentonville  and you are absolutely correct about the way that walmart does their employees. Management is paid decent but employees are left unable to afford their bills.  Living in the area makes it hard to avoid them but anytime I'm out of the area I actively avoid walmarts at all cost.'",
        "In response to 'I was at their home office working in IT for 5 years and they treat everyone like shit. Gaslighting, bullying, favoritism are all commonplace and if they like you they'll big you up but as soon as they get bored with you or you make one slight mistake they'll be done with you and trying everything to get rid.\nThey will literally create teams to interfere in a project because the wrong people get the credit and they will fuck everything up, ruin relationships and be promoted in 6 months while you're in trouble for cleaning up the mess they created.\nI ended up in therapy and was told to quiet quit then. Therapists and Doctors in the Bentonville area will tell you they have an influx of burnt out home office employees', a user said: 'I have been seeing it in several industries in the area lately.  The stress of the people here has been so high lately. I've known so many people get burnt out through Walmart, Tyson, and jb hunt. But with the rent increases in the area people have to work. Things are definitely becoming less affordable and walmart has such a monopoly out here. I can think of 6 walmarts in a 10 minute distance from my house. It's always so strange going to other areas for work and actually having options besides greedy walmart.'"
    ]
}