{
    "username": "mellomee",
    "contributions": [
        "In response to 'My understanding is “quiet quitting” isn’t quitting at all unless you’re not meeting expectations. It’s just a hostile term for not grinding yourself to scraps for some company until there’s nothing left for you. I say screw that.\nMy last job I gave 100% consistently, IMO above and beyond expectations. And don’t get me wrong, I was rewarded for it, both in accolades and financially, but I also completely burned out and became entirely demotivated after a few years.\nMy current job my average output is more like 50% to maybe 65% consistently. I don’t overly stress, it’s generally cushy, and I can and do scale up my effort when it’s explicitly needed. I still receive accolades and commensurate pay (and bonuses), and I’m recovering from burnout now and am in a better place.\nSome might call not putting in maximal effort “quiet quitting” but I just don’t see it that way. I’m productive enough to perform well, my work is recognized, and I’m maintaining my sanity and well being. That’s just better all around.', a user said: 'I personally wouldn't call this quiet quitting. It sounds like balanced work. You'll be more productive in the end bc burnout leads to diminishing returns eventually. The fact that you scale up when needed shows that you adjust based on business need. This is how I would coach my employees to operate. As long as work is getting done and they will be there for me when I need them, then I can offer them the same flexibility in kind. It sounds like you're the type where your 65% is prob others 90%. Some are more skilled than others. I one day hope to be like this lol.'",
        "In response to 'I think it’s basically like getting satisfactory or adequate on your report card instead of excellent or above average. Quiet quitting is not new most people do that as the norm. It’s only a new concept to people with a personality type of pleasing or over achieving. I used to go above and beyond but I’m also quiet and introverted so I don’t stand out. My colleagues that would join the conversation and group outings would get promoted. Not to say that some weren’t deserving but others I knew I was more competent than but it came down to who you knew for the promotions. I began to quiet quit until I found my dream job. More pay and less work and they value my quiet introverted self. Best of all I work mostly from home with the occasional office trip. I don’t even try that hard and get excellent reviews from my manager so quiet quitting isn’t necessary here but I still do bare minimum so they don’t start to give me more work. My boss likes that I don’t bug him and figure things out on my own. Apparently I do more than the last person before me that they make my half ass work look amazing.', a user said: 'This feels really accurate- S, not S+.'"
    ]
}