{
    "username": "melodyknows",
    "contributions": [
        "In response to 'Original Post: Quiet quitting is happening at my school You all have heard it around the world. Quiet quitting or \"simply doing your job and nothing else\" is going around. Anyway the Fall Fling dance rolls around and teachers are \"required\" to chaperone. Basically we are given a google form to sign up for a shift to chaperone the dance. No this isnt paid, yes its on a Friday night after a long work day and week, and no food is not provided to teachers. Total suckfest all around. Well get this, the day before the dance we get a frantic email from Admin. No one signed up to chaperone. NOT A SINGLE teacher signed up to chaperone. We get some messages about how this is mandatory, teachers must be there for the event, we can choose which shift we work but must be there. No one signs up. Cue Admin start walking door to door with a sheet asking people to sign up. Get this, the teachers stand their ground and say no. Of course a few caved, 1 or 2, but overwhelmingly the teachers say no.\n​\nGuess what happened, well they had the dance, the admin chaperoned, the few people that signed up, basically a skeleton crew. The next week nothing, no messages, no angry faculty meeting, nothing. They know that they cant do anything to the teachers because its not one or two, its everyone. Listen I understand that kids need fun stuff to do, but maybe don't make teachers do it, or if they have to be there pay them??', a user said: 'I think I'm quitting quitting. This Friday. At my goal setting/ post-observation meeting. I'm done. I'm pregnant, and just going to finish the semester and live my best life until I deliver in May.\nThe job I have isn't the job I was hired to. They pulled a bait and switch (added two preps to my schedule; changed the grade level I was to teach from 7th grade to 6th grade and high school), and I'm so frustrated by it. I was worried about them trying to hold my credential if I left, but now I no longer care. The job is making me miserable.'",
        "In response to 'Original Post: It's NOT \"quiet quitting!!!\" \"Working your contract,\" \"working to rule\" and \"acting your wage\" are all MUCH better terms. Why would you use the word \"quit\" to describe you adhering to your contract and doing your job? It has nothing but negative connotations AND denotation.\nI highly encourage everyone here to lose that term. We're working our contracts. We're not quitting anything. Some may STOP giving away their physical and/or emotional labor, but that's not the same as quitting!\nEdit: For those of you saying \"It's called 'doing our job'\" The implications of teachers \"just doing our job\" are:  volunteering for events, grading/planning at home, taking over other  peoples' responsibilities, adding more to your plate every year, etc...  Admin considers this \"just doing your job.\"', a user said: 'I was just thinking about this! \"Quiet quitting\" makes it sound like we aren't doing our jobs. I'm doing my job\nthat they pay me for\n.\nBut also... today I put in my notice. I gave them two months notice. I don't want to come back after winter break.'",
        "In response to 'What truly terrifies me about this generation is that they are the next workforce and they just... don't want to do anything. Like they are all so anti school and haven't realized that life is work, honey.', a user said: 'The kids in their generation that do want to work are going to have very little competition.'"
    ]
}