{
    "username": "micah9639",
    "contributions": [
        "In response to 'The term \"quiet quitting\" isn't used consistently in the media . . . and teenagers are notorious for taking something out of context anyway . . .\nWhat \"quiet quitting\" (as I understand it) doesn't mean to do the minimum at your job, but rather not to overdo things . . . not to give yourself over to your work completely. Don't work overtime, don't stress about deadlines and obstacles you have no control over. Just do your job, within your 40 hours. If you are a teacher, that would mean no longer coming in early, staying late, working at home, spending your own money on the classroom . . .\nFor a student to \"quiet quit\" . . . if they were serious about it, it might mean not doing homework, or not pushing for that \"A\", just showing up and doing what you can during the school day.\nNot doing any work at all isn't quiet quitting, it's just quitting. And there's a lot more of that going around these days then there used to be . . . .', a user said: 'That isn’t quiet quitting that is doing the work you are paid for. As a teacher I bring 100% during the school day but the moment my contract time of 4 pm hits I’m done and will not bring work home. Please don’t normalize unpaid overtime for teachers'",
        "In response to 'Oh please.\nWorking beyond your contract IS normal in teaching. It shouldn't be, but denying reality is kinda foolish.\nI don't like the term \"quiet quitting\", but that's what it means. I prefer the term \"working to contract\". Same thing, but a better connotation.', a user said: 'I haven’t worked beyond my contract for 5 years. School has a problem with that I just calmly point out my contract work hours and explain that I would be more than happy to do the extra work during my contract time so it sounds like I need more pay or more planning periods. Conforming to what is considered “normal” is exactly the reason why schools know they can get away with the garbage conditions in schools. Working your paid time only is not quiet quitting and shouldn’t be seen as such or you’ll quickly find schools using that as another weapon to get teachers to do more for less. This is the “do it for the children” argument all over again'"
    ]
}