{
    "username": "MidLife_Crisis_Actor",
    "contributions": [
        "In response to 'Yeah teachers do an ungodly amount of stuff \"off the clock\". Source: parents were both teachers.', a user said: 'And parents and school districts take advantage of the fact that they know a teacher isn't going to let a kid suffer because the school or their parents suck.'",
        "In response to 'Well done.\nPicking up donuts for work is a fine request, but it's not 'before work.' Working starts when you do the thing for the job.', a user said: 'It would be fine if the request means I'll be a bit late to work without penalty.  If it wasn't that out of the way and you didn't have to get up any earlier to do it AND MOST IMPORTANTLY, the employer treated you fairly with respect...  then do it.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'Give them what they say they value.  They value clocked time.  Intensity and quality of work don't matter to them.  (By their own words and actions.). Stop giving it to them.  Burn 8 hours a day and go home.'",
        "In response to 'It’s a snappy slogan used to shame people who have self worth. Boomers NEED snappy slogans to function. It’s used to describe people who know when they leave work for the day, that’s it, work stays there. I don’t bring my filthy boots in the house like I don’t bring work past the main entrance', a user said: 'Boomers are responsible for nearly all of society's ills.  They were all about free love and drugs but when it was time for THEM to settle down they became Reagan Democrats and part of the Moral Majority and started the War on Drugs.  Many of them became Yuppies and feasted on fast and loose stock transactions, until the housing bubble burst.  In their retirement years, they've become a hardened voting bloc that elects establishment politicians just as old and antiquated as they are.  They are locusts that destroy everything in their path as they mindlessly consume it.'",
        "In response to 'I do the bare minimum.  I’ve honestly expected to be fired for years now and it never happens.  Likely because it would take a year to get someone else up and running in this position', a user said: 'Most people don't understand the game we're all playing here.  Employers are paying the minimum amount to keep us from quitting and Workers should be supplying the minimum amount of work to keep from getting fired.  This is especially true of salaried workers.  Working \"overtime\" when on salary is simply working for free.'",
        "In response to 'Original Post: How is performing your job duties “quiet quitting?” Are you penalized for your efficiency & preventing burnout? [External Link]: https://i.redd.it/02qwb6ziqvi91.jpg', a user said: 'Remember who pays to have the articles written...'"
    ]
}