{
    "username": "milksteakofcourse",
    "contributions": [
        "In response to 'Not very good analysis or conclusion. Considering labor is a huge portion of expenses, that businesses are run by people and the current labor shortage, it amazes me that business leaders still have no idea how to\neffectively\nmanage their workforces.\nWorkers started to realize that many companies have awful work cultures, and that many jobs have a lack of benefits, advancement and job security. And then add a lot of inflation and financial anxiety. If the quality of worklife decreases, so will effort (because people intuitively understand diminishing returns of effort vs progress), and that effort then is applied elsewhere in travelling, moving, going to the gym, working on a new hobby, or getting a new job or degree.\nPeople who write articles like this have no idea how much the world has changed. When they say things like \"it’s up for debate whether the phenomenon is condemnable slacking\" it reveals the reason why people quiet quit - managers/higher ups who think like this constantly nagging employees under the assumption of bad faith laziness when they may just need extra time to process everything, like stress from rising rents, health, etc. Workplace culture is super important.\nThe way to alleviate quiet quitting is to provide workers better pay, a better culture, and the hope for advancement.', a user said: 'In the timeless words of ray liota “fuck you pay me”'",
        "In response to 'That many companies conducted exit interviews with employees leaving during that time was a good idea, Grant said, but “I would much rather see employers conducting entry interviews or stay interviews.”\nThis reminds me of when I took a Human Resources class in college and the course was going on about how apparently more pay isn’t a priority for employees in the workplace. The past few years proved that concept to be bunk.', a user said: 'Wow that class was straight up oligarchical propaganda'",
        "In response to 'Quiet quitting is the language of the oppressor, and it's kind of a dumb phrase too', a user said: 'Act your wage'",
        "In response to 'Original Post: I've been \"quiet quitting \" for a week and have never been more relaxed. I work in a high stress medical setting and have been for 8 years now. I've always been talk to go above and beyond for work. Over the last 4  years I've been increasingly burnt out and my paychecks do not seem to match my effort.\nHowever this past week, after a particularly nasty mental breakdown a few weeks ago, I've been doing the bare job requirements and it's been lovely. I now feel like I have more energy for my life outside of work, and more energy to further myself personally.\nRemember it's only a job, do what you have to and clock out.\n***edit: as many have said it's \"acting my wage\" I was using \"quiet quitting \" ironically', a user said: 'Act your wage playboy'"
    ]
}