{
    "username": "MissDisplaced",
    "contributions": [
        "In response to 'Original Post: Quiet Quitting: What is it Really? Quiet quitting is a confusing term to me, but maybe I just don’t understand it. I have rarely ever given 120% to a job… maybe when I was fresh out of college when I had that mindset. But the years have jaded me. What people call “quiet quitting” (doing the minimum) is what I just call doing my job lol. It’s not like I refuse when they ask me to do more work (tho rarely do they ask), but I don’t SEEK more work out unless I’m just bored. For example, in my work, we work in Sprints and get assigned stories to do for those sprints. I just do those stories — not more or less — unless I’m just bored and have finished my stories weeks in advance, then I may grab a story for the next Sprint. I get paid by the hour so no work means no pay. But it’s not like I can ADD more stories to the current Sprint because someone else still needs to test them and THEY may not have capacity. So, a lot of times I just do things around the house since there always seems to be something to do at home. Have I been quiet quitting for years and just didn’t know it or is doing the minimum not really what quiet quitting is all about?', a user said: 'In my 40+ years of working, I have learned the hard way that going above and beyond, or putting in more than 40 hours is seldom appreciated. You’re expendable to save a few bucks no matter what you do.'",
        "In response to 'This is why I’m honestly glad I’m a contractor and not an employee. I don’t have to worry about “promotions” or “raises”. I just ask for a little bit more every contract renewal. If they say “No”, then no harm, no foul. I get to put away more than double in a 401K as someone self employed vs an employee. I have no loyalties to anyone but to myself because most companies don’t deserve it.', a user said: 'I’ve never chased promotions either. Raises or bonuses are nice, and I do my job well. But it seems the more I’d put in the worse I was treated. I nope outta that now and take my vacations.'",
        "In response to 'I think of \"Quiet Quitting\" as meaning that you have no interest in keeping your job and if you get fired for poor performance, you are OK with that.', a user said: 'No, that’s not what Quiet Quitting means. Quiet Quitting means doing your job to the letter or minimum requirement. You work, but no extra and no overtime without pay (for salaried positions).  You also don’t volunteer or participate in anything. You treat the job for what it is: a paycheck.\nWhich is basically how companies treat us. Disposable.'",
        "In response to 'That just sounds like doing your job, not quite quitting. It means that you have quit your job and you just are not telling them. If they find out, fine.', a user said: 'It might be more a thing in the US where there is intense pressure to work 60-70 hours per week, weekends, not taking vacation time, working while on vacation, etc., even if you are a set salary and so don’t get paid overtime for those extra hours because it’s supposed to show how committed you are. Or work culture things like coming in 15-30 minutes before your shift for team meetings.\nSo Quiet Quitting is sticking to a 40 hour week, working only during your shift, taking your lunch break, and using your vacation time. But EMPLOYERS have deemed this “quitting” or not working hard/being committed to the company.'"
    ]
}