{
    "username": "Mixtrix_of_delicioux",
    "contributions": [
        "In response to 'Original Post: I realized today, I quiet quit grocery shopping! So about a year ago I had a breakdown emotionally. Nothing really changed. I kept my terrible job. Our chores didn’t immediately change.\nBut I stopped cooking as often, so I didn’t have to dishes as often, didn’t have to clean up the kitchen as often. Kids still eat, less healthy than I like, but they love sandwiches and the random crappy frozen food, with a fruit and veg. I cooked less so I shopped somewhat less. Then I shopped less and less. And my husband was offering to grab what we needed more. So I just keep doing less.\nToday I realized I couldn’t remember the last time I did a big grocery haul. And today I found shrimp in my freezer. That my husband bought. That I didn’t ask for. Like oh cool I will plan something for this. \nMy mental health is somewhat better. Wondering what else I can quiet quit.', a user said: 'Oh my god, I've done this unconsciously and your post just made me realize it.'",
        "In response to 'What do you think triggered it for you?\nBefore we had kids and before I was overwhelmed by everything, I think I was super anal so unconsciously got all the chores. Things changed though. They really changed. Lol', a user said: 'My mom died, so I stopped functioning entirely. My husband never noticed the work of cooking, despite being a person who really does his share of home and parenting responsibilities. And he LOVES Costco, so it seems to've worked out well. We get a surprise bag of veggies once a week and we pick up odds and ends as needed.'",
        "In response to 'I’m so sorry about your mom. I don’t want to even imagine. I called mine twice today already. I really hope that your ok and doing better now.', a user said: 'Thanks for your kindness! It's at the days are mostly good, with the occasional wet fish slap of grief. She had the best death we could give her. I miss her a lot.'"
    ]
}