{
    "username": "moderngamer327",
    "contributions": [
        "In response to 'The only people who can afford to have kids are people working 60 hours a week, like imagine working 10 hours a day 6 days straight and still being expected to raise a fucking child due to some bullshit demographic collapse\nHyperbole aside,  if governments want to address this they have to tackle the workaholism that capitalism encourages.', a user said: 'Except poorer people have more kids. It’s not an issue of affordability. Especially when you compare how little people had historically.\nWork hours have been declining over time'",
        "In response to 'That's no longer true. In developed countries, for the past few decades, a U-shaped curve can be observed. The richest few percent have the highest fertility rate, while middle-class women/couples tend to have the fewest kids, until the lowest income percentiles finally exhibit slightly higher fertility rates.\nHere's an exemplary graph for the United States.\nAlso, across countries, you see that at some development level, fertility rates are no longer falling and might even rise again for countries with HDI>0.9 compared to countries with 0.85<HDI<0.9.', a user said: 'It is true that the highest incomes do have a higher fertility rate it is the\nreally\nhigh incomes, like the 0.1% not the 5% or 1%. In fact if you take the 1% income brackets fertility rate it is the lowest in the US despite the highest incomes having a higher rate. This is because of just how few it actually is'",
        "In response to 'According to the graph I linked, families with an income of more than $300k have a similar fertility rate compared to families with an income below $20k. That corresponds to the top 5% vs the bottom 10%. Families with incomes above $500k (top 2%) even have significantly more children than poor families. [\nref\n]', a user said: 'Ah I see my mistake I was comparing it to individual income brackets instead of family brackets'",
        "In response to 'I mean is it a huge surprise that people don't want to live in huts in order to breed more? That's hyperbole but you get the point I'm making. If people are given a comparably much easier life without children then they'll often choose not to have them.', a user said: 'I think that is what the real answer is. Kids are not required anymore and people simply don’t want them'",
        "In response to 'You didn't mention, they've used mass media to slowly convince people that violence is never the solution, producing entire societies of ambulatory doormats who will suffer any indignity lying down.', a user said: 'Violence can be answer but it should be a last resort. Things like revolutions can improve people’s lives but at great cost and they don’t always work as planned'",
        "In response to 'People are quiet quitting because the social contract fucking sucks. You work more, and you get less. Fewer people can afford a house, the earth is going to shit because corporations would rather see profits than a liveable atmosphere, capitalism is doing wealth redistribution, robbing from the poor and middle classes and giving to the rich.\nThe only reason most people work is to avoid homelessness. There's no incentive, no motivation when your life is 100% stick and no carrot.\nAnd the politicians and business owners see this, and they don't care, they don't make any effort to understand what people want, and the only solution they see is making life WORSE. Because if you beat your workers harder they will work harder, right?\nThe reality is that most people are deeply apathetic and with good reason. Why should we work 40, 50, 60 hours a week just so that billionaires can have even more billions? They aren't even doing anything with that money. They just fucking hide it in offshore tax-free accounts, or make dick-shaped rockets so they can go into space for 20 seconds while on earth people are starving to death.', a user said: 'In Japan housing prices are actually going down unlike most of the developed world. The earth is going to crap because of industrialization not because of corporations. From a historical perspective there has never been so few people living in absolute poverty\nI mean hasn’t that always been the case? In the entire history of humanity it’s been work or starve\nLife has been getting better by most metrics\nBecause you get more money'"
    ]
}