{
    "username": "ModusOperandiAlpha",
    "contributions": [
        "In response to 'Yep. I’ve passed through this phase and am in the active extrication phase. I became all talked out about a year ago. I’ve already passed through the grieving stage. The angry stage. The bargaining stage. My husband was shocked when I told him I was filing for divorce. Like my dude you didn’t realize everything we talked about over and over actually WAS important? 🤯', a user said: 'I could’ve written this myself.\nRegarding your question at the end: In my instance, I’ve come to the conclusion that he really didn’t deem it important before I filed for divorce, because all that non-resolution of behaviors and events that were intolerable to me wasn’t actively negatively impacting\nhim\n(only me and our kid), and therefore wasn’t important\nto him\n. The fact that these things were important\nto me\nwas obviously not motivating enough for him.  Once I upset the apple cart by filing for divorce,\nthen\nthese things became a problem\nfor him\nbecause they suddenly directly negatively affected him, and he urgently wanted to work on these issues in therapy (which he previously refused to do). But by then it was obvious that he wasn’t suddenly amenable because he wanted me to be/become happy in the relationship, but rather because he was suddenly desperate to say anything to manipulate me to stay so I could continue to serve his purposes (no matter how benign those purposes might be, they were in service to him, not to me or even to us both).\nAs long as he was getting his needs met (in my instance, someone to bring home the bacon financially, carry all the household mental load, act as his emotional disregulation manager, and mitigate fallout from his high-friction style of social interaction) he didn’t care that I was miserable, and he only pretended to care after I resigned from my service-provider role by filing for divorce.\nI’m just sorry it took me so long to see it, accept the reality of it, and act on it.'"
    ]
}