{
    "username": "moeburn",
    "contributions": [
        "In response to 'CEOs are worried about employees setting boundaries.\nFixed', a user said: 'Work-to-rule is a job action in which employees do no more than the minimum required by the rules of their contract, and precisely follow all safety or other regulations, which may cause a slowdown or decrease in productivity, because the employer did not hire enough employees or pay the appropriate salary and as such does not have the requirements needed to run at the level they desire.[1][2] Such an action is considered less disruptive than a strike or lockout, and obeying the rules is less susceptible to disciplinary action. Notable examples have included nurses refusing to answer telephones, teachers refusing to work for free at night and during weekends and holidays, and police officers refusing to issue citations. Refusal to work overtime, travel on duty, or sign up to other tasks requiring employee assent are other manifestations of using work-to-rule as industrial action.\nHas nobody really heard of this before?  Used to happen all the time to TDSB schools in the 00's.'",
        "In response to 'Repeat after me, Quiet Quitting is not a thing.\nNow write it 100 times on the blackboard.\nProper headline “CEOs are worried they will no longer get away with underpaying and under hiring employees.”', a user said: 'Repeat after me, Quiet Quitting is not a thing.\nIt's definitely a thing, it's a new name for an old labour action,\nwork-to-rule.\nI remember when teachers used to announce they were going on Work to Rule.  They'd send home forms to parents basically saying all school field trips are cancelled, any pencils or papers teachers used to provide will no longer be provided, stuff like that.'",
        "In response to 'The quiet quitting thing is anti union propaganda.', a user said: 'I don't really understand how throwing up a bunch of articles everywhere encouraging people to engage in a work-to-rule job action with a fun new rebrand of the name is\nanti\nunion propaganda.  Work to rule is a good thing.  If tiktok teenagers want to put a new name on it that's fine with me.\nThis is like the people who say \"unskilled labour\" is anti-worker propaganda when it's union advocates who came up with the term in the first place, as a way to recognize people who need unions and labour regulations the most.'",
        "In response to 'Original Post: Analysis Shows 'Quiet Fleecing' of US Workers—Not 'Quiet Quitting'—Is the Real Problem | \"Workers are more productive than ever, but their pay hasn't kept pace while top 1% wages have skyrocketed,\" says the Economic Policy Institute. [External Link]: https://www.commondreams.org/news/2022/09/09/analysis-shows-quiet-fleecing-us-workers-not-quiet-quitting-real-problem', a user said: 'Quiet quitting isn't a problem, it's a rebrand of an old job action - work to rule.'",
        "In response to 'Not really, work-to-rule has a long history as a protest, whereas \"quiet quitting\" refers even to people who are doing fully adequate and expected work.\nWork-to-rule is an organized, wide-spread action in a workplace.\n\"Quiet quitting\" is basically the one guy at the office who asks \"leaving early?\" when you leave at 5PM or expects you to respond to emails at any time, but elevated to having an opinion article.', a user said: 'Work to rule is doing fully adequate and expected work, and no more.\n\"Quiet quitting\" to me sounds like a call to this kind of labour action, but nationally, instead of limited to one union/workplace.\nDon't blame the opinion articles writing about it for teenage tiktok leftists coming up with a bad name for a good cause, that's kinda their whole thing.'",
        "In response to 'Original Post: /u/x_v_b explains how the sudden ubiquity of the buzz-phrase \"quiet quitting\" is really just a PR exercise to discourage workers from standing up against wage theft by employers [External Link]: https://www.reddit.com/r/OutOfTheLoop/comments/x0feqg/whats_up_with_all_these_articles_about_quiet/im91pkm/?context=3', a user said: 'Employees do not want to allow this anymore and those companies are upset about it, so they made up a catchy PR phrase \"quiet quitting\" and are trying to frame open refusal of wage theft as a bad thing.\nThat's not hyperbole, that's a literal explanation of what this is.\nIt is a dumb title, mostly because we already had a title for this kind of job action, it's called\nwork-to-rule.\nBut to say that it's a PR campaign on the side of the\ncorporations?\nThat's one heck of a stretch.  That's like saying Republicans came up with \"Defund the police\" to make police reformists look bad.'",
        "In response to 'Original Post: “Quiet Quitting”, not quite quitting, but forcing employers to adapt. [External Link]: https://www.cbc.ca/news/business/quiet-quitting-worker-disengagement-1.6560226', a user said: 'Viral social media phenomenon telling people not to work as hard?\nhttps://en.wikipedia.org/wiki/Tang_ping'"
    ]
}