{
    "username": "Momentirely",
    "contributions": [
        "In response to '[Deleted or Empty Comment]', a user said: 'The rich work more insidiously than that, but you're right. Not to disagree with anything you said, but to elaborate: That's the logical next step for them, but it will be preceded by years of the 1% lobbying and creating court cases in an attempt to get cases in front of the SC to get decisions that limit the power and scope of what unions can do. They'll also try to limit workers' ability to create unions in the first place, just like how they're currently trying to limit the right to protest. Hell, if they could do what they want to, they'd just outlaw unions altogether, but that would be too drastic of a change to go over smoothly with the public. But they will 100% make it essentially illegal to be in a union, or they'll make a union's powers so weak that it will be useless to even start one.\nThe most nightmarish scenario I can think of would have them starting the unions themselves, claiming that they've been defeated and that we've got what we wanted, then continuing to screw us over using the sham unions as a tool for that purpose.\nBut I think it's more likely they'll ask the gov't to step in and tightly regulate unions (\"to protect the workers\" they'll say) and that will make it such a bureaucratic nightmare to start a union that it will be almost impossible to do so. They don't have to take a full-on 1984 totalitarian approach, as they've learned many times. All it takes is to make something difficult or unappealing and people will tend to not do it. And if they lobby for the right laws, then the Property Protectors will do exactly what they're meant to do: act as the personal militia of the country's richest inhabitants.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'No one will do something until everybody is on board, but nobody will be on board until somebody does something. We're all afraid to fight for a better life because there's a chance we'd lose what little comfort we currently have -- which is not so little, actually. I think a lot of Americans start to remember just how good we have it here when there's a chance of losing it all. But by not fighting, we're gonna lose it all eventually anyway. We're in a slow downward spiral and too paralyzed to do anything about it. And that includes me; I have a family to look out for, too, so I want to believe this can still be turned around by wielding political influence. The politicians rule for the benefit of the people, because we let them. I believe we need to start demanding much more of our politicians. We should already\nexpect\nmore of them, but we need to up the bar and make sure they truly represent our interests, and the only way to do that is to get money the fuck out of politics.'"
    ]
}