{
    "username": "Momo--Sama",
    "contributions": [
        "In response to 'Were Jim’s sales not consistently high? Also, aside from Kelly sabotage, his customers loved him and gave him great reviews. I don’t think he’s the example of quiet quitting.', a user said: 'Yeah, I think people are conflating not being emotionally invested in your work and not trying.'",
        "In response to 'Mad as in you didn't like the ending or you were liking it and it's over? I just started reading krakoa era. It's gonna be awhile until I catch up.', a user said: 'I think this “back to basics” moment is more difficult to swallow because the X-Men are fundamentally different than any other super hero team. The Avengers, Fantastic Four, etc are people who choose to abandon their normal lives to selflessly fight for others. The X-Men are not. They fight to survive and protect themselves as much if not more than to save others. Krakoa didn’t merely represent expansion. It represented newfound prosperity, security, it was a victory, maybe not the victory Xavier imagined, but a victory for all mutantkind nonetheless.\nThis coming reset isn’t like reducing the Avengers back to the MCU roster, it’s the loss of almost everything the X-Men ever fought for.'",
        "In response to 'I mean, I feel like that's just normal ups and downs.\nWhenever any hero has an arc where they're on top of the world, it's right before they're about to be struck down to their lowest point.\nIt's not even the first time this has happened to the X-Men. They've created like three other utopias where mutants could run away and be free of the flatscans in the last three decades I'm pretty sure.', a user said: 'You can say “well logically you can’t have a story where the characters are perpetually late 20 early 30 something for 50 years and not have these cyclical ups and downs happen” and you’re right, I’m the fool for feeling upset when the reversion to the mean happens, but I still\nfeel\nit. I still dread watching these characters I care about fight for basic needs again after coming so far. But you are right.'"
    ]
}