{
    "username": "mongoloided_mango",
    "contributions": [
        "In response to 'Can you imagine posting this on a social network dedicated to work and still have your job and be considered normal/decent\nCapitalism is wild', a user said: 'He'd get a promotion'",
        "In response to 'Original Post: Absolutely unhinged response to a post supporting employees that do \"quiet quitting\" [External Link]: https://i.redd.it/934fs89cs1o91.png', a user said: 'its the truth though. also, more woman in the workspace equals higher supply which drives wages down as its more competitive.  Corporations love it, more cheaper, more better.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'No, if productivity has increased 3, 5, 10 times as much as pay, thats a not increase in wages due to increased efficiencies as wages would have increased by the same margin. so again, increase in efficiencies does not translate to increase in wages.\n​\na mother, housewife, or whatever titles you want to give to the person is not a job.  There are no news reports of major lay-offs to mothers and housewives due to the economic downturn lol.  last reccesion, there were no reports on housewives lost jobs.  the reason being......\nyou guessed it, its not a job lol.\nlabor that needs to get *done* is a task, it is not a job in the sense of being employed in a JOB. boy you dense.  also, send me a link to the last news report on major lay-offs to housewaife and mothers on their jobs, thanks.'",
        "In response to 'No, if productivity has increased 3, 5, 10 times as much as pay, thats a not increase in wages due to increased efficiencies as wages would have increased by the same margin. so again, increase in efficiencies does not translate to increase in wages.\nThat's cute, but it's the opposite of what your actual article says.\na mother, housewife, or whatever titles you want to give to the person is not a job. There are no news reports of major lay-offs to mothers and housewives due to the economic downturn lol. last reccesion, there were no reports on housewives lost jobs. the reason being......\nIs \"Peasant Farmer\" a job? Because \"Housewife\" is like \"Peasant farmer\" in that it is not a part of the formal economy but it is productive labor.\nlabor that needs to get\ndone\nis a task, it is not a job in the sense of being employed in a JOB. boy you dense. also, send me a link to the last news report on major lay-offs to housewaife and mothers on their jobs, thanks.\nWhether you call it a \"task\" or a \"job\", the formalization of it provides the demand that draws the new \"supply\" of labor to the formal economy, which was the point.', a user said: 'No, cost of living adjustments, aka COLA is a thing and contributes to gradual increases in wages.  increased in efficienies does not translate to increase in wages, especially across the board.\nSo is washing my car, or cutting my grass,  it is productive labor, yet agian is not a job. it is a TASK.  a peasant farmer isnt doing a job, unless he is selling his produce. and if he is, he best report anything greater than $600, Biden hiring revenue agents for that $$$'",
        "In response to 'Paging\n/r/badeconomics\n.\nLabor is conserved here.   A woman whom was previously a house wife can now take her kids to school, do the house work and cooking quicker using modern implements and still commit to a full work day.  Nobody is working less, they just do more using the same hours.\nUsing the argument that increasing the labor pool while demand is held constant as an argument against women employment is ignorant.\nThis assumes the markets for employees across the field stayed constant in size.  We know from elementary economics, increase in the labor pool results in long term economic growth.  Industries often hire new labor cheaper and result in industry growth.  Increased number of employees result in bigger consumer spending and bigger demand from services, which result in even more economic growth.\nWhile there are many economic indicators that show that economic growth does not necessarily imply an increase in wages, there are even more indicators that economic stagnation or decline would result in wages decline and unemployment.  The growth of a formal labor pool is generally good for the economy at large and for those of whom participate in it.\nCorporations didn't love hiring women for much of the 19th and 20th century.  Many of those whom interview candidates today still feel uncomfortable working with women.  Most managers still cringe at the thought of FMLA or providing a spot for breast feeding at work.  I don't really see how 'corporations love it', honestly.', a user said: 'you expect me to read all this, jesus christ people.'",
        "In response to 'It's not, and you're an idiot.', a user said: 'its 100% true, and peter jones deserves a promotion for posting that.'"
    ]
}