{
    "username": "Moretalent",
    "contributions": [
        "In response to 'I think there’s even a way to answer that question without even really brutally breaking from Biden, necessarily, or at least it’s an implied break- something like “knowing what we know now, I’d try a few things differently to accomplish our shared vision on (housing/minimum wage/whatever policy you pick), because I won’t quit until the American people have better (housing/infrastructure/whatever policy outcomes). Joe and I shared that vision, and I want to accomplish that in my presidency..”\nI’d stick with the vague “visions” description, like you both want to see more affordable housing/lower inflation/whatever, but not saying specifically how you’d do it differently in that instant.', a user said: 'and i mean she was on the view. it wasn't a hostile or even a journalistic audience.  there's a reason her primary campaign fell apart. read the obit all her staffers said she was indecisive and slow to make any decisions. she had no vision. no original ideas or inherent will to fight for any ideas. she represented no core value and stood for nothing she believed in 4 year earlier'",
        "In response to 'Idk what you can call that opening segment other than 25 minutes of pure cope:\nLamenting (again) the capitulation of Zuck and Facebook to Trump (why are we pretending that billionaires and corporations are our friends?)\nFavs pining for Joe Biden to have some sort of event about protecting political institutions while also acknowledging how unpopular of a platform that is right now\nTommy’s pretty absurd ideas that Biden could, or will, stop armaments to Israel or try to pressure Bibi to stop bombing Syria, would lift sanctions on Syria or normalize relations with Cuba and close Gitmo. All of these are antithetical to who Joe Biden is as a person and president\nThese boys need to wake up', a user said: 'i mean zuckerberg did the right thing baning those fake hunter laptop stories prior to the election'"
    ]
}