{
    "username": "MortgageNo8573",
    "contributions": [
        "In response to 'It's like people are their jobs here.', a user said: 'Exactly. You can't just be an accountant. Or a nurse, or a manager or whatever. Your career is essentially a part of your entire personality. You always have to BE ON and available.\nI've never been part of that mentality. I punch in, do my 40 hours that week, and punch out. I take all my time off, when I'm sick, I'm sick.\nAfter working for 2 1/2 years in a hospital through Covid, I learned a very important lesson: Your employer could care less if you drop dead. Your job will be posted before your corpse is cold in the ground. So come in, do your job, and go home.'",
        "In response to 'Original Post: Why is quiet quitting even a thing in America? I mean, in Western Europe you're supposed to forget about work once you've spent your 8 hours (hour and a half for lunch and breaks included) at the service of the company.\nI can't understand why is quiet quitting even a thing... How could it be \"quitting\" to do just your regular job and refuse to do overtime or completing tasks outside of your job description? Isn't that what you were hired for? Why should you do unpaid extra work?\nThis mindset of \"you must sacrifice yourself for the company and you must be happy about it\" is downright exploitative and undermines any kind of work—life balance.\nIn countries like France, even contacting an employee during their vacation period may get the company into legal trouble, that's the standard in the developed world outside America.', a user said: 'Because in America, corporations believe they own all of their workers time. It's pretty much the norm to leave work after 12 hours and STILL be available for work calls, emails and a few hours on the weekends. It's the norm to work a service job and have to be available for shifts at all hours, 7 days a week. Employees are made to feel guilty, lazy, unproductive, and unprofessional for taking vacations and time off. Anything more than a week of vacation is seen as a MASSIVE inconvenience for the company. There is also a big push to make everyone feel like \"we are a family here.\" I'm sorry but my family is at HOME not at work. Co-workers and bosses are not family. It's just another way to manipulate people into overworking themselves.'",
        "In response to 'Original Post: Had a fight with my parents over this “quiet quitting” trend. Somehow refusing to answer emails/phones outside of work hours is a trend and my parents think it’s just us being lazy. I can’t seem to make them see the reality. When they were young and working you could leave work behind by walking out of a building, not so anymore.\narticle', a user said: 'Sooo what's the argument? That our parents were able to maintain a work/life balance but we are not allowed to? When my job is done, so am I. If your boss wants you to answer phones/emails/work after hours, then you should expect to get paid for it. If not, you are not obligated to do so. I don't work for free, and neither should anyone else.'",
        "In response to 'Original Post: Quiet Quitting going around the store. We are done running around like slaves on cocaine (that we paid for). It's spreading. Bare minimum for what I'm paid for is what they get now. The store is melting from within & we will win the war. Workers unite. Power to the people. 💪', a user said: 'Good for you. Now start organizing. UNION STRONG, UNION SMART.'"
    ]
}