{
    "username": "MountainPerformer210",
    "contributions": [
        "In response to 'The term \"quiet quitting\" isn't used consistently in the media . . . and teenagers are notorious for taking something out of context anyway . . .\nWhat \"quiet quitting\" (as I understand it) doesn't mean to do the minimum at your job, but rather not to overdo things . . . not to give yourself over to your work completely. Don't work overtime, don't stress about deadlines and obstacles you have no control over. Just do your job, within your 40 hours. If you are a teacher, that would mean no longer coming in early, staying late, working at home, spending your own money on the classroom . . .\nFor a student to \"quiet quit\" . . . if they were serious about it, it might mean not doing homework, or not pushing for that \"A\", just showing up and doing what you can during the school day.\nNot doing any work at all isn't quiet quitting, it's just quitting. And there's a lot more of that going around these days then there used to be . . . .', a user said: 'What truly terrifies me about this generation is that they are the next workforce and they just... don't want to do anything. Like they are all so anti school and haven't realized that life is work, honey.'",
        "In response to 'I feel like most upcoming high school students will graduate, realize making YouTube and TikTok videos and game streams is a lot more work than they realized (and a very hard gig to build a following within that is serious enough to pay rent), and eventually take whatever jobs are available to make ends meet in adulthood. Work becomes a matter of necessity, not passion. My local department stores and hardware stores are full of former students who did not care about school work, but are now working 40+ hour work weeks to support their kids, pay bills, etc.\nStudents who go to college right after or who have support from family may encounter this lesson  a bit later; they will have the advantage of being more selective with what jobs fields they apply for (depending on their degree), but will also need to be more competitive within a saturated candidate pool. It was that way when I graduated college a decade ago, and I had to work two part time jobs for 3 years before I landed a job applicable to my degree.', a user said: 'Right teaching is good in the respect that it’s stable and high need which is part of why I chose it it keeps my brain active and is less mind numbing then some corporate job or retail or sales job but what you want in a career is with as much stability as possible and yes even TikTok and posting every day requires discipline the same amount that doing your homework every night requires there’s no easy way out of having to pay rent and that’s why the kids are so checked out they think they are gods when they can make some side money from beats or part time jobs but it’s not enough to cover rent and utility bills and groceries'",
        "In response to 'No, they realize capitalism is exploitative and they feel disenfranchised by a world designed to extract their labor for pennies. Of course they don’t want to fucking work,\nhoney\n.', a user said: 'I wish I didn’t have to work but someone’s gotta pay my bills you can feel however you want about that'",
        "In response to 'We all feel that way.', a user said: 'So how is it different for them I get paid pennies for this job and am screwed over by capitalism and global warming Covid and an emerging recession and teacher shortages I still work'",
        "In response to 'It’s not. Do you blame children for being daunted by that prospect?', a user said: 'They can feel anyway they want about it they still need to figure out skills to support themselves'"
    ]
}