{
    "username": "Mr_ToDo",
    "contributions": [
        "In response to 'Study: finds the same thing as every other study and trial on this topic.\nCompanies: Nah, fuck that.', a user said: 'Same thing for work from home I guess.'",
        "In response to 'It’s a bullshit term. I worked at a startup and the cto was asking me why I’m not working like the ceo there (get up at 7am and use product until 10pm every day)', a user said: '\"Because that's not my job? Because I'm not paid like him? take your pick\"\nIf you want to have 2 employees, hire 2 employees. Shockingly it's actually cheaper than paying the overtime(yes, yes, I know they probably don't want to pay you overtime. They probably figure that they can exempt you somehow, but not paying you isn't going to motivate you to work those extra hours any faster).'",
        "In response to '[Deleted or Empty Comment]', a user said: 'Oh, you mean constructive dismissal?'",
        "In response to 'Fuck \"quiet quitting\"\nIts called \"doing the job I am paid for\".\nAm I being \"quietly fired\" when my employer only pays me what theyre required to?', a user said: 'Probably. But I guess that depends how you take the language. It kind of sounds like taking away my current pay and giving me minimum wage. Without a employment contract I suppose that's legal if they give notice, but I guess notice is hardly quite :)\nBut I guess if you happen to work for a unicorn that pays bonuses and things like that when people go above and beyond, then I suppose \"quietly fired\" could be a term for cutting those out.'",
        "In response to 'What about 6 hour work days? It would be a 30 hour work week. There could be four shifts for a work day. You get two extra hours a day for the same pay. Our societies are already set up for a five day work week. This makes more sense to me. For a four day work week, which day to you take off? Monday? Friday? Maybe Wednesday and split up the week?', a user said: 'Depending on the industry we could also take different days off and stay open for the full 5 days.'"
    ]
}