{
    "username": "MrBleah",
    "contributions": [
        "In response to 'Original Post: Corporate media condemns job hopping & quiet quitting as \"disloyalty\", meanwhile Wall Street rewarded tech firms firing thousands of workers instanteounsly because they \"ripped the band aid off\" [External Link]: https://i.redd.it/bh1yrn4p6fga1.jpg', a user said: 'This has forever been a class war, with the rich, their politicians and the corporations against the worker. I'm sorry to say that everything else is just a distraction from that.\nIs abortion an important issue? Yes. Will Democrats fuck over the worker while supporting abortion rights? Yes they will and the problem is that fucking over the worker is fucking over abortion rights, because it leaves the people most in need of the service without the financial wherewithal to even get it if it is available.\nPoliticians love to run on issues that have no consequence at all for their corporate masters.\nBipartisan support has always been against labor.\nThe Taft–Hartley Act of 1947 curbed the power of labor to organize after major strikes in 1945-1946 showed that the people were still dissatisfied with the status quo. This legislation alone has been incredibly effective in curtailing union activities and was passed by both parties in an override of Truman's veto.\nThe very recent bipartisan support for stomping on the right of railroad workers to strike are an example of the power of Taft-Hartley in action even today.\nRepeal Taft-Hartley.'",
        "In response to 'I've always said that the only \"privilege\" that has ever existed is the privilege of the wealthy.  Race, sex, orientation?  All distractions.', a user said: 'Racism, sexism and other forms of discrimination are certainly problems in this country, but they are also easy distractions from the core problem and that is the economic strife of the worker against the rich and powerful.\nIn the USA the workers that have historically always been more economically disadvantaged are women and non-whites. In this society if you are economically disadvantaged you have less power to effect change and that's why worker protections have to come first.'"
    ]
}