{
    "username": "mr-louzhu",
    "contributions": [
        "In response to 'Just want to add onto your point about market downturns:\nCompanies are constantly chasing growth but very few seem to try and keep adequate reserves to weather downturns (ie. they only care about the short term). Then it leads to rapid layoffs like you were saying. A few months after layoffs, you then see those same companies start hiring again but suddenly they’ve lost the trust of existing staff and have surrounded them with new employees with lesser experience.', a user said: 'It’s everything to do with the priority given to shareholder value over actual business value.\nShareholders want to see returns today. Corporate management teams, in a bid to appease shareholders, perform substantial lay offs and then shifting responsibilities to remaining staff who are already over worked and underpaid as is (due to aforesaid shareholder incentives) and consequently they get burned out and disengage.\nThis has the immediate effect of increasing shareholder value. But it has the long term effect of decreasing business value, which in the long run is bad for shareholder returns.\nBut corporate managers operate based on their incentives, which are entirely driven by shareholder sentiment. And shareholder sentiments are driven entirely by quarterly returns.\nThe problem is capitalism. That’s what ultimately creates toxic corporate cultures and short sighted thinking within corporate management culture.\nBut then there’s always some twat going off about how capitalism is tHe MoSt eFfIciEnT sYsTeM.\nWhat tickles me is all the corporate managers acting like it’s some big mystery and they don’t know what to do about it but that whatever the cause is, it’s definitely not their fault!\nLemme tell you something I learned in all my years working within corporate environments: corporate executives are all privileged, entitled Ivy League pricks who aren’t any smarter or more talented than you or I. In fact, often they’re inept and clueless. They move from one company to the next sopping up benefits and perks and then bailing before the going gets tough. They’re basically trading cards or trophy horses. Executive ornaments. And to be honest, most of their labor is delegated out to subordinates and they don’t do a lot of actual work themselves. But these privileged fuckwits and their incompetence are half the problem here all by itself.'",
        "In response to 'Literally decades of not matching inflation in wage growth, and increasing workloads. Constant denials of requests for additional headcount. Paying market rate for the clueless new guy but punishing those who favour stability despite them having valuable knowledge and skills the business depends on. Increasing expectations of availability and reduced response times. Why didn’t you read the email I sent at 6:30pm last night before our 8am stand up meeting? Layoffs at the slightest hint of a recession. Refusal to invest in tools and training needed to be efficient. Constant requests to just “spend less” but no reduction in targets.\nWhy the fuck would anyone go the extra mile these days?', a user said: 'Bad leadership is the norm not the exception. And part of being a bad leader is you lack insight enough to realize you, not your employees, are at fault for poor performance within your staff. The quality of your workers and their work is a direct reflection on your capability to lead.'"
    ]
}