{
    "username": "MrSickRanchezz",
    "contributions": [
        "In response to 'They say people don't quit jobs, they quit management.\nMany of us can empathize with your situation of having management that is non-conducive to the job you are tasked with doing.', a user said: 'Idk WHY companies place so much value on managers. It's never the managers that make the business, and I feel like the current system in most corporate jobs just rewards the shit out of management for existing, and even for actively doing things which harm the business. I've often wondered if these managers that have been promoted a hundred times into a position of semi-power are just corrupt/lacking in morals enough  to fudge numbers and keep shareholders happy... Yet in a TRUE stroke of capatilist brilliance, the people actually\nmaking and designing the products\nstarve.\nThis practice is precisely why companies like CompUSA and Circuit City fell prey to Amazon. Underpaying salespeople in an industry which RELIES almost\nENTIRELY\non your salespeople being friendly, knowledgeable, and helpful  is a surefire way to watch your MASSIVE business declare bankruptcy inside of a decade. This is also why Best Buy will 100% fail in the next decade. Well, this, and the fact that their CEO has been pushing HARD to pivot the business into it's customer's homes. And I don't mean online, I mean they want to have showrooms where you can go VIEW PRODUCTS, but they won't sell them there, or allow you to order them there. Instead, they'll force you to book an appointment with one of their (already overworked and underpaid) Geek Squad Home Product installers to have them go VIEW THE ROOM YOU WANNA PUT THE SHIT YOU WANNA BUY IN, and then they will recommend you products, and then they will finally allow you to order them. At least this was the plan, last I heard, about 5 years back. Their old CEO was an idiot, but way, way better at his job. On paper, Best Buy looks like they have a chance, but when you factoring the amount of \"cost-cutting measures\" (read: pay-cuts, bonuses fucked up beyond repair, and positions to advance to being utterly eliminated for EVERYONE except for high level store management and above) Best Buy has taken every year since 2012 or so, they're OBVIOUSLY circling the drain, and anyone buying their stock is a fucking dumb shit who needs to do some research.\nSource: Friend of a long time former employee, or maybe I'm an ex-employee who knows better than to identify herself, maybe not. You'll never fucking know for sure,\nBest Buy Security unit!\n(Yeah, they have a war room in Minnesota which looks like some shit straight out of a Jason Bourne movie according to some of the District Managers I've spoken to who've been there. Target too, Target has one of the most advanced crime labs on earth, and regularly consults for police departments with limited equipment).\nBURNBLUEANDYELLOW'"
    ]
}