{
    "username": "Mrsoverit",
    "contributions": [
        "In response to 'Quiet quitting? No. But I've been \"acting my wage\" for the past 3 years.\nNo lesson planning until I'm at school. I do it the morning of. They require us to be on campus 30 min early so now I have a use for that time.\nI grade during our stupid biweekly meetings.\nNo kids are allowed in my room during my lunch. No kids are allowed to remain in my room once my contract hours are over.\nI get 12 sick days and so I take at least 1 \"mental health\" day a month and do nothing school related.\nI told the principal last year I'm not supervising the exchange student visits or an annual culture festival anymore because it's all unpaid work. This year I told my club officers they need to find a new club supervisor.\nIt's had zero impact on my evaluations. I'm still a highly rated teacher. Enrollment demand for my classes had increased enormously. I go on dates after work even during the weekday now.', a user said: 'We have to have our lesson plans turned in a week in advance'",
        "In response to 'Original Post: Is anyone “quiet quitting” this year? I’m curious if anyone else is doing this and how it’s going. My mental health was a mess after last year and my home life is messy— my daughter has a chronic illness that is not in remission. I decided at the end of last year that I was done overextending myself for this job.\nSince then, I’ve just said no, over and over. Can I help take tickets at a football game for four hours and $30? No. Can I lead a PLC? No. Can I mentor a new teacher for an extra plan bell? No, because I’ll just get called to sub for free every day— learned the hard way last year. I’m contracted to work from 7:45-3:15 and so that’s when I arrive and when I go home. If I have to stay extra for any reason— like my daughter’s late practice— I watch Netflix on my school computer and get a Pepsi.\nIt’s been a real relief so far— knowing there’s no pressure for what else may be lurking ahead. It doesn’t matter, because I’m not doing it anyway.', a user said: 'Cries in drama teacher\nKissed my quiet quitting days goodbye today because of rehearsals. Back to 12 hour days.'"
    ]
}