{
    "username": "MuaddibMcFly",
    "contributions": [
        "In response to 'It seems like you have a misunderstanding of what quiet quitting is.  It isn't that productivity is steady, it is instead that the minimum effort is put forth so as to skirt the line between being fired and holding onto your job.  Generally speaking you see a loss in productivity, not a maintaining of productivity.  For example, you are given a deadline of 4 weeks for a project.  In reality, you could complete it in 1 week by putting in extra hours, normally you'd complete it in 2 weeks without extra hours, but in a quiet quitting scenario you'd wait until the day it is due to finish, waiting the full 4 weeks.\nSo your initial assumption is based on a false premise.\nNow for the rest of your weird statements.\ninevitably trending towards record-breaking profits for the top 1% regardless of wider economic factors\nThe only way you can call profits record breaking is if you look at them in raw dollar value.  Which, if you are economically educated, makes absolutely no sense.  Profits are records nearly every year in a healthy company because inflation creeps up every year.  When you look at the profits of these companies in the way that every single economist and financial person does, you see a decrease in profitability.  Yes that company that sold 1 billion in goods made 100 million in profit last year, but they made 90 million on 800 million in sales the year.  It's a record profit!  But the percent of profit made was less.  As we look through the economy you see this more and more.\na laborer under a functioning capitalist society exchanges an agreed-upon quantity of labor for an agreed-upon wage\nThis isn't really true unless you are contractually obliged to such a thing.  For example, a cashier at a store will inevitably have downtime, so their labor isn't being utilized but they are being paid for a such a time.  Conversely a construction worker may agree upon a contract that they spend 1000 hours building something but due to an unforeseen issue or complication they end up spending 1200 hours instead.  They don't get to bill for additional hours unless you agree upon that first.  Labor is not a quantity to wage driven process.\nand a consistent degradation of the wage, purchasing power\nI'm not entirely sure what you think this means, but wages have trended up, not down.  Purchasing power has changed, not degraded as well.  The only way you can come to these conclusions is by using bad data points.  For example, the purchasing power of someone in 2023 would include things that someone in 2010 did not.  Streaming subscriptions, for example.  The problem with purchasing power charts is that it makes no distinction for how the costs of people have modified over time.  Someone in the 90's would be amazed at not just the fact that we carry a computer in our pocket that has access to the internet at speeds faster than they ever did, but that those devices cost over a thousand dollars a piece.  Similarly, wages can only been seen as degrading if you look at the same job over time.  The value of many types of labor goes down as advancements in technology go forward.  We do not bemoan the stagecoach driver being a job with no wage potential with the advent of the car.  But today we do that all the time with things like automated order taking reducing the number of people needed thus decreasing the wages required for such a position.  Likewise tools which a carpenter or plumber uses have increased productivity requiring us to need less and less of their labor.\nmaybe actually read a campaign platform or two\nUgh, probably your worst argument.  Campaign platforms are the most useless, generic items that a politician puts out.  They have very little bearing on what they actually end up doing.  For example, if we listened to the platforms of republicans, we'd see them in favor of small government and responsible budgets.  In reality, we see neither.  If we listened to democrats we'd hear about the need for data driven spending and responsible budgets.   In reality, we see neither.  There's a reason that the joke in the US goes \"How do you know when a politician is lying?  His lips are moving\".\nYou have competent politicians, you just refuse to give them power for some reason...\nThe problem here is that there is no such thing as a competent politician.  I would also imagine that the ones you think are competent wouldn't actually address any of the things you want them to.  You seem to understand that in a capitalist society there is widespread prosperity to be had, but then you want politicians to do what?  Enact the policies that you fled from?  That is a great way to squash that prosperity.\nSome part thoughts to ponder on before you reply.\nIn the US, generational wealth, isn't a thing.  70% of all wealth is lost by the second generation and\n90% is lost by the third\n.  The idea that someone being wealthy means that you family is set for life is a poor one.\nIf you look at IRS data, you see that someone in the bottom 25% of income almost always has moved out of that bracket within a decade.  We have very recently had a skewed system in which more young people stayed in college, many for more than the 4 years for a degree, skewing age based statistics about what age you should acquire wealth at.  Previous generations didn't attend college at nearly the numbers todays youth did meaning when you compare average wealth at 25 today versus 50 years ago, there will be a vast difference.\nA large summation of everything I've said can boil down to, you've been lied to using statistics to manipulate you.  But when you boil the data down into usable data, none of the things you hold dear are true.  You read the headline of a news article from someone who didn't understand the study conducted and believed them.  When in reality, the data shows a much much different picture.', a user said: 'It isn't that productivity is steady, it is instead that the minimum effort is put forth so as to skirt the line between being fired and holding onto your job.\nAnd the other side of the coin is employers paying the minimum amount contracted to keep them from quitting.\nIt's nothing more than working the minimum required amount because the employer\npays\nthe minimum required amount.\nIn other words, the term \"quiet quitting\" is nothing more than a pejorative reframing of the concept of \"working your wage.\"\nThere's one guy on instagram who did the whole \"quiet quitting\" thing, because he had been the\nbest performer\nat his company, for two years running, and the company refused to give him a raise or bonus.  In response to their refusal to give\ntheir best worker\nany sort of raise, that worker decided to stop giving 110%, because there was no point.  Then, in his next annual review, the company that\nrefused\nto give him extra money had the audacity to complain about him not giving\nthem\nthe extra effort.\nFor example, you are given a deadline of 4 weeks for a project. In reality, you could complete it in 1 week by putting in extra hours, normally you'd complete it in 2 weeks without extra hours, but in a quiet quitting scenario you'd wait until the day it is due to finish, waiting the full 4 weeks.\nYeah, because they asked for it in  4 weeks, and if they\ndid\nget it done in 1 week, they'd be given\nanother\ntask immediately.  No bonus for doing things faster than expected, not even a \"here's a week of light duty, as a reward for getting it done early enough for robust and comprehensive testing.\"'",
        "In response to 'And the other side of the coin is employers paying the minimum amount contracted to keep them from quitting.\nIm not sure what your point is here. Companies will offer different rates for the same job for several reasons: they want to attract more candidates, they want to attract better qualified candidates, and they want to retain current talent/reduce turnover.\nYes, employers dont want you to quit. Retraining costs a lot, and it's cheaper to just give you more money. Idk what this matters. We as employees also choose jobs based on their wage all the time. I quickly quit my 18/hr job to make 30 elsewhere doing the same thing. Employers compete with each other in the labor market, and you are the commodity.\nSo minimum in the sense they wont pay me double my worth? Yes. Minimum as in that they will pay me scraps? Not if they care about any of the things i mentioned', a user said: 'Im not sure what your point is here.\nMy point is that one side is doing the minimum, then complaining that\nthe other side\nis\nalso\ndoing the minimum.\nIf they want someone to put in more effort than was contracted for, they need to offer more compensation than was contracted for.'",
        "In response to 'And the other side of the coin is employers paying the minimum amount contracted to keep them from quitting.\nWhat a talking point.  Even if I accepted this is true (very clearly it is not), how does that impact the statement I made?  When you do something for yourself, do you always exert the minimum amount of work required?  Or do you do good work that goes above the minimum?\nThere's one guy on instagram who did the whole \"quiet quitting\" thing, because he had been the best performer at his company, for two years running, and the company refused to give him a raise or bonus. In response to their refusal to give their best worker any sort of raise, that worker decided to stop giving 110%, because there was no point. Then, in his next annual review, the company that refused to give him extra money had the audacity to complain about him not giving them the extra effort.\nWhile a cute anecdote, it really shows how wages and work interact.  If you are working the minimum, why would you be expected to receive more than the minimum salary?  If you show that you are doing more than the minimum, then you would be rewarded with a raise.  Effort is rewarded, no effort is not.\nYeah, because they asked for it in 4 weeks, and if they did get it done in 1 week, they'd be given another task immediately. No bonus for doing things faster than expected, not even a \"here's a week of light duty, as a reward for getting it done early enough for robust and comprehensive testing.\"\nBecause that's not how they're being paid.  If you are being paid by project then it would make sense that you'd get paid more for the next project after finishing the first.  But you're talking about wages, which are paid no matter if there is a project to work on or not.  You should not expect to receive extra compensation for completing a project in a timely manner.', a user said: 'When you do something for yourself\n...when I do something for myself, the quality of my work is my compensation.  When I do something for an employer,\nmy compensation\nis my compensation.\nIf you are working the minimum, why would you be expected to receive more than the minimum salary?\nRespectfully, you're only looking at one side of the argument.\nIf employers are paying the minimum, why would workers be expected to do more than the minimum work?\nEffort is rewarded\nAgain, the problem, the reason that Working one's Wage\nis a thing in the first place\nis that effort is\nnot\nbeing rewarded.\nYou should not expect to receive extra compensation for completing a project in a timely manner.\nAnd because there is no extra compensation for putting in that extra effort, employers should not expect extra effort for what they're paying.'",
        "In response to 'If employers are paying the minimum, why would workers be expected to do more than the minimum work?\nBecause employers aren't paying the minimum.  Like this is a phrase so many people keep repeating at me like it's some magic bullet.  It's nonsense.\nAgain, the problem, the reason that Working one's Wage is a thing in the first place is that effort is not being rewarded.\nMinimum effort is met with minimum compensation.  How is that a problem?\nAnd because there is no extra compensation for putting in that extra effort, employers should not expect extra effort for what they're paying.\nThe extra compensation comes in forms of raises, bonuses, and promotions.  There are other career advancements that come out of it as well.  It's like you saw that I replied already debunking all of your statements and decided to just repeat them at me.', a user said: 'Because employers aren't paying the minimum\nAnd workers aren't\ndoing\nthe minimum, because the minimum is \"nothing.\"\nMinimum effort is met with minimum compensation. How is that a problem?\nIt's not, and that's OP's entire point: the complaints about \"quiet quitting\" are literally complaints about\nprecisely that:\nminimum contracted effort in exchange for minimum contracted compensation.\nThe extra compensation comes in forms of raises, bonuses, and promotions.\nIF\nit comes, yes.  But for many, including the overwhelming majority of those who \"work their wage,\" they\ndon't\ncome.\nWorse, with inflation, a\nlack\nof raise/bonus/promotion is a de facto\nreduction\nin compensation value.\nIt's like you saw that I replied already debunking all of your statements and decided to just repeat them at me.\nExcept for the part where it is nothing like that at all, sure.'",
        "In response to 'And workers aren't doing the minimum, because the minimum is \"nothing.\"\nWhat absolute nonsense.  In a discussion about a job and what the minimum is for a job, you try and paint something else and pretend that it is an answer.\nIt's not, and that's OP's entire point: the complaints about \"quiet quitting\" are literally complaints about precisely that: minimum contracted effort in exchange for minimum contracted compensation.\nIt seems like you're confused - this is not the argument of the OP.\nIF it comes, yes. But for many, including the overwhelming majority of those who \"work their wage,\" they don't come.\nThe overwhelming majority of workers receive raises each year.  It is uncommon to not have a yearly raise outside of situations like recessions.\nExcept for the part where it is nothing like that at all, sure.\nThen you need to explain why it isn't.  Your arguments just seem to amount to plugging your ears and shouting \"Nuh uh\" at me.  Show me how it is untrue instead of just saying \"No it isn't\" repeatedly.', a user said: 'In a discussion about a job and what the minimum is for a job, you try and paint something else and pretend that it is an answer\nThat's literally exactly what you're doing when you assert that they're not paying their employees the minimum contracted amount.'",
        "In response to 'Recently, many major corporations have started to use the term \"quiet quitting\" to refer to employees whose productivity remains consistent\nI don't think quiet quitting means this.\nI thought it referred to only doing the bare minimum, or only doing the job as described precisely in the job description.\nFormerly known as 'working to task' or 'work to rule'', a user said: 'only doing the job as described precisely in the job description.\nAnd they have no right to complain when they're providing compensation precisely as described in the salary agreement.\nIf one gives more, the other should, too.  If one doesn't, the other has no right to complain that the other doesn't, either.'"
    ]
}