{
    "username": "Mundane-Mechanic-547",
    "contributions": [
        "In response to 'Original Post: The news media ignoring declining American life expectancy in favor of nonsense like \"quiet quitting\" is one of their most heinous lies of omission to date [External Link]: https://i.redd.it/5vgz6ij9blea1.jpg', a user said: 'It's almost completey due to external factors.  Environmental factors play a huge role in the major cancers such as colon.   Obesity plays a role in cancer and heart disease, the #1 and #2 issues.  It plays a role in Covid mortality. Then you have the pandemic itself.  To blame labor conditions all of a sudden is a huge stretch.  No doubt working at Walmart forces unhealthy choices, so wages are a significant contribution there.  But it wouldn't dive like this all of a sudden.   For the vast majority of us we do have choices to live healthier and most of us do not.'",
        "In response to 'To blame labor conditions all of a sudden is a huge stretch. No doubt working at Walmart forces unhealthy choices, so wages are a significant contribution there. But it wouldn't dive like this all of a sudden. For the vast majority of us we do have choices to live healthier and most of us do not.\nWalmart jobs result in people lacking insurance... which is tied to a much higher incidence of COVID death in the US (but not other developed countries that have universal healthcare systems):\nThe Catastrophic Cost of Uninsurance: COVID-19 Cases and Deaths Closely Tied to America’s Health Coverage Gaps\nThis report uses that research to address one fundamental question: If everyone in America had health insurance, how many people who contracted COVID-19 could have been spared, and how many who died might still be with us today? We find as follows:\nNationally, roughly 1 out of every 3 COVID-19 deaths are linked to health insurance gaps.\nMore than 40% of all COVID-19 infections are associated with health insurance gaps.\nBy August 31, 2020, health insurance gaps were linked to an estimated 2.6 million COVID-19 cases and 58,000 COVID-19 deaths. By February 1, 2021, 10.9 million infections and 143,000 COVID-19 deaths may have been associated with health insurance gaps.', a user said: 'I don't disagree with that, but 58k out of a million Covid deaths is chump change.  It would not explain the drastic decline in life expectancy.  All countries are seeing this.  I'm not at all giving Walmart a free pass, but you gotta look at the data in holistic fashion and not just cherry pick it.\nThe life expectancy decline isn't due to any sort of labor issue, not in the short term.    Why?  Because those issues with Walmart etc are decades old.  It can't possibly explain a plunge in the last few years.'"
    ]
}