{
    "username": "mynameisethan182",
    "contributions": [
        "In response to 'Original Post: Japan's historic work ethic is declining—45% of workers admit they're quiet quitting [External Link]: https://fortune.com/article/japan-work-ethic-declining-45-percent-of-workers-quiet-quitting/', a user said: 'The term quiet quitting is so dumb. I know, in the states, it was used to basically used to describe doing what was outlined in your job(s) contract & not going over and beyond.\nThat's not \"\nquiet quitting\n\" that's doing your job. Workers shouldn't feel pressured to do an ounce more than the job they signed up to do.\nEdit:\nWorkers said they do the basics required for their jobs for various reasons, but cite wanting a better work-life balance or feeling indifferent about their career path as prime reasons for losing motivation at work.\nIt seems it's being applied similarly here too. If employers want more work. Let them pay more money & put it in the contracts & let employees know up front when they sign up for the job.'",
        "In response to 'Quiet quitting in the US: NOt doing shit and waiting to get fired for it / put on PIP.\nQuiet quitting in Japan: Just doing your job to a tee and not doing any overtime or anything above and beyond.\nShit is insane.', a user said: 'Quiet quitting in the US: NOt doing shit and waiting to get fired for it / put on PIP.\nThey used Quiet quitting in the US to refer to doing your job to a tee as well. That was what I was attempting to get at. Apologies if I poorly communicated that.'",
        "In response to 'no, it's changed now tho. In the US, quiet quitting is not doing your job but showing up to work anyway. Just basically wasting space.', a user said: 'This is published late last year.\n.\nQuiet quitting refers to\ndoing the minimum requirements of one's job and putting in no more time, effort, or enthusiasm than absolutely necessary\n. As such, it is something of a misnomer, since the worker who does this doesn't actually leave their position and continues to collect a salary.\nThe usage does not differ here.'"
    ]
}