{
    "username": "MzzPanda",
    "contributions": [
        "In response to 'Original Post: How to quiet quit without being detected after being known to be an extra-mile person at work? Firstly, I know - quiet quitting is just doing your job and nothing extra. Stop repeating the chant.\nSecond, I was known to be THAT person, who goes out of his way to help. I guess I associated my self worth with how company values me.\nIt took a couple of a years and being passed over a promotion to wake up.\nI cannot quit at the moment, or change jobs, I have been looking and nothing suitable on the horizon yet.\nThe question is how do I make the shift in attitude without getting so much attention especially that I am known to be a hard worker.\nEdit: Thank you everyone! Very useful tips! Read every single one! 🙏', a user said: 'Ur gonna have a hard time quiet quitting if u don't understand why u go out of ur way to help in the first place. I say that from a place of personal experience. Is it that ur a ppl pleaser and don't want to cause conflict, or is it because ur actually being assigned responsibilities that are beyond ur job description? Or a combination of both. I recently quiet quit to my coworkers lol... I told my boss because he isn't the cause of my added work stress, and he agrees that I've basically spoiled my coworkers. One thing I can say with relative certainty is that ur GOING to be detected. The ppl who rely on u to carry them will be the first to notice, and will likely complain. Don't engage in office politics. Let them have their little tantrums. If they confront u directly, flat out tell them that if THEY did their jobs, then u wouldn't have to...then walk away 🎤🫳'",
        "In response to 'Nice. \nWhen you say people who rely on you, are you referring to your subordinates/team or superiors?', a user said: 'I'm talking about both. When u do extra work to carry the burden of others, whether it be ur equals or those in charge who delegate most of their work to make their day easier, they notice almost immediately that they \"suddenly\" don't get help anymore. I've been in ur position before. Once u set boundaries, and stick to them, ur working life will be a bit easier until u find something better'"
    ]
}