{
    "username": "NachoMan_HandySavage",
    "contributions": [
        "\"Quiet Quitting\" is a bullshit gaslighting term. Don't let it become an acceptable term [External Link]: https://i.redd.it/fwj0foce59k91.jpg",
        "In response to 'I always tell my coworkers who say they skip breaks that they are giving the company 2.5 hours for free every week.', a user said: 'Yes! Exactly. Some places give you no benefits\nother\nthan your break(s). Why would you let them talk you out of that too??'",
        "In response to '[Deleted or Empty Comment]', a user said: 'This is fucking rough and I am sorry to hear you went through that. Did they figure out what was wrong/hope you made a full recovery.\nYou did the right thing afterwards too. What is the manager's job if not to make sure there are enough people working? Power to you.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'I totally agree. When I first heard the term a few weeks ago I was in the same boat as you. I just assumed we were having a bunch of 20 year olds getting sick of being treated like shit and just ghosting their employer.'",
        "In response to 'This is such a great post. I've been in a labor union for many years. I enjoy better than average wages and benefits that the typical worker in my field.\nI just wanted to add that \"Work to Rule\" can go beyond just working the bare minimum. It can be proactive. Nit picking every aspect of safety regulations is one way to Work to Rule. I drive a work truck and I occasionally work aloft or in dangerous environments. I can always find something that is unsafe to report.\nWhen our union is in conflict with the company, we occasionally deploy \"Work to Rule\" tactics. That means we go over every job with a fine toothed comb looking for safety problems.\nWorn tread on a truck tire? Sorry boss, can't drive 'til that tire is replaced. Broken glass on the job site? Someone's gonna hafta make that safe before I go in there. Do I smell natural gas? Better call the gas company to make sure. There is always a reason to double check safety.', a user said: 'I think it is unlikely you just heard me haha, but I gave this such a solid clap and \"Yesss\". Let me know if you heard me, I can keep trying lol'",
        "In response to '[Deleted or Empty Comment]', a user said: 'What happened?'",
        "In response to 'Hey cool yet another post where ‘quiet quitting’ and ‘act your wage’ are hashed out. Only the 80th post in the past 3 weeks about this. Very cool\nFor a phrase Reddit hates they’ve done nothing but spread the absolute shit out of it nonstop', a user said: 'Based on the fact that there are a few people in the comments that are still unaware of what the term meant, I think it helped at least a few people. Soooo jog on'",
        "In response to 'Where is it being called Quiet Quitting?', a user said: 'If this is a real question, I would just recommend googling any major news network and that term in quotes. You will find tons of articles and puff pieces from all of the major networks.'",
        "In response to 'Stop posting about it then... This is literally the only subreddit I see it... That and\nr/antiwork', a user said: 'Seeing as there are a bunch of comments on this post of people not knowing what the term means, I see it is helping people learn. If you are really that much of a miserable grump that just because you know something already others cannot learn about it and that makes you unhappy, whelp, jog on friend.'"
    ]
}