{
    "username": "natishakelly",
    "contributions": [
        "In response to 'Original Post: I think my remote team mate is quiet quitting And it's ticking me off. Need advice if I should say something?\nMy team is fully remote,  spread  across the US. Our individual and team metrics are tracked by the amount of tickets we process on a weekly basis. This is a FULL time job and I've found that a member of our team is only logging about 4 hours a day - if that! Meanwhile, the rest of the team is putting in 9 hr days just to keep up with the volume.  We've also had to log in and work the last two Saturdays just to clear the backlog.  If this person would just work a normal day,  it would lighten the load on each of us. Our manager hasn't seemed to notice that this  person's \"numbers\" are half of what the other team members are producing. Do I speak up or keep my trap shut,  silently seething all day?\n**Thank you everyone for your input! I'm not going to do my managers job for them,  if they don't care,  I won't care either.  I'll hit my targets and focus on my career advancement in 2025.', a user said: 'And this type of worker is why companies are moving back to in office.'",
        "In response to 'Why? These types of workers exist in office too. Managers are still responsible for replacing bad employees, their job doesn’t somehow happen automatically when in the office any more than wfh.', a user said: 'I agree but it makes it easier for managers to hold people accountable and gather proof for dismissal.'",
        "In response to 'Sounds like there is plenty of proof to me, OP says they can see the person is only logging 4 hours a day. Managers have access to even more tracking, so they have even more proof than that. There’s not really any additional evidence they can somehow only collect in offices, being non-productive is the information they would use regardless of\nwhere\nthe employee is being so. If a manager is so dumb they don’t know how to interpret “only logging 4 hours of day in the system” as evidence of work, they probably need to be replaced also.', a user said: 'OP isn’t the manager though. That’s the issue.'"
    ]
}