{
    "username": "Necessary_Cow_1152",
    "contributions": [
        "In response to 'Original Post: Quiet quitting life I am quiet quitting life and nobody realizes that’s what it is. My friends think I’m just being a bad friend. My family just thinks I’m being a bad family member. I don’t want to die but I don’t want to live in the world any more. I just want to go to work and then come home and that’s it. I don’t want to go have dinner with people anymore. I don’t want to hang out and be made to feel obligated to stay until 11 pm before I can go home.  Nobody realizes that this is my way letting go of life, of escaping from the world.  I’m alone, I’m 30 years old and haven’t had an intimate partner for a decade. I love those in my life tremendously. But I just want to let go. When I’m home, I’m free to be who I want. To feel how I want, to look how I want. I can say what I want, my cat doesn’t mind. He doesn’t judge. He looks up to me and needs me and he’s the only thing that’s warm in my bed.  There’s nothing more signifícate to write here. Just thank you for listening.', a user said: 'You don't sound as if you are quiet-quitting life to me....it sounds like you are protecting yourself from unnecessary bullshit.  If you are working and doing what you are supposed to do that's good.  If anyone tries to make you feel guilty or something for not participating in the 'extra' stuff....well, to hell with them.\nEnjoy your bubble.  I'm have depression but take medication or I'm absolutely miserable...I'm also an introvert.  I rarely leave the house and have groceries delivered.  But it's often boring and  lonely.  I live far away from where I am from so have to meet new friends and I really have no idea how to go about doing that today.  I have been single for 2 years and they took the dog 🥲.\nBut I do have roommates so have some interaction.  They have cats that I baby and I never was a cat person before.  But I'm still so OCD about getting ringworm or something that I wash my hands immediately after petting one lol.  Which is ridiculous because they are indoor cats and clean 😆'"
    ]
}