{
    "username": "nem8",
    "contributions": [
        "In response to 'hah, det minte meg om leksene vi brukte å få av en mattelærer på barneskolen. De kom i 3 kategorier; \"skal\", \"bør\" og \"kan\". Jeg husker ikke om læreren ble sur om vi ikke gjorde alt, men syns det var en merkelig måte å gi lekser på.', a user said: 'Dette var (er?) vanlig på barne og ungdomsskolen fordi det ofte er stor variasjon på kunnskap og interesse :)'",
        "In response to 'Et godt eksempel kan være om noen på jobben får ansvar for å skrive vaktlister. De kan godt gjøre den faktiske jobben innenfor arbeidstiden, men det vil likevel være folk som vil kontakte dem utenfor arbeidstiden med spørsmål om fri/bytting av vakter osv. Og man vil ha det i bakhodet selv om man ikke er på arbeid.', a user said: 'Ikke et godt eksempel da det er snakk om to forskjellige ting. Normaltid og overtid. Det er stor forskjell på disse to tingene. Sistnevnte er ofte noe en arbeidsgiver forventer, og gjenstand for mange uenigheter. Jeg regner med veldig mange i denne tråden tenker på det når de deler sin mening.'",
        "In response to 'Nei, det er ikke snakk om overtid her. Jobben blir gjort innenfor arbeidstiden. Man kan selvfølgelig la være å svare på henvendelser utenom arbeidstid, men det er likevel et forstyrrelsesmoment man blir utsatt for mens man ikke er på jobb.', a user said: 'Ditt eksempel:\nVaktliste i normaltid.\nOppfølging etter arbeidstid = overtid.\nForeslår at hvis man ikke vil jobbe overtid så la jobbtelefonen være avslått så sant man ikke har vakt.  Hvis man blir stressa av at ansatte ringer på privattelefonen utenfor arbeidstid fordi arbeidsgiver har delt nummeret med andre ansatte så er det på sin plass å ta en samtale med arbeidsgiver og eventuelt fagforening.\nEventuelt hvis man vil ha litt ekstra kroner så avtaler man med arbeidsgiver at dette regnes som overtid (avhengig av hva som står i personalhåndbok rundt dette, min erfaring er at det ofte står at overtid skal avtales/godkjennes)'",
        "In response to 'Der tar du feil. Arbeidsgivers styringsrett går ut på at arbeidsgiver kan gi deg andre oppgaver enn det som står i arbeidskontrakten din så lenge det ikke går utover avtalens grunnpreg, også kalt en vesentlig endring.\nI praksis betyr det at arbeidsgiver fint kan tillegge deg tilleggsoppgaver som ikke er nevnt i arbeidskontrakten din.\nEdit: Skrivefeil', a user said: 'Skjønner ikke hvorfor du blir nedstemt. Det du skriver stemmer jo. Dvs, hvis du mente arbeids\ngiver\ni siste setning.'",
        "In response to 'hvis du mente arbeidsgiver\nDet har du selvsagt helt rett i. Takk!\nSkjønner ikke hvorfor du blir nedstemt. Det du skriver stemmer jo.\nNei, det kan du si. Sier vel noe om kunnskapsnivået, kanskje? Kun spekulasjon, selvsagt, men jeg tror mange av de som er unge voksne har blitt pakket inn i bomull siden de var små. Virkeligheten treffer deg knallhardt hvis du har vokst opp uten å møte motstand.', a user said: 'Ja, jeg har også inntrykk av at det er flest unge, kanskje de er mer konfliktsky og kvier seg for å snakke med leder/fagforening om ting de føler er utfordrende. Det er jo strengt talt ikke farlig og noe man bør lære seg å gjøre så tidlig som mulig.'",
        "In response to 'Hvis du gjør det bedre enn kollegaene dine slik du beskriver over lengre blir du jo ofte forfremmet og da belønnet med bedre lønn.', a user said: 'Sjelden det skjer automatisk. Men hvis man tar initiativ i medarbeidersamtaler og lønnssamtaler så fører det jo ofte fram. Problemet er vel de som sier ja til alt og aldri ber om noe mer.'"
    ]
}