{
    "username": "New_Listen8095",
    "contributions": [
        "In response to 'I keep seeing this over and over but can someone ELI5 me why won't judges in SF convict? What is the reasoning behind this?', a user said: 'Not sure about SF, but have had lots of experience with Alameda County DA these last several years. Police (Alameda County Sheriffs) have arrested somebody that my parents had a restraining order against many times. Less than a quarter of the charges have stuck. And many times, things that should be charged as a felony are charged as a misdemeanor. Calls to the charging DA to find out why often go unanswered. (There is one charging DA that is responsive and always returns calls and one that refuses to speak with victims.)\nAnd of the ones that have stuck, they get them dealt down to almost nothing. So of a quarter of the charges that stick, then they combine three charges as a single offense and offer them the sentence for one single offense. And in CA, you only need to serve half on your sentence. Meanwhile, the prosecutors want you, as the victim, to be ready for a court trial at any point in case the deal doesn’t go through. For Alameda County, it’s not unheard of for a court trial to happen a year after the offense. These are cases that all have video evidence - remember that the charging DA won’t even charge the case unless they’re 150% sure they can win. But it saves hassle and money when they can cut a deal so that’s what they do the majority of the time.\nNot to mention all the times Alameda County judges have released this person on his own recognizance only to have him commit the same crimes he was in the middle of getting prosecuted for (inevitably with countless delays due to public defenders constantly pushing the case back). In my case, prosecutors have repeatedly asked the judge not to release the suspect and provide a long list of reasons. The judges never seem to care.\nThe sheriffs have actually followed up with me apologetically when they’ve been unable to get charges to stick and have to release him. I can’t imagine how frustrating their job must be. And to their credit, they always attempt the arrest anyway.'"
    ]
}