{
    "username": "New-Caramel-3719",
    "contributions": [
        "In response to 'Japan literally has a term for people dying from overwork and people who withdrew from society altogether. \"Legendary work ethic\" should be said in terms of horror and not envy.', a user said: 'Average working hours\nincluding unpaid OT\nis below global average in Japan(1903) already, lower than the US(1976).\nFancy words like\nworking to death\nor\nblack companies\nexist, but what is considered illegal working hours and making news for violating labor law in Japan is just average working condition in nearly 30% of countries in the world.\nThe average yearly working hours in Singapore(2,215h) or Vietnam(2,163h) are considered illegal 'black company' level by Japanese standards, while India(2,428h) and China(2397h) are considered working to death in Japan.\nAverage regular time is 1800-1850 hours in Japan and legal OT cap is 360 hours a year.\nWorking OT of 100 hours a month or 80 hours of 2 consecutive month are defined as working to death in Japan, average certified working to death cases involving 2300-2500 hours of yearly working hours(including unpaid OT)\nOf 169 countries and regions in the list of average working hours by OECD, 53 of them have over 2200 hours of average yearly working hours that would be considered illegal/black companies in Japan.\n11 coutnries have average working hours of 2400 hours or more that would be not just violating OT cap but also considred working to death if they apply Japanese labor law.\nhttps://clockify.me/working-hours'",
        "In response to 'Having worked in Japan, I don’t think this takes in consideration of after work drinking sessions, which destroyed me after a week. I know not every company does it but it’s still crazy common', a user said: 'When did you work in Japan?\nIt is pretty rare to have once a week type of regular after work drinking today. There are various surveys, 2%-6% employees have once a week or more after work drinking.\nhttps://money-bu-jpx.com/news/article052903/\nhttps://www.workport.co.jp/applicant_data/detail423.html\nhttps://presswalker.jp/press/41163\nhttps://prtimes.jp/main/html/rd/p/000000052.000069473.html\npre-covid\nhttps://gallery.intage.co.jp/nomikai2017/'",
        "In response to 'Here's a Fortune article from February with another trash headline claiming that Japan is moving to a 4-day work week:\nhttps://fortune.com/article/tokyo-4-day-workweek-desperate-attempt-japan-shed-title-worlds-oldest-population/\nIn the article, it claims the Tokyo Metropolitan Government, one of the largets employers in the country, is trialing a 4-day work week.\nSome things that the article just conveniently glosses over: Is this available to ALL tokyo metropolitan employees, or is it a select few to trial this (will the janitor get a 4 day work week, or is it just a couple of top executives), how many are in this trial, and how long will this trial last?\nBecause I'll bet dollars to donuts that:\nIt's a select 50-100 employees\nIt's not a permanent change\nEven if selected, employees will be reluctant to continue on this trial so that they don't look like lazy employees to their colleagues.\nThese articles that are trying to paint Japan as moving toward a more progressive work culture are technically not wrong, but people need to understand exactly what an incredibly risk adverse society Japan is from top to bottom, especially their corporate structure and work culture.', a user said: 'people need to understand exactly what an incredibly risk adverse society Japan is from top to bottom, especially their corporate structure and work culture.\nYeah, that's why working hours have been significantly reduced over the past decade—because of how society now views them.\nFew major or mid-sized companies in Japan want to be singled out and end up on national news for allowing employees to work illegal overtime.\nSince long working hours have become illegal, and allowing employees to work 55–60 hours a week has gone from acceptable to extremely risky, few companies permit such long hours anymore.\nFor example, many major companies in Japan use third-party monitoring systems that detect if you use your PC after recorded working hours, making it impossible for employees to secretly work unpaid overtime.\nEven though \"risk adverse culture\" has not changed, what is considered risk is changing very fast according with public perception and law.'"
    ]
}