{
    "username": "NewLightNitwit",
    "contributions": [
        "In response to 'Original Post: Is Quiet Quitting now a thing for Jehovah's Witnesses? So many posts here related to Memorial Season for the Jehovah's Witnesses Organization make me feel like many \"active\" JWs are simply engaging in Quiet Quitting. These JWs are not DA, DF'D or PIMO even but they are just doing less....not showing up for in-person activity....not very engaged as a JW anymore. It is great to see this and the growth of this EXJW Sub too.\nReally the most effective thing that can be done to damage the harmful Jehovah's Witness Organization is to simply stop supporting it with your time or energy. Stop volunteering, stop showing up at as many meetings, stop participating if you can.', a user said: 'I get the parallel you're trying to make between quiet quitting and decreased activity as a JW, but here's the unfortunate difference. There is no such thing as quiet quitting for anyone except for someone strategically fading, which would require them to be PIMQ at minimum.\nGOSSIP/SNITCH CULTURE is way too prevalent for anyone to quiet quit like is happening secularly. You are just the dreaded SPIRITUALLY WEAK individual who will be soft shunned and/or marked.'",
        "In response to 'Original Post: Is Quiet Quitting now a thing for Jehovah's Witnesses? So many posts here related to Memorial Season for the Jehovah's Witnesses Organization make me feel like many \"active\" JWs are simply engaging in Quiet Quitting. These JWs are not DA, DF'D or PIMO even but they are just doing less....not showing up for in-person activity....not very engaged as a JW anymore. It is great to see this and the growth of this EXJW Sub too.\nReally the most effective thing that can be done to damage the harmful Jehovah's Witness Organization is to simply stop supporting it with your time or energy. Stop volunteering, stop showing up at as many meetings, stop participating if you can.', a user said: 'Had to come back to this one. I love the decrease. I love the apathy. I wish it could wake up more good but blind people by looking around them and seeing the drudgery that is being a JW. It saddens me that it won't. I always say this the JW hedge their bets. Increase in any area? God's hand is evident. Decrease? Satan's influence and the scripture that says the love of the greater number will cool off.'"
    ]
}