{
    "username": "newnamesameface",
    "contributions": [
        "In response to 'Original Post: Reddit was so hot on \"quiet quitting\" but now when you talk about using slowdowns to interfere with the fascist takeover, all you hear is crickets We are at a pivotal moment, where either we choose to plunge the system into darkness on our terms temporarily, or the oligarchs drive the system into darkness on their terms for the foreseeable future.  And yet, so many people seem willing to just continue, business as usual, even as our protections (worker protections, immigrant protections, social services) evaporate before our eyes.\nThe ruling class may own the companies, but the working class still runs them, and we have a chance to use that to help ward off the darkness.', a user said: 'Why don't you tell us what you're doing maybe that'll encourage more of it'",
        "In response to 'I get that you were just being snarky, BUT today was actually a great example, so:  I had two sets of documents I needed to review, one for our friends in Europe (please get it to us by Fri!) and one for work stateside (can we get this by the end of today?).  Wouldn't you know, the European papers took longer to review than I thought, and I couldn't get them back to Europe until after the end of their business day, so now it's going to be delayed until Monday.  And darn it, because I spent so much time on the European docs, I couldn't get the stateside docs turned around by the close of business today.  So now they're not going to get sent out until Monday.\nIt's little things like that, with plausible deniability (or sometimes even anonymity, depending on your work environment) that can throw extra pauses into the workflow, that are especially impactful when there are multiple steps downstream dependent on it', a user said: 'I was actually only being 20% snarky. But I am getting tired of the \"why is no one doing anything\" posts so instead of that maybe let's talk about the ways we are doing things since none of us have the resources or ability to go up against the corporate machine en masse.\nEvery time we get on each other's backs about not doing enough it solidifies their hold over us. Instead start the ball rolling and one day may it be a force to be reckoned with'"
    ]
}