{
    "username": "newnewaccountagain",
    "contributions": [
        "In response to 'Otherwise known as \"doing your job\"', a user said: 'Problem is if the most junior people in a company aren’t internally or externally compelled to stretch their skills and job description, the individual, company, and general economy will stagnate.\nI’m here for a conversation of fair compensation but frankly there’s a trade between labor and marketable skills that happen with junior corporate workers.. the people getting shafted are in the middle training the juniors and creating all of the shareholder value for the top. These are also likely the ones with the most financial obligations at home. If a Gen Zer wants to do the bare minimum that’s fine in theory but it violates the “contract” and they’ll stagnate or get bounced for someone with curiosity and ambition'",
        "In response to 'That’s fine. You’re more than welcome to fire someone for doing the job you hired them to do.\nIf you need to hire a personal assistant to do all sorts of jobs then you can hire someone and pay them accordingly.', a user said: 'Boss: would you be interested in shadowing this project? I think it’s teach you a lot about xyz\nPeople ITT: You’re a fucking bloodsucking capitalist vampire (making slightly more that me)\nA lot of folks in this sun should do gig work bc they don’t seem to understand the idea of deferred benefits or compensation'",
        "In response to 'Let’s be honest here. America is largely going through a transition similar to the Post-Soviet era.\nPeople forget that the Soviet states largely de-industrialized as well. And people aren’t usually aware that Post-Soviet citizens are only  “minimally ” less educated than their Western counterparts. Belarus I believe just surpassed Finland for the highest IQ scores in the European world.\nYet if you have lived in a Post-Soviet state like I have, nothing works, the infrastructure is poor, and people don’t value their work like the “quiet quitters” here today.\nAlmost 50% of the American labor force is in either retail, warehouses, gigs, deliveries or food services…. While this may have kind-of sufficed for a period…. the investment economy created an inequality crises and took its toll on the housing market, leaving people to prioritize the consumption of goods and manufactured experiences.\nWith inflation hitting us during a de-globalization related supply chain crises, now the goods that kept people mildly happy in the absence of the opportunity to own a home are out of reach.\nA large amount of the +50% of those in the service industry up-skilled to the point that there is a high supply of people who can perform technical work in IT and fields requiring college education. Leading professional white collar work to pay less. Supply and demand rules the labor force. (This could be negated with diversification into more manufacturing)\nPeople I know who did everything right before 2020 and finished their degrees/found full-time professional jobs are only doing “marginally better” than they were while working part-time at Target/restaurants during college.\nBeing able to have a “why” and “for” behind one’s work is now only reserved for the most prestigious of careers.\nWhile it’s too soon to tell if this is here to stay, I would assume that if it does, it’ll logically follow the same cultural trends of Post-Soviet states. A subtle understanding amongst the entire population that the only pathway to success for those not born wealthy is via lying, cheating, and stealing….. a key factor in what brought about the corruption cultures in states like Russia, Armenia, Ukraine and Kazakhstan.', a user said: 'Could you also say that millennials are agin out of mindless consumption and realizing that they can keep going to nice dinners but can’t afford houses or families?'"
    ]
}