{
    "username": "NILPonziScheme",
    "contributions": [
        "In response to 'I think that's just a standard contract buyout situation,  and may possible be used too hero with a salary cap if a league uses salary cap.\nFit instance the Blazers bought out Didi Louzada in the summer not because they can't afford to give him his 1.8 million, but because by rule they can use the stretch and waive policy to give him like 280k a year for 7 years, which might help the team get out from paying a much bigger  luxury tax bill.\nThe funny thing about the Bonilla contract is that the Mets did this one time deal with Bonilla because of BERNIE MADOFF. Then owner of the the team was invested with Madoff and he thought he was making so much money that it would be more profitable to invest the 6 million they owed to Bonilla with Madoff, which would make so much money that it wouldn't matter if they had to pay Bobby 30 million from 2011 to 2035.\nOf course they lost all their bogus investments, and even Madoff has died,  but they still have to pay Bobby for another 13 years!', a user said: 'IIRC, the Mets owner at the time used to put all of their operating cash in an account with Madoff during the offseason, and he'd give it back prior to the next season with its new earnings added in. Figure they did that a few times and it keeps working, he stops asking questions.\nAs for the Bonilla contract, figure part of the assumption is with inflation, $1.19 million each year will be worth less than $5.9 million and its potential earnings in 35 years. Fred Wilpon agreed to the deal because he figured by 2011 when the payments started, that $5.9 million would be $16.83 million (assuming Madoff kept returning 10% annually) in 2011 when the payments started. At that point, the annual return is still generating profit over the $1.19 million they owe Bonilla.\nSad thing is, the S&P 500 was outperforming Madoff's 10% a year at that time.\nBonilla also has a second deferred compensation deal with the Orioles and Mets that pays him $500k a year until 2029.'"
    ]
}