{
    "username": "Nixter295",
    "contributions": [
        "In response to '\"Quiet quitting\" er vel mer det å gjøre absolutt så lite som mulig men fortsatt ikke kunne sparkes, i.e. gjøre en dårlig jobb og bruke mest mulig arbeidstid på sosiale medier, mobilspill eller hva enn en kan fylle tiden med som ikke er produktivt arbeid.\nNoe som er litt annerledes enn hva jeg opplever ihvertfall de som intervjues her snakker om som virker på meg mer som \"act your wage\", blir man ikke kompensert for tiden man bruker på å svare på e-post utenom arbeidstid, så burde ikke det være nødvendig, står gjerne heller ikke i rollebeskrivelsen for da kan man lettere argumentere for kompensasjon, er bare noe \"en god ansatt vet å gjøre\".\nOfte er vel dumskap forklaringen, men har inntrykk av at der finnes en agenda for å spre forvirring mellom disse to begrepene, ihvertfall i amerikansk media, noe som kan gi mening da den ene er en sunn og fornuftig holdning som med fordel kan spres, mens den andre er en negativ ladet betegnelse på kollegaen som gjør at gjerne andre må ta i litt ekstra for å få ting til å gå rundt.\nHelt klart fordelaktig for de på toppen om vi fokuserer på Kevin som slasker på reddit hele jævla dagen fremfor det faktum at de forsøker å normalisere det at å jobbe litt ulønnet på fritiden bør kunne forventes av samtlige i grunn.\nEdit: typo', a user said: '\"Quiet quitting\" er vel mer det å gjøre absolutt så lite som mulig men fortsatt ikke kunne sparkes, i.e. gjøre en dårlig jobb og bruke mest mulig arbeidstid på sosiale medier, mobilspill eller hva enn en kan fylle tiden med som ikke er produktivt arbeid.\nNei, quiet quitting er å gjøre som kontrakten din kreve av deg, ikke mere og ikke mindre. Trenger ikke å gjøre en dårlig jobb av den grunn.\n.'",
        "In response to 'Dette er jo hva hele diskusjonen i tråden går ut. «Act your wage» gir mer mening enn «quite quitting» om du tenker over ordene som brukes.', a user said: 'Ja, men quiet quitting gjelder også å holde seg unna alt av jobb email og telefoner fra arbeid når du har fritid.\nHar ikke hørt så mye om det fra «act your wage»'"
    ]
}