{
    "username": "nlb1923",
    "contributions": [
        "In response to 'What does that mean? New blood wouldn’t help?', a user said: 'White blood cells.  Getting blood red blood cells and/or white is platelets.  Which chemo kills all the blood more or less but white blood counts is the dangerous one being low due to the increased risk of infection and getting sick.\nBut there are shots for boosting wbc/neutrophils called neupogen, neulasta etc. Filgrastim is the active ingredient.  Daily shots that boost WBC.   I had nearly 100 neupogen shots.  Plus red blood infusions and platelets.  Chemo gets delayed from low blood counts all the time, but with the shots and infusions counts can recover quickly.\nSo yes, new blood can help.  But there can also be a lot more involved and it isn’t as simple as just getting some new blood.  And typically the line drawn for completely stopping chemo is if it will kill you faster than the cancer and if it is working.  Because chemo is essentially the Drs killing all the fast growing cells, cancers are typically fast growing cells compared to “healthy” cells, same as hair.  Why hair typically falls out.\n(I can’t speak for all cases, not a dr)'",
        "In response to 'You have this mostly what I experienced as caregiver for my wife but some cancers simply won't react to the chemo and nothing you can do will help, especially given other side effects that you should never have.', a user said: 'Yeah, that is the line of stopping it.  If it works or will kill you first, essentially, obviously plenty of nuance to this and I’m being blunt about it.  I can only speak to what I went through as well, which was a stage 4 cancer and chemo (mostly “salvage” chemo, don’t think they call it that anymore, HDCT now I think).  It is some seriously rough stuff.  And I wouldn’t want to wish it on anyone, I’m just extremely lucky that was all more than 20 years ago.  And it is a surreal conversation with your Dr (I was 20 at the time) when they say “we are basically going to take you to the edge of dying with chemo, we know exactly where that line is and that is the only way to kill the cancer”.\nAlso, sorry you had to go through that.  I can only speak from a patient perspective which I honestly believe is easier to go through than a caretaker.  Because I witnessed how that is for the caretakers, the fact that you wish there was something you could do but just have to watch.  As a patient, I was almost oblivious to a lot of things if that makes sense, I think as a patient our brain kind of blocks out a lot of that.  And we are just doing what we have to do, so I can’t imagine how it would be to watch and not be able to do anything.  But I can say that the things that those who cared for me did will never be forgotten, even the smallest of random things.  Just sitting and watching tv.  Or telling jokes.\nAnd I don’t want to pry or anything so don’t share anything you aren’t completely comfortable sharing, but did your wife have Adriamycin (aka The Red Devil Chemo aka doxorubicin)?  I only ask because I know what cancers that is used for, most commonly at least.  But it was one that I had as salvage chemo and that one was terrible to put it mildly.'",
        "In response to 'I don't recall the chemo name.\nIt was actually two variations, and her cancer is genetic (chk2) which means both my kids have a 50/50 of getting it so as a caregiver, the process never really ended.\nThank you for the consideration as a caregiver.  It took a long time to face the facts, so to speak, but having to contend with being the dad of two amazing children, watching mom suffer for nearly 2 years now (she's finally on the mend), it's nothing short of emotionally draining.\nI burned out fast but luckily my union had in place a program that paid the remainder of my caregiver leave, meaning I was able to care for things in the worst times, with nearly no loss to my financial income, given that she was off work.\nI think that's got to be one of the worst aspects beyond watching your loved ones hurting, seeing how quickly a family can suffer fiscal insecurities just by being sick.', a user said: 'Thank you for sharing!  And seriously thank you for all you did.  Has to be the hardest thing anyone can do.  I know I was challenging to deal with at times, and 20+ years later I still appreciate (more really) how lucky I was to have the people around me.  I am hoping the absolute best for you, your wife (so glad to hear she’s on the mend), and kids.\nI will give you a somewhat funny story about 50/50 genetic odds.  A few years after I recovered from everything, my mom was actually rushed to the hospital one day from the airport.  Heart issues, turned out to be a somewhat rare condition where there is multiple extra electrical impulses to the heart (can’t remember the name) and ones it goes haywire it can cause a heart attack etc.  So she has to have surgery to repair it etc (all good after the heart surgery), and after the surgery my brother and I are there at the hospital and the surgeon comes in.  Tells us that we have to get tested because it is 50% chance it is passed on to the kids so one of us may have it.  Luckily for me, I already knew the answer because I had spoken with my Drs already and they told me there was zero chance I had it (I had plenty of tests before all the surgeries and in hospital, they would have found it), so I turned to my brother and said “I’m good, already talked to my Drs.  That means you have it!” Of course he got a little pale 😂, but he scheduled the test.  And he turned out clear as well, so we both got the lucky side of the 50/50.  (Not telling to downplay the risk or anything, just a funny anecdote. But one thing I did learn was life is short and to enjoy every moment you can.  Best of luck to you and your family, I am around if you ever need to ask questions for a different perspective or anything).'"
    ]
}