{
    "username": "No_Bowler9121",
    "contributions": [
        "In response to 'They're going to TRY stopping it by slamming us with a recession and massive unemployment.\nThat might kick the can down the road a bit, but only pisses everyone off even more, long term.', a user said: 'Im still waiting for guiatines'",
        "In response to 'While I understand your points, I am just not understanding why some people are so very triggered by this phrasing?', a user said: 'Because its being used by propagandists against the new labor movement'",
        "In response to '[Deleted or Empty Comment]', a user said: 'Because it calls you lazy for doing your job. It's classist propaganda'",
        "In response to 'Volunteering, no.  Not my job.\nTaking over new responsibilities that are part of the job description for other people, no. Not my job - literally someone else's.\nGrading/planning at home...yes.\nThis isa salaried job, not an hourly one, and we do not WANT to be treated like clock workers- it's bad for kids, and bad for professionals.\nIf you're being asked to write LONGER plans than before, you negotiate it as a salary bump.  Same with adding to our plates.  Our job is not \"working as long as we are in the building\".  That's not what salaries do - and our contracts\ndistinguish\nclearly, and on purpose, between \"in building hours\" and responsibilities, and sometimes we do a few hours of that at home - just like lawyers and doctors do.', a user said: 'You can't negotiate because of step ladders. We are salaried 40 hours non except. They need to give us our office hours back as its amoral to ask your employees to work more then their paid hours. Lawyers and doctors get paid a ton more and don't get summers unemployed.'",
        "In response to 'You misunderstand.  Salaried workers work to the task, not the clock.  Most of your contract is negotiated tasks.  The hours - not work hours, but \"in building\" hours - are part of that negotiation - just one thing we negotiate, not at all, by contract, the time in which those tasks are expected to fit.\nLow pay is a separate issue.  If you want it to stay lower than it should be, the fastest way to do that is to keep claiming we work to the clock.  Then no one will ask us to do professional tasks - they'll just can everything and say we are overqualified.', a user said: 'They say shot about us anyways I'm not worried anymore about what they say, the truth is we are overworked, they ask too much and don't deserve the labor we have given them at what they pay.'",
        "In response to 'Original Post: Quiet quitting could be the best thing for education. Everyone's definition of quiet quitting is different. Mine is not working outside of your contract ours. Work from 7am to 3pm and then you're done. No lesson planning outside of class, no chaperoning, no working gates unless it involves extra pay.\nWhen you ignore these boundaries, you overwork yourself, can't sustain the position, and you end up leaving the profession and in return your students lose a great educator.\nIf you can't do all the tasks a school asks for you to do during the day, that is not the fault of you, it is the fault of your boss requiring too much of you. If you continue doing these tasks outside of your hours you are effectively telling your admin that this is okay.\nWhen you put your value in working extra hours because it makes you feel like you are \"doing it for the kids\" you are doing the opposite long term. The precedent that teachers have to put so much time in outside of work is toxic and leads to teacher burnout. A shortage of teachers is not good for any educational system.\nI'd like to blame admin, government, or students but the easiest fix is in the teachers themselves. When we overwork ourselves, we effectively hurt education. Only work your hours and if you can't get your work done, let your admin know you don't have the time. Healthy work life balance can keep us going and bring more teachers into the profession.\nEdit: Sorry y'all. I didn't realize how problematic the term \"quiet quitting\" is. I am glad though that it brought some attention to the post which led to some good discussion. I will use a different term from here on out and I am happy a lot of you only work your hours or work your contract.', a user said: 'Use a better phrase, \"quite quiting\" in classist propaganda.'"
    ]
}