{
    "username": "No_Imagination_sorry",
    "contributions": [
        "In response to 'How did education debt become the one type you can't escape with bankruptcy etc?', a user said: 'Il start by saying my personal belief is that any education that could culturally or scientifically benefit us as a species should be free. I'm also in the UK and have some student debt but it works differently here.\nBut you could argue that clearing education debt because of bankruptcy doesn't make sense. In theory, if you claim bankruptcy then you have lost the advantages that the money you had afforded you. For example, you may have to change your living situation, sell expensive vehicles etc. You don't get to keep everything you bought with the debt, and get rid of the debt (in most situations, unless you're rich and doing it to avoid taxes or something, and everything is hidden in shell businesses).\nHowever, when you take bankruptcy you don't lose the qualifications you earned. If you think about it in terms of a thing you have bought, then they can't take that way from you because you can't pay it, so that would mean claiming bankruptcy would leave you with a supposedly benefiting from a free degree.\nClearing student debt then also becomes complicated because when the students went to college, they were aware of the financial situation it would put them in. They made a conscious choice with those details in mind. Some argue that it's not right that you take on debt knowingly, and then cry about it.\nBut then, here's me with £60,000 of student debt (interest free, sorry) and working a job with people who barely finished school.\nThe requirement for so many jobs to be a graduate, when they really don't require a 3-4 year degree, is ridiculous. So many people go to University because they feel they have to in order to get a good job, when our grandparents generation, or even parents generation, only had to go to education for a select few industries.\nThe whole adult education system is broken, and needs a rework. Globally.'"
    ]
}