{
    "username": "No_Mission_5694",
    "contributions": [
        "In response to 'Original Post: Quiet Quitting........ [External Link]: https://v.redd.it/oss4az9norxe1', a user said: 'This is how contractor companies delivered in the GMC vans prior to the branded-van program. No one actually had a problem with it. Anything even slightly breakable arrived via FedEx, UPS etc.'",
        "In response to 'Doing a good service for cheeked up pay is only enabling the system of customers and the company\nTake it out on the product and even the most settled in customers will reconsider ordering their nail polish, toilet paper, and the tried and true kitty litter', a user said: 'Interesting, I know exactly zero Amazon DSP drivers who would have a problem with delivering *only* toilet paper and nail polish, all day every day'",
        "In response to 'I don’t know, man. I’m out here finishing 200 stops in 8–9 hours, and there are people at my DSP knocking out 200 in 4.\nBut every time they rescue me and I don’t hand off the overflow from the totes they grabbed, I end up having to go back to houses they delivered to. And honestly?\nThey never seem to put much care into it.\nI just feel bad leaving packages somewhere that’s out in the open or hard for the customer to get to.\nLow-key… I wish I could move that fast. But not at the cost of doing it half-assed. Guess that just makes me an Amazon soy boy, huh?', a user said: 'Each route is custom-made for each specific driver. Anyone who is doing 200 in 4 hours isn't actually doing their own route, they have been hooked up by dispatch to have an easier route.\nSo if they are ratfucking the routes like that you really might as well leave the stuff out in the open, block driveways, etc and if a bunch of stuff gets stolen Amazon will figure out that it's because your DSP is the one ratfucking the routes and playing favorites.'",
        "In response to 'Lazy fucks', a user said: 'The Amazon DSP (delivery service partner) company gaslights them pretty hard to blame Amazon and blame the customer. So expect downvotes haha'"
    ]
}