{
    "username": "NoBiasPls",
    "contributions": [
        "In response to 'Except \"quiet quitting\" isn't a thing. If you're showing up to work and doing the job you're paid to do, then you aren't quitting. You're literally doing your job. It's an incredibly arrogant, upper class American notion to think that everyone who works should necessarily go above and beyond what they are paid to do and come up with a derogatory term for people who don't.', a user said: 'I think it applies better to certain roles. For example I'm a software QA engineer, and while our main responsibility is to QA the work being done we also have several other responsibilities likes contributing to process improvements, writing test cases for regression, improving old test cases to help new folks.\nThe thing is that these other responsibilities only happen when we have some extra time and so there's not always as rigorous requirements to make sure people get it done, and some just forgo these responsibilities because irs harder to be held accountable.\nThat is what quite quiting is imo, which in that scenario is absolutely just someone not fufilling their duties'",
        "In response to 'If someone isn't fulfilling their duties then there's already terminology for that, like underperforming etc. \"Quiet quitting\" is a derogatory term that's recently made it into workforce vernacular that's aimed at shaming people who do their jobs and don't go beyond that, by people who are attempting (apparently succesfully) to get their workforce to think going above and beyond their pay grade is standard.\nIf, in the scenario you describe, someone is failing to perform their duties then \"quiet quitting\" doesn't apply, because they're not actually doing the job they are paid to do.', a user said: 'I think the distinction is attitude, underperforming can be a result of inexperience or life factors outside of work as opposed to consciously not performing additional responsibilities because you know you can get away with it and don't care.\nEdit: I don't think you guys understand the nuances of certain professions.'",
        "In response to 'I think so, part of what I'm contesting is that there's nothing wrong with not performing additional responsibilities. It's not necessarily a case of \"getting away with it\", it's more a case of \"that's not my job\". It's a fine line for sure, but the term is clearly derogatory and aimed at making it seem wrong to \"just\" do your job, which is literally what you are paid to do.\nI'm saying this as a manager in a large organisation who got there by going above and beyond, and is still doing so in the hopes of continuing to progress. People I work with fit the definition of this term, but I strongly disagree with the characterisation because there is absolutely nothing wrong with the work they do. I'm perfectly happy for people to be at work when they're supposed to be, do the work they're supposed to do, pass on the work they're not supposed to do to someone who is, not do overtime, not be expected to deal with work when they're not actually there etc. As long as they're not underperforming or causing issues within the team, then that's fine by me. There is a line, like deliberately only doing the easiest work, but that's a breach of protocol that can become a disciplinary offense, so doesn't seem to fit the definition of \"quiet quitting\".', a user said: 'That's the thing, I just don't think it applies to a lot of jobs but in my case our responsibilities are very nuanced and imo it is absolutely getting away with it, the QA team as a whole has goals to improve how our teams function and those that do not put in that effort when they can just make the job harder for everyone else, but it's the fact that it's so subjective which makes it difficult to actually say that person isn't doing their duties. Over long periods of time the pattern is noticed as we are expected to describe what we contributed as far as these additional responsibilities go, but it can take a couple years for that pattern to be clear and actionable enough for anything to happen. And I'm my experience the engineers doing this find a new job every few years.\nI totally get how it can be a derogatory corporate term, but I'd personally use something just as accusatory regardless because it really is just some lazy engineer doing the minimum that they can get away with\nEdit: on the flip side I've actually done this before. During covid when my company refused to compensate me appropriately I just quite working basically. I automated my main responsibilities and did nothing for 6 month and not only did nobody notice I was actually constantly receiving praise for all my 'hard work' although I never knew what the fuck they were talking about'"
    ]
}