{
    "username": "noble_thief_",
    "contributions": [
        "In response to 'Ich glaube viele haben hier ein Falsches Verständnis von welchen Arbeitern wir eigentlich reden . nach den Kommentaren denken viele wohl an Kleine unternehmen mit 15 Angestellten wo auf termin Projekte abgearbeitet werden .  und der Chef jeden Persönlich kennt.\nDas ist aber nicht die Lebenswirklichkeit vieler junger Arbeitnehmer.\nstellt euch eher ein Callcenter für Vodafone Kundenservice vor, mit 500+ Mitarbeitern die für Mindestlohn Arbeiten und bei denen Jeden Minute Arbeit und jeder Tastenanschlag kontrolliert und ausgewertet wird.\nDas ist nicht enden wollende Fließbandarbeit, monoton, erschöpfend, keine Aufstiegsmöglichkeiten und Fleiß und anstrengung spiegeln sich in keinster weiße auf der Gehaltsabrechnung wieder.\nder Leistungsspiegel sagt du hast 6 Minuten Zeit um einen Kunden abzuarbeiten 8 Minuten für eine Mail. Dein Chef will aber das du es in der Hälfte schaffst da im Email eingang 50.000 Vorgänge Liegen und egal wie Hart du arbeitest dieser Stappel wird einfach nicht Kleiner.\nund dann musst du die JEDEN Monat sorgen machen wie du dich am ende des Monats ernährst.\nDiese Leute sehen das und wissen das so Ihre Arbeitswelt für den Rest Ihres Lebens aussehen wird. weil Sie eben keine \"leistungs- oder Karriere Menschen Sind\"\nalles was die wollen ist  ehrlich Arbeit für ehrliches Geld. Abrer das Geld reicht nie und Sie sollen das 50+ Jahre machen??? kein wunder das die sich schon mit 25 zurückgezogen haben.', a user said: 'Ich mache genau das in einem kleinen Unternehmen mit 11 Mitarbeitern. Meine Kollegin kommt in ihrem Urlaub rein, ist immer erreichbar, kommt krank in die Arbeit, macht Überstunden ohne Ende und ist noch dankbar wenn sie nach 5 Jahren eine Gehaltserhöhung bekommt. Ich mache das alles nicht. Und sie guckt mich an als wäre ich deshalb eine schlechte Person. Ich hab meinen Chef deutlich gesagt, dass ich bereit bin für bezahlte Überstunden oder Überstunden die zeitnah abgebaut werden können, dass ich im Urlaub nicht erreichbar bin und bleibe und dass ich, wenn ich krank bin, krank bin. Ich sehe das als normal, ich arbeite für Geld, nicht für die Firma. Ist ja nicht meine Firma. Ich mag die Firma trotzdem. Ich bin schwerbehindert, wenn ich mich stresse wird meine Behinderung schlimmer. Mir hat mal ein Arzt gesagt: „Menschen mit Ihrer Behinderung MÜSSEN so leben wie andere Menschen leben sollten.“ Und danach mühe ich mich zu leben.'"
    ]
}