{
    "username": "NoiseyTurbulence",
    "contributions": [
        "In response to 'Original Post: How to Approach Annual Review After I Quiet Quit Almost a year ago, my boss pulled some power move BS and I made two changes as a result: I took work email off my phone and stopped working more than the expected hours. No more extra from me - if an opportunity for a conference proposal comes and she doesn't mention it at the weekly meeting, neither do I. If she has a \"good idea fairy\" moment of something she's really like to see happen I just...don't.\nMy boss's boss knows my boss is a piece of work and after I confided in a colleague that I was thinking about leaving, I was rewarded with a raise.\nSo now we're at the year-end and I put together the end-of-quarter metrics. To do so, I pulled from last year's annual report, and holy hell while we've hit our metrics most of the \"extra\" stuff has fallen away.\nIt will be time soon for my annual review and next year's goal-setting. I'm wondering if anyone has any advice for the discussion. I'm thinking that no good comes of telling her that I'm done doing more than what's required, but I have to think it will be fairly obvious. Anyone have any good advice?\nFWIW we are a team of three, and we replaced the other team member last year, had someone for a little over a month who didn't work out, so I think I can play it off like some of my time was spent mentoring? I also want to stay in this job at least 5 more years because of some specific benefits and the hopes that my retirement-aged boss will quit in the next two years. Thanks!!', a user said: 'Lead with you exceeded strategic metrics. Make that your main focus. The extra is above and beyond that’s something you Boss should be worrying about.\nI was one of those people for the longest time at all of my jobs that went above and beyond for everything, and it was never appreciated. I was always the one that was the most overworked because my boss kept piling more and more work on me because I never complained or spoke up about it very often while my coworkers slacked off like unbelievably, even though my bosses knew they were slacking off they would still handle the work to me and I over the last five years started dialing way back and making myself look really busy even when I’m not so that my coworkers get an equal share of the work and I’m not the one doing all the work by myself anymore.\nThere’s nothing exciting or respectable about people that willingly overwork themselves so pat yourself on the back. You did a great job dialing yourself back and let them worry about anything beyond your normal job.'"
    ]
}