{
    "username": "north_canadian_ice",
    "contributions": [
        "The news media ignoring declining American life expectancy in favor of nonsense like \"quiet quitting\" is one of their most heinous lies of omission to date [External Link]: https://i.redd.it/5vgz6ij9blea1.jpg",
        "In response to 'It's also what happens when a significant chunk of the country decides not to get vaccinated during the worst global pandemic in a century.', a user said: 'It's also what happens when a significant chunk of the country decides not to get vaccinated during the worst global pandemic in a century.\nThat's only one of many factors:\nStudy: More Than 335,000 Lives Could Have Been Saved During Pandemic if U.S. Had Universal Health Care\nOverall, including both COVID and non-COVID patients, 211,897 lives would have been saved in 2020 with universal care. From the start of the pandemic in the U.S. to March 2022, those preventable deaths mount to 338,594.'",
        "In response to 'Original Post: The news media ignoring declining American life expectancy in favor of nonsense like \"quiet quitting\" is one of their most heinous lies of omission to date [External Link]: https://i.redd.it/5vgz6ij9blea1.jpg', a user said: 'If you type \"quiet quitting\" into Google News, you will find about 100,000 results.\nIf you type quiet quitting without quotations, you will find over 2 million results.\nIf you type declining American life expectancy into Google News, you will find 28,000 results.\nDeclining US life expectancy gets 61,000 results.\nDoes the news media focus on our lack of healthcare benefits? Our heinous work conditions? On why our lives are being shortened as cost of living soars?\nQuite the opposite - you even have NPR shaming workers for \"quiet quitting\".'",
        "In response to 'Same thing happens when searching for articles about shoplifting vs articles about wage theft.', a user said: 'Same thing happens when looking for articles about shoplifting vs articles about wage theft.\nWalgreens executive says ‘maybe we cried too much last year’ about theft'",
        "In response to 'I don’t disagree with your points, but “quiet quitting” became popular on twitter by everyday people, and was obviously used before that/before twitter. News media just decided to focus on that once it started going viral. When “declining American life expectancy” starts trending, then the direct comparison would make more sense (what a mouthful… hilarious to compare search results of that to a recently popular two-word phrase)', a user said: 'I don’t disagree with your points, but “quiet quitting” became popular on twitter by everyday people, and was obviously used before that/before twitter. News media just decided to focus on that once it started going viral.\nThe news media often ignores viral trends - they chose to focus on quiet quitting for a reason.\nThe news media almost always portrays quiet quitting as a bad thing for business - and a shameful thing for workers to partake in.'",
        "In response to 'Two word tag phrase vs 4 word sentence.\nOf course the amount of results is lower.', a user said: 'Declining US/American life expectancy is a pretty basic search term. That's how the issue is reported.\nWhat would be a simpler search term I should have used in your eyes to better illustrate the point?'",
        "In response to 'That's not the point, you are comparing what is effectively a slogan with a concept.\nThe fact that you are even demonstrating that there is multiple terms (US/American) makes it obvious that one is more specific.\nFor example, an article may be titled, reduced life expectancy for Americans, another may be titled, United States life expectancy on the decline, and another may be more sensational, like, Americans are dying earlier than other countries.\nAll three discuss the same subject, but might not all appear on the same search.\nQuiet quitting on the other hand is a popular phrase, nearly every discussion on the topic will include that phrase near verbatim (both supporters and detractors), and both words are generally more used in other contexts (as well as globally instead of specifying a country), so a search for quiet quitting may return results unrelated to the topic or unrelated to the US', a user said: 'That's not the point, you are comparing what is effectively a slogan with a concept. The fact that you are even demonstrating that there is multiple terms (US/American) makes it obvious that one is more specific.\nThe point of including both terms was to add up their cumulative search hits. Which still fell under quiet quitting alone did.\nJust because quiet quitting is a slogan doesn't mean you can't compare it to the sum of two 4 word phrases.\nThe fact there is no slogan for our declining lifespan is because the media ignores the issue! The media loves slogans for issues they focus on.\nQuiet quitting on the other hand is a popular phrase, nearly every discussion on the topic will include that phrase near verbatim (both supporters and detractors), and both words are generally more used in other contexts (as well as globally instead of specifying a country), so a search for quiet quitting may return results unrelated to the topic or unrelated to the US\nThere are other terms & phrases for quiet quitting. Especially in other countries.'",
        "In response to 'So the problem is that the news media has reported this only 60000 times? Also obviously more specific search terms are going to get less hits. \"US life expectancy\" gives 1.6 million news results. Also also when you search that the first thing that comes up is basically this exact chart.\nThis is dumb', a user said: 'US life expectancy\" gives 1.6 million news results\nUS life expectancy is too broad as it includes articles both positive & negative over the decades.\nQuiet quitting is a term coined in what, 2022?'",
        "In response to 'And most of the articles about quiet quitting seem to be criticizing the term. What's your point?', a user said: 'And most of the articles about quiet quitting seem to be criticizing the term.\nI would disagree with that.'",
        "In response to 'My guess would be covid deaths. America was hit hard thanks to denial. The years on the chart line up with covid.', a user said: 'The years on the chart line up with covid.\nNotice however that in other countries - their life expectancy has rebounded while ours continues to decline.'",
        "In response to 'Probably has something to do with the rise of anti vax nut jobs.  Also US is home to a lot of religious fanatics who will refuse medical treatment and deny science.  Remember the first settlers were religious fanatics, the world today would be a marginally better place if the mayflower had sunk in the middle of the Atlantic.', a user said: 'The antivaxxers definitely play a role - but many working class people were devastated by covid because they had to work sick & couldn't get healthcare & rest that they needed.'",
        "In response to 'But the chart shows that the dataset only goes through 2021.  I'm curious to see how the next few years go.', a user said: 'True, but you can see that even in 2021 life expectancy rebounded in other countries (but not ours).'",
        "In response to 'America is massive', a user said: 'America is massive\nAnd we pride ourselves on American exceptionalism & our massive wealth - making our declining life expectancy even more inexplicable.'",
        "In response to '\"Other countries\" and the data was cherry picked from over five sources. This is anything but complete.', a user said: '\"Other countries\" and the data was cherry picked from over five sources. This is anything but complete.\nThat's a strong claim. Can you point to me what you find cherry picked here? Here is the full study:\nHow does U.S. life expectancy compare to other countries?'",
        "In response to 'For comparable country average health spending in 2021, we used 2020 data points for the following countries due to missing 2021 data: Australia, Belgium, France, Japan, Netherlands, and Switzerland.\nThe methods section covers a lot just like this, if they didn't get what they wanted, it was omitted, if the data wasn't complete or didn't meet what they were looking for they seemed to switch the country on a whim.\nThe lines behind the blue one are representing countries, right? Why aren't they labeled? The blue line is an average, but an average of what? Just a set of countries, or a set of countries mixed up together when it suits them to make this \"average\" line?', a user said: 'The methods section covers a lot just like this, if they didn't get what they wanted, it was omitted if the data wasn't complete or didn't meet what they were looking for they seemed to switch the country on a whim.\nIncomplete data is a fact of life when doing studies - this isn't a reason to assign bad intentions to the authors.\nThe lines behind the blue one are representing countries, right? Why aren't they labeled? The blue line is an average, but an average of what? Just a set of countries, or a set of countries mixed up together when it suits them to make this \"average\" line?\nThey are labeled,\nas indicated in this image I uploaded pointing to Switzerland's line.\n.'",
        "In response to 'The second time you had to link something else to explain your original post, and you're acting like it's normal to just add things. For all I know, you just made that.', a user said: 'The second time you had to link something else to explain your original post\nThey are all the same source.\nThe first link was the study that the original post graph came from. The second link is an image I uploaded myself from the first link where I highlighted Switzerland. Thus debunking your nonsensical claim here:\nThe lines behind the blue one are representing countries, right? Why aren't they labeled?\nMoving on...\nand you're acting like it's normal to just add things. For all I know, you just made that.\nYou seem eager to malign my intentions when I'm being straightforward about my sources.'",
        "In response to 'Any data for anything past 2020 or are you uselessly fearmongering?', a user said: 'Any data for anything past 2020 or are you uselessly fearmongering?\nIf you read the study instead of maligning my intentions, you would know there is plenty of data in 2021 in the study.\nhttps://www.healthsystemtracker.org/chart-collection/u-s-life-expectancy-compare-countries/#Life%20expectancy%20at%20birth%20in%20years,%201980-2021'",
        "In response to 'The news covers Covid pretty intensely, or at least did up until about half a year ago.  And that’s clearly what caused a massive drop in it right around 2020.', a user said: 'The news covers Covid pretty intensely, or at least did up until about half a year ago.\nThat's not the same thing as covering declining life expectancy - and investigating solutions.\nAnd that’s clearly what caused a massive drop in it right around 2020.\nWhy is the US the only country where life expectancy isn't rebounding?'",
        "In response to 'Here is the link to the underlying report, digging into it it seems to largely be a story of a long divergence in the average life expectancy beginning in the 1980s.  Then in 2020 life expectancy falling through the floor for men with a lower decline for women.\nThe ten countries we are compared to all have better public options or single provider healthcare systems.  The US isn’t rebounding because these are future projections and without massive reform to our healthcare system people will continue to die at younger ages compared to people living in countries with better healthcare coverage continuing the trend that began before Covid.\nhttps://www.healthsystemtracker.org/indicator/health-well-being/life-expectancy/', a user said: 'The US isn’t rebounding because these are future projections and\nwithout massive reform to our healthcare system people will continue to die at younger ages compared to people living in countries with better healthcare coverage continuing the trend that began before Covid.\nWell said - this is the key point. And it's something the media neglects to cover when covering topics like the economy & workers. And the stranglehold corporations have over our lives.\nCorporations control our healthcare & the media tends to frame things from a pro-corporate point of view. So the media doesn't shine a light on the failures of our system - instead pointing the failures on individual workers who aren't doing enough to sustain the system.\nAs an example - as healthcare systems collapse the issue is framed as nurses not working hard enough. Instead of say, looking into why the nurses are so overworked & understaffed.'",
        "In response to 'I think you’re understanding how culpable the media is in all this. I’m not talking about individual reporters, but the guiding hands. I would say the United States has the most successful propaganda arm of any group in history, and almost everyone you talk to can’t point to a single thing they’ve seen and identify it as propaganda, when a huge amount of the news here and abroad (even foreign language news) has the intelligence communities fingers all over it (and what isn’t narrative spinning by the government is usually narrative spinning on behalf of the elites) It it truly fucked', a user said: 'I think you’re understanding how culpable the media is in all this. I’m not talking about individual reporters, but the guiding hands.\nAs Noam Chomsky said to a BBC reporter once -\nIf you believed different you wouldn't been sitting here.'",
        "In response to 'The post makes no sense.  Drop in life expectancy = economic failure?', a user said: 'The post makes no sense. Drop in life expectancy = economic failure?\nUnquestionably so, your comment makes no sense.\nThe economy is defined as the wealth & resources of a country. The US is failing to appropriate adequate wealth & resources to the health of our country.'",
        "In response to 'Isn’t life expectancy calculated by using death probabilities and averages? So anti vaxxers dying en masse in their 40s will bring down the number. Is there any methodology for life expectancy by political affiliation or region', a user said: 'Isn’t life expectancy calculated by using death probabilities and averages? So anti vaxxers dying en masse in their 40s will bring down the number. Is there any methodology for life expectancy by political affiliation or region\nIt's not just anti vaxxers:\nStudy: More Than 335,000 Lives Could Have Been Saved During Pandemic if U.S. Had Universal Health Care\nOverall, including both COVID and non-COVID patients, 211,897 lives would have been saved in 2020 with universal care. From the start of the pandemic in the U.S. to March 2022, those preventable deaths mount to 338,594.'",
        "In response to 'Is there a source for the life expectancy graph for USA? I searched but I could find no graph matching this one, only ones that disagreed such as\nhere\n.\nAdditionally, I have heard from fairly trusted sources that the biggest life expectancy drop in the US recently (at least pre COVID), was from the opioid crisis, and that drop was merely 0.2 years. This seems to contradict your graph.\nI might well be mistaken, I haven't done extensive study on this, but I would like to see some sort of source that backs up your claim.\nEdit: It seems I may have misinterpreted the graph, as such I cannot comment on its accuracy since I have no knowledge of recent life expectancy trends, my apologies.', a user said: 'Is there a source for the life expectancy graph for USA? I searched but I could find no graph matching this one, only ones that disagreed such as here.\nHow does U.S. life expectancy compare to other countries?\nAdditionally, I have heard from fairly trusted sources that the biggest life expectancy drop in the US recently (at least pre COVID), was from the opioid crisis, and that drop was merely 0.2 years. This seems to contradict your graph.\nThe point of the graph is to illustrate how the pandemic hammered our life expectancy unlike any other developed country. In 2021 - we were the only developed country to see a decrease in life expectancy.'",
        "In response to 'It's almost completey due to external factors.  Environmental factors play a huge role in the major cancers such as colon.   Obesity plays a role in cancer and heart disease, the #1 and #2 issues.  It plays a role in Covid mortality. Then you have the pandemic itself.  To blame labor conditions all of a sudden is a huge stretch.  No doubt working at Walmart forces unhealthy choices, so wages are a significant contribution there.  But it wouldn't dive like this all of a sudden.   For the vast majority of us we do have choices to live healthier and most of us do not.', a user said: 'To blame labor conditions all of a sudden is a huge stretch. No doubt working at Walmart forces unhealthy choices, so wages are a significant contribution there. But it wouldn't dive like this all of a sudden. For the vast majority of us we do have choices to live healthier and most of us do not.\nWalmart jobs result in people lacking insurance... which is tied to a much higher incidence of COVID death in the US (but not other developed countries that have universal healthcare systems):\nThe Catastrophic Cost of Uninsurance: COVID-19 Cases and Deaths Closely Tied to America’s Health Coverage Gaps\nThis report uses that research to address one fundamental question: If everyone in America had health insurance, how many people who contracted COVID-19 could have been spared, and how many who died might still be with us today? We find as follows:\nNationally, roughly 1 out of every 3 COVID-19 deaths are linked to health insurance gaps.\nMore than 40% of all COVID-19 infections are associated with health insurance gaps.\nBy August 31, 2020, health insurance gaps were linked to an estimated 2.6 million COVID-19 cases and 58,000 COVID-19 deaths. By February 1, 2021, 10.9 million infections and 143,000 COVID-19 deaths may have been associated with health insurance gaps.'",
        "In response to 'I don't disagree with that, but 58k out of a million Covid deaths is chump change.  It would not explain the drastic decline in life expectancy.  All countries are seeing this.  I'm not at all giving Walmart a free pass, but you gotta look at the data in holistic fashion and not just cherry pick it.\nThe life expectancy decline isn't due to any sort of labor issue, not in the short term.    Why?  Because those issues with Walmart etc are decades old.  It can't possibly explain a plunge in the last few years.', a user said: 'I don't disagree with that, but 58k out of a million Covid deaths is chump change. It would not explain the drastic decline in life expectancy. All countries are seeing this. I'm not at all giving Walmart a free pass, but you gotta look at the data in holistic fashion and not just cherry pick it.\nThe 58k is based on data up until August 31, 2020. Here is a more recent study from Yale:\nStudy: More Than 335,000 Lives Could Have Been Saved During Pandemic if U.S. Had Universal Health Care\nOverall, including both COVID and non-COVID patients, 211,897 lives would have been saved in 2020 with universal care. From the start of the pandemic in the U.S. to March 2022, those preventable deaths mount to 338,594.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'The recent drop has nothing to do with economics. That’s because of Covid.\nCovid only affected the United States?'",
        "In response to '[Deleted or Empty Comment]', a user said: 'Economics is not the explanation. It’s the diversity and demographics of our population.\nEconomics is the explanation:\nThe Catastrophic Cost of Uninsurance: COVID-19 Cases and Deaths Closely Tied to America’s Health Coverage Gaps\nThis report uses that research to address one fundamental question: If everyone in America had health insurance, how many people who contracted COVID-19 could have been spared, and how many who died might still be with us today? We find as follows:\nNationally, roughly 1 out of every 3 COVID-19 deaths are linked to health insurance gaps.\nMore than 40% of all COVID-19 infections are associated with health insurance gaps.\nBy August 31, 2020, health insurance gaps were linked to an estimated 2.6 million COVID-19 cases and 58,000 COVID-19 deaths. By February 1, 2021, 10.9 million infections and 143,000 COVID-19 deaths may have been associated with health insurance gaps.'",
        "In response to 'I mean, this likely has a lot to do with Covid numbers, which are going to screw with statistical analysis of age at death.\nWe’ll have to wait and see if it evens out.', a user said: 'I mean, this likely has a lot to do with Covid numbers, which are going to screw with statistical analysis of age at death.\nWouldn't we see this play out all over the world then? Why are other countries life expectancy rebounding in 2021 while ours is still declining?'",
        "In response to 'Compare vaccine hesitancy numbers in America to those of the other 10 nations, and you’ll likely see a correlation.\nPeople were dying of Covid in droves well into 2021, too.', a user said: 'Compare vaccine hesitancy numbers in America to those of the other 10 nations, and you’ll likely see a correlation.\nVaccine hesitancy is only one factor of many:\nThe Catastrophic Cost of Uninsurance: COVID-19 Cases and Deaths Closely Tied to America’s Health Coverage Gaps\nThis report uses that research to address one fundamental question: If everyone in America had health insurance, how many people who contracted COVID-19 could have been spared, and how many who died might still be with us today? We find as follows:\nNationally, roughly 1 out of every 3 COVID-19 deaths are linked to health insurance gaps.\nMore than 40% of all COVID-19 infections are associated with health insurance gaps.\nBy August 31, 2020, health insurance gaps were linked to an estimated 2.6 million COVID-19 cases and 58,000 COVID-19 deaths. By February 1, 2021, 10.9 million infections and 143,000 COVID-19 deaths may have been associated with health insurance gaps.'",
        "In response to 'How is the declining life expectancy related to economic failure (its not) and how does that relate at all to a heinous lie of omission?\nRelates more to fentanyl and the opioid crisis with a sprinkle of Covid, but again, does not have relation to a not failed economy either.\nI mean, yeah, make arguments, and push for reform, but god damn have some logic to it.', a user said: 'How is the declining life expectancy related to economic failure (its not)\nStudy: More Than 335,000 Lives Could Have Been Saved During Pandemic if U.S. Had Universal Health Care\nOverall, including both COVID and non-COVID patients, 211,897 lives would have been saved in 2020 with universal care. From the start of the pandemic in the U.S. to March 2022, those preventable deaths mount to 338,594.\nTo your next point:\nand how does that relate at all to a heinous lie of omission?\nIf you type \"quiet quitting\" into Google News, you will find about 100,000 results.\nIf you type quiet quitting without quotations, you will find over 2 million results.\nIf you type declining American life expectancy into Google News, you will find 28,000 results.\nDeclining US life expectancy gets 61,000 results.\nRelates more to fentanyl and the opioid crisis with a sprinkle of Covid, but again, does not have relation to a not failed economy either.\nYou can't separate our for-profit health care system from the economy. Especially when the arugments against Medicare for All always boil down to \"hOw aRe YoU gOiNg To pAy FoR tHaT\".'",
        "In response to 'This graph is super misleading.\nIt starts at 72?\nImagine if the nyse dropped from 90-89\nBuuut, if your graph starts at 87, and goes up to 92, then suddenly it’s called by half the graph, and it’s an economic depression.', a user said: 'It starts at 72?\nWhat developed country has a life expectancy under 72?\nImagine if the nyse dropped from 90-89\nBuuut, if your graph starts at 87, and goes up to 92, then suddenly it’s called by half the graph, and it’s an economic depression.\nYou're comparing this to the stock market lol. Here's the full data set, tell me what's wrong with it?\nhttps://www.healthsystemtracker.org/chart-collection/u-s-life-expectancy-compare-countries/#Life%20expectancy%20at%20birth%20in%20years,%201980-2021'",
        "In response to 'This graph makes it seem like we’re living 10-20% less than the rest of the world, it shows a sharp decline for what is 2 years. I’m not saying this isn’t a problem, but this graph is misleading', a user said: 'The graph isn't misleading at all dude, the x & y axis are labeled appropriately.\nNot every graph needs to start at zero.'",
        "Corporate media condemns job hopping & quiet quitting as \"disloyalty\", meanwhile Wall Street rewarded tech firms firing thousands of workers instanteounsly because they \"ripped the band aid off\" [External Link]: https://i.redd.it/bh1yrn4p6fga1.jpg",
        "In response to '[Deleted or Empty Comment]', a user said: 'You are on to something. The narrative is framed in the same way that an adult scolds a 5 year old when they disbehave.\nExcept we aren't 5 year olds who are disbehaving, we are adults trying to live our lives. This framing is because the rich are seen as superhumans in our caste system. And if we disobey them, we are in the wrong.\nIt's a simple conservative hierarchy, and the corporate media will always take the side of the ultra rich superhumans who want to\ninject young peoples blood\nwhile living on Mars.'",
        "In response to 'Even worse they are buying blood donated by others probably believing it will be used to save lives only for it to be bought and then resold to rich old people', a user said: 'only for it to be bought and then resold to rich old people\nNews story in 2033:\nIs Generation Alpha quiet quitting on their elders by neglecting their $20/hour weekly blood donations?\nMany baby boomers suffering from chronic conditions are raising the alarm that their quality of life is deteoriating due to a lack of Alpha blood. We spoke to a former CEO of a fast food company to bring you the latest:\n\"No one wants to work anymore, we know in the modern economy blood donations are a necessity for Alpha to meet their fudicuary obligations.\" said the former CEO, who wanted to remain anonymous. \"It's time Congress thinks about legislation, no one is thinking about my sore knee at the polo grounds when I can get only a pint of blood a week.\"'",
        "In response to 'They (the rich/elite) have incredible class solidarity. The work in unison to push messages which divide us (workers) along meaningless lines meanwhile theyre openly have meetings discussing how they can take as much from us as possible. Makes me want to do\nstuff\nya’know?', a user said: 'The best antidote to their class solidarity is to spread the good word of unionization.\nThis is how we win, and it may take us a while to gather momentum on unionization. But as the 60s showed, culture can change quickly. We have green shoots at Amazon, Starbucks, Apple, REI, etc.\nEven if there is no chance of your company unionizing, you can still point out to your coworkers the obvious hypocrisy of our current system. Like the loyalty the rich demand of us when they see us as plebs unworthy of job security or any respect whatsoever.\nWhen Bernie goes on FOX, he is doing the same thing - trying to win over a few people or at the least make them think about their views a bit. It's a long & slow game, but we have the right ideas & we must never give up.'",
        "In response to 'Yep.  The flood starts with a few raindrops.', a user said: 'And given the polling done on young people - it is clear that the majority of Gen Z are against the current economic system. The raindrops are accumulating fast.\nWe have our first Gen Z congressman, Maxwell Frost. The green shoots are there that were absent in 2013 in the wake of Occupy Wall Street.\nMillenials gave our current movement a test run in 2011 - the fight for $15 came soon after. Then Bernie's two runs brought the concerns of OWS to a mass consciousness with Bernie's empathetic & concise framing.\nGen Z has seen how unfair the economy has been to their parents & siblings. Our movement is gaining strength, the reason it seems hopeless at times is because of how batshit the wealthy have become in response to our movement.\nThey have decided its better to destroy the planet, our ecosystems, any hope that young people have. If the alternative is to pay higher taxes & not have biggest house, biggest money, bestest sports car, etc. But they've gone too far and overshot - and they've set the stage for a much farther left future.'",
        "In response to 'Gen Z doesnt vote or participate in local and state and federal elections.', a user said: 'What a bullshit statement dude, Gen Z is why Democrats overperformed in 2022.\nGen Z was the only generation to vote overwhelmingly Democratic. At a clip of 65-35.'",
        "In response to 'Here’s the 3 point cheapest solution for corporations to stop “Quiet Quitting”…\n1.)Offer great healthcare ( not some “high deductible” scheme/ shit insurance).\n2.)Offer more than 25 cent pay raises for every year served.  Even to part time employees.\n3.)Offer Four day work week.\nPizza parties are shit.', a user said: 'At this point, it's fair to say companies are willing to sacrifice profit out of spite.\nBecause their control & power over us is of utmost importance. And they hate us & hate that the pandemic inspired us to ask for just a tad more.\nIf even Walmart admits higher wages at their stores has led to better outcomes... there is no excuse for these companies to be crying about quiet quitting when they give 2% raises & demand a return to office'",
        "In response to 'I agree with you, but Walmart gave me my annual raise this month and it was... 2%.\nIt's good that they raised the starting wage again, though.', a user said: 'Walmart should be paying people $25/hour. They could easily still be profitable.'",
        "In response to 'fun fact, stock buybacks were illegal\nuntil Reagan', a user said: 'You are correct. There is no reason they should be legal.\nLook at BBBY and how much they spent on stock buybacks that they could have invested into the business & employees.'",
        "In response to 'It’s becoming very clear who went to private school together lol', a user said: 'How dare you plebs want a fraction of the lifestyle & benefits we enjoy for being born to the right family!\nLol'",
        "In response to '\"How dare you serfs try and stop the return of feudalism!\" /s', a user said: 'They want us to have zero self respect.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'This comment is so full of bullshit I don't know where to start.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'All of corporate media? CNBC, Fox Business, Bloomberg, WSJ, etc.\nThose tabloids may seem bullshit but they have a lot of sway over people, unfortunately.\nPretending their influence isn't there is unhelpful. Look at outlets like the Daily Mail in the UK & how much toxic BS they get people riled up about. It helped lead to Brexit.'"
    ]
}