{
    "username": "NoShock8442",
    "contributions": [
        "Is anyone in the process of “quiet quitting”? I’ve been at my job for 9 years. I work in a department where I get swamped daily and have been under staffed since covid. I’m burned the fuck out. I’ve asked management and HR for help to no avail. I dread every day I wake up knowing I have to go to work.\nI’ve tried to pare back my work load myself but my work ethic is too strong to just go in and dog it but now I’m to point where I don’t care. I make great money and the benefits are probably some of the best in the country but I’m not happy at all. I’ve looked at applying other places and have had call backs but I couldn’t pull the trigger and leave.\nI’ve heard of quiet quitting where you just go in and do the bare minimum. Knowing my employer they either won’t bat an eye or they will come to me and wonder why I’m not laying waste to any and all tasks like I used to which would be a mistake on their part as that would piss me off lol. Has anyone done quiet quitting or currently doing that?",
        "In response to 'I quiet quit last September. At first I thought it was just a phase but now nearly 6mo later I think this is my new normal.', a user said: 'Are you now much happier? Any blow back from the decrease in your work output? I feel like since I’m always short staffed I could get away with doing this.'",
        "In response to 'Have you tried talking to your manager about your workload and how it is affecting your stress levels and health? Their response to a serious discussion will most likely point you in the right direction for what the best decision is for you. If their response is something you don't accept as a solution, you will probably feel better about accepting another job offer.', a user said: 'Management and I use that term very loosely couldn’t care less who does what as long as stuff gets done. They don’t wanna rock the boat and are covered up with their own stuff to care about anything else.'",
        "In response to 'Seems like a lazy solution, better would be to find a more fulfilling job and continue to grow in your career.', a user said: 'Hardly a lazy solution. I’m able to do the job of five people that are on the shift before me and have been doing that for years. The solution seems more than appropriate. 1 person doing the work of 1 person now.'",
        "In response to 'The reward for hard workers has always just been more work.', a user said: 'Absolutely'"
    ]
}