{
    "username": "notapoliticalalt",
    "contributions": [
        "In response to 'The great thing is that WFH makes it possible for people to do so, whatever their reasons, which may change over time.', a user said: 'Yeah. I’m sure there are some people who are afraid, but my guess is that most people now simply don’t wanna go back to the office for other reasons. Bill Maher can whine all he wants but most people don’t wanna go back for a variety of reasons.'",
        "In response to 'I said this 4.5 years ago and will say this again: Japan has never learned the sociological/cultural lessons China did from Colonial losses in the 19th Century as well as the losses in WW2 and this will lead to their population eventually going the way of The Great Asian Panda; nearly extinct.\nFrom the xenophobia that dictates their immigration policy to the Ageism that dictates their Workplace culture Japan simply will not be able to exist in its current form in about 50-75 years.', a user said: 'I mean…it’s kind of hard to say that China doesn’t have some of the same issues that Japan does in terms of its workplaces. Sure, they have a bit more cushion, but China, Japan, and Korea all face some similar issues that revolve around their brutal work cultures.'",
        "In response to 'China is a land of practical solutions. If push comes to shove I fully expect the Chinese to import workers and subsidize Han Chinese people to have more children, very very similar to how Saudi Arabia and Dubai operate today.', a user said: 'China is a land of practical solutions.\nIn some ways that’s true, in others it is not.\nIf push comes to shove I fully expect the Chinese to import workers and subsidize Han Chinese people to have more children, very very similar to how Saudi Arabia and Dubai operate today.\nThat’s a massive piece of speculation and I suspect would cause a lot more domestic turmoil than they are used to. The whole reason they have oppressed and disappeared the Uighurs is because they view them as too different, a threat to unity. I really can’t imagine them playing well with Central Asians and Africans long term in China.\nAlso, economic subsidies don’t really appear to affect fertility rates significantly. I generally support these policies, but I also think it’s important to be honest that they don’t really move the needle on this. China currently has a lot of problems with its economy and they know a massive population decline is coming.\nI don’t by any means think this means they will collapse. In fact, I would agree China will probably manage the change the best of these three countries, mostly because of its resources and economy. But I still have no idea what you mean by the Chinese learning their lesson from your initial comment. And all of the reasons you listed as to why Japan is failing are found in much of Chinese culture as well.'",
        "In response to 'China is the next great world power assuming The US does not get involved in their future Taiwanese Endeavors... thats all u need to know. And clearly the people who upvoted got my intentions in the comments so I wouldn’t think too much about it. In like less than 48 hrs u will forget u even had this conversation anyway.', a user said: 'China is the next great world power assuming The US does not get involved in their future Taiwanese Endeavors... thats all u need to know.\nChina is already a super power, but I do not think it will be hegemon like the US was. It certainly has gained power from the US right now, but I don’t think they will be running the world on their own.\nAnd clearly the people who upvoted got my intentions in the comments so I wouldn’t think too much about it.\nNo…that’s really not an argument. Upvotes do not make something you say correct. I’m not even fully disagreeing with you, but I don’t know why you are saying things about one country as though they aren’t true about both countries. China has some very real problems that don’t go away just because they are a superpower.\nIn like less than 48 hrs u will forget u even had this conversation anyway.\nOkay…and?'"
    ]
}