{
    "username": "notmyworkaccount5",
    "contributions": [
        "In response to 'Why are people (Khanna and Favs) still doing “when they go low, we go high” in December 2024?', a user said: 'I feel like MLK Jr's quote about the white moderate is very prescient about the DNC and most liberals today:\n\"...but the white moderate who is more devoted to order than to justice; who prefers a negative peace which is the absence of tension to a positive peace which is the presence of justice; who constantly says, \"I agree with you in the goal you seek, but I can't agree with your methods of direct action\"; who paternalistically feels that he can set the timetable for another man's freedom; who lives by the myth of time; and who constantly advises the Negro to wait until a \"more convenient season.\" Shallow understanding from people of good will is more frustrating than absolute misunderstanding from people of ill will. Lukewarm acceptance is much more bewildering than outright rejection.\"\nBit of a long copy/paste chunk from his letter from Birmingham jail but every line feels like it still applies today. People like Favs feel way more focused on order and the process than justice.'",
        "In response to 'I need to reread that letter. I feel like growing up in the American education system we were only exposed to MLK in the context of nonviolent peaceful protest, with none of his more pointed writing directed at moderates and liberals.\nOf course we also only learned about Malcom X from the perspective that he was a radical.', a user said: 'He was also super anti capitalist which is almost certainly why the FBI had him assassinated and almost everything we were taught about him in school was a very white washed version of him.'",
        "In response to 'The usual army of \"the Dems have not made any mistakes and its progressives' fault for everything\" posters will swoop in to defend them soon', a user said: 'I'm starting to think those kinds of people hate progressives more than they hate fascists.'"
    ]
}