{
    "username": "NotsoNewtoGermany",
    "contributions": [
        "In response to 'Can we stop acting like this is a legitimate term and not just a way for crappy employers to shame workers?', a user said: 'Worse than that— this is an article written in silly season, which is why it's silly. Other countries call it cucumber time. Essentially, news stories drop in the summer because there is nothing to talk about, so journalists make up terms to describe everyday phenomenon in an attempt to make it seem like a story.\nWhat does silly season mean?\nFrom Miriam Webster:\n1 : a period (such as late summer) when the mass media often focus on trivial or frivolous matters for lack of major news stories. 2 : a period marked by frivolous, outlandish, or illogical activity or behavior.\nWhich this is.'",
        "In response to 'I don’t think quiet quitting is a thing. I think I’m fed up with being under-appreciated and underpaid and I’m no longer giving my employer extra time and effort that only benefits my employer would be a better choice of words\nAlso, yes I have been doing this for about a year now. I spent probably 9 years working my butt off. I worked unpaid overtime and illegally shifted work time around to make it work for my employer, I’ve worked shifts where I’ve repeatedly asked for help and received none, I was constantly coming in on days I had taken off and received very very little in return. So, I’ve started saying no and only putting in what is required of me.', a user said: 'Quite quitting is definitely not a thing— it came from an article written in silly season, which is why it's silly. Other countries call it cucumber time. Essentially, news stories drop in the summer because there is nothing to talk about, so journalists make up terms to describe everyday phenomenon in an attempt to make it seem like a story.\nWhat does silly season mean?\nFrom Miriam Webster:\n1 : a period (such as late summer) when the mass media often focus on trivial or frivolous matters for lack of major news stories. 2 : a period marked by frivolous, outlandish, or illogical activity or behavior.\nWhich this is.'"
    ]
}