{
    "username": "no-turning-back",
    "contributions": [
        "In response to 'Será que tem? Isso aí depende de setor para setor na real.', a user said: 'agradeço à TI por me permitir pagar de doido'",
        "In response to 'Por enquanto... Pq tu acha que existe atualmente um marketing tao grande em cima da area? Nao vejo isso durando por muito mais tempo.', a user said: 'Marketing é sonho de pote. Onde tiver algo que pareça um caminho minimamente viável de ganhar dinheiro vai ter gente falando que é a melhor coisa do mundo... Tipo aquela história de vender pá na corrida do ouro. A picaretagem do vendedor de TI no pote está em subestimar o tempo que leva para alguém se formar como bom profissional de TI.\nSobre a demanda atual e futura, hoje tem um trabalho acima do normal por estarmos em uma época de \"mudança de paradigma\" no uso de TI nos negócios (estrutura, dados, gestão, canais de venda...), e pouco profissional estava qualificado para esse trabalho. Isso que gerou esse boom de TI de agora, junto com o crescimento absurdo da acessibilidade à internet e a um ponto de acesso à internet com os celulares.\nNesse momento existe também uma dor dos empregadores justamente por estarem lidando com alta demanda e poucos profissionais. Aí existe uma narrativa de \"grande demanda\" e esforço pra formar gente, mas acho que o mercado atual está bem suprido. Pessoal está fazendo um esforço mesmo para abaixar os salários, mesmo que forme muito profissional bunda. Isso ajuda a inflar mais ainda o marketing.\nAí passado esse momento de transição (acho que mais uns 3 anos globalmente) a gente deve começar a viver um mercado mais estável. Acho que vai continuar existindo demanda de TI, mas não tanto uma demanda crescente da \"TI pura\" de hoje (que é uma demanda mais matricial/estrutural/alto nível). Mais uma demanda de \"TI aplicada\" às funções (na ponta do processo).\nEntão eu acho que esse pessoal da febre da TI dos dias atuais vai acabar sendo bem-vindo, não vai ser tanto esforço desperdiçado.\nAgora tem toda discussão de como a gente vai progredir na gestão da parte de \"TI pura\" que eu falei, que deve optar por equipes mais especializadas e centralizadas e isso tem suas consequências... Mas aí eu não parei pra pensar nisso kkkk\nSe alguém acabar lendo esse comentário e se interessando no assunto, um livro muito bom que resume o cenário de TI até o ano de 2008 é um do Prof. Fernando Laurindo da Poli-USP chamado \"Tecnologia da Informação: Planejamento e Gestão de Estratégias\".'"
    ]
}