{
    "username": "Nude-Love",
    "contributions": [
        "In response to 'A six hour work day would be great (and an hour lunch should be folded into that instead of weirdly tacked on as if you were actually free to use it as your own time and not just refreshing yourself to work the second half of the day). A six hour day and a four day work week would be even better. I think there have been very small studies showing that is ideal and most workers aren't actually putting in more than that, they're just trapped at their desks or in an office for the rest of the 45h instead of living their lives (and their output suffers because of it, although I suspect the capitalist overlords are less interested in a marginal increase in output to skim profits from than keeping people tired so they don't organize new social structures and realize the capital class serves no purpose).\nI think most office work could be done M-Th and businesses could largely be closed on Fridays. For service and support and retail jobs, those businesses are already used to managing multiple shifts and you could have some people off on Mondays and others off on Fridays, maybe with a rotating schedule for fairness.\nWhat is clear at least is that the current standardized nine hour, five day work week combined with the extreme productivity expected from each worker is destroying lives. It's amazing to think how little output was expected from the typical worker when comparing today with even just 30 years ago (and that's 20 years after wages and productivity stopped being correlated).', a user said: 'One thing I fucking despise about work is the whole unpaid lunch hour. Working from home, sure that's a legit hour off where I can do pretty much whatever I want with that hour. Unpaid lunch hour at an office? Oh sweet, guess I'll sit in the lunch room for an hour with sweet fuck all to do other than to talk to co-workers, which inevitably just leads to more discussions about work.'",
        "In response to 'My theory is the that value was never there to begin with- I just don't buy that most people are productive for 8 straight hours. We could probably shift to a 4x8 work week for most jobs and wouldn't notice a difference', a user said: 'I think I get\nmaybe\n4 good hours of work in when working from the office. Probably stretches out to 5 or 6 when working from home because of less distractions and I'm in a much more relaxing and comfortable environment.'"
    ]
}