{
    "username": "numbersthen0987431",
    "contributions": [
        "In response to 'My job just had a critical piece of equipment fail days before my vacation.  I worked 15hr days to shore up as much as I could before I went.  This was the expectation from management and I'm positive if they could pull my vacation they would have.', a user said: 'You mean the piece of equipment that you've been telling them to replace for the past 6-12 months?'",
        "In response to 'How did you know, lol', a user said: 'Oh you know, just a HUNCH, lol.\nI've worked in maintenance and engineering support. Maintenance crew comes up and tells me \"Machines A, B, and C need to be repaired\", and I put it on my list of equipment to inspect after asking the level of criticalness each repair was. The next day I inspect each machine myself to determine the amount of work to be done to get it up and running, put together the price for the repairs, and estimate the pricing.\nThen I present the information and get ignored for 6 months. Then I get called on a Saturday afternoon because \"machines are down and we have critical deadlines\", in which my response was always \"Per my emails the last 6 months: you didn't think these repairs were necessary, so I will see you Monday\".'",
        "In response to 'They should also give you a phone or pay you a stipend Towards your bill.', a user said: 'My company pays for my phone and the phone bill. I only answer text/email/calls if my boss sends me a message.'",
        "In response to 'Original Post: Had a fight with my parents over this “quiet quitting” trend. Somehow refusing to answer emails/phones outside of work hours is a trend and my parents think it’s just us being lazy. I can’t seem to make them see the reality. When they were young and working you could leave work behind by walking out of a building, not so anymore.\narticle', a user said: 'Who else had parents who always yelled \"I'M NOT HOME!!!\" whenever the phone rang?'"
    ]
}