{
    "username": "Obsidian-Winter",
    "contributions": [
        "In response to 'It's just the new buzzword for \"work to rule\", which has been a thing for decades.\nI don't like the phraseology around it, as it implies an action that shares similarities to quitting, when in reality it is people no longer willing to be taken for granted and go the 'extra mile' in return for shitty pay and rights.', a user said: 'I used to work for a broadband provider (in the days before fiber was a domestic product) and when they turned our call centre into a tech support centre they gave us training which basically amounted to \"follow this flow chart\".\nThat same flowchart (updated for fiber and images changed to show the new router cases) is available online now for customers to access directly via their mobile data (mobile data not really being a thing back when this story happene). That's how simple it is to follow but there is lots of redundancy built in where the flow chart methodically rules out a bunch of stuff that a competent tech support person will identify during the initial preamble.\nI was a decent tech support person so when Mr Smith or Mrs Bloggs calls up with X or Y problems I was usually able to identify what the issue was without using the flow chart which saved the customer time and meant my customer satisfaction scores were fairly high and my repeat callers were low.\nMy manager (a jobsworth who didn't know anything about tech at all and was barely able to manage the team) didn't like that I was deviating from the script and pulled me up on it frequently. It got to the point where I was told that if they found out I went off script one more time they would pull me into a disciplinary and start the process to fire me.\nOk then.\nFrom that day until the day I left I stuck to the (flawed) flowchart. This included not calling back customers if the call dropped. Not fixing basic stuff like internal setup issues (ie the time someone wrapped their wireless router in Christmas tinsel and couldn't figure out why they suddenly had no signal) and when we reached the end of the call I would make it clear that I did know what was wrong but that my manager (who I identified by name) had forbidden me from deviating from the flowchart and that because their issue isn't on the flowchart I am forbidden on grounds of dismissal from telling them. Then I gave them the complaints procedure gladly and talked them through how to get it escalated quickly.\nAfter a few months we were changed from tech support to debt management. Again, I stuck to the letter of the rules.\nMy manager didn't like that I wasn't \"using my initiative\" to try and sell expensive upgrades to people who were struggling financially, and when they challenge me on why I pointed to their threat of dismissal if I used my initiative. They didn't have a leg to stand on and had to drop it directly.\nI did end up leaving over it, but not until I was ready with a better job lined up. I have been with the new company for years now and haven't looked back.'"
    ]
}