{
    "username": "OccultMachines",
    "contributions": [
        "In response to 'I remember when I was getting burnt from work. I started doing the \"bare minimum\" doing exactly what my responsibilities and nothing more, timing everything so it'd take the whole day, same reaction. Was very weird, Ive been using that strategy for years now and... it works?', a user said: 'Yeah, I see these youngsters coming into the industry trying to do everything and \"make an impact\" and it's just like... you're bringing way more negative attention on you than positive. All anyone wants you to do is your job and literally nothing more. Mind your own business and don't step on anyone's toes.'",
        "In response to 'I work at an older company, not many young people there and many people have worked there over a decade or 2 and I can see why. The culture there is “Stay in your lane. Leave at 5, you can pick up anything you didn’t finish tomorrow, don’t work after hours.” They actually respect work life balance and no bullshit “you need to be a team player!” that is common in many shitty companies.\nSo much better compared to my last job where I got in trouble cause I wasn’t finding things to do on my own when I didn’t even know what else I\ncould\ndo nor did I have the time. Oh and they were trying to implant illegal policies regarding lunch breaks too. My current work was such a breath of fresh air and pay significantly more as well.', a user said: 'Yeah, same deal here really. I've actually had my manager talk to me about not doing work that wasn't my responsibility lol.\nAt a previous company we had a junior (who already overstepped quite a bit and tried to be a \"big guy\") who threw a fit mid-meeting and actually yelled and slammed the table because we weren't sprint planning \"in the way he learned in the Agile training course\" and just... wow. Way to ruin the way coworkers look at you for the rest of your career. This was also a company where you kind of had to \"look for work\" even though you were employed though. Lots of people laid off after we lost some defense contracts because of their \"Lack of billable work.\" I hate places like that and will never work at one again. It's the managers job to secure contracts and find work, not ours. Not our fault y'all fucked it and lost our only contract.'"
    ]
}