{
    "username": "oddmanout",
    "contributions": [
        "In response to 'Uhm no. Older millennials graduated college after the dot com bubble burst. There was no work. Then we went to graduate school. Then the GFC happened.\nAbsolutely refute this notion that older millennials had it easier.', a user said: 'Yup.  Older Millennials were the ones who started college right when the prices started skyrocketing and graduated right when the recession started.  The lucky ones who got jobs were either soon laid off or were working for 1/2 of what they should have been making.\nThey had a long time recovering too.  Even when the economy recovered, they had graduated 5-8 years before, so when they were trying for those entry level jobs, they were up against people who had just graduated universities, so of course, they looked better on paper.'",
        "In response to 'Yep, graduated high school in 98 and my inner circle for the most part never caught up wage wise.', a user said: 'Same, I graduated in 99.  I'm friends with people from early 40s down to late 20s, and the people who graduated college right into that recession have never recovered.\nThe biggest problem I see is that TONS of them were never able to get a job in their field. By the time we were out of the recession, they had been out of college for like 8 years.  When they went for those entry level jobs that were finally available, they were snapped up by recent grads.  So we have people with biology degrees working as line-cooks and security guards well into their 40s.'",
        "In response to 'Hey that's me! I graduated college in 2004. Managed to find a job. Laid off in 2009. Went back to school in 2010 because I couldn't find a job. Graduated with masters in 2013. Found a job. But because of the timing, I couldn't buy into the market in 2008 which all of the houses would have paid for it self 3x by now. Not to mention the lost years of working experience, student loan debt, etc, etc.', a user said: 'Yea, this is what a lot of people are missing. Older millennials may have ended up in the same spot by 2013 as the younger millennials, but they were 8 years behind in savings, retirement, job growth, home ownership, etc.\nNot to mention most of them were 8 years out of their industry so when the jobs finally opened up, they were up against recent college grads, which put them at a disadvantage, meaning a lot of older millennials ended up in jobs they didn't go to school for, making far less money than they should or could have.'",
        "In response to 'Older millennials did have it better.  If they got a salary job before 2008, even if let go for years, they were able to get back on their feet.  Middle millennials (≈90% of them) had it the worst.  Once they were ready for a job there was 300 people applying for every McDonald's position, let alone the rest of the economy.  When jobs did open up the economy was afraid to hire them due to how long they had been looking for work, choosing the younger millennials over the middle ones.  The younger millennials had it the best.  Get out of college, struggle to get a job, but if you landed one you were golden.  Not golden in a Silent Generation or Gen X kind of way, but you had a stable job and could pay rent golden.  Meanwhile Gen Z has it the best since the Gen X and they have absolutely no clue.  Most of the bitching on this sub is embarrassing.  Gen Z might as well be rebranded as the privileged generation.  Too lazy to Google a simple question?  Ask someone on Reddit instead and get angry if they tell you to Google it.  You have to work to get a job?  Oh no!  Not that.  Every generation after The Silent Generation had to do that, but early Gen Z got a rare couple of years where jobs were being handed out like candy and they thought that was normal.  That was the best it has been since the 1950s.', a user said: 'If they got a salary job before 2008\nNot a lot of them got salary jobs and those who got the salary jobs before 2008 were generally the first ones laid off. Then they were competing with the middle millennials later for entry level jobs when the economy got better, except they had been out of college and out of work longer, so it was much harder for them to get good jobs.  If a company is looking for an entry level software developer and one guy graduated 5 years ago and has been a bartender since then and one graduated 2 years ago, they're going with the one that graduated 2 years ago.\nThen long-term recovery of older millennials is much worse.  Because they sat in a job moratorium for half a decade longer than others, they were older, had little or no savings by the time they were 30, are way behind on retirement, and had long gaps on resumes.  A LOT of them were never even able to get into a job in their field, and that ship has sailed.\nI'm in my early 40s.  I got in just under the wire. I got a salaried job while I was still in college so I was lucky.  I'm also friends with people from my age down to late 20s.  Most of the mid and younger millennials have bounced back but the older millennials haven't.  They're doing much better, but they're approaching their 40s at the same place in their careers as people approaching their 30s.  Because they sat for 5 years and were passed by the younger generation, they're a good decade behind where they should be.'",
        "In response to 'You do realize 42 and younger is an older millennial, right?  It was the people who are 35-37 right now who got shafted the most.  Those are middle millennials.', a user said: 'Yes, I am. Like I said, I'm in my early 40s.  I've watched this play out for the past 20 years.\nIt's the older millennials (who are around my age) who have not recovered nearly as much as the others.  The reason is that when the economy finally recovered and entry level jobs started showing up, they had been out of their industries for 8 years competing with recent grads for jobs.  Those jobs went to the recent grads.\nA huge chunk of older millennials ended up in fields they didn't go to school for, making far less than what they could or should have.  They're also 5 years behind the middle millennials when it comes to savings, retirement, and buying homes, which means they're going to be less prepared for retirement.'"
    ]
}