{
    "username": "Odeeum",
    "contributions": [
        "In response to 'Original Post: Why is quiet quitting even a thing in America? I mean, in Western Europe you're supposed to forget about work once you've spent your 8 hours (hour and a half for lunch and breaks included) at the service of the company.\nI can't understand why is quiet quitting even a thing... How could it be \"quitting\" to do just your regular job and refuse to do overtime or completing tasks outside of your job description? Isn't that what you were hired for? Why should you do unpaid extra work?\nThis mindset of \"you must sacrifice yourself for the company and you must be happy about it\" is downright exploitative and undermines any kind of work—life balance.\nIn countries like France, even contacting an employee during their vacation period may get the company into legal trouble, that's the standard in the developed world outside America.', a user said: 'I didn't realize the chasm of difference between worker and employment mindset between those in europe vs the US until I started working closely with them.\nIn the US you are (or were?) brought up to value hard work ethic over so many other qualities in life...to the point where it has become pathological.   It's almost this \"red badge of courage\" in the US to say how many hours you worked last week...how little vacation you took last year...how many times you had to work during your vacation.  It wasn't until I worked with some folks over there that it really drove home the point to me that we were the ones that were wrong and not the EU.\nThey got to take vacations and didn't take a laptop...or their workphone.   After hours work was not a given and do not call someone on the weekend.\nAnd I slowly realized...the business was fine...nothing caught on fire because they didnt' answer their mobile.  The company didn't go out of business...we still remained profitible.\nI think the younger generations knew this was bullshit from the get go however and really don't fuck around with ruining ones life, marriage, etc to make a bunch of executive twats rich.'"
    ]
}