{
    "username": "OEKae42",
    "contributions": [
        "In response to 'I’m not sure I entirely understand this concept. isn’t the whole idea to only work while your paid? I thought   it was illegal to require work that isn’t payed for? Idk as an employer I hardly expect my employees to answer the phone when they are off, let alone work.  At most I text them and I don’t expect a reply.  I assume that what this is about right? Or is like when your an office worker and ur boss tells you to go clean the bathroom because someone made a mess, or something way outside your job description, and refusing to do that? Because that line is a bit harder to draw depending on the job. Like if I’m a dispatcher but I get sent on a sales call, seems silly to protest that if it’s good training/not that far off of what you Normally do, but I get not wanting to clean the bathrooms. Idk once I had a job that wanted me to go above and beyond and I remember telling them at the start “I’ll work the hours I’m payed.  You want me to stay late, sure but that would be overtime pay.”', a user said: 'Think even lower tier. Grocery store employee paid minimum wage to stock shelves, but Brandy called in so now you get to stock the shelves\nand\nrun the register. But now Tom got hit by a car at the start of his shift so you now get to go fetch shopping carts so that customers have them to shop with and it's past the time your supposed to clock out and go home. You ask about it and the manager just shruggs it off telling you to be more of a team player and counters by asking why the shelves aren't fully stocked, that's your job, and hurry up and clear the line of customers.\nThis leads you to working three people's jobs for the pay of one, and you are expected to stay late without warning.\nPeople who are acting their wage will drag their feet, stocking half assed, not bothering to greet the customers, and saying fuck the carts further out in the parking lot. Or they might just leave at their time to leave and challenge their managers to risk firing them when they are already understaffed as is.'"
    ]
}