{
    "username": "OEWorker",
    "contributions": [
        "In response to 'Clearly that has worked very well in the short run. But what happens when those laid off people run out of money and max out their credit cards? It's not like they can get other jobs when other companies are also laying people off. Where will new customers come from who can spend enough to keep profits high?', a user said: 'I had this conversation recently with my wife. There will be a huge issue because people won't have money to spend.\nFirst time in history just very recently like a few weeks ago that credit card revolving balance is for the first time higher than paid off credit cards.\nCompanies don't realize they need a customer base to buy their products and that said customers are employees of other firms....\nGonna be interesting to watch that dumpster fire once corps run out of customers because they don't give their own people money to buy from each other'",
        "In response to 'I’ve been saying this same thing for years. It’s so mind boggling to me that our govt & corps haven’t learned after all of these “social experiments with tax payer money” that the trickle-down effect does not work to support the greater good.\nThe most obvious social experiment was during the pandemic when govt touted keeping corps & big businesses afloat by giving them money directly instead of giving enough money to the consumers to pay for said bills/products being offered by these companies. The free market/capitalism doesn’t work well if consumers can’t afford the products!', a user said: 'Yet funny enough when the stimulus checks came, people spent it and survived.\nThis should be the lesson out of this. Not to forget how many people abused the PPP loans for lambos and ferraris and what not.\nMy boss at the time read the fine print for like 1-2 weeks before deciding not to take it because I suppose you have to be super super detailed with it or else the govt gonna come crashing and demanding money back and penalties and shit. He didn't feel like going through with it. Clauses about not firing people, additional paperwork if hiring more people, etc. Etc.\nPlus we didn't need it because as essential business we just kept operating, lol.\nBut yeah back to the point - you are 100% right. Money needs to go into people's hands, not the corps, they will hog as much as possible and only hand out empty promises.'",
        "In response to 'Byt thats the general rule, less you engage more likely for promotion you are and more you more you work more probable noone would like to loose that ;)', a user said: 'Yup. Because you become too important as a contributor that it becomes hard to move you out of your role cuz while busting your ass turns out you do the work of 3 people, lol.'",
        "In response to 'This hits close to home. I'm not OE but I'm interested in it. I've been in the same role for 15 years without so much as a title change, despite complaining about it 5 years ago. The only upside is that my job is easy. They give me a raise every year but I'm still underpaid in the job market for my skill set. We're supposed to have 4 devs but we only have 2. Why? Because I do the work of 3 people. Instead of promoting me, they just decided to save money and have fewer devs on staff.', a user said: 'Sadly that is how smart business works. Just start slowing down and build evidence you need more people and then start advocating to lead the team of new devs especially since you should be interviewing them anyway as you understand the job the best.'",
        "In response to 'It's only smart until the person doing 3 jobs leaves.', a user said: 'That's like how I said, once I get to boss levels of that authority I'd compensate and take care of that person adequately.\nWorkers exist to create business value aka money. However, business never compensates workers anywhere close to their actual value. And ofc you can never compensate a worker how much money they make you as a company since that would be anti profit lol.\nProfit = customer $ - employee $ (essentially in my book)\nBut employees are way underpaid anyway. If an employee gets paid $100k/yr, only 2 weeks vacay and gets micro managed but is worth $300k to the company, there is a problem.\nBut hey how else will CEOs make 100,000% of average employee income, right?'",
        "In response to 'oh.  oh wow, that makes a lot of sense.  when you become too efficient at your job, you become too valuable in that position.', a user said: 'Exactly. The shitty part is that companies don't give you the paycheck of 2 or 3 people.\nFunny enough every bachelor's and masters degree in business administration would teach you to freaking value your employees. One of those disconnects between ideal and real life.\nAnd the crazy thing is it causes huge amounts of brain drain. Google and other corps be promoting engineers to managers while they are sucky managers but genius coders.\nIt would be way more efficient for the org to give them a raise and let them be coders and mentor other coders rather than go actual manager level.\nI wish I become C level at some point in my life to make these decisions. Because too much talent goes to waste in management level. Some people just prefer being contributors and if they are elite they should get compensated adequately.'"
    ]
}