{
    "username": "Ok_Butterfly_46",
    "contributions": [
        "In response to 'Original Post: When you quiet quit/ride it out till you get fired, it negatively affects others in this community I had a teammate who had been dropping the ball for a while and was finally let go this week. His output was so bad that my manager noticed and did some digging. Turns out he barely worked at all and was clearly just coasting till he got fired.\nWell, my manager and skip are PISSED and literally called out how they think our old teammate was working multiple jobs. In my xp, they definitely were as they had many signs.\nRegardless, it’s now coming back to bite my team and me with new policies. Yes I’m pushing back on all the BS coming our way and trying to minimize it, but I wouldn’t be surprised if activity monitoring software came up soon to flag suspicious activity as well. This gig has been great for OE for years and now it’s in jeopardy because someone couldn’t just quit when they were done… I have friends (OE and not) at multiple other companies who are dealing with fallout like this as well.\nMy point being, when you pull the anti work card and coast like this just waiting to be fired (which I see recommended here daily), it’s not an isolated event. You get your bag a bit bigger and your teammates (and fellow OEers) deal with the fallout.\nIt helps to push for more RTOs that may have not as it eliminates the possibility of many of these issues. This also affects remote offerings (wayyyy down from what I’m seeing myself in new job hunts)\nHow would you feel if others put your extra paycheck(s) in jeopardy?\nGet your bag, but don’t screw others over while you do it.', a user said: 'Companies must define clear KPIs to measure productivity, and act quickly if they are not met.\nSome of us here have OE’d for longer periods because we still deliver to those goals. OE doesn’t always mean we slack it off.\nIn many cases, we’ve gone to higher positions making 30% more and working twice as much. With OE we stepped down to be a highly effective IC and still put in the extra time, yet now I’m putting that extra effort in another company and making 100% more instead of 30%. It’s just logical.'",
        "In response to 'No they don’t. You’re wishing for something that just isn’t a thing.', a user said: 'What I’m saying is companies create the environment for slackers to thrive. No matter if they OE or not.'"
    ]
}