{
    "username": "Ok-Camel2429",
    "contributions": [
        "In response to 'Original Post: Is Quiet Quitting now a thing for Jehovah's Witnesses? So many posts here related to Memorial Season for the Jehovah's Witnesses Organization make me feel like many \"active\" JWs are simply engaging in Quiet Quitting. These JWs are not DA, DF'D or PIMO even but they are just doing less....not showing up for in-person activity....not very engaged as a JW anymore. It is great to see this and the growth of this EXJW Sub too.\nReally the most effective thing that can be done to damage the harmful Jehovah's Witness Organization is to simply stop supporting it with your time or energy. Stop volunteering, stop showing up at as many meetings, stop participating if you can.', a user said: 'My friend who’s PIMR (relaxed), was crying the other day about they don’t enjoy being around witnesses anymore. They felt bad about the fact that they don’t enjoy meetings, memorial, assembly.\nThey know that I’m PIMO, about to be POMO. They do just about everything that I do even though they still believe. Maybe it will catch on to them that they’re wasting their life in the org. It’s clear being in the hamster wheel is not doing them any good, but they just need “something to believe in”.'",
        "In response to 'was crying the other day about they don’t enjoy being around witnesses anymore\nInteresting comment and thanks for sharing that. Me and the PIMI spouse have talked about this for a really long time now. Basically, that many of the JW relationships we have are very shallow and the people that we can choose as friends in JW Land have so many problems that is difficult to really be friends with anyone.\nJWs are either taking depression medication, alcoholics, mentally unstable or in many cases trying to survive while basically living in poverty. How are you going to develop close friendships if the people you are picking from have an endless number of problems.', a user said: 'Exactly! I can’t attribute all of their issues to the org, but the main friends they have are me and another POMO.\nMy friend just doesn’t enjoy the company of witnesses, because they are in fact shallow, judgmental, and immature.'",
        "In response to 'That's just it. Many need something to believe. Other religions will keep you despite small differences in doctrine opinion. They would busy themselves with your career choice. They won't berate you to work free. That is the difference here. I am sure catholic is just as big a scam. But you can be catholic and also be left alone', a user said: 'Yep! I’ve told my friend about why I’m leaving. The details of doctrine. They just dismissed it. They were PIMQ for a time previously, but just reasoned that since there’s “nowhere else to go” that they should just stay.\nWe have/have had discussions about all of the normal people (I hate saying worldly now) things that we would have done had we not been born witnesses.\nI don’t know what they’re going to do in the future, where they stand with their faith.'"
    ]
}