{
    "username": "-Ok-Perception-",
    "contributions": [
        "In response to 'It makes sense.\nWhen your younger it's easier for employers to convince you that by doing\nEVERYTHING\nthey demand it'll have a positive impact on you in the long run (raise, promotions, etc.) But then you get older and realize that you could be the top performer in the office for 6 months straight and still get passed over for promotions you apply/interview for because an older candidate with no experience in your department who worked for the company remotely for 3 years applied instead.\n(Sorry I might be projecting my experience a bit)', a user said: 'In blue collar labor, both raises and titles only come if they like you.  Hell, even the expected minimum payment for that job won't be delivered on if they don't like you.  They'll have you do all their work without even having the title.....  and dumbass young guys will do it, because they're still convinced hard work will get you ahead.\n​\nIn blue collar work, there's always those that are liked and do very little (and make the big paychecks).  And the guys actually doing all the work that will be relentlessly smeared and \"politicked against\" because they don't gossip, politic, and control the narrative all day.'",
        "In response to 'Lucky. I work in a factory, and they consider reading a book a waste of time.\nI could spend the hours of downtime BSing with coworkers no problem, but open a book and someone will come over to tell you to stop it.', a user said: 'Little tip for someone doing blue collar work with a bunch of rednecks.\nDon't try to act smart or show intelligence in any way.  You'll have them leaving all their work for you to do as they go to smear you with the management for laziness and fucking up.  They'll sit around and talk all day but you'll be the lazy fuckup because enough unified dumbasses can control the narrative in a \"good old boys club\".\n​\nIt's a very strong unspoken rule amongst rednecks that you're never supposed to be \"smarter than your station\".  They'll absolutely love you if you always play one notch dumber than they are.\n​\nDon't crack out books, don't talk philosophy, psychology, or history.  Never disagree with the right wing fundamentalist talking points.  And if you really want them to love you, act interested in Jesus.'",
        "In response to 'Huh. This explains a LOT of trouble I went through before I found a career that makes sense for me.', a user said: 'I learned it the hard way too.   Now I'm the dumbest man in the crew and they love me.'"
    ]
}