{
    "username": "Ok-Wave8206",
    "contributions": [
        "In response to 'Remember to create a burner email to post the review. I hate hearing this. It makes me regret them being my one card for emergencies. Bastards.', a user said: 'All credit cards make their cash off of drowning poor people in debt and killing what little chance they had to claw their way into the middle class. In the US the only higher cause of bankruptcy is medical debt (another ridiculous system designed to drown the poor). They also take a huge chunk of the middle class and ruin their future; forcing them and the next generation into poverty.\nAll credit cards are ran by scum, it’s a purposely evil system.'",
        "In response to 'Credit card companies prey on people who can’t control their instant gratification impulses. The real problem with them is how they double dip society the interest rates they charge are as bad or worse than what a loan shark gets. Then they turn around and charge the businesses that excepts them a percentage. Personally I use them for the convenience. In over forty years of using them I proud to say I have never paid a penny in interest on them. There’s another problem with them that is getting more popular, a lot of businesses are starting to carry their charge over to the customer. I’ve actually had businesses remove the card payment and then paid it in cash. I know this sounds a little petty but you have to look at it as all these little charges add up. The main reason for using them is the cash back option on the better ones but that is useless if you are carrying a balance on one.', a user said: 'Couldn’t agree more, all of my grocery shopping goes on my credit card because I get 6% cash back on groceries. If you have the cash it’s a very useful way of saving a bit of money, but only if you’re already in financial circumstances that guarantee you will NEVER miss a payment.'",
        "In response to 'What do you mean by taking the next gen into poverty?  I got loans in my name only for my kids’ college and they die with me. They are debt free and I plan to keep it that way.\nThey all have jobs to pay for expenses and some rent but they are not going to start 80k in debt. I currently have 140k in student loans between my MBA and their college and I have 1 more to go.', a user said: 'There’s a huge difference between debt from loans and debt from credit cards. If you’re late on a loan payment the interest rate won’t shoot up to 28% trapping you in a situation where you can’t even keep up with interest. Like it or not people who declare bankruptcy effect more than just themselves. Their kids are\nmuch\nmore likely to remain in poverty, at least in America if you’re raised in poverty you are most likely going to die in poverty. Taking away the middle class life has long reaching impacts.'"
    ]
}