{
    "username": "Ok-Willow-9145",
    "contributions": [
        "In response to 'Original Post: How to quiet quit without being detected after being known to be an extra-mile person at work? Firstly, I know - quiet quitting is just doing your job and nothing extra. Stop repeating the chant.\nSecond, I was known to be THAT person, who goes out of his way to help. I guess I associated my self worth with how company values me.\nIt took a couple of a years and being passed over a promotion to wake up.\nI cannot quit at the moment, or change jobs, I have been looking and nothing suitable on the horizon yet.\nThe question is how do I make the shift in attitude without getting so much attention especially that I am known to be a hard worker.\nEdit: Thank you everyone! Very useful tips! Read every single one! 🙏', a user said: 'Start by taking any breaks that you’re entitled to. Then, don’t volunteer for anything. If the feeling hits you go to the bathroom until it passes.\nIf anyone comments, talk vaguely about how you’re swamped and struggling to keep your head above water.\nPlan to take time off. You don’t have to use up all of your vacation time, but look ahead at your calendar plan time for events, activities, and rest. Don’t be around all the time to pick up the slack.\nWhile you’re right-sizing  your role,  continue to be pleasant while doing nothing but the job you’re paid for and going home.\nYou won’t believe how quickly doing this will bring down your stress levels.'",
        "In response to 'Loved the tip of plan activities in your calendar. That could actually serve as reminder as well not to prioritize work. I’ve been told previously the importance of being “pleasant” at all times. You also suggested the same. Why is this important?', a user said: 'Being pleasant, not enthusiastic or overly friendly, leaves people with a generally positive impression of you, but doesn’t give them any reason to focus on you or what you’re doing.\nYou can’t make yourself invisible, but you can make yourself dim enough to fade in to the background. Being in the background gives you space to operate in a way that works best for you until you can fade right on out of that job.'",
        "In response to 'Seems to be the American way in the last few years. Something to think about. Some of your most popular TV programs sell this cut throat way of thinking. Survivor is one of the worst and most popular. They put people in a survival situation but also expect them to form phony alliances and cut each other’s throats.', a user said: 'That’s how it’s been since the beginning of this country. Exploitation has been the name of the game.'"
    ]
}