{
    "username": "old_man_snowflake",
    "contributions": [
        "In response to 'Yeah it's interesting. At WFH my day is literally jam packed with meetings and coding. I somehow miss the office days when I could just dick around slurping coffe chatting to people in the kitchen for hours. We even had a car racing sim rig at the office that I could use and boy, did I use it. I work shittons more from home than I ever did at the office.', a user said: 'i'd be happier if they sold the car sim and paid better, but hey, menial distractions are fun too. ping pong and kombucha on tap, now don't you want to pay 30 bucks to park for the joy of working?'",
        "In response to '[Deleted or Empty Comment]', a user said: 'remember when 100k/yr seemed like it would make all your problems disappear? then you realize you can't even afford rent in a decent part of town for that.'",
        "In response to '$100k in 1982 is is the same as $307k now. No wonder it doesn't stretch as far.', a user said: 'I mean, we all have seen the charts. \"Real\" wage growth hasn't happened in 30-some years. It's all inflation. Real wages haven't seen appreciable growth in over a generation.'",
        "In response to 'Middlesex County Massachusetts has literally like the 3rd richest twin in America in it.\nIf\nBoston\nand\nNew York\naren’t where the good jobs are, where are they?\nLike fine you don’t like NYC or Boston and don’t want to live there, but then Certainty 100k is a lot of money if you want to live in I don’t know, Milwaukee?', a user said: '100k in LA, Seattle, San Francisco (and by extension the dozens of bay area cities) just doesn't go as far as it did even 15-20 years ago.\nThere aren't a lot of 100k-paying jobs in towns where you can still get a 2br apartment for under 1k/mo.\nYou don't even need to take my word for it:\nhttps://www.rentcafe.com/average-rent-market-trends/us/wa/seattle/\n-- so $2200/mo average for ~700sqft. 2200/mo, on the 33% rule, means a net pay of 6600/mo, which means a gross of about 8300, which is about 100k/yr. That salary literally buys you the mean housing for the general area, so it seemingly follows that the 'decent' parts of town would be more expensive, QED. And the 33% rule is too much IMO, it should be closer to 25% of take-home. Applying that math to our fictional average dwelling would be 2200*4/.8 (.8 for tax estimation purposes), *12 for yearly rate, gives us 132k/yr. There's a whole 30k of income difference based on your comfort level of housing-to-pay ratio.\nAnd this assumes it's just you, and you're cool with a tiny apartment with 1 bedroom and likely no outdoor space, parking extra, etc etc. Just in my neighborhood, there literally isn't a house on the market for under 1.4m dollars right now. Condos and townhouses, sure, but not standalone housing. The natural consequence of increased density is dramatically higher prices for owning actual land.'"
    ]
}