{
    "username": "OlympicAnalEater",
    "contributions": [
        "Quiet quitting: Employees suffering pandemic burnout say they've just stopped working as hard [External Link]: https://www.usatoday.com/story/money/2022/08/14/what-is-quiet-quitting/10304956002/",
        "In response to 'People who get smart stop working as hard. Then there are people who get better at their jobs and therefore stop working as hard. Also people, who WFH and avoid all the office drama and other destructive bulls#it, find they get things done without working as hard.', a user said: 'Isn't wfh has more micro management than in the office??'",
        "In response to 'Your boss is at your home watching your every move and commenting on it?', a user said: 'The company application tracking user movement through webcam and mouse?'",
        "In response to 'I’ve spent my career working in fifth gear. I’ve downshifted to third and still run circles around everyone.\nA business will drop you like a bad habit, if necessary. I know.\nSo I’m enjoying a better work/life balance. Only the employee can make that happen.', a user said: 'What do you do?'",
        "In response to 'They’ll blame the pandemic til the end of this decade. Face it, employees got a taste of real freedom and piece of mind and don’t ever wanna go back. Let what’s gave us alienation and neglect BURN 🔥and we’ll build back what we want later.', a user said: 'lol this is like mitch mc connel blamed stimulus check is the cause of the current labor shortages.'",
        "In response to 'Employers stopped investing in employees. What do they expect?', a user said: 'Then they go to news stations to make a story about why no one wants to work with them when they offer \"competitive salary\" and \"good\" benefits.'",
        "In response to 'Tf And I’m over here tryna get a job..', a user said: 'Same here. Trying to get a job for 3 months now and I can't land one like tf???'",
        "In response to 'Friends around me kept telling me that “I had been working from 8 to 8” in 2020 and I kept thinking “why? You don’t work 12 hours if you physically go into office, why are you increasing working hours?”\nAnd I was lay-off in 2020. I highly suspect it is because I am the only one kept 8 hour working schedule. workaholics ruin everything :(\nEdit: got layoff at 2021.', a user said: 'what do you do now?'"
    ]
}