{
    "username": "omgkelwtf",
    "contributions": [
        "My icing quiet quit 😂 I made some Xmas cookies and took them to moms. I made far too many and brought the rest home. They all survived except the trees. The icing came off in a sheet. Did my icing job just quiet quit? The other cookies are fine. Only the trees did this. All decorated the same day using the same batch of icing. Weird!",
        "In response to 'Awesome! You can reuse it for next year! 😂', a user said: 'Time saving life hack right here 😂'",
        "In response to 'This would be ideal for my 4yo who will scrape off the icing with her teeth then hand me the cookie when she is done.  Cool, thanks, kid.', a user said: 'Setting you up for extra decorating practice. Harsh coach 😂'",
        "In response to 'The little amount of moisture in royal icing is the culprit. Maybe because of just green frosting or the shape.', a user said: 'Very interesting! I also had wreaths with the same decorations, icing colors, etc. No issues there. The only thing I did differently with this batch of cookies is this was a rush decorating job. I had these babies in and out of the dehydrator all day. Got all 5.5 dozen decorated though! Dry as possible. I couldn't make a dent in the icing anyway. They traveled there really well. Normally I take 2-3 days to get a batch decorated so I know they're dry.'",
        "In response to 'Maybe the trees were still too warm?', a user said: 'These were baked days ahead. They were definitely cooled off by then lol'",
        "In response to 'Im not a cookie expert, but perhaps the exact dehydrator timing/settings for the xmas tree cookies played a role? If you had batches constantly going, it's very possible. It looks like the icing dried to the cookie oddly.', a user said: 'Same settings I always use. Lowest temp (95f in mine) and I just let it run while I cycled cookies through icing steps. I don't really use \"settings\". I just turn it on as low as it can go and stick them in for 10 mins or so. No real formula here beyond \"does the icing look dry enough to move to the next step?\" After 10 mins the answer is usually yes lol However, not timing anything means that they could have stayed in longer than I intended if I got distracted or something. Entirely possible around here. I have two birds who see sprinkles as forbidden seeds 😂'",
        "In response to 'I’m so curious how this happened! You mentioned you did wreaths with this green, too, were those decorated with any other colors (I’m picturing a circle cookie with a white base and the green wreath on too)?\nThe green looks really rich in color, maybe oversaturated?\nBtw, I love how you decorated these, so cute!', a user said: 'Nope exact same icing colors, decorations, and technique. The only thing I did differently this time is the rush decorating job.\nAnd thanks! Everyone was so impressed with the cookies and I'm like, \"ok but this was literally the fastest decorating job I've ever done and the wreaths sort of look like I decorated them in the dark while drunk but ok\" 😂'"
    ]
}