{
    "username": "OminousVictory",
    "contributions": [
        "In response to 'As someone who is 5 years into the industry, they are a bunch of psychos. I used to keep getting attacked because - \"You only do what you are given. You don't have initiative, you should go above and beyond and voluntarily take up more projects.\"\nBasically, here is the deal - they cannot reduce the salaries. Hence, they are firing people and overworking existing people, expecting them to do additional work. Ie, reduce a team of 10 to 6 and expect the same total team work for the same individual pay. Hence, they are asking us to \"go above and beyond\" and do other people's jobs.\nOh also, meanwhile, they can fire you at anytime with zero justification, and have the security clear out your desk within 10 minutes.', a user said: 'This right here never forget. If they can let you go and let you retire without giving you money to stay. Your replaceable wether it is true or not. \nThe managements mind is set in stone. \nIf they call you back do it for 10x as much premium contract. \"Consulting\"'",
        "In response to '-If you are going to take the stance that wage increases have been substantial and beyond a sustainable level, you also have to look at the whole picture where profits have exploded too (under crazy wage increases) and attack both fronts.\nHow exactly would the Federal Reserve dictate how much a company does or doesn’t make?  Tax policy could impact their bottom line I suppose, but that’s our law makers not the Fed.\n-Talking about people being able to afford homes, without discussing how we're going to reduce the prices on commodities all humans need, will miss the mark and the \"steel manned\" argument you are making.\nI used home prices as a generic example.  Inflation makes everything cost more, including “commodities all humans need”.\nIt’s not like Jerome Powell is the supreme being that dictates all things about everything.  They just set the baseline interest rates which trickles down to interest rates of everything else.  If inflation is too high, those rates need to go up. That’s pretty much it.  I’m sure if Jerome could choose to make every member of society zillionaires while experiencing no inflation so a loaf of bread still cost $2 he would do that. That’s not how economy works.\nEdit: typo', a user said: 'With current issue to fix food prices. It’s just best to have people grow their own food and hunt for venison. Cause their only tool their offering for consumers is “ don’t buy “ you need food so you’ll have to grow and scavenge to refuse the inflated prices being presented by a vast majority of corporations. Not all of them have raised their prices like Oncorr, Arizona, and utz.\nTaking Arizona as an example some stores are pushing the cost a-crossed all the product cause Gallon Arizona is $3. But at other stores it’s 3.50, 3.78, 3.89. All vastly different prices. \nIf the cans aren’t .99 cents then that store is actively sabotaging all the products across the board. I don’t care if it’s .15 cents more or .45 cents more I won’t shop there cause it’s across the board. This was after Gas prices  came back down now food is going up again??'"
    ]
}