{
    "username": "Omnipresent_Walrus",
    "contributions": [
        "In response to 'Something isn’t ableist just because you don’t like it.', a user said: 'No but we have laws here for making reasonable adjustments to accommodate disability and illness. Conditions like CFS are invisible but make life miserable and painful for those that suffer with it; one cannot work effectively when you're struggling to move. The reasonable adjustment is to assess their work on goals achieved and allow them to get it done in less time rather than expecting them to hang around and stay awake for your satisfaction.'",
        "In response to 'As a chef, I think you all are a bunch of whining pussies.', a user said: 'Bro sounds like you need a day off'",
        "In response to 'I do. I have one a week. Lots of work to be done though. Its a competitive field and the weak have a way of rooting themselves out. Luckily, Im not one of them.', a user said: 'People who are proud of being taken advantage of never cease to amuse me.'",
        "In response to 'That’s just rewarding laziness.', a user said: 'So you're missing the part of the study where productivity actually increased on average? Read.'",
        "In response to 'Most likely a temporary outcome. Soon you lazy fucks will demand a 1 day workweek.', a user said: 'Imagine being this miserable about a purely positive outcome. Is the rest of your life really so boring that you have to be at work 24/7?'",
        "In response to 'Is your chosen, voluntary work so boring and miserable you have to lay there like a sack of potatoes while everyone else supposedly subsidizes your laziness?', a user said: 'I'm a programmer, in 10 hours of work from home a week I subsidise the rest of the country's laziness by automating their work and charging a small fortune for it. Which is very rewarding indeed.\nThe rest of the time is spent outdoors, at the gym, reading, or making music. Which is\nextremely\nfulfilling, contributes to my local economy, and keeps me very busy. Far from sitting around like a sack of potatoes.\nI'm glad you enjoy having your worth extracted from you for the majority of your life but personally I'd rather be doing intrinsically valuable things that don't justify their doing by generating profit for someone else.'"
    ]
}