{
    "username": "one_little_victory_",
    "contributions": [
        "In response to 'Oh man. I feel like your current experience is acting as my ghost of Christmas future.\nMy hubby grew up in a cat family, which nothing wrong with that I LOVE cats! He met me when my youngest pup was 2.5 y/o. \nRecently he tried to convince me to get a kitten from his friend whose cat recently had a litter. I told him no. Absolutely not.\nWe currently have 2 big dogs. one is very much getting closer to crossing the rainbow bridge (which will absolutely shatter me) and the other just turned 11 and has always been super needy/demanding. I told him no I don't want the added responsibility of cleaning litter, keeping track of cat food/treats, plus another basket of problems if cat doesn't have perfect health. He says he will take care of all the cat's needs. I know thats a load of shit since I currently take care of EVERYTHING related to our dogs. Food, health, grooming, ect. He is good at making sure the younger gets walked (ya know, the fun parts!) whether it be by walking him himself only on the weekends or guilting me into it because he works full time and I'm currently home during the week. Doesn't matter that I have terrible insomnia and may have only fallen asleep like 2 hours prior... I should still get up (and stay up) literally before dawn (summer in AZ so morning is the only time where pup won't burn his paws) to ensure pup gets his walk. PS pup doesn't go crazy if he's not walked everyday so it's not a crisis if he skips a day.\nI told him if he wants to get a baby pet we are getting another dog. He has NO IDEA of the amount of work that goes into raising a puppy into a well behaved dog. It's like training for a human baby and if he can't deal with everything that comes with raising a puppy then raising children with him may be off the table. He already thinks he's too old for a human baby (hes only 37 btw) and I know for a fact it didn't even cross his mind that maybe his idea of being too old for kids at 37 is insulting to me because my parents were 39 and 40 when I came into the picture, until I told him that...\nSorry for the rant.\nOP- How old are your kid(s) and how did infancy go with someone like your husband?', a user said: 'Stand your ground about the kitten. He isnt entitled to, and doesn't get to demand, your personal trust when he doesn't have integrity, when his words and actions don't match.\nYou are 100% correct that you would get stuck with everything regarding that kitten, and he would just pet it once in a while when he notices it and feels like it. He can pound sand.'"
    ]
}