{
    "username": "OneX32",
    "contributions": [
        "In response to '[Deleted or Empty Comment]', a user said: 'It's 100% capitalist propaganda. As a worker, you are only legally required to work the hours you agreed to when signing your labor contract. Stopping work when your shift ends is just being a human. Framing it as \"quitting\" is just doing lip service for management to get free labor.'",
        "In response to 'when signing your labor contract\ncries in American', a user said: 'Wait. Labor contracts aren't a thing outside of America? Get me out of here.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'from the human race progress perspective it makes sense\nIt doesn't make sense when increasing productivity decreases overall human well-being.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'Considering most technological advancement occurred shortly after Enlightenment ideals (the movement that moved humanity's focus from monarchical well-being to more overall human well-being) proliferated through England and the rest of the Western world and then the next large proliferation of technological advancement occurred when democratic ideals proliferated in the democratized post-WWII world, yes.\nIn fact, periods of the slowest technological and economic growth in civilized history occurred when overall human well-being was placed on the back burner.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'Post-world war technological and economic advancement would never have happened if there were no industrial revolution influenced by Enlightenment ideals first.'",
        "In response to 'Original Post: The management lesson by Jimbo! Quiet Quitting. [External Link]: https://i.redd.it/cuq274hiurq91.jpg', a user said: 'Quiet quitting? Wtf?\nQuiet quitting is an application of work-to-rule, in which employees work within defined work hours and engage solely in activities within those hours\nWait. So doing what you were hired to do when you contracted to do it is now \"quitting\"?'",
        "In response to 'It's like they're trying to push the idea that when you have a job, your employer owns you, your free time belongs to them and you will be available for them 24/7. If you can't do that, you're a quitter.\nIt's fucking mental.', a user said: 'They really are and it's a full court press by the corporate world using social media and too many are falling for it. We're human beings, not robots specifically designed to increase the bottom line.'"
    ]
}