{
    "username": "Onionringlets3",
    "contributions": [
        "In response to 'You might be right, but this is the most \"Imma-get-mine\" crowd I know.\nAnd more power to 'em. Companies been gettin' theirs for years.', a user said: 'I see a lot of posts on a sub like Millennials w ppl lamenting the fact they have no job, the market sucks, they'll never own a house, the system is rigged, etc.\nIt always makes me think of the folks here, 'getting theirs' while there's 'not enough' to go around.\nI mean, yes, rage against the machine, always, but you have to eat.'",
        "In response to 'see a lot of posts on a sub like Millennials w ppl lamenting the fact they have no job\nSkill mismatch. That sub is filled with people who don't have careers.', a user said: 'Fr fr\nI may not like the system. But im great at the game'",
        "In response to 'And the only reason you can well is because you’re on the positive side of the time trade. I swear you people in this sub are some of the most stubborn and stupid people I have ever seen on Reddit, as an entire community.', a user said: ''The most stubborn and stupid people' out here making way more than most people. 💁🏾‍♀️'",
        "In response to 'Are they really making more? I would argue only in aggregate, because they have multiple jobs. The one dude talking about making 650k working 4 jobs, cool, I work 1 job where I can make that based on performance and I don’t have to live in the shadows like a criminal waiting to get caught.\nOtherwise, their roles are clearly commodity based and really don’t pay all that well in and of themselves. It also tells me that the roles really aren’t that skilled since you have people who can do multiple jobs at the same time. If they were very niche jobs requiring a lot of skill and expertise, you wouldn’t be able to OE the jobs.\nSo I’d say these people are also working a ton more and all the posts about being stressed out about juggling everything.', a user said: 'Oof there's so much wrong with your response I'm not going to take my time to refute all of it. Though I will say, I HIGHLY doubt you can make $650K with your one job. If you could, you would be.\nYou may be limited and unable to work multiple niche jobs requiring a lot of skill and expertise, bc it would take all your efforts to do so, but that's not the case for other people.\nI OE bc I went back to a company/industry (finance) that I have waaaay too much knowledge in, so they pay me a lot to do what amounts to not that much work for me. Other industry is travel and comes w insane benefits, I don't OE bc I have lil scraps for jobs, I just like doing whatever I want, when I want and I can afford to do so. I mean the finance job pays enough on its own to not have to OE at all, I just like both companies and both benes.\nMost of the people here making a LOT have tech/software skills that most people just don't have. I make a lot bc most people don't understand how interest works. I'm not doing anything special, but the amount of people that can do what I can do is low.'",
        "In response to 'I literally do not care, don’t waste your time.\nSales jobs are based on producing. Some years better than others. Plenty of sales people make that kind of money without working 4 jobs.\nI muted this entire sub because most of you are completely disconnected from reality. Literally some of the dumbest questions in all of the employment subs I see come from people in here.\nEnjoy the lives you have created and keep your smug tech attitudes balled up in your little world!', a user said: '🤣 yes I work in sales in finance, don't have or need 4 jobs, it is a reason to OE bc some years I make $150K, some years I may $350K from the same job, same effort. I don't like the fluctuations, so always having something else steady is great.\nWe definitely will enjoy our bountiful lives and superior attitudes. Enjoy your small reality!'"
    ]
}