{
    "username": "onomatopeic",
    "contributions": [
        "In response to 'Original Post: Having to read about \"Quiet Quitting\" instead of the long-established \"Work to Rule\". And of course it's on TikTok.\nQuiet quitting: The workplace trend taking over TikTok - BBC News\nKids today need to learn more about unions and industrial action.!', a user said: 'Very much so (as do my colleagues in the NHS, quite frankly: yes Gladys, a health professional\ncan\nstrike). I particularly enjoyed the insight from \"[workplace] decorum expert\" (\n1\n) Pattie Ehsaei\n\"Quiet quitting is doing the bare minimum required of you at work and being content with mediocrity,\" she told the BBC.... \"Advancement and pay increases will go to those whose level of effort warrants advancement, and doing the bare minimum certainly does not.\"\nThe simple fact that the quoted segment follows Emma's story of having her workload increased to the point that she was \"\ntaking care of the whole team\n\" and that she was turned down for a pay rise shows just how little Pattie seems to know the workplace.\n1.\nnote that while I\nam\nquoting, I'm taking the liberty of quoting and using scare-quotes at the same time because, really? A \"\nworkplace decorum expert\n\"? I can't tell if this a symptom of peak capitalism, or some form of prank that just went on too long for her to take it back.'",
        "In response to 'Am I the only one who thinks that somebody claiming to be a 'workplace decorum expert' has no fucking idea of what a real workplace is like, and is probably immensely disliked in whatever (probably new media based) work environment they currently occupy space in?', a user said: 'There's at least two of us, so no: you're definitely not the only one.'",
        "In response to 'scare-quotes\nNever heard someone use this term before. What exactly do you mean by scare-quotes? Quotes that make the content extra scary?', a user said: 'Scare quotes are quotation marks placed around a word or phrase from which you, the writer, wish to distance yourself because you consider that word or phrase to be odd or inappropriate for some reason. …possibly you believe it's just plain wrong. Quite often scare quotes are used to express irony or sarcasm (\nhttps://www.sussex.ac.uk/informatics/punctuation/quotes/scare\n).\nIn this specific instance the quotes indicate my disbelief in the role of, or the likelihood of there being such a thing as, “workplace decorum expert.”'"
    ]
}