{
    "username": "option8",
    "contributions": [
        "TIFU and ragequit my job [Update 5 may, 12:00pm: Yes my wife is talking to me again. No, the company has not yet been in contact. I'm leaving now to drop off all my company-owned assets and badge. Wish me luck.]\n[Update 1:20pm: Thank you all for your concern, and whoever messaged the Reddit Cares folks - I'm okay. I've been working with professionals to improve my mental health for several years. This is a definite regression, but without the help I've already had, it would have happened much sooner, and much more spectacularly self destructive.]\n[Last update 7:35pm: It's the end of the day, and I'm not exhausted. I'm not short-tempered and grumpy. I'm actually in a good mood for the first time in a while. Thanks, everyone who had kind words. I'll keep reading and replying. It's not like I've got anything better to do with my time.]\n(Happened yesterday, for the pedantic.)\nI was on a Zoom call, waiting to give a presentation that was scheduled for a 15 minute slot. Three hours of listening to the presentations queued before mine, and it comes down to five minutes. \"Okay, I'll just speed through this, as nothing has changed, so it should be an easy approval.\"\nFirst slide. Second bullet. I'm interrupted.\nBy one of the committee who clearly hasn't read the proposal. Or any of the\nthree months\nof back and forth on the specific wording or implementation details, justifications and prior approvals.\nI try to drill down to the specific objection, even find the email thread where I was given that specific wording, and they ask for clarification on what, exactly, I'm looking to get approved. [What would you say... You do here?.gif]\nBackground: I'm building a script to automate some internal reporting tasks currently done manually. To do that, the script needs an API key. To approve use of the key requires this security review, to be sure the script is communicating and storing all its data securely. This final presentation,\n83 days\nafter the initial application, should be a rubber stamp. All the items in the application have been documented, action items responded to, amended, and given the go-ahead. The last change was over a month ago.\nSo, what am I here to get approval for? I need the committee's approval on my plan, because the security group who controls access to the API requires it to grant me API access, so I can build the script. The application lays out my plan to secure the data the script reports on. (Sidebar: To get the script plan approved also requires a complete review of the entire infrastructure plan of the server instance the script was going to run on. No joke.)  What am I here for? Ultimately, so the guy that grants the keys can check the box next to my request. What's the key for? Script needs it. Script needs documentation, approval. Documentation done, I'm asking for approval.\nI just want to write some code.\nYou tell me to get approval, fine. Tell me who to ask, and what assurances they need. Fine. Ask your questions, and I'll answer them. FINE. Just let me finish writing my code.\nThen, after three hours of listening to you drone on about details that are completely irrelevant to the other applicants' presentations - including questioning their business case for even building the proposed service in the first place - and you squeeze me in the last five minutes - and then interrupt me and talk over me and talk down to me (Sound familiar, ladies? Totally get it.) all because\nyou\nclearly haven't done the homework?\nI snapped.\nI said things that were inappropriate, rude, immature, insulting, potentially actionable, shouting and cursing and I don't even know what else. [I'm out of order? You're out of order! The whole trial is out of order!.gif]\nBut I've been out the door on this job for weeks. I've had my resignation letter written for a month. All I was waiting for was an offer from one of the dozens of job applications I've sent out. I fully planned to finish this project, put in my two weeks, quietly send out some goodbye emails, and fade away. [Homer disappears into the bushes.gif]\nBut nah.\nSo I clicked \"leave meeting\", queued up a bunch of emails, then went to pick up my kids from school. I was running a few minutes late.\nCareer-limiting maneuver? Absolutely. Selfish, short-sighted, impulsive. I'm better than that. I'm disappointed in myself and embarrassed. I didn't sleep last night, and ever since the call, I can't stop shaking. My heart is still beating so fast it's like some long, drawn out panic attack. I feel sick to my stomach and I can't sit still. My wife's not talking to me yet.\nBest thing I've ever done for myself.\nTL;DR: I've been ready to quietly quit my job for weeks, but a three hour Zoom call pushed me over the edge.",
        "In response to 'To me it sounds like your only fuck up was to not take your unhappiness more seriously sooner.\nAs much as it was unprofessional, at least you’re away from an environment that wasn’t right for you. Probably saved yourself some issues much later down the line by acting now than keep pushing on.', a user said: 'I have been working on it for a long time. Months. Been unhappy a long time, and taking steps to eliminate my anxiety and find outlets. This job finally got to the point it was clearly affecting my mental and even physical health. When I brought that up to my manager, he shrugged it off and told me to relax. I don't feel bad at all if I happen to have thrown him under the bus in my final messages to management.'",
        "In response to 'Good for you, I am happy for you because I felt your pain. It took me 20 years at the same toxic far below average paying job, but I finally grew a set and quit on monday morning. I didn't quit in quite the spectacular fashion as you but I finally had enough of the stress and anxiety. For me it was the fear of change I guess, that's why I stayed so long. Luckily I had lined up a much better job with no toxicity and considerably better pay. I actually start this coming monday. \nI hope everything goes well for you, keep your head up and good luck. I am rooting for you!', a user said: 'That sounds like quite a turnaround. Congrats.\nAre you hiring?'",
        "In response to 'For those of you trying to shift blame or place fault on the wife - you all are the worst. As someone who has gone through this personally, you never want to do this without your partner along side of you. It shows lack of respect and faith. It is awful to the person that is supposed to be your equal in life.', a user said: 'She was upset for a few reasons, and is now much more zen:\n1 - Lost my income, and now we rely on hers. She's always made more than me anyway, so it won't be a major hardship. \n2 - I didn't stick to the plan we had agreed on. I have been actively looking for other jobs, and biding my time. I jumped the gun, so now my job search has more urgency.\n3 - I may have limited my ability to be hired at another job by burning bridges. She has the mistaken impression that my managers would have been a good reference.'"
    ]
}