{
    "username": "OriginalSchmidt1",
    "contributions": [
        "In response to 'You would be surprised.  My wife is an HR director for her company.  Only about 250 people.  The owner is an undiagnosed ADHD narcissist that despises WFH.  They had some top sales guys that demanded to WFH or they were leaving for a competitor.  He agreed to it because he knew they would lose a ton of money if they walked.\nLike literally a couple of times a month, the owner sends my wife articles and posts on Antiwork telling her, these guys aren’t working and to get them back here ASAP.\nShe has to talk him down every time reminding him that they are obviously working as their sales jobs are commissioned based, and there has been no drop off in their sales or earnings.  He still is pissy for several days and says “well, their sales would be even higher if they were here!”  She ignores it and he forgets a day or two later until he happens to see a new article or post that sets him off again.', a user said: 'Spoiler alert for that dude: they aren’t working when they are in the office either.'",
        "In response to 'Oh we know that.  That is what cracks me up.  I worked in an office for 20+ years.  I, without a doubt, spent more time trying to look busy than actually working.\nI have been working from home for close to 7 years now.  I would get way more done than I did in the office and I only worked maybe two hours a day, tops.\nRather than measuring how much time an ass is in a seat, they should be paying for work done.  I am in the United States and am fortunate enough that my current employer understands that and doesn’t care what we do as long as the work gets done.', a user said: 'Exactly that! \nThe thing is, if I worked the entire 8 hours, then I would get more work done sure, but then leadership sees you getting all that work done so then they expect that everyday.. my situation for example, I work in the investigative field, my expectation was to finish 2 cases a day. Then we have a meeting and are told we are short handed so some days we will be expected to handle 3 cases. They hired more people so we have a full team, then they tell use since we did so well handling 3 cases a day that is our new expectation.. but ya see, some cases just have wayy more content and information than others so then you end up completely stressed on the days you end up with a big case.. so now, I refuse to do more than 3 cases a day because the next thing we know, they will up it again.\nSo of course I’m not going to work then entire 8 hours because my only reward is more work.\nAnd wouldn’t ya know our last meeting included the roll out of a new incentive program.. a 25$ giftcard for meeting certain goals.. yeah I’m not working harder for a giftcard that won’t even fill up my gas tank. It was more insulting than anything. So yeah, I get up a little later and let my morning routine bleed into my first hour of work and take a lot of Reddit breaks throughout the day because no way you are getting more work out of me for the same pay.'",
        "In response to 'Tell me about it, I read so many of these and constantly wonder, how the fuck can I get one of these jobs???', a user said: 'For me, it was quite the process and it definitely took some unexpected turns. First I did a medical billing and coding program, then worked in a doctors office for 5 years, bought a nice alienware laptop so that if a work from home opportunity arose, I’d have the equipment and I wouldn’t have that holding me back, then I quit my job and got a gig doing customer and driver support for a food delivery service, this was during covid and we were working from home, after a year they started calling us back to the office, one of my work friends quit, and a couple months later told me about how his wife got a job working from home doing medical canvassing for an investigative company and it seemed like a good fit for me. That experience in the doctor’s office and working from home with the food delivery service was got me that job and I’ve been with the company ever since, love working from home! And I have even moved from making canvas calls to social media Investigations!\nJust to say, sometimes you have to find stepping stones to lead to what you really want.'"
    ]
}