{
    "username": "OriginallyMyName",
    "contributions": [
        "In response to 'There are millions of people who own a house and a newer car that are completely oblivious to what's going on out there. Many are shocked beyond belief when life happens and they find themselves looking at having to buy a house or a car.\nMany people here would scoff at paying more for a Jeep Grand Cherokee than a fully loaded Lexus SUV. But somehow they're okay with over-inflated home values.\nA mortgage payment is DOUBLE what it was four years ago. This is unsustainable. My mortgage payment 4 years ago was $1200. You're going to have a tough time convincing me that I should pay twice that for less house. This is not a normal or healthy housing market and interest rates aren't the problem.', a user said: 'Holy moly is this ever the truth. I make close to what the couple in the OP makes - on my own - and trying to get on the property ladder is a nightmare. It isn't helped by family members who have owned their homes for at least 8 years chiming in with advice from what is essentially another world. Finally had my brother in law, today actually, sit with me and try to and set up at least a tour. Found a home listed early in the morning, for 300k, that was accepting tours. Called the agent and she basically gave us a \"uhh are you SURE you wanna make the trip? there are quite a few contracts already in and they're all well over asking...\" and so we wound up just not going with that one. BIL began to grok the situation at least. For a first time buyer the insane bubble pricing and the FOMO are bright red flags, I can't picture anyone buying in good conscience today.'",
        "In response to 'Your last sentence is exactly what people were telling us in 2017 when we bought. Back then we paid $25k over asking (and appraisal) and had to waive inspection and appraisal contingency. We won the house over like a dozen other offers. People were calling us idiots and zaying that the buying frenzy would subside and we'd have buyers remorse. Well...6 years later and it's done nothing but get worse. This honestly seems to just be what buying a house is. Long gone are the days of a family viewing some houses and picking their favorite to buy. Competition is fierce. You need lots of cash and to take on risk. It sucks, but I don't think it will ever get better.', a user said: 'Maybe it's just wishful thinking but I really can't see this as being sustainable. I know everyone says it as a cope but if every other buyer is an investor looking to scoop up an extra 200k in 5 years when they sell, what happens when the line stops going up? What happens if it goes down?\nIf this market was all families trying to get in for the first time and get on the property ladder it would be one thing, but the effect of various types of investors has poisoned the marketplace. For someone locked in, who doesn't intend on selling anytime soon, it likely means nothing. But to the people buying for the first time, and the investors hoping to turn that profit, it means a lot. Someone entering as a first time buyer basically accepts the fact that they're paying at least a 50% markup on an asset that they also have to accept a guaranteed rug pull on. Somebody investing basically accepts the same thing, so yes you're correct there's risk but cui bono? Especially if the investing crowd fails as a group to realize the profit they want.\nSomeone is going to have to hold these bags once the circus leaves town and it shouldn't be regular people just trying to buy a house they want to live in. Probably there is going to be millions of people who would otherwise be fully vested homeowners who just check out as much as they can, and society loses the soft benefit of having that many people with a stake in their area of the country.'"
    ]
}