{
    "username": "overengineeredpotato",
    "contributions": [
        "In response to 'Det har ingenting med \"quitting\" å gjøre heller. Det er et tullete begrep laget for å gi negative konnotasjoner til det å ikke yte 110%.', a user said: 'Ja, omgrepet må tolkast i den samanhengen det har blitt skapt, i dette tilfellet amerikansk arbeidskultur. Der har ein arbeidstakar langt dårlegare føresetnader enn i Noreg, og det blir aktivt slått ned på fagforeiningar i store deler av samfunnet (til og med frå staten si side, ref. togarbeidar-streiken no nyleg). I tillegg brukast \"The American Dream\" som ei oppfordring til å yta ekstra slik at ein skiljer seg ut og stiger i gradene, men fleire og fleire innser at draumen om hus, bil, ferie kvart år osv. ikkje er oppnåeleg når produktivitet og lønsvekst ikkje har hengt saman sidan Reagan si tid. Visst ein i tillegg skulle finna på å få ein sjukdom så kan ein sjå langt etter å bli gjeldsfri før ein ligg seks fot under.\n\"Quiet quitting\" for ein amerikanar betyr at dei ikkje lenger let seg utnytta for ein draum som aldri kan oppfyllast.\nEin ser dei same økonomiske tendensane i Noreg, spesielt i yrker der arbeidskraft er lett å erstatta. Sjølv om me ikkje opererer med minimumsløn så er det vanskeleg å sjå føre seg at t.d. ein butikkarbeidar vil vere i stand til å både leva og spara nok til å bli økonomisk uavhengig på sikt. Spesielt visst ein er einsleg og heller ikkje har foreldre som kan hjelpa med sikkerheit på lån e.l.\nEg trur det er brei semje om at \"quiet quitting\" er eit litt tullete uttrykk, men allikevel eit fornuftig konsept. Ein skal jobba for å leve, ikkje leve for å jobba. Halve diskusjonen her kjem av at folk ikkje har lest artiklane og dermed \"kommenterar frå hofta\" om kva dei _trur_ at dette betyr. Klassisk Reddit.'",
        "In response to 'Hva vil det si å være økonomisk uavhengig egentlig?', a user said: 'Eg har alltid tenkt på det som å vere gjeldsfri, fyrst og framst, men det kan vel bety ulike ting for ulike folk. I alle fall å ha stort nok overskot og lite nok gjeld til at ein ikkje blir fastlåst i ein situasjon. For å spela vidare på den opprinnelege kommentaren: Er du butikkarbeider og tener 20-25 k netto i mnd så ryker lett halvparten til husleige og det er vanskeleg å spara nok til å kunne eige noko sjølv og dermed på sikt ha betre råd (igjen, spesielt dersom ein er einsleg og ikkje har rike foreldre). Tilbakebetaling av lån har eit endepunkt, det har ikkje leige.\nRotete forklart men eg håpar det var forståeleg.'",
        "In response to 'Ser den. Er selv så godt som gjeldsfri, så fastlåst økonomisk føler jeg meg ikke. Har 27 netto i mnd i snitt, men løser bosituasjon ved å bo sammen med andre, og det sparer jeg veldig mye på, da mindre enn 1/3 går til husleie. Med tanke på leie.. så har jeg odel på gård, så hvis jeg skulle ønske meg bolig i fremtiden (noe jeg ikke ønsker, da det ville låst meg økonomisk med gjeld så jeg ikke har mulighet til å trappe ned i stilling hvis jeg skulle ønske å jobbe mindre/flytte til utlandet/reise osv) så er jo det alltids en mulighet i fremtiden, da foreldrene mine nærmer seg pensjonist alderen. Vil ikke si jeg har rike foreldre, men de støtter meg alltid økonomisk og med en midlertidig plass å bo og jobb på gården når jeg har vært mellom skole/jobber/studier osv.. kanskje er jeg i en noe spesiell situasjon, men penger er altså ikke egentlig ett problem.', a user said: 'Det høyrest ut som ein veldig fin situasjon :) Ikkje alle som er så heldig, dessverre.'"
    ]
}