{
    "username": "owlbunnysubway",
    "contributions": [
        "In response to 'Original Post: Quietly Quitting and Lying Flat I have wondered over the years why we are constantly told to work harder, work harder, but then things don't always get any better. But it's super-important for Singapore to be competitive against every else, right, so we got to work hard.\nBut I also see that in other parts of the world, there is a bit of a backlash against this kind of idea:\nquietly quitting\nand\nlying flat\nWhat is your opinion?', a user said: 'Yours is a question that can be approached via many different angles. From the societal perspective, Singapore does not have natural resources, etc. etc. - there's no need to rehash all that well-trodden logic.\nBut, there are also ramifications to society if we as individuals all end up overworked, burnt out or, worse, suffer from mental issues. That creates a burden on society too - just that it may be harder to see and track. But that's an issue for our bureaucrats to sort out.\nFrom the personal perspective - my take is that an individual should first recognise how much of the proverbial fat between the status quo and subsistence one actually has to trim. That is something necessary to recognise in order to understand the impact of quietly quitting/lying flat (but also a good practice to practice gratitude). Thereafter, whether to quietly quit or lie flat - as well as how quiet one should quit, or how flat one should lie - is a function of personal preference.\nIf one is at the unfortunate position where one does not have much fat to trim, then lying flatter than the status quo is a dangerous exercise (but dangerous does not mean undoable - see point about cost/benefits, below). If one is comfortable now, then very technically, one has the capacity to lie a bit flatter.\nIf, then, one has the capacity to lie a bit flatter and lying flatter actually brings about some degree of joy (e.g. space to pursue actual interests) ... why not?\nConversely - if lying flat does not bring fulfilment to the individual... then why would one lie flat?\nThere's no right or wrong on this. We each have the capacity and capability to design the life we individually want. So long as we're clear-minded about the costs and benefits of each choice, there's nothing stopping us from making those choices.'"
    ]
}