{
    "username": "oxopop",
    "contributions": [
        "I’m quiet quitting my PhD I’m over stressing about it. None of this matters anyway. My experiment failed? It’s on my advisor to think about what I can do to still get this degree. I’m done overachieving and stressing literally ruining my health over this stupid degree that doesn’t matter anyway. Fuck it and fuck academia! I want to do something that makes me happy in the future and it’s clear academia is NOT IT!\nEdit: wow this post popped off. And I feel the need to address some things.\n1. I am not going to sit back and do nothing for the rest of my PhD. I’m going to do the reasonable minimum amount of work necessary to finish my dissertation and no more. Others in my lab are not applying for as many grants or extracurricular positions as I am, and I’m tired of trying to go the extra mile to “look good”. It’s too much.\n2. Some of yall don’t understand what a failed fieldwork experiment looks like. A ton of physical work, far away from home and everyone you know for months, and at the end of the day you get no data. No data cannot be published. And then if you want to try repeating it you need to wait another YEAR for the next season.\n3. Yes I do have some mental and physical health issues that have been exacerbated by doing this PhD, which is why I want to finish it and never look back. I am absolutely burnt out.",
        "In response to 'I also had another friend quiet quit her PhD due to poor mentoring skills from her PI. Her PI noticed and also asked her to graduate sooner than later, she got a first author paper, and graduated in 5 years opposed to the standard 6 in her field. Her and I still have very nice cv’s. You don’t have to be the best in academia. You don’t even have to be smart. Just stubborn enough to finish', a user said: 'Thanks for sharing your story and sorry you went through all that. I am nothing if not stubborn enough to finish this damn thing'",
        "In response to 'Finishing your dissertation and not worrying about anything else isn't quiet quitting. Lots of us have been doing that for years haha', a user said: 'I think my post title really triggered some folks lol'",
        "In response to 'How do you get “no data?” Also why would finishing your degree be on your advisor.\nMaybe don’t quiet quit and just quit. Why keep doing it if you aren’t happy?', a user said: 'I’ll be happy when it’s done lol. Only 1.5 years left seems wrong to throw it away now. All things considered my career is on a good trajectory, I’m just burnt out. No data because all of my plants died from drought. Not really publishable to say that plants need water to live. Not saying it’s on my advisor to finish the degree but it can’t just be me spinning my wheels on my own anymore.'",
        "In response to 'How do you do field work and get NO data? I’m confused. You mean null results? If that’s what you mean, what kind of analysis did you do?', a user said: 'All my plants died from drought. No usable data because everyone already knows plants need water to live'",
        "In response to 'So you made a mistake?', a user said: 'Mother Nature smote my experiment. Out of my hands entirely'",
        "In response to 'Why don’t you just quit for real then rather than wasting resources, time and taking up a spot of someone who’s dreaming about being in your place?', a user said: 'Because I’m four years in and going to finish the damn thing. Just not by trying to overachieve 24/7'"
    ]
}