{
    "username": "PaliBaner",
    "contributions": [
        "In response to 'I posted this as a reply in a different thread. In Canada we (at least myself and people I know) call it work-to-rule:\nhttps://www.theglobeandmail.com/canada/article-ontario-teachers-unions-prepare-for-challenging-round-of-negotiations/\neducation unions had been engaged in job action – ranging from work-to-rule to one-day strikes\nhttps://www.cbc.ca/news/politics/border-workers-work-to-rule-begins-1.6131898\nBorder service officers have begun work-to-rule action while unions and the government continue to negotiate a new contract.\nhttps://www.cbc.ca/news/canada/manitoba/nurses-voting-possible-strike-1.6055533\nA vote does not mean a strike will happen, and nurses must still provide care since they're deemed essential service providers, even if they choose to strike.\nInstead nurses will begin refusing to do non-essential tasks, like answering phones or transcribing doctors' orders that day, Jackson said.\n\"It's going to be very, very low-key, it's going to be minimal disruption for patient care and for nurses,\" Jackson said.\nAll of these sources pre-date Quiet Quitting.', a user said: 'Yeah, but Work to rule is a kind of protest, whereas IMO quiet quitting is a new way of life.\nPS Work to rule is called Italian strike in my country.'",
        "In response to 'quiet quitting is a new way of life\nYou're right, I haven't seen much mentioned on what conditions would end quiet quitting.\nI've always assumed people would naturally try harder when made happy. When I go work to rule, I'm usually pissed off and don't mind dealing with people complaining. The rest of the time I'm trying to get the work done as fast as possible so I can screw off again.\nThe whole concept gives me vibes of this:\nhttps://en.wikipedia.org/wiki/Lysistrata', a user said: 'Me personally - I worked hard and did a lot of extra stuff at my first job ta IBM. Me extra work got me nowhere, so ever since I left that god forsaken place I did bare minimum. I even got fired twice for this, standing up for myself and calling BS out. I regret nothing, never will do extra work except for running my own business if it happens one day.'"
    ]
}