{
    "username": "paperbasket18",
    "contributions": [
        "In response to 'I am right there with you.\nI think turned the corner when I had a discussion with my manager for my annual performance appraisal. Exceeds was a 5% raise, Meets was 3%, and needs improvement =fuck you, update your resume.\nI always get Meets and as a former manager, I realized that probably 80% of us get Meets. So I asked, (without saying whose dick do I need to suck) what I’d have to do to earn exceeds. The answer amounted to about 20-30% more time and work. For 2% increase, which works out to like $30/paycheck. You want me to work 60 hours a week for $30? You can fuck all the way off with that shit.\nI do the bare minimum to, as you said, skate under the radar. I meet or exceed deadlines, take accountability for mistakes, show how I’m taking steps to avoid repeating them, and oh yes, it’s all about that time sheet, so o work from home and stay logged in an extra hour every day. To account for lunch.\nI could make a lot more money at some other job, but I’m in pretty decent financial shape. Not great, not super wealthy or even what I’d call well off, but there is enough for me. I have enough. I am enough. A bigger house won’t make me happier. (I’d like to downsize because even my modest 3/2 cottage is too much for me to clean.)\nI just wanna sock away as much moolah as possible and retire as soon as possible and make art all day.', a user said: 'The ability to skate under the radar is probably what is going to keep me in my job for the long haul (I’m a late Gen Xer, so I have years to go until retirement, sadly.) I could try to go elsewhere and make more money, but they pay me a comfortable salary for relatively low stress work. I never work past 5 or on weekends. Any other job in my field that pays my salary or better is frankly probably going to expect a lot more of me, like possibly managing others (no thanks) or just taking initiative and being more innovative than I currently am. I don’t have the energy for it. I can’t imagine how I’ll feel in another 15 years if I feel this way now, but that’s a problem for another day.'"
    ]
}