{
    "username": "pataconconqueso",
    "contributions": [
        "In response to 'Original Post: Japan's historic work ethic is declining—45% of workers admit they're quiet quitting [External Link]: https://fortune.com/article/japan-work-ethic-declining-45-percent-of-workers-quiet-quitting/', a user said: 'Dont they pretend to work more about appearances (staying late, drinking with boas, etc) than actual productive working?\nAt least that is what my Japanese coworkers always ramt about when it comes to them being expected to be amazing workwrs based on being Japanese'",
        "In response to 'But I'm seeing that police aren't bothering to do their jobs because judges aren't convicting...so seems like it's some sort of endless loop?', a user said: 'The police dont want to do their jobs well that is the start of the loop. They think the DA should be able to prosecute with their shitty work and they can’t because they need actual well documented evidence to proceed, which SFPD is too lazy to produce\nIm dealing with them now, because i need a report from them for my insurance to pick up my wife’s car, and it’s been a month and ive had to send back the report 3 times because they cant follow simple instructions.\nIf this is how they do everything, no wonder the DA can’t prosecute anything'",
        "In response to 'Original Post: My cousin is SFPD and has the same take on the bikers. Are we basically just paying them 3/4 $billion a year to cry and quiet quit? [External Link]: https://i.redd.it/uhdkr8xy39ld1.jpeg', a user said: 'Sounds to me like they are just whiny and dont eant to work.\nStopping them, detaining them, and getting their bikes impounded would’ve been a start.\nAlso DAs can only prosecute with how good the paperwork and evidence is.\nIn my neighborhood a drunk driver hi like 4 cars basically in front of the police, it’s been a month and they havent even finished their report for insurances.\nAll this shit just sounds like excuses to sit on theor ass and get paid an SF bloated salary when they dint even live here'"
    ]
}