{
    "username": "PaxDramaticus",
    "contributions": [
        "In response to 'I thought that was part of the salaryman culture. You’re not allowed to leave until your boss leaves, so everyone just looks as busy as possible while watching the clock waiting for the boss to head out.', a user said: 'Man, that takes me back. Zard was on the radio, the Super Famicon was the hot new thing, and the Gundams were taking a break to do national stereotype Mortal Kombat.'",
        "In response to 'I’ve never experienced Japanese work culture first hand, but from what I’ve heard you work long hours, to the point that you’re not supposed to leave before your boss, even if work is complete?\nAll the pics of salarymen asleep in Tokyo shows that burnout is strong. Which leads to low productivity when you’re actually in the job', a user said: 'All the pics of salarymen asleep in Tokyo shows that burnout is strong.\nThey don't, actually.\nSleeping at the desk either means the employee is (a) lazy, or (b) putting on a big performance. \"Hey, please notice how hard I work, it's to the point I can't even help myself from falling asleep!\" It's like how the second place sports teams openly weep when they lose the final match of the tournament - it's about performing vulnerability as theater to communicate that you feel like you've given it your all, regardless of if you've actually done so.\nThe people I know who burn out aren't sleeping at their desks because they have too much going on and are under too much pressure. The people I know who burn out are skipping meals and eating Calorie Mate or a single room-temperature onigiri at 4pm. The people I know who burn out are suddenly and sporadically absent with doctor's notes because it's the only way they know to catch their breath. The people I know who burn out are randomly exploding at people underneath them because their nerves are frayed and they've experienced their sempai doing the same to them. The people I know who are burning out are the people who get things done while their superiors performatively sleep on the job.\nAnd the people I know who burn out don't do all this stuff because the boss makes them. They do all this because they genuinely want to do a good job, genuinely worry about how what they do impacts the people around them, and genuinely worry about how they are seen by their peers.'",
        "In response to 'Original Post: Japan's historic work ethic is declining—45% of workers admit they're quiet quitting [External Link]: https://fortune.com/article/japan-work-ethic-declining-45-percent-of-workers-quiet-quitting/', a user said: 'Garbage Japanology, trying to turn a decades-long workplace trend into a scary \"decline\" in \"ethics\".'"
    ]
}