{
    "username": "pdoherty972",
    "contributions": [
        "In response to 'There are millions of people who own a house and a newer car that are completely oblivious to what's going on out there. Many are shocked beyond belief when life happens and they find themselves looking at having to buy a house or a car.\nMany people here would scoff at paying more for a Jeep Grand Cherokee than a fully loaded Lexus SUV. But somehow they're okay with over-inflated home values.\nA mortgage payment is DOUBLE what it was four years ago. This is unsustainable. My mortgage payment 4 years ago was $1200. You're going to have a tough time convincing me that I should pay twice that for less house. This is not a normal or healthy housing market and interest rates aren't the problem.', a user said: 'A mortgage payment is DOUBLE what it was four years ago. This is unsustainable. My mortgage payment 4 years ago was $1200. You're going to have a tough time convincing me that I should pay twice that for less house. This is not a normal or healthy housing market and interest rates aren't the problem.\nInterest rates are what caused payments to increase, so how can it not be interest rates?  Homes in most places went up around 30-40%, so that certainly can’t explain it.'",
        "In response to 'Its seller greed.\nBuy a house in 1997 for 91k. Assessed value 315k in 2019 with 4.5% interest rates. Neighbors identical home sells for 650k in 2022 with 2.75% interest rates.\nInterest rates are now 6%. Should the value be 675k? 325k? Sellers are delusional and think their home is worth what it was at 2.25% + 10% appreciation/yr since. They don't actually have a 600k cost basis. That's if they're the smart ones and didn't take a huge cash out refinance / home equity loan during covid to buy a Ferrari and get their wife's tits redone.\nYou know why they can't drop the price? Because 60% of boomers have no retirement. If the value of the only thing they own drops, all of 'em are gonna be fucked.\nWe have to fund their retirement because they didn't save and plan accordingly.', a user said: 'Why do you think houses should be worth what the buyer’s costs are?  How are they related? Home values are primarily based on what it costs to build new, and further to that by demand in a given area (proximity to jobs and amenities increase this) and the supply of people willing to sell new or existing homes.  That’s it.  There can be some downward pressure if buyers can’t get loans at rates that make the payment make sense with their finances, but that’s not the seller’s problem to solve.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'Agreed.  A company I used to work for would shoot to get you to 85% of the new salary range during promotion, which seemed fair.'",
        "In response to 'why should an employee go above and beyond for employers who only give them the bare minimum\nEver since I became salaried it feels like every hour worked past 40 is just scamming myself and ultimately reducing my hourly pay rate lol.\nI always end up working 50+ hours a week :(', a user said: 'Employers abuse the exempt thing from the FLSA by labeling nearly all workers as exempt, when in fact it was supposed to apply to managerial and career-type roles where the worker had a ton of autonomy in how they go about their jobs.'",
        "In response to 'Lol they really did forget us, didn't they?  I'd leave my house on my bike in the summer at like 9am without even telling my mom where I was going.  I just had to be home by 5 for dinner.  We'd ride 30-40 miles a day, down highways, railroads, wherever.\nNo cell phones.  Not even pagers.  Just...\nfreedom\n.', a user said: 'Yep - good times.'",
        "In response to 'Well you can afford a 250K house on a 120K salary', a user said: 'Easily.'",
        "In response to '20% use to be the standard', a user said: 'It’s never been a standard - it’s been a goal/guideline in the past.  So has 33% of gross.'"
    ]
}