{
    "username": "Peetrrabbit",
    "contributions": [
        "In response to 'Original Post: What leaders need to know about quiet quitting… aka the labor rebellion [External Link]: https://v.redd.it/xravs6qh8ot91', a user said: 'Yeah …. There’s nothing in this video.  As someone who manages hundreds of people, I’m not sure what she means by ‘manufactured chaos used to control people’.   I just wanna build software.  I’ll pay a competitive wage to get top talent. It’s on me if I’m not paying enough.   And all I’m looking for in return is to do the job we agree on upfront.  Recession isn’t going to change that for me…. If someone wants to work, has the skills I need, I’ll make it worth their while.  And there are a lot of people like me trying to build something.   I truly don’t understand what the giant conspiracy is that she seems to think is occurring.'",
        "In response to 'seems like you have a small world and you think that the rest of your country or world functions the same as you. this labor uprising is happening all over the globe and ceos are using as many tactics as they can to stop it, most notably amazon and starbucks. just because you don’t see it or care to see it doesn’t mean it’s not there. if you just listened to her and honestly thought there was no truth to that, you’re either delusional or willfully ignorant.', a user said: 'I did listen.  And I'm asking what 'tactics' you're talking about are being deployed to 'manufacture chaos'.   Can you please be specific about one?'",
        "In response to 'The tactics being used are corporate propaganda used to demonize unionization and prevent workers from demanding higher wages.  Or the “people don’t want to work” style of messaging being used to gaslight workers’ legitimate arguments for better pay and better working conditions.  Manufactured chaos is the attempt to turn public opinion against workers who are fighting for fair treatment in a labor market where there are 2 jobs for every 1 jobseeker.  And these arguments don’t even touch the micro tactics in individual companies like being potentially fired for discussing salary, firings for trying to unionize, or shutting down locations that are discussing unionizing even when the business is still viable—just to discourage unionizing at other locations.', a user said: 'Thanks!    See - this is the specificity I was looking for.   Don't know why asking for it leads to personal attacks.   But - thank you, and well written.'"
    ]
}