{
    "username": "Pensfan66877129",
    "contributions": [
        "In response to 'Original Post: Has anyone \"Quiet Quit\" as a response to RTO? I'm not in this position, so I don't need advice, but I'm curious to hear everyone's thoughts on this.\nI work remotely, which is why I follow this sub. I've seen a lot of people in this sub who are being asked to RTO. I've been thinking about this the past few days as the sub has been full of people discussing how to respond to RTO mandates.\nLots of people, including myself, are speculating that the recent push for RTO is force people to quit their jobs. If they don't fire you then they don't have to pay out unemployment. And, you have to have significant savings to go without a job.\nWhat do you think about about returning to the office and quiet quitting so you can still draw unemployment? Anyone done this?', a user said: 'Absolutely. The day in the office is hammer time. I get as much done as possible. Day after, it’s clock in, monitor any emails that may come in, and do me for the day. If you’re going to make me drive an hour in at 6am, pay for parking downtown, have to buy lunch and my own coffee, then drive another hour back home, all doing exactly everything I do at home, without even having a meeting, you better believe that next day is a free day for me.'",
        "In response to 'Do you make it appear that you’re spreading that work out across multiple days? Otherwise, it seems like it could send the wrong message if your productivity sky rockets on days you’re in the office.', a user said: 'Productivity isn’t tracked. At all. We’re a “case deadline” type of team. As long as my cases are turned in by the due date, no one bats an eye.'",
        "In response to 'Or maybe you just have “lunch meetings” with your team or “collaborate with new colleagues”…..😏', a user said: 'Ha! Negative. We’re a small ‘team’ of 6. We do not collaborate or do work together. We all have our own tasks. Not friends with any of them either, so there is ZERO urge to have a lunch meeting. Meanwhile the other 40 employees in our office, work from home and never have to come in. So yeah, our RTO is legitimately pointless.'"
    ]
}