{
    "username": "PepeAvatar",
    "contributions": [
        "In response to 'Original Post: What do you think of \"Quiet quitting\"? This is a term thats been making the rounds on social media recently. Basically doing the bare minimum at work to not get fired.\nReminds me of the old Homer Simpson quote: \"If you hate your job you dont strike, you just go in every day and do it really half assed\".', a user said: 'Most people who \"quiet quit\" have been burnt already or in the past. I've just left a job who I busted my ballocks off for 3 years because I was told in my interview and every yearly review they where going to make a new team once the current team expands and they would be cherry picking the best people from the current team to join the new team and this new role fit exactly what I wanted out of my career.\nTurns out after 2.5 years I got wind from another department that this new department was never going to materialise, because management baked the role into their role and were happy with how they were doing - they were complaining about this to me as the extra workload annoyed them.\nI asked my manager about it who told me that they were not planning on making this new department anymore and they were happy with the current way the teams handled their work. So I stopped giving a shit anymore I \"quiet quit\" and suddenly my workload got called into question numerous times by management, even though it never dropped below the level of the lowest performer on my team. I always said that I wasn't the lowest performer so I must be doing okay, right? they got more and more hostile before they basically said they were planning to go down the discaplinary route if I didn't start performing at my old rate. Handed my notice in on the spot and they went into panic mode to try and retain me telling me not to do anything \"hasty\" and how would I pay my bills etc (I had saved up a safety net so i didn't care at that point)\nFound a new job before my notice was up and they were very happy I could start in 10 days after they offered the job. Made sure at this new job to never try my hardest and just put in a regular shift as everyone else does. Fuck working to make someone else rich\nTL;DR - Worked hard to get a job on a new department, new department never materialised, lost motivation, boss threatened discaplinary action for drop in performance, quit on the spot.'"
    ]
}