{
    "username": "Periwonkles",
    "contributions": [
        "In response to 'You should strive for a reasonable balance between work and entertainment activities. As you get older, certain things no longer amuse you, but taking pride in your career gives people long-term people satisfaction.', a user said: 'Eh.\nI spent 14 years absolutely busting my ass in my career field. It worked. I moved up quickly until I maxed out on the ladder. I knew my field. I cared about my work. But I was also existing in a constant state of burnout.\nI changed career fields for my mental health a year ago. I’m now in a non-management position in a role that is challenging but that I absolutely do not have to take home with me. I don’t feel defined by my title. My personal life and who I am as a person is completely detached from it.\nWhile I’ll likely move up the ladder a bit at some point for salary reasons, I have a much better sense of work life balance now that I’m not emotionally attached to my job. I mean, sure, I still have a solid work ethic and care about the quality of my work, but when my day ends I clock ALL THE WAY out.\nWhatever satisfaction ever came from working in a field I was passionate about wasn’t worth it. As I get older I intend to continue protecting my energy to spend on time with people I love doing things I love (however that changes over the years). I’m convinced that’s how you’ll one day reflect and see a life well lived.'",
        "In response to 'When I was looking for a job a few years back, a headhunter asked me why I worked for a company for 16 years.  He then told me that most “ideal” candidates don’t stay at jobs over 3 years and move around.', a user said: 'That’s interesting, opposite of what I was raised being told, and happens to basically match my resume. I chased growth opportunities and moved to different organizations (within my field) accordingly. My longest time with any one organization over a 14 year career was 3 years. I successfully hit the top of the available ladder in my original field (I switched fields in the last year).\nI’m interested in settling where I am now (lots of room for internal growth), but I am not now nor have I ever been loyal to any organization over my own interests. I don’t ENJOY having to work away the bulk of my young life and I’m certainly not sacrificing opportunities to maximize my return on having to do so.'"
    ]
}