{
    "username": "peroyvindh",
    "contributions": [
        "In response to 'Helt riktig! De som jobber mer enn de må, og er mer tilgjengelige for arbeidsgiveren sin gjør seg selv en bjørnetjeneste. Du får svært sjelden takk for det, du får ekstremt sjelden mer lønn. Det som oftest skjer er at man får flere oppgaver. \nIngen er mer enn et utskiftbart tannhjul. \nInnse det og lev lykkeligere!', a user said: 'Jeg har gjort den ekstra innsatsen og har absolutt fått uttelling for det. I 2018 gikk jeg fra en lønn på under 500k året før, til over 800k fordi jeg gjorde det ekstra og faktisk viste arbeidsgiver nytte av arbeidet jeg gjorde. Har fortsatt økt lønn litt i etterkant også, men svakere lønnsutvikling nå i ettertid, men hadde jeg ikke gjort noe ekstra uten en gang å be om kompensasjon, hadde jeg aldri hatt i nærheten av samme lønnsnivå som jeg har i dag, men så hadde jeg ikke vært verdt lønna for arbeidsgiver heller.'",
        "In response to 'Du er inne på noe her. Er helt med på at man ikke skal jobbe gratis, men dette avhenger av situasjonen. Jobber man med noe som er svært rutinepreget og ikke krever noen form for utdannelse, og hvor mulighetene for å avansere er minimale, så bør man få betalt for hver time (det bør man få uansett).\nMEN, dersom man får stilling som juniorkonsulent/utvikler så er det smart å legge ned litt ekstra innsats. Har ansatt folk siden 2001 og det er en merkbar endring i mentaliteten til nyutdannede. De krever masse, lever over evne, null økonomisk forståelse og slutter så fort noe butter i mot. Kan være at jeg er dårlig til å ansatte, men dette står jeg fast ved:\nMine beste ansettelser siden 2001 har vært folk uten utdanning og de har klart å levere til de grader. De har hatt engasjementet og har jobbet som bare fy og de har lagt ned den innsatsen som førte til at de fikk nødvendig kompetanse og innsikt. Har fortsatt kontakt med flere av disse og de klarer seg svært bra. Og dette hadde de ikke klart med \"quiet quitting\".\nFår jeg valget mellom å ansette en nyutdannet fra BI eller Universitetet uten engasjement eller et snev av nysgjerrighet, og én uten utdanning, men veldig nysgjerrig - hadde valgt sistnevnte any day!', a user said: 'Er 90% enig i det du sier, men tror det er viktig å poengtere at det også finnes de med utdanning som fortsatt er nysgjerrig og interessert i å lære mer utenfor arbeidstid. Det er de jeg helst vil ha både som kollegaer, da det er noen jeg også kan lære av, og ville ansatt hvis jeg var arbeidsgiver.'",
        "In response to 'Ditt eksempel:\nVaktliste i normaltid.\nOppfølging etter arbeidstid = overtid.\nForeslår at hvis man ikke vil jobbe overtid så la jobbtelefonen være avslått så sant man ikke har vakt.  Hvis man blir stressa av at ansatte ringer på privattelefonen utenfor arbeidstid fordi arbeidsgiver har delt nummeret med andre ansatte så er det på sin plass å ta en samtale med arbeidsgiver og eventuelt fagforening.\nEventuelt hvis man vil ha litt ekstra kroner så avtaler man med arbeidsgiver at dette regnes som overtid (avhengig av hva som står i personalhåndbok rundt dette, min erfaring er at det ofte står at overtid skal avtales/godkjennes)', a user said: 'Det du her kaller overtid, er noe mange vaktansvarlige kanskje ikke en gang tar betalt for, men når det er tid for å snakke med sjefen om lønn og betingelser (bør være minst en gang annethvert år, og mulig du må initiere selv), så er det noe du kan ta opp at du har ekstra ansvar og i tillegg får kontakt etter arbeidstid, noe de fleste anstendige sjefer vil belønne med høyere lønnsvekst enn kolleger som står og dagdrømmer og ellers gjør en halvveis jobb.'",
        "In response to 'Sjelden det skjer automatisk. Men hvis man tar initiativ i medarbeidersamtaler og lønnssamtaler så fører det jo ofte fram. Problemet er vel de som sier ja til alt og aldri ber om noe mer.', a user said: 'De du beskriver som svarer ja til alt og aldri ber om noe mer, er vel ikke akkurat de som bedriver quiet quiting. Men har selv opplevd at det faktisk lønner seg når man endelig begynner å be om lønn for innsatsen man har lagt ned.'",
        "In response to 'Original Post: Påstand: \"Quiet quitting\" er ikke noen ny trend, vi har bare adoptert et teit begrep for å ikke jobbe gratis Litt kontekst:\nhttps://www.dagsavisen.no/nyheter/2023/05/28/nora-vil-ikke-svare-pa-mail-etter-jobb-jeg-er-en-quiet-quitter-men-ikke-lat/\nhttps://www.nrk.no/innlandet/1.16087894\nhttps://www.aftenposten.no/meninger/sid/i/wAOOp5/jeg-er-en-quiet-quitter-men-ikke-en-unnasluntrer\nEdit: fikset lenker', a user said: 'Vel, de som aldri svarer på spørsmål etter arbeidstid og ellers ikke virker interessert i å være litt fleksible er de jeg stort sett gjennom min karriere kaller idioter. Selv forsøker jeg alltid å svare på korrespondanse etter arbeidstid, noen ganger svarer jeg at det må vente til i morgen, men er det noe som haster, eller tar meg mindre enn en halvtime å svare på/fikse, koster det meg ikke mange kaloriene, og jeg har noe å komme tilbake med på neste lønnssamtale. Har alltid vært late idioter i arbeidslivet, så er ikke nødvendigvis noen ny trend, men at noen bortskjemte drittunger lager trend av det er nytt.'"
    ]
}