{
    "username": "perpetual_stew",
    "contributions": [
        "In response to 'Original Post: Anyone Ever Quiet Quit a Trip? This has happened probably three times where I get close to the end of a trip and just become over it all and just end to get back home (the US). I don’t want to visit another church/palace/museum, I don’t want to wander anymore (my feet hurt). I’m tired of eating out and just done with it all. Doesn’t mean I’ve had a bad time, but I’m ready to be back in my comfort zone and bed. So when this feeling hits. I sort of find myself shutting down.\nThen, I feel guilty because I’ve flown across the world to be in a city people dream of visiting and I’m not soaking in every moment. I will say when my social connections are low, this quiet quitting happens faster. But despite 100 museums and sites. I have no energy to see anymore.\nHas anyone else experienced this?\nEdit: I’m trying to read all of these responses, on touchy airplane WiFi. But thank you for your responses!', a user said: 'I only check out churches/palaces/museums or other sights if I feel like it in the first place, so if I’m done I don’t go. But I have had the feeling of just not enjoying being somewhere, and I’ve either gone home early if a short trip, or just taking off to check out some other cities or nature in the country.  Going home early is a bit extreme though, and I’ve only done that for Stockholm. I’d just try to do local things like bars, shopping or local hiking options if the tourist sights doesn’t do it for me.  Or maybe switch it up and check things out super early with the sunrise or at night and sleep/drink in the hotel bar all day.  Try to suss out why you find something boring, and don’t feel any shame if staring at the 110th old building or tedious museum isn’t doing it for you. It’s not that important unless it’s a world class, unesco world heritage level site.\nThat’s another tip btw, check what the closest UNESCO world heritage site is and have a journey going there. That’s usually worth it to me.'"
    ]
}