{
    "username": "Personal_Cod_455",
    "contributions": [
        "In response to '“Fuck you, I got mine”', a user said: 'Seems to be the American way in the last few years. Something to think about. Some of your most popular TV programs sell this cut throat way of thinking. Survivor is one of the worst and most popular. They put people in a survival situation but also expect them to form phony alliances and cut each other’s throats.'",
        "In response to 'We are definitely living in a game show /contest. At least in America. I agree with you, but feel it might be a big ignorant to ignore the blatant competitiveness of late stage capitalism.', a user said: 'Capitalism has gotten way out of control it used for excuses for inappropriate behavior and actions like a cruch'",
        "In response to 'I mean, on a gameshow/contest, that’s kinda of expected when there can only be one winner.\nThat shouldn’t be applied to life/society', a user said: 'What I’m getting at why are these cut throat programs so popular . When they should be considered screwed up adults only!'",
        "In response to '“Fuck you, I got mine”', a user said: 'You said it that is the modern way of thinking. This is where the sick authoritarian assholes like trump and his greasy little wannabe desantis come from'",
        "In response to 'All credit cards make their cash off of drowning poor people in debt and killing what little chance they had to claw their way into the middle class. In the US the only higher cause of bankruptcy is medical debt (another ridiculous system designed to drown the poor). They also take a huge chunk of the middle class and ruin their future; forcing them and the next generation into poverty.\nAll credit cards are ran by scum, it’s a purposely evil system.', a user said: 'Credit card companies prey on people who can’t control their instant gratification impulses. The real problem with them is how they double dip society the interest rates they charge are as bad or worse than what a loan shark gets. Then they turn around and charge the businesses that excepts them a percentage. Personally I use them for the convenience. In over forty years of using them I proud to say I have never paid a penny in interest on them. There’s another problem with them that is getting more popular, a lot of businesses are starting to carry their charge over to the customer. I’ve actually had businesses remove the card payment and then paid it in cash. I know this sounds a little petty but you have to look at it as all these little charges add up. The main reason for using them is the cash back option on the better ones but that is useless if you are carrying a balance on one.'"
    ]
}