{
    "username": "philthewiz",
    "contributions": [
        "In response to 'I think demographics explain some of the decline but the working age population has been declining since 2008, it's a much longer trend. From what I can see many people gave themselves a pay rise when inflation hit by working fewer hours (no quibbles from me, get the maximum $/hr you can.)\nInflation is still too high of course.', a user said: 'The solution is not more productivity from the worker.\nNo lemon juice left to squeeze.'",
        "In response to 'You might not be able to get more juice out of the lemon, but you can certainly use an automated juice press instead of a manual one.', a user said: 'Automated or not, there is no more juice to give.\nI don't think that this analogy works.\nBut automation will be the answer to most of our problems. AI will either doom us or save us.'",
        "In response to 'I agree.  Automation is the future.  That's the natural evolution of technology to automate tasks to make life easier.  Problem is there's going to come a time when little if any human labor is needed.  What are we going to do about earning a currency to pay for things?  Will  things become plentiful that we don't need to worry about currency?  I like that at least 1 politician, Andrew Yang, has been thinking about the future and pitching ideas.  Wish more would have half of a brain to pitch ideas rather than blaming immigrants.\nAs for AI, I want to clarify you're probably thinking of Generative AI (ChatGPT).  It's limited to relying on copying what already exists rather than creating something new.  Not saying we won't get truly sentient artificial intelligence that can think and act like a human but better.', a user said: 'Everyone is relying on something that already exists.\nWe won't be needed at some point for most of the labour.\nWe are living the ego death of humanity haha! We might die in the process. I'm being dramatic but it's hard to not see this as a real possibility.'"
    ]
}