{
    "username": "phoneguyfl",
    "contributions": [
        "In response to 'Quiet quitting is a bs moniker made up by the capitalistic bootlickers. Doing your job within the scope of your job duties and not going beyond that is in no way an act of quitting. The capitalists are just so used to being in a power imbalance with the workforce that they now expect everyone to devote all of their life energy to the betterment of their shareholders profits. Sounds like the capitalists have a major case of entitlement disease. Whomever still uses this terminology is perpetuating a myth.', a user said: 'From what I gather, \"Quiet Quitting\" means not donating extra time to the company for free, just to maintain some sort of \"warm and fuzzy feelings\" from management. God forbit folks do what they were hired (and agreed) to.\nThere is a school of thought that says workers who dedicate all their time/life to a company are rewarded, and while this may have been true decades ago or in a few minority companies, the vast majority of companies will happily burn down employees, toss them aside when no longer useful, and hire new younger models. This simply isn't true any longer and employees are treated like shot or replaced on the whims of the executive suite.'",
        "In response to 'My husband used to get decent bonuses and even a couple of significant merit raises, and he was always happy to put in extra time in the evenings and weekends occasionally. Now he gets 3% raises and his last bonus was $428 (no, I didn’t miss a number). He shuts his computer off exactly at 5:00, and that’s that.\nIf you want employees to go above and beyond, you need to make sure you are showing your appreciation in meaningful ways.', a user said: 'I am the same. I am happy to give extra time when I am compensated (or even acknowledged) for it but when not, it's exactly 5pm logoff. I think it's sad that there is a number of people who think giving what is agreed upon is \"silent quitting\", when in reality it is just simply the tradeoff between employer and employee.'",
        "In response to 'You are rewarded though. It’s called a paycheck. \nI can’t grasp the concept of quiet quitting. It’s always been: \nI clocked in, what do want me to do!\nI can clean toilets with a tooth brush, I can balance the accounting books, I will even perform surgery if needed.\nAbout 5 years ago, when I give people their yearly review, I started giving them a copy of their job description too. Just to refresh themselves if they wanted too.', a user said: 'I think you missed the part about \"extra free/donated time\" in my comment. Or, are you one of those folks that believe employees are owned by employers and must give all of their available time to enrichen the company executives?'"
    ]
}