{
    "username": "physicallyabusemedad",
    "contributions": [
        "In response to 'If you type \"quiet quitting\" into Google News, you will find about 100,000 results.\nIf you type quiet quitting without quotations, you will find over 2 million results.\nIf you type declining American life expectancy into Google News, you will find 28,000 results.\nDeclining US life expectancy gets 61,000 results.\nDoes the news media focus on our lack of healthcare benefits? Our heinous work conditions? On why our lives are being shortened as cost of living soars?\nQuite the opposite - you even have NPR shaming workers for \"quiet quitting\".', a user said: 'I don’t disagree with your points, but “quiet quitting” became popular on twitter by everyday people, and was obviously used before that/before twitter. News media just decided to focus on that once it started going viral. When “declining American life expectancy” starts trending, then the direct comparison would make more sense (what a mouthful… hilarious to compare search results of that to a recently popular two-word phrase)'",
        "In response to 'I don’t disagree with your points, but “quiet quitting” became popular on twitter by everyday people, and was obviously used before that/before twitter. News media just decided to focus on that once it started going viral.\nThe news media often ignores viral trends - they chose to focus on quiet quitting for a reason.\nThe news media almost always portrays quiet quitting as a bad thing for business - and a shameful thing for workers to partake in.', a user said: 'I’m not sure how news media portrays quiet quitting, but your portrayal of their coverage sounds plausible given their track record so I’ll take your word for it.\nBut news media does not often ignore viral trends. They certainly selectively choose what to cover and will avoid talking about a topic for as long as they can, but once it becomes viral enough they often will end up caving. There have been a lot of very controversial issues that go trending online and, depending on the topic, you can notice media outlets being suspiciously quiet about the topic until it gets too large to not report on. Rather than “too large to not report on,” it may more so be a matter of their peers/rivals begin to report on it, so they have to compete as well.'"
    ]
}