{
    "username": "pik204",
    "contributions": [
        "In response to 'Original Post: Quiet quitting got me a bonus and a 15% raise I work from home and stopped trying about a year ago. I do monthly closing entries (10 hours of work), but other than that, I hardly do anything. I take my time responding to emails, decline meetings I don't have to join, etc. Since we were acquired and there's been turnover in management, my boss doesn't know what my job involves, and is also weirdly-averse to delegation (workaholic type), so I don't get assigned to anything.  Since I'm just chilling all day with my dog, I'm holding out here until they replace me or until kids come along, maybe in another year.\nWell my boss called me up today to tell me I'm doing a \"great job\". We exceeded targets, so I'm getting 2x my bonus (20k, target was 10k), and a 15% raise (100k to 115k).  Que sera, sera..', a user said: 'Accountants at my org still use excel and pdfs to manually reconcile information. Some still print pdfs to look at them.\nEntire management team is made up of dinosaurs so in first hour of my work day using Tableau i am able to do more than others take a week to finish.\nIn some cases older managers take months and still don't turn anything productive as they continue to \"ctrl c+v\" data in Excel while my work automatically reconciles even their books.\nI do nothing 80% of the time outside of that.\nUnfortunately no advancement opportunities, management is mostly an \"old friends club\" flipping burgers.\nI could automate everyone's job but 90% of people are not willing to change or learn new applications. \nI've come to accept that and became happy to occupy 80% of my time doing non-work related tasks. Having hobbies is what keeps me going.'",
        "In response to 'What is this magic you speak of? I know all of the tasks I do are incredibly repetitive but I don’t know how to do it more automatically. I’m building spreadsheets of reports bc the software we account on doesn’t give reports how we want to. How can I learn to automate stuff?', a user said: 'Get/learn better tools, Tableau, Power BI, connect to your data source, create a job that can extract what you need periodically. If you cant use any of the certified data connectors or have shitty IT, learn to extract data using python or if you have a license, power automate. There is a tool for every job, just like in trades, you just need an appetite to learn them, many provide free trials which you can showcase.'",
        "In response to 'Thanks! I have the appetite, just hadn’t heard of any of these before. I’ve been working in small companies. I appreciate the recommendations. I’ve started trying to learn Python. Do you have any suggestions on subreddits to follow or resources to start learning automation tools without a coding background? I’ll take any and all guidance!', a user said: 'I don't have formal IT training although i know web is full of courses like udemy and the likes.\nI just google and youtube now, although I was forced to learn by working years in IT, next to dev and dev ops, plus nerding it out in junior and high school trying new and pirated software.\nIf you like it, you will pick it up, just try to learn best practices in whatever language and tools you pick up. \nIf accountants knew 10% of Excel 365, their jobs would have been better even using tiny bit of macros but they prefer to insert notes, highlights and manual inputs. It's really a mind shift with or without new or old tools that already exist. If you have it, you can do it.'"
    ]
}