{
    "username": "pip-whip",
    "contributions": [
        "In response to 'Original Post: What's your opinion on quiet quitting? Been doing it for almost a fortnight now, and it's changed my life (for the better).\nInterested to hear others' thoughts.', a user said: 'It disgusts me.\nYou're basically saying that you are perfectly content to be overlooked, never promoted, not worthy of a raise or a bonus, and likely to be at the top of the list when it comes time to lay people off.\nYou're also saying that you take no pride in your work and have no goals or asprirations.\nNow, if you were previously choosing to overwork yourself and you realized you were burning out and purposefully chose to do a readjustment to a more-realistic work ethic, that would be a different thing entirely.'",
        "In response to 'Original Post: I didn't get the promotion. Should I quit or quiet quit? A few months ago everyone in my team was let go apart from me. I was then told I could apply for my old manager's role. I applied but have now been told I didn't get the role and they are going with an external candidate.\nFor these past few months I have basically been doing this promotion role (and have received really good feedback from lots of senior people). I have not gotten a payrise to do all this extra work.\nI want to leave before this candidate starts because I'm tired of giving them essentially cheap labour. I was told if I didn't get this promotion, another role would be made available for me (in the same team), so I would probably have lots of leverage to negotiate a payrise. But I really don't want to have to essentially train this new external candidate who will be making more than double what I earn in the role I didn't get.\nShould I hand in my notice now, do a shitty handover and let the new person flounder? Or should I stay in my role with more money, but be looking for jobs on the side (it could be months and months before I find a good job). If I do immediately quit, I do have savings I could live on for 6+ months (took me years to save this amount).\nWhat would you do? Any advice?', a user said: 'It sounds as if you might be overestimating your value. You probably were passed over for the more-senior position because you don't have enough experience. The manager they hire who does have experience won't need to be trained by you.\nYou're not giving them cheap labor. If you are working a 40-hour week at the pay rate that was agreed upon when you were hired, you are doing your job.\nYes, you should stay in your role and continue to do your job as well as you can until you find another job. This will benefit you by not doing damage to your professional reputation for being a petulant child and you will continue to get projects for your portfolio.\nYour entire post sounds like a four-year-old throwing a temper tantrum.'",
        "In response to 'I wish I was working 40 hours a week. I am working my ass off to keep this department running after everyone else was let go. I've had to do things way above my paygrade for the past 5 months. The manager will absolutely need to lean on me and be trained on systems I help to set up in the company.\nIt is my prerogative if I want to leave a company that has been taking advantage of me. Working for less than you're worth is not exactly unheard of in business.', a user said: 'You should reread both your own post and mine. You didn't mention working overtime or taking on more responsibilities in your original post. And I didn't say you shouldn't leave and get another job.'"
    ]
}