{
    "username": "PM_Best_Porn_Pls",
    "contributions": [
        "In response to 'There's a great book on all this - why Japan fell off so hard economically and whether it's an issue of Japanese culture.\nThe Contest for Japan's Economic Future: Entrepreneurs Vs Corporate Giants\nBook by Richard Katz\nI read this on the Tokyo subway over the past couple weeks and it's pretty compelling.\nIn short, the innovative companies that rocketed Japan to the top of the world after world war 2 calcified into local monopolies that prevent any new companies from taking the same route they did. They do this with the support of Japan's single party government because the idea of a company of lifetime employed Japanese folding due to competition from a more innovative startup is unthinkable.\nThese old companies do not embrace new technologies because they are too big and have too much momentum to pivot meaningfully. They suck up all the government subsidies that go toward startups in other countries. They suck up all the employees that would otherwise work for startups with the implicit threat of \"once you leave lifetime employment you will never get it again, anywhere\".\nJapan is trapped in an economy where Blockbuster never had to contend with a Netflix because Netflix would not have been able to get any venture capital or convince any employees or seasoned business veterans to face the danger of leaving a lifetime employment company. Except, for like, things a lot more important than movie streaming like the entire digital/computer revolution.\nThis Is not a Japanese culture problem. Japan was very innovative in the past and full of risk takers. The problem is currently the governmentally created carrots and sticks present far more risk than reward.\nThe author also notes to watch out for trends like this in the US where big tech companies have started to buy and squash competition rather than adapt to it and try to saddle employees who leave to form startups to lawsuits and non competes.', a user said: 'Yeah, Japanese managements are hell to deal because of this archaic thinking.'"
    ]
}