{
    "username": "PoliteCanadian2",
    "contributions": [
        "In response to 'It’s everything to do with the priority given to shareholder value over actual business value.\nShareholders want to see returns today. Corporate management teams, in a bid to appease shareholders, perform substantial lay offs and then shifting responsibilities to remaining staff who are already over worked and underpaid as is (due to aforesaid shareholder incentives) and consequently they get burned out and disengage.\nThis has the immediate effect of increasing shareholder value. But it has the long term effect of decreasing business value, which in the long run is bad for shareholder returns.\nBut corporate managers operate based on their incentives, which are entirely driven by shareholder sentiment. And shareholder sentiments are driven entirely by quarterly returns.\nThe problem is capitalism. That’s what ultimately creates toxic corporate cultures and short sighted thinking within corporate management culture.\nBut then there’s always some twat going off about how capitalism is tHe MoSt eFfIciEnT sYsTeM.\nWhat tickles me is all the corporate managers acting like it’s some big mystery and they don’t know what to do about it but that whatever the cause is, it’s definitely not their fault!\nLemme tell you something I learned in all my years working within corporate environments: corporate executives are all privileged, entitled Ivy League pricks who aren’t any smarter or more talented than you or I. In fact, often they’re inept and clueless. They move from one company to the next sopping up benefits and perks and then bailing before the going gets tough. They’re basically trading cards or trophy horses. Executive ornaments. And to be honest, most of their labor is delegated out to subordinates and they don’t do a lot of actual work themselves. But these privileged fuckwits and their incompetence are half the problem here all by itself.', a user said: 'Shareholders are actually the untalked about poison of this whole capitalism thing. They want to continuously see higher profits so when you make 10% more in gross income you can’t increase your costs by 10% investing in your workforce because ‘wE wAnT hIgHeR rEtUrNs oN oUr iNvEsTmEnTS’.\nWhat happens if you don’t show profits quarter over quarter? Your stock price goes down (gasp) and you look bad.'"
    ]
}