{
    "username": "PoorlyAttemptedHuman",
    "contributions": [
        "In response to 'This \"quiet quitting\" thing has such a weird name. It's literally \"Doing your job.\"\nYou don't pay the price of a 97' hyundai and expect the performance of a F1. If you want you car to run at that speed, well... it will certainly cost you.\nI really hate how this corporate hustle culture eventually became a scam to have workers give their 100% while giving them a 20% salary. What was the point of that in the first place? Why did we allow ourselves to be used like that? I remember people shitting on the french for being on strike all the time, supposedly being \"lazy\" and demanding their rights. Guess what? They are correct and we were the suckers.\nPaying X and getting X\n10\ndoes not apply anywhere else in the market, (certainly not profesional services) why are employees any different?', a user said: 'I stopped giving 100% a long time ago.\nAn employer gets my best, which could be 50% one day, 80% another day, and maybe just maybe they'll get a 90% day somewhere in the week. I don't do 100% any more.\nI consider my body a very specialized and valuable piece of equipment. I don't subject valuable equipment to a 100% duty cycle. Why? I don't want to burn it up.'",
        "In response to 'I really like that analogy, I may steal it!\nIt is kinda crazy how we often undervalue and burn out literally our most valuable asset (brain and body), which is the one that generates so much of our revenue as workers.', a user said: 'Oh I understand that a boss or company wants 100%. How can you blame them. When I go to the store and look at a new plasma cutter to play with, I want one with a 100% duty cycle. All I see are less than 50%, to get something like that you have to pay a lot more.\nSadly, we were tricked out of knowing this and it has been hustle, hustle, hustle, more more more give it all to the company and smile and be grateful.\nThey want an expensive, industrial duty welding machine that can work hard all day every day, but they are accustomed to paying Tractor Supply \"good enough\" farm welder prices.\nI hate to tell you, but my body is not an industrial duty anything.'"
    ]
}