{
    "username": "postcardmap45",
    "contributions": [
        "In response to 'Yes it's called acting our wage and we all need to stand in solidarity and quit giving quarter work for nickels and pennies.', a user said: 'Im gonna start using “acting our wage” whenever someone says people are quiet quitting'",
        "In response to 'Original Post: What are your thoughts on “quiet quitting”? Is it something you’ve been doing for a while or something you’ve recently started implementing? For those who don’t know, quiet quitting refers to not over extending yourself and going above and beyond at work such as taking on more responsibilities or staying late. You do what’s asked of you then go home on time.', a user said: 'TLDR; Everyone should read\nPedagogy of the Oppressed_Paulo Freire\nto understand their role as a worker, among other things. Look up “deserving poor” on Google scholar.\nQuiet quitting is a horrible phrase some scab came up with in response to all the unionizing and otherwise appropriate response to exploitation by workers worldwide. This is the type of rhetoric peddled by biased new sources to distract from grassroots work like making a living wage a guaranteed human right world wide.\nPeople forget (or are indoctrinated into a system of thinking that convinces them otherwise) that individual labor has\nimmense value\n(we have to put a numerical value to it due to our current economic system)—workers just personally never get to see how much value it actually has because grand-scale wage theft (even for those who get paid well) is what’s normal in our world.\nYou are not “quiet quitting” if you do what you are (under)paid for. If you enjoy doing more work, good for you—ask for more money/recognition/influence/power. Regardless, your co-worker who clocks out when their workday is over is not a quitter, simply someone who has\nboundaries\n.\nWe should all refrain from using this phrase and tell others around us not to use it either. It’s another way to create division among the working class, to call some lazy and others superstars…further weakening any hope of wide-scale class consciousness.'"
    ]
}