{
    "username": "powerswithin18",
    "contributions": [
        "In response to 'Original Post: [The Philippine Star] \"Quiet quitting\" is taking over the workplace – what exactly does it mean? [External Link]: https://i.redd.it/0rs7ss5twrj91.png', a user said: 'Hello! Before I quit my job, (Medical staff at a private hospital). I had the inconvenience of being “pabida” or doing more than what I was paid for. This totally lead to me being not paid enough, and overworked, of course.\nFast forward to now (working as a freelancer at a completely different career environment: medical to marketing) my work-life balance actually has a balance. I remember a supervisor asked me not to do any work after work hours, or if I did, at least use the timer to track the hours Ive worked so they can pay me (I have a US-based client). So thankful because my pabida attitude lead me to have 2 salary increases in a span of 1 year of working for them. They truly know how to recognize effort and they truly know when not to work.\nI just want to stress the completely different work ethics people overseas have than those that are here.\nI have a friend who works as a freelancer too but to a startup company based here. Let me just say, they expect her to answer urgent calls at 9pm and do reports due THE NEXT MORNING. Did she get paid for that? Of course not.\nAlso, regarding my previous hospital job, I remember I got reprimanded by my supervisor for doing the bare minimum (when I started just quietly doing my job and refused additional workload outside my job description). He also had the audacity to tell me that I was slacking off and that the hospital was just paying me to be there (if you work in the hospital, moments of peace are god-sent). I almost told him how I worked 6 years, never been late, never missed a day (wasnt able to use my sick leaves) and even went through a storm just to show up for work. Basically, if you’re not of good use to the higher-ups they only see you as a mediocre employee that’s just there. They wont fire you but to them, you’re a pain in the butt because you cant do them a favor of doing their dirty work.\nLesson: act your salary. Its nice to go out and beyond just for the sake of “helping” but remember, your workplace is not your “family” so you dont owe them anything. PS if a workplace says “we’re family here” RUN.'"
    ]
}