{
    "username": "Practical_Bed_6871",
    "contributions": [
        "In response to 'Yep, everything this administration does is short sighted by a mile. The detrimental policies and decisions that they’re pursuing are going to cause problems for years and years. It’s already undermining their goals of getting pendency down and maintaining quality of examination.\nTaking away resources examiners use to search and apply art. The fact that just this necessary Windows 11 upgrade has caused so many system issues on a minor level. The fact that applications and functions that have been developed over the last five years suddenly just don’t seem to want to work anymore.  The fact that we can’t hire.  people are leaving. nobody who is currently on a telework agreement will voluntarily opt to return to campus to become a supervisor. Nobody to train probationary examiners.  We are in for a rough few years.', a user said: 'The goal was never to reduce waste or fraud; it was to cripple the effectiveness of government across the board. The USPTO isn't even funded by taxpayer dollars; 100% funded by user fees! Sure, Applicants and the Patent Bar complain about the quality of Office Actions and application backlog, but how does any Applicant gain from the chaos created at the Office by the Trump Administration? How do Applicants gain from probationary Examiners and APJs being fired?'",
        "In response to 'For myself, my morale is pretty low. My sleep is shit, my cognition is shit, and I’m struggling to be creative with BRI. It’s like I can’t see the proper scope of a claim right now. I’ve been writing a lot of in re mayhew rejections to try to force them to narrow things down.\nAt least there are fewer cases being reviewed, am I right?! 🤷🏻‍♂️', a user said: 'If it's any consolation, folks preparing and prosecuting patent applications are also feeling the stress. Companies are cutting prosecution budgets, and cutting back on how much work their in-house counsel sends to outside counsel. Small and micro-entity applicants are also cutting back. It's not a fun time all around.\nJust out of curiosity, anyone ever respond to your 112(a) rejections with the argument that since you haven't determined the level of skill in the art, you're in no position to assert that the application is insufficient to enable a person skilled in the art to make and use the invention as claimed?'",
        "In response to 'Naw. They always amend and do what I say and then I allow…', a user said: 'Resistance is futile.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'It did have some prestige to it. It was a stepping stone to moving up to Director and possibly even Commissioner. It was also an SES job with a lot of managerial work attached to it. It wasn't exactly a frat party.'"
    ]
}