{
    "username": "PragmaticBoredom",
    "contributions": [
        "In response to 'This probably qualifies as an Unethical Life Protip. I did something similar in the past as an IC at a previous company along with my colleagues when a nonsensical performance metric system was foisted on us:\nIt sounds like at least some of your perf metrics are 1) quantitative and 2) transparent within your company (i.e., you can see or deduce the metrics for other ICs).\n1) make a histogram of metrics for ICs comparable to you\n2) assuming you really are in, say, the 9th decile, compare your metrics to the median.\n3) figure out how much effort it takes to stay, say, at the 6th decile (just above median), and do that much.\nTL;DR: if a bad quantitative metrics system is used against you, you can use it right back.', a user said: 'Some practical advice: I think if I surveyed all of the people I’ve managed over the years, 80% would claim to be in the top 50% of the team. Of the people who clearly considered themselves the highest performer on their team, maybe only half or fewer were actually the most\nproductive\n.\nThat’s not to say I doubt the OP. I’m trying to say that it’s much harder to accurately gauge our own performance than we think. Trying to target arbitrary comparisons is easier said than done.\nIf anything, I’d just try to match a couple people around you plus a little extra for safety margin. Trying to stack rank your peers, effectively, is very likely to result in a different perspective than your managers.'",
        "In response to 'You quiet quit when you no longer care about the consequences of being a low performer (and you should probably find a new job asap)', a user said: 'There are two different definitions of “quiet quitting”. One is where you stop doing everything except the absolute minimum to avoid raising suspicions. You’re collecting paychecks until they fire you and playing a game to see how long you can stretch it.\nThe second, which doesn’t make sense IMO but is used a lot on Reddit, is where you go from high performer to average performer. It’s really hard to give advice in these scenarios because you never really know if the person is a superstar or they just imagine it that way.\nIf the OP is actually so far above their peers that nobody compares, there shouldn’t be any concern about PIP or firing. A company isn’t going to fire one person for performing at the same level as their peers.\nWhich begs the question: Why the fear about getting fired? Either it’s irrational, or the OP isn’t entirely honest with themself about how much better they are than their peers'",
        "In response to 'I know I would never get fired, but if I make it extremely obvious that I'm quiet quitting (i.e no longer pushing myself to grow and outperform myself) my managers will start putting undesirable pressure on me by threatening disciplinary action. They've done that before when I was overachieving but they wanted me to do more, more, more, more. They say \"this isn't a charity, we won't pay people to just \"make it through the day\", you have to do XYZ\" (which my peers never do).\nMy dream is to overachieve and be a high performer at a job where my managers can recognize this and help me maintain that level of achievement indefinitely. Where I can feel comfortable knowing exactly where I stand with my work and my performance and feel totally fulfilled at the end of the day without that sickly feeling of being whipped for more', a user said: '“Quiet quitting” in whatever form you imagine it involves not caring what your managers think as long as you don’t get fired before finding the next job.\nIf you’re quiet quitting then you shouldn’t care what these managers think because you’re busy finding the next job.\nI do sense some cognitive dissonance in the way you say you want to be a top performer in a thread where you’re asking for advice on how to quiet quit.\nI also think you’re developing some extremely unrealistic expectations with comments about wanting to feel “totally fulfilled at the end of the day” and having managers help you maintain high performance indefinitely. You’re the only one responsible for your performance at the end of the day and a job will always be a job. Find a job and a pace that you can sustain and stick with that.'",
        "In response to 'What I mean by that is, let's say my job involved tracking report for bank fraud, following and investigating accounts, responding to escalations from front-office staff, staying on top of new fraud trends, and thinking proactively to improve processes that would prevent future fraud.\nI would bring an extremely strong work ethic with a high attention to detail, a commitment to continuous documentation at every level, and a high level of operational proficiency that would have tangible results via a decrease in successful fraud at the institution.\nI want THAT. I would work HARD and I would work diligently but I would feel totally satisfied and fulfilled at the end of the day. I want to be able to go into my performance evaluation and have my manager say \"You're doing great. Let's go through some of your recent achievements. Wow, great job on this. This one was really special. I think you're meeting (or exceeding or whatever) expectations. No complaints here. What do you want to work on/develop? How can I support you?\"\nI don't want to continue in a position where I'm going so far above and beyond (above and beyond what the description of the job is, AND so far above and beyond the other individuals in the team) and I keep getting harangued for more, more, more.', a user said: 'If you want a different type of work that you enjoy more, then you need to go get it. It’s not actually your current job’s responsibility to ensure you’re fulfilled and enjoy the work. They have jobs to be done and that’s the job you applied for and got.\nIf you know what kind of work you’d enjoy then go get it. However, this is a situation where people frequently imagine the grass being greener on the other side of the fence. This job you imagined probably wouldn’t be as fulfilling and satisfying as you imagine because it would still be a job and you’d still have a manager.\nThe cognitive dissonance I was referring to is on full display in your comment above, though I know you’re going to disagree. The part I don’t think you see is the “I would be a high performer if only my managers didn’t ask anything of me”. It’s a common theme among people who view themselves as high performers (or former gifted kids, or high IQ, or a number of other statuses) who struggle when their self identity encounters the demands of the real world. The dissonance between believing they are a top performer and the realities of what a company sees as a top performer is hard to accept, so they externalize the reasons for it: Blame the manager, blame the job, blame the work. Blame anyone but themselves. Then it’s easier to accept, and you can continue imagining the high performer status while asking on Reddit for advice about “quiet quitting”\nI don’t say all of this to be mean. I’m trying to highlight a common pitfall before it turns into a bigger problem. If you don’t like your job, you need to go find a new one. If you’re really a top performer at your job, then going back to average performance shouldn’t be a concern because it would be illogical to fire you from it\nand\nyou don’t care about this job because you’re leaving.'"
    ]
}