{
    "username": "Preference_Afraid",
    "contributions": [
        "In response to 'Original Post: How to Approach Annual Review After I Quiet Quit Almost a year ago, my boss pulled some power move BS and I made two changes as a result: I took work email off my phone and stopped working more than the expected hours. No more extra from me - if an opportunity for a conference proposal comes and she doesn't mention it at the weekly meeting, neither do I. If she has a \"good idea fairy\" moment of something she's really like to see happen I just...don't.\nMy boss's boss knows my boss is a piece of work and after I confided in a colleague that I was thinking about leaving, I was rewarded with a raise.\nSo now we're at the year-end and I put together the end-of-quarter metrics. To do so, I pulled from last year's annual report, and holy hell while we've hit our metrics most of the \"extra\" stuff has fallen away.\nIt will be time soon for my annual review and next year's goal-setting. I'm wondering if anyone has any advice for the discussion. I'm thinking that no good comes of telling her that I'm done doing more than what's required, but I have to think it will be fairly obvious. Anyone have any good advice?\nFWIW we are a team of three, and we replaced the other team member last year, had someone for a little over a month who didn't work out, so I think I can play it off like some of my time was spent mentoring? I also want to stay in this job at least 5 more years because of some specific benefits and the hopes that my retirement-aged boss will quit in the next two years. Thanks!!', a user said: 'I love my job but there's absolutely no opportunity for advancement where I am. When I'm asked about goals in the performance reviews I tell them as much: no opportunities to advance so my goal is to meet my metrics to maintain employment'",
        "I've stopped doing the \"fun\" extra office stuff after I didn't like the way my boss handled something, AITAH? I guess background is important and sorry it's long:\nMy job performance is exceptional. I meet every necessary mark 100% of the time and have done so for the last ten years. Maybe an odd month or two in there due to travel and things that would make it impossible. I've also stepped up and carried the load for coworkers when things have come up to ensure our area isn't dinged for performance issues. Clients get along well with me, I've never had a complaint filed against me, etc. You get the idea.\nI also am known to do all the holiday decorating, coordinating the gifts for office celebrations, baking the desserts, writing formal thank yous from our department, and making holiday baskets to help maintain positive relationships with the other agencies we work with.\nA couple months back, there was a policy change and none of us were happy about it. I made the best of a bad situation and adapted to the change immediately. My coworkers did as well, but they all called me to complain and vent. This is normal. We tend to complain amongst ourselves for one good bitch session and then just \"it is what it is\" and continue to work hard and not complain again.\nHere's where the issue is, while one of my coworkers was venting my boss was eavesdropping selectively on my side of the conversation as that's what he could hear. I was commiserating with them, but also pointing out how it wouldn't be that bad, it's in our contract, how we can make it fun/less obnoxious etc etc etc. We hung up and I didn't think about it further, especially since neither of us really said anything that you wouldn't expect an employee to say with the kind of change they're wanting. It was pretty damn tame....\nI didn't think about it again until my boss called me in a few days later to do an employee evaluation in response to it.\nIn every review I've had here I've always hit the \"exceeds expectations\" in nearly every category. He cut me down to \"meets expectations\" on everything. He reamed me for my \"attitude\" for not cutting my coworker off and letting them vent. Telling me I should have told them to call him. He accused me of being negative/a negative influence and that if he didn't \"nip it in the bud now it could fester and create a toxic work environment\".... I was and still am pretty pissed about it. Coworkers should be allowed to vent to each other without it being treated like this.\nAfter this, as you may have guessed, I'm just not in the mood to head up everything extra I'd been doing to make the office environment \"fun\". I keep my door closed when he's here, I didn't bring dessert for the March birthday lunch. That lunch isn't mandatory, but I didn't want more problems so I went and just sat quietly the entire time. Now there's another \"appreciation week/month\" for one of the departments we work with and there's been an email chain about cards/gifts and I've responded the amount I'll put towards it and asked who I should send it to.... People are noticing I'm not picking this stuff up and that chain has gone in a circle for days now and I'm not budging. I've had one person approach me about it and I just said I don't have the time to take it on right now.\nI guess I'm feeling like all the shit I did on the regular to foster a positive work environment got thrown out or was never appreciated because I lent an ear to a coworker and then got viciously reprimanded for it. Like what's the point if ten years of going out of my way gets thrown out just like that?\nAITAH for just quietly stepping out of all of these extras due to my feelings on how this was handled? Am I being overly petty?\nUPDATE\nI hope I'm updating correctly.\nSo a lot of people had asked for an update. I've waited a while after some movement/developments.\nThere was an event that usually requires someone to head up the card, gift, staff coordination things. I had told the team and my boss several weeks in advance this event was pending and I wouldn't be free. No one did anything until the day before and then one of them called me to ask that I do all the leg work.\nI declined citing that I just did not have the time. Which was/is true.\nMy higher ups cornered me on this a few days later stating that I've been pulling away, teamwork makes the dream work etc. And citing this event as evidence. They also cited me being on my phone during unofficial mandatory fun times as further evidence of drawing back.\nI told them that I had given everyone, boss included, weeks of notice that the event was coming up and I wouldn't be available to head it up. I pointed out that I'm still helping the team with tasks directly relevant to work, but with my current caseload I just can't afford to allocate time to the social/event planning right now. As for the mandatory fun, I reminded them that I often don't get lunch breaks due to community meetings that get held at those hours and my having to flex out early on those days. So having to lose out on a good break on a day I don't have to is burning me out.\nThey fumbled around for about thirty minutes trying to convince me, and I just held firm that with my current caseload, I don't have time to allocate to non-essentials. I was told I'm allowed to prioritize my breaks.\nI've been so busy I haven't had a chance to attend the community meetings recently, and honestly, this might be another thing I end up cutting back on in the long run.\nOverall it came across like they're panicked I'm considering leaving. There was a comment about that concern and I let them know I'm not planning on leaving, but I am taking time to restructure my priorities now that my caseload has increased.\nUPDATE 2\nAnnual performance evaluation is in and it's just as dismal as the retaliatory one. I've declined signing it without discussion and I've contacted my Union. This feels like punitive retaliation. If they can't justify the decreases despite my consistent quality performance I will be quiet quitting everything that's not a core job function as continuing to do so will feel like chasing an unattainable metric.",
        "In response to 'NTA.  The boss, as the kids called it, FAFO'd.\nVenting is typically a positive and necessary thing, as long as it's handled appropriately, and it sounds as if you were that appropriate \"bottleneck\" and sounding board.  He was extremely stupid to have not allowed you to explain the situation to him.\nStand your ground.  Just keep it light, sweet, and \"My work load is preventing me from keeping up with those extra tasks\" about it all.', a user said: 'Thank you. I did try to explain it to him when he was marking me down. The real irony is he was sitting there calling me a potential negative toxic presence that was going to ruin team morale the day after I had just handed out hand made Valentine's to my other teammates.'",
        "In response to 'It sounds as if they're pretty tight with OP seeing as how, prior to this, they felt safe to vent to her.  Clearly that's all going to end now and I can't imagine why OP wouldn't subtly let it be known why.', a user said: 'I've beaten around the bush a bit, and I think they've had  similar issues with him recently as well. Two of them have vaguely asked about the change and I've kept to the line about just being busy with my caseload the last month or so.  It's one of those \"been slammed\"\nexchange knowing looks\nsituations.'",
        "In response to 'I don't think OP should even let it be known subtly. It reads like their boss legitimately was listening at keyholes. I'm not sure if you want to even subtly complain in that environment.', a user said: 'No, it wasn't like that exactly. Historically we've all called to complain to each other when things change and then we move on. He's been around for that and never taken issue before. I had my door open and I guess he just wasn't having it this time for whatever reason. He definitely misheard things though. It's like he heard key words and phrases and took them out of context or dropped them entirely.'",
        "In response to 'I agree with you and absolutely would be hurt in this aspect of having an evaluation weaponized against you. He is toxic management. His actions are going to damage morale more than providing a sympathetic ear will ever do.\nHe (boss) is going to try and flip this on you. Now that you're not doing the extras that did brighten up your coworkers days, he may try and come back and use this against you.\nDo you have a way to formally dispute the evaluation? Can you speak with HR? He is out of line punishing an employee for listening to someone else vent about the workplace. Venting is healthy. Gets things out in the open so work can continue. I think you need to \"vent\" to someone higher on the food chain that can wrangle him in.', a user said: 'This one isn't the annual so it doesn't really count towards anything that could impact pay/raises. If my next one goes like this I will be taking it above him, at that point it will potentially impact my earnings and I refuse to get docked pay when I do so much'",
        "In response to 'Do you get a copy of all of your evaluations, including this one?\nIf you don't - make sure you get them.\nAlso document like you did here in a diary - an explanation that you attach to that last evaluation explaing your side, and date it.  Keep a diary (a CYA diary) of any further interactions you have with the boss going forward.\nThis way if it does impact a pay or raise or more formal evaluation that impacts pay or raises, you don't have to recall something from a year ago - you can just tell them you will refer to your journal entries.', a user said: 'This is great advice'",
        "In response to 'I think this is egregious behavior from a manager and you ought to advocate for yourself sooner than later. This should not be swept under the rug, leadership should be aware of this choice he made.', a user said: 'Oh this is one of those \"not what you know but who you know\" situations in regards to hiring and I'm not looking to whack the hornets nest unless absolutely have no other option'",
        "In response to '[Deleted or Empty Comment]', a user said: 'The whole reason we were complaining amongst ourselves and not to him is because we know the change wasn't something he decided on. We didn't see the point in stressing him out on something none of us have any control over. It definitely felt like a just complain to each other and move on situation.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'No idea, he gets in these moods sometimes. Part of me wonders if he's been getting crap from higher up and it's just seizing an opportunity to try and look better. Like if our evals go from ok to fantastic in a few months it will give him some kind of benefit on his next eval?'",
        "In response to 'What do you mean?\nLike he is purposely underselling evals so later it looks like there was growth?', a user said: 'Yeah, aside from wanting to make an example out of us, it's the only thing I can think that makes sense.'",
        "In response to 'The fact that he took what he overheard and worked that as part of your performance evaluation is extreme and tells me there is something more to this on his side.  All the extra that you are doing are not part of your work duties and stepping back is a choice.  Simply let people know that you no longer have time to participate or lead such activities.   I would watch things carefully and start documenting.  Make sure that your silence and non participation is not used against you,', a user said: 'That's the reason I didn't miss the March birthday lunch. I'm definitely documenting. My plan is to just say \"I don't have time with my current case volume\" if anyone asks. I've heard he reviewed the person that was complaining to me too, even though he didn't hear their side of the conversation, which I'm thankful for. Not them getting reviewed, but the not hearing part. They were pretty worked up.'",
        "In response to 'NTA.\nYou might want to start looking for a new job. Your boss seems to be the type to have the attitude “the beatings will continue until moral improves.” He may end up firing you to “nip it in the bud” and set the other employees straight.', a user said: 'Oh, that's the thing, I love this job, it's a good one, and one of the few that still has a union. He wouldn't be able to terminate me unless I actually did something crazy or consistently not meet my matrix.'",
        "In response to 'Can you talk to your union representative about what happened here?', a user said: 'I could, but I'm holding off unless he tries to take it further than this. My actual review is up in a few months, and if that goes like this again with how good my performance is, I will be.'",
        "In response to 'I’m sure you know the protocol better than I do. That said, is this something you should give your union rep a heads up about? This thing happened, I won’t take any further if I get my usual excellent review. But if I don’t,…', a user said: 'Maybe it's my people pleasing, but I kinda feel like they're busy and I don't want to bother them unless, you know? Maybe I should though'",
        "In response to 'NTA. If he considers every thing you have done as meets expectations, then only give him 'meets expectations'.\nThen when he complains, tell him that since going above and beyond is only 'meets expectations', you are only going to give him 'meets expectations'.  This is on him.', a user said: 'I've just decided that if he wants to improve or maintain morale at the level it's been, he can take the lead on all these non work related odds and ends.'",
        "In response to 'If your boss can listen in to your conversations, you have to be a lot more careful (learned this the hard way). There is not necessarily anything wrong with venting, but there is a time and place. Your boss, however, is a complete AH for his review based on one overheard one half of a conversation, instead of communicating his concerns to you. He is probably unaware that he has hurt morale, as you are not doing the things that actually helped morale.\nNTA - but please learn not to have these types of conversations in a place or phone line that can be overheard.', a user said: 'Yeah, usually if we're going to say something out of pocket we do personal phone texts, I guess that's why neither of us thought anything of it at the time. It was so run of the mill \"this sucks what can you do?\"  That we didn't think it would really be taken like this if someone did over hear'",
        "In response to 'NTA - but the  entire reason you were called into the office and given a pop performance review is to create a paper trail to be used to fire you in the future. So, since you're not sucking up (and I wouldn't either), you're going to get fired. I'd start looking for your next gig. It's time.', a user said: 'I promise you, it's unlikely given the union. I've seen people scream in a boss's face in the middle of orientation with twenty witnesses during a department transfer and they are still working here. That guy didn't even meet his time frames. If all he has is \"she said 'yeah I agree, this sucks'\" I think I'm ok.'",
        "In response to 'NTA. I'm curious about the policy change, but either way your boss is an idiot and doesn't deserve you. I think you're smart to cut back on all that extra effort in this situation.', a user said: 'Mandatory nontraditional hours with a lot of extra stipulations.'",
        "In response to 'Sounds like the union contract negotiations team is pretty weak if this happened. Is your union as strong as you think it is?', a user said: 'Our contracts state some nontraditional hours may be required. They've never used it like this before, so it was a shock to all of us.'"
    ]
}