{
    "username": "PreferredSelection",
    "contributions": [
        "In response to 'As much as it matters to you, I can tell you that they don't give a shit about what you did and have already moved on. I quit my job of FIFTEEN YEARS at the end of January, as a developer. I was tired of all the shit there. Tired of my boss. Tired of it all. I couldn't take any more of it. COVID certainly helped me start looking, but I am very happy I never ragequit, even though I wanted to. I gave my notice. Gave them 4 weeks. Once I was gone, that was it. Nobody cares. My old boss hasn't reached out once to ask how things are. Other employees I worked with for a decade or more don't talk to me. Nobody gives a fuck. Me, on the other hand, I've never been happier. My new job is awesome. I'm finally treated like a person. Upper management is great. I love the development I do (company develops cannabis grow monitoring solutions), and finally feel like I'm making an actual difference in the world. Happy employees equal happy customers, but my old boss didn't understand that. I was depressed. I was angry. I couldn't take it anymore. Good for you for finally quitting, because it will make a difference to you even though nobody else at your old place gives a fuck.', a user said: 'Other employees I worked with for a decade or more don't talk to me. Nobody gives a fuck.\nThis is so true. When you fantasize about leaving a horrible company, you can picture the hole you'll leave. Especially when you know you're doing the work of more than one person.\nThat's the thing about being underappreciated, though. No reason they should suddenly care once you leave.'",
        "In response to 'I dreamt of the day I'd give my notice. I could see my boss falling to his knees saying, \"No, please don't go. What do we need to do to keep you?\", and me saying something to the effect of, \"You could pay me a million dollars and I wouldn't stay.\" They were really good dreams. Then I gave my notice. He was calm, cool, collected, and immediately thought about planning for my departure. Congratulated me on the new opportunity. Never once asked why. He just did what he wanted to do for his company. He did not care if his employees were unhappy.', a user said: 'I got a mix of this. 25ish% raise offered at a place that normally does 2%.\nBut cool and collected, totally understanding of why I was leaving.\nIt actually kinda sucked. I've had so many terrible managers come and go, and when I finally found a job elsewhere, I had to give my notice to one of the better bosses we'd had.'"
    ]
}