{
    "username": "Pretty_Baseball_6056",
    "contributions": [
        "In response to 'I have been politely declining and actively ignoring requests for personal service for the last 2 years. I've been overloading my schedule because my retirement is directly proportional to the average of my highest five salaries. And there really just is no time for me to do personal service. Unless you are directed by your supervisor, I would just quietly pretend you're not getting the emails. I feel like they don't deserve a response, honestly, and I think it's best to just let the request pass on by. I think responding it to it brings too much attention to not doing it, but ignoring it, you can just pretend you didn't get it', a user said: 'Are you sure overloads will help? I would guess they don't count towards your \"salary\" and are instead are a different contract entirely'",
        "In response to 'Associate professor here as well.\nAs you very well know, any service you don't do is service someone else will have to. Telling your colleagues you don't want to do service because you didn't get as much summer teaching as you'd like probably would not go over well for you.\nThe unfortunate reality here is that absent an external offer, or intention to quit, you don't have any leverage.', a user said: 'Orrrr....hear me out.... ALL professors (or at least tenured ones) stop letting administrators trample you by ceasing all service'",
        "In response to 'If that is your goal, join a union, join the AAUP, vote no confidence in the faculty senate. You know, the opposite of the \"quiet\" part.\nTenured faculty saying no to their share of service does absolutely nothing to administration, just transfers it to the non-tenured faculty.\nPeople can downvote me all they want. But I've been the junior faculty at the university where all the tenured faculty refused to do service and then fought to take over the summer classes from non-tenure track faculty. Nothing like being the assistant professor having to single handedly handle accreditation because tenured faculty didn't care. Nothing like watching lecturers making 40k a year not being able to teach summers because faculty making 100k wanted a little bit more for their retirement.\nYou want to fight administration, then use that damn tenure for something and actually fight the administration. The \"quiet\" part of \"quiet quitting\" just means that your punching down at the folks without tenure.', a user said: 'Yes, believe it or not it is my goal to be treated with dignity and respect. For the 10 years I invested in my education to pay off with a job that values their employees.\nAlso, my personal experience at a state school in a blue state showed me that some unions are completely usesless and can even make the conditions worse. My experience at that school was that the only people who stuck around long-term didn't depend on their paycheck the way I did (spouses earn much more, they're single, family money, etc). As a result, few people paid attention to important administrative/board issues, and thus no chance for change.'"
    ]
}