{
    "username": "PrimalSeptimus",
    "contributions": [
        "In response to 'I had two bosses at a previous job who were genuinely boggled that I wouldn't do what they thought were \"common things that employees should do.\"\nOne boss gave me a $20 and told me to pick up doughnuts the next morning before work.  I was going to charge him overtime until he apologized; he realized that it was out of place as a work request.  It was a \"no harm, no foul\" situation for me at that point, but I've had others.\nOne boss wanted me to go pick up three laptops at an electronics store near the job and put them on my own credit card.  \"No.\"  *boggle* \"Why not?  The company will reimburse you.\"  \"Would the company lend me (price of\nNICE\nlaptop * 3) for several weeks?  No?\"\nIt was an I.T. job where some server monitoring and troubleshooting was involved.  I was \"selected at random\" to wake up twice in the middle of the night and check server health, plus troubleshoot as needed.  \"No.\" *boggle* \"Why not?  We'll pay you for the time you've worked.\"  \"You require two weeks' notice if I need a day off.  Changes to my schedule require two weeks notice.\"', a user said: 'I once had to buy a ton of equipment (enough to set up a new facility and enough for Fry's to flag me as a suspected reseller) on my own credit card, and it was awesome. I had to wait for the reimbursement, but I got soooo many points that I was able to redeem for flights/hotels.'",
        "In response to 'i used to do something similar, but with restaurant points rather than credit card.\nall the food i ordered for my department got put on my bosses' credit cards, but the accounts were all in my name.  most of the time i'd spend the free money on picking up a ton of pastries some random morning, but i'd use any pizza place freebies on my family for dinner.', a user said: 'I used my Amazon card, so I racked up points fast, since I was spending thousands of dollars pretty much every week for a while. I would have been hosed, big time if I hadn't been reimbursed in a timely manner, but since I was, I was happy to do it. Back then, the rewards were a lot better, too, and I was able to use them for a basically free trip.'"
    ]
}