{
    "username": "Prince_Jellyfish",
    "contributions": [
        "In response to 'Original Post: How to effectively quiet quit as the highest performer on my team I am the team's highest performer. I have a lead IC role (\"hybrid management\") where a lot of my job duties involve coaching, development plans and employee growth. I am one of two lead ICs and there are like 3-4 other ICs on the team.\nOver the past two years, I've taken this position very seriously and have operated at a much higher level (the position above mine) than expected. I was rapidly promoted to lead IC in less than a year and I have been told that going into full management is \"mine if I want it\". The difference between myself and the other ICs on the team (including lead IC) is pretty dramatic. I'm easily doing twice or three times the workload and have a much higher operational proficiency, client satisfaction, etc.\nFor a plethora of reasons, I've become totally disillusioned with the institution, middle/upper management, and the position. What's compounding my anger/depression is that I took my position as a downgrade in my career, but intended to be underpaid and underappreciated for 2-ish years to build up hands-on experience in a new industry. I've been ACTIVELY trying to get OUT and make a lateral or upwards move (externally, not internally as my institution does not offer internal jobs) and because of the PARTICULARLY shitty state of the white-collar job market (\"worse than 2008\"), I have been faced with rejection after rejection after rejection, usually after getting 99% of the way there. I also have particular grievances about the way that middle/upper management has \"strung me along\" on a variety of promises. I look back and see that I'm literally ROTTING in what was supposed to be a temporary position, in the prime years of my career, and I feel STUCK (can't get out no matter how hard I try).\nIt's important to note that I really don't *like* the idea of quiet-quitting. I always used to say \"why would you quiet quit? Just go find a better job that you feel fulfilled in\". The problem now is that I'm so bitter at the institution that putting in extra effort feels nauseating and violating, and I'm STUCK at this job due to the extremely terrible job market (unless I restart my career entirely or quit without a job lined up).\nAnyways, circling back to the point of my question: I've become widely known as such an aggressive overperformer that my bosses have flat-out told me that overperformance has become my new baseline for expected monthly performance. I used to easily get \"exceeds expectations\" every month, whereas now they want me to continuously struggle and squeeze every drop of effort out of myself just to justify a \"meets expectations\". My goal for quiet quitting is to start putting in the same amount of effort as the other lead IC, who notoriously underperforms but is never held accountable. However, it's going to become extremely and immediately apparent as soon as my next monthly performance evaluation hits, and my managers are going to be asking me \"WTF is going on\".\nI fear that this will immediately result in 1-2 months of \"does not meet expectations\", followed swiftly by a PIP or something like that. I'll be told to go back to my previous baseline, and when I don't, I'll be accused of insubordination or something. I really don't want to deal with this level of mental stress, especially as I'm already highly depressed from my rejections while job-searching.\nDo any managers here have an idea of what I should do to effectively and smartly go from \"ultra top performer\" to quiet-quitter?', a user said: 'First, your feelings of stress, overwhelm, frustration, and despair, are all valid things to feel. Most people would probably feel the same way in your situation You're not wrong, stupid, or crazy to feel the way you do.\nAt the same time, your feelings are not entirely based on facts.\nIt seems like, to some extent, what may currently feel like an impossible problem, is not actually as big a problem as it seems to be.\nYes, the job market is pretty rough out there. Yes, you are in a situation where your current bosses expect you to over-perform, and might be pretty annoyed if you drop down to baseline.\nThose things are outside your locus of control. They are real, they are affecting your situation. But, while your decision-making should take that context into account, that should not be the focus of your solution.\nYour solution should be focused on the things you can do to go from where you are now to where you want to be.\nFrom the outside looking in, the solution to your problem is pretty simple:\nFirst, keep looking for a new job. It sucks that your past attempts have not worked. Keep going.\nSecond, consider getting some career and job application advice. It might be that you are doing something small to undermine your chances. In this hyper-competitive environment, outside feedback can often help.\nThird, start to think in an open-minded way about how you might widen your search. You might have to go in an unexpected direction for a while. You took this job as a means to an end -- but it might turn out, things being what they are in 2025, that you might have to go left when you planned to go right -- or even go purple or banana or something totally outside the box.\nWhen it comes to your current job, my best advice is, if you really are doing twice or three times the workload and have a much higher operational proficiency, client satisfaction, etc, to drop down the amount you are currently working, but not to zero or baseline.\nWhat would it look like to outperform the rest of your team by 105% or 110% instead of 200%-300%? What would it look like to be the top performer on your team by a small but significant amount?\nBe very smart about setting that as your goal, and then do the work to accomplish that goal and no more.\nIf you get bad reviews or feedback, or put on a PIP, my advice is to not care very much about that.\nYour managers aren't teachers in school, they aren't mom and dad, they aren't people you always need to keep happy with you at all costs.\nYou are currently placing too much emphasis on keeping authority figures always happy with you, no matter the personal cost.\nIn a situation where an authority figure is a helpful, wise mentor, that can be a good thing.\nIn a situation where an authority figure does not have your interests in mind, and is only trying to squeeze as much productivity out of you as possible while you burn out and experience extreme emotional distress, trying to keep them happy at all costs is actually really dangerous.\nIf a job/employer demonstrates that they will not reward you for going above and beyond, you can simply choose to stop going above and beyond.\nI'm sure when your productivity drops, they will be annoyed at you. But, ultimately, in my opinion, that's only your problem in as much as it's your problem.\nIf you are professional and polite, it is unlikely that they will fire someone who has dropped down significantly but remains a top performer.\nUltimately, again, all of your stresses and fears are valid. But a lot of this problem is emotional/mental (though still real and valid). \"Someone will be disappointed in me\" and \"I will get put on a PIP\" -- these are not the failures that your emotions are telling you they are.\nA job is a partnership. When a company demonstrates that they are not looking out for you, your responsibility is to be realistic, understand the power they do hold over you (ie compensation and potentially firing you) and make smart, rational, self-interested decisions based on that context. You don't owe anyone overperformance and exhaustion just because they will be annoyed at you if you don't give it to them.'"
    ]
}