{
    "username": "PrincessBuzzkill",
    "contributions": [
        "In response to 'Original Post: Quietly quitting When I first heard the term 'quiet quitting' I needed to understand more of what that meant. Now that I know, I think that's me right now.\nI've been working the same job for 10 years at a major global electronics company, a name all of you would know instantly. It's a good job, it pays well, it's low stress with great benefits. I am good at what I do and my co workers are cool.\nAnd I don't give a fuck anymore.\nI stopped trying to advance. I stopped going the extra mile. I stopped being the one offering input at the weekly meetings. It just doesn't get me anywhere after all these promises of working your way up the ladder.\nI realized I hit a peak a few years ago and no matter what I do, or how hard I work, it doesn't matter. Upper management are mostly ambitious borderline sociopath MBA career climbers who are all young enough to be my children. They all give a creepy vibe almost like a politician who acts like they care about you, then they talk shit behind your back.\nSo I still do my job but I do the minimum amount required not to be noticed. I don't report errors on our website, I don't correct people when they are wrong. I just don't, period. The biggest thing that put a target on your back here is attendance, like even clocking in 1 minute late gets you on the tardy report that goes out once a week but I never have a problem with that, and quite honestly it blows me away how many co-workers just can't seem to get here on time because we aren't in a giant metropolis with lots of traffic. Usually the younger co-workers are the late one.\nI am in my early 50s and I've spoken with my immediate supervisor who is two years older than me about this, and we're both in agreement that we're too old and lazy to want to start over, so we'll just coast here as long as we can.\nAnyone else feeling this?', a user said: 'I don't think that's really 'quietly quitting' - I think that's just work/life balance.\nI've been with my company for nearly 25 years now, and realized about 8 years or so ago that I just don't care enough to keep killing myself trying to reach the next golden ring.\nI like my work, I like my team, I'm in a relatively good place financially, my managers don't need to hand-hold me, and they appreciate that I have firm boundaries about what I can/can't do during work hours.\nWhen my company tasked our immediate managers to have conversations with their employees about their 'career aspirations and goals' I was straight up honest and said 'I really just want to keep on doing what I do or similar - I don't want to manage people - I have no desire to keep climbing the corporate ladder.\nI'm working to live, not living to work\n\"\nI've refused to carry a work phone because there's no reason to get in touch with me after 5 or on the weekends.  I rarely volunteer to work more than what I'm paid for because I don't get overtime as a salaried employee.  I've even (occasionally) told C-Suite executives 'no' to requests because of my work load being too much -\nespecially\nafter we went through the last round of layoffs and they kept trying to squeeze more and more out of us.\nEven with all of this, I still win awards and various accolades at work, I'm still get shout outs all over the place, I still get raises, I still get rated as 'above expectations' on my reviews, and I'm still asked to join special projects because of my knowledge, expertise, and honesty.\nI also know I'm replaceable - everyone is.  Corporations, and the people who make the big dollars of our backs, don't really give a flying fuck about anything we do in the trenches.  They have no loyalty to anything more than their own stock portfolios, so I simply choose not to give them more sweat equity than I need to.'"
    ]
}