{
    "username": "ProfessToKnow",
    "contributions": [
        "In response to 'Admin has made a number of decisions in the last two years that have amounted to several pay cuts and huge demands for more work. My response has been:\nTake service commitments only if they come with course release or stipend.\nSay yes to students but no to admin unless there is extra money involved (no volunteering for their pop up committees, town hall meetings, etc).\nRespond, but don't be proactive, especially if admin is about to shoot themselves in the foot. I've been around long enough to know when they're about to hurt themselves, but they don't want to hear that their idea isn't brilliant, so I just sit quietly while they break things.\nSkip everything optional.\nResearch what would be interesting to me anyway, even if it wasn't published.\nUse every perk of the job to comfort myself: all the CE money, any scheduling flexibility, etc.\nRemember that this isn't forever and have a back up plan.\nI hope we all find a way through!', a user said: 'This is a fabulous list. I’m in a similar situation with diminished compensation and more demands on my time, and I’ve been slowly shedding anything nonessential over the last five years. The hardest is not being proactive and engaged in uni projects. I’d previously been very involved in program and curriculum development and would have a lot to offer in those areas, but there are no concrete rewards for that works and my goodwill is largely spent.'",
        "In response to 'For example, a student emailed me today and asked a question.  I normally would make several phone calls and send several emails until I found the answer for them.  Instead, today I just told the student to email Admin.\nThat is an example of soft quitting.  Not my problem.  Talk to Admin.  This is me not going above and beyond anymore.', a user said: 'Passing this kind of task to administrators is the best and simplest way I’ve found to free up my time. I still sometimes have the urge to fix a problem myself when I know I can, but it’s healthier to pass it on.'"
    ]
}