{
    "username": "ProfessionUpbeat4500",
    "contributions": [
        "In response to 'Original Post: I am an indie dev, earning 4-5L/mo, doing freelance projects and my own products I am a 27-year-old indie dev, I make games/apps.\nI live in Vadodara/Gujarat.\nI started my indie journey 13 yrs ago, making simple android apps.\nThe Beginning (2011-2019)\nStarted at 14 making simple Android apps\nLearned C/C++, PHP, Java, JavaScript, MySQL - built my foundation\nEarned around $500 from early apps and websites\nWent to UK for master's in game development, came back to india\nBreaking Into the Industry (2019-2021)\nGot first job as game designer in mobile games (2019)\nCOVID layoff after quiet quitting - they noticed I'd checked out\nJoined French studio remotely as junior PM during pandemic\nBuilt my own games on the side, worked with publishers\nHired freelancers, made $2000-$2500/month working on own projects\nThe German Detour (2022)\nMoved to Germany for game producer role in January\nGot laid off by October - realized I couldn't work in corporate structures\nDecided to go completely solo after coming back to India\nThe Reset and Breakthrough (2023-2025)\nTook break, read books, decided to focus fully on indie dev\nPivoted from mobile to browser games - less competition\nStarted creating game dev content on LinkedIn - best decision\nMade browser variation of trending mobile game using AI + my programming skills\nHit 30+ million players, Game of the Year on CoolMath Games\nMade 20+ browser games - solo + with freelancers\nOpened doors to publishers, freelance projects, speaking opportunities, game licensing\nI now get freelance project requests regulary from a couple of publishers. I hand them to freelancers or use Cursor to build most of them.\nI have published a couple of games for TV platform and they are already profitable now.\nI earn about 4-5L/month and hopefully it will be doubled by end of this year, and my schedule is not hectic at all.\nI take afternoon naps, hit the gym, working in different slots throughout the day.\nAll bootstrapped, solo, from Vadodara - you can build something big from anywhere.\nHappy to answer questions!', a user said: 'Share any game u made'"
    ]
}