{
    "username": "Professional-Belt708",
    "contributions": [
        "In response to 'Original Post: Is anyone in the process of “quiet quitting”? I’ve been at my job for 9 years. I work in a department where I get swamped daily and have been under staffed since covid. I’m burned the fuck out. I’ve asked management and HR for help to no avail. I dread every day I wake up knowing I have to go to work.\nI’ve tried to pare back my work load myself but my work ethic is too strong to just go in and dog it but now I’m to point where I don’t care. I make great money and the benefits are probably some of the best in the country but I’m not happy at all. I’ve looked at applying other places and have had call backs but I couldn’t pull the trigger and leave.\nI’ve heard of quiet quitting where you just go in and do the bare minimum. Knowing my employer they either won’t bat an eye or they will come to me and wonder why I’m not laying waste to any and all tasks like I used to which would be a mistake on their part as that would piss me off lol. Has anyone done quiet quitting or currently doing that?', a user said: 'Get over your work ethic first of all- lol! The company would shed you in a second to save $10 for shareholders or the CEO.\nI started quiet quitting/acting my wage at my last job when I learned the pay and bonus structure, that no matter how hard I worked I’d never get more than a 3% raise and bonuses were longevity based, not merit based. And I was doing the work of three people.\nLuckily most of my processes were manual, couldn’t really be tracked, my bosses didn’t really understand what I did even though I was the only one who knew how 85% of the department worked. So I just slowed right the hell down when I started burning out and they didn’t even notice. I started looking for a new job too but it took almost 18 months because it’s really hard to find a high paying job in my field. Now I’m well compensated and working hard for the money I’m paid!'",
        "In response to 'This legit was my last proformance review they call them \"360 reviews\" for added chagrin. \"We were not able to consult your follow workers to get positive feedback from them about you\". \"Thats because all the people I worked for in the last three years all resigned and left around the same time 12 months ago and you didn't replace my team. I have been running my department single handedly, how about a raise?\". \"we are not going to see you here in the office early every day and staying late on the phone to customers belting out positive outcomes\", \"nope and you never will\". I resigned 3 weeks later to go to a much better paying job. And refused to do \"an exit interview\",citing a complete waste of time\". After the blockages in work they replaced me with three discount employees that can barely communicate in English and still to this day I hear from people the other side of the fence give me a smile about the shitshow since I left even almost three years later.', a user said: 'A colleague and I quit a shitshow job last year after one of our colleagues was fired for reasons having nothing to do with his performance. The manager just didn't like him, so she and the office bully conspired until they found something they could fire him for.  That was the final straw for me and my colleague who were the other two longest term employees (lots of institutional knowledge walked out the door with us!).  Now, I hear from the former colleague I'm still close friends with that the person who replaced the colleague who quit last year with me just quit two weeks ago, and the person who replaced our fired colleague just quit Friday!  We're roaring with laughter over this.'"
    ]
}