{
    "username": "prophetprofits",
    "contributions": [
        "In response to 'Original Post: Is anyone else “quiet quitting” or just completely burnt out? I’m just completely over it. I used to be so “hungry” and now I’m catching myself doing the bare minimum, and I genuinely don’t care if I get fired.\nI think the largest factor is that I’m not getting paid until equipment ships and we’ve been on a year+ lead-time, so the carrot is essentially gone.\nI don’t have an ounce of ambition left in me, and it sucks because I have “golden handcuffs” to this job because I have over $50k in commissions waiting for me.\nIs anyone else feeling the same?', a user said: 'Burnt out, yes. Considering a completely different career path. Monthly quota is wearing me down — especially not hitting it these past few months — the pressure looms outside of work and the dread coming back on a Monday isn’t healthy.\nI’m still relatively young (4 years out of uni) but as an introvert I don’t know if I can mentally handle being a full cycle rep of making 50 calls a day plus doing demos and closing deals.\nI love being rewarded for your performance unlike other jobs, and I get to build trust with people and help solve their problems, and I enjoy the grind. But with so many things out of my control (DMs pushing deals months out) it’s freaking tough to keep level headed. I realize why the drinking culture is so rampant in sales.\nI honestly don’t know what to do — been in my role 6 months, I’m building better habits around sleep, mental health, eating, and exercise but I haven’t seen a lasting change. I’m normally an anxious person so I’ll admit maybe I’m just not cut out for the constant pressure sales brings when you’re not doing well.'",
        "In response to 'and the dread coming back on a Monday isn’t healthy\nYour dread has the courtesy to wait until Monday?  Mine starts on Sunday.  Every Sunday.', a user said: 'It’s 100% there for me too every Sunday, the later in the day the greater the anxiety. But nothing compared to waking up on a Monday morning thinking here we go again.'",
        "In response to 'Maybe consider looking into an AM/renewals role! You still get the rewards of a “sale”, but less pressure and very little (or zero) cold calling.', a user said: 'Sounds like that would be much more suited to me, I was shortlisted for an AM position but ultimately didn’t get it and landed an AE role instead. I’ll definitely look into transitioning in my current company or apply elsewhere. Thank you for bringing this to the top of my mind.'",
        "In response to 'I enjoy AM. A lot of keeping the customer happy, babysitting trouble clients and in my role, chasing our support staff on critical tickets. But more farming than hunting, pressure for sales isn’t there and you build great relationships if you’re good at your job.\nWhen a customer is happy with the product and support, you get credit where it’s due and when they buy more, that’s a reflection of your work.\nAll in all, good times! Plus even though I have some 60 hour weeks, most are closer to 25. Peaks and troughs there I guess.', a user said: 'Farming over hunting sounds a lot less stressful while still being meaningful work. What’s in it for you that makes those 60 hour weeks worth it? I’m assuming you get commission on upselling clients?'",
        "In response to 'I hear you. I’m not working for a company but I know the pain of being an introvert in an extrovert world. You can do the job but it’s just so darn exhausting. I’m going back to school to get my bachelors and masters for Counselling psychology. It’ll be a long journey but I think it’s worth it in the long run.', a user said: 'Thanks for sharing. I’m actually considering going back to school for either Psychology, a Physician’s Assistant, or Computer Science. Not an easy decision but as you said it will be worth it in the long run doing something with more purpose and aligns with an introverts skills.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'At this point not really, it would be a sigh of relief. I’ve put everything I could into my job, progressed in becoming among the top in dials per day, demos booked. I’m ready to look for a new job or do a 360 and go back to school.\nThings are out of my control with the timing of buyers, getting pushed by my manager to try and close deals in month with promos which ultimately are just scaring buyers away. I have a decent pipeline with fall opps but the slow summer has me feeling pressure and asking myself what have I done for them lately?\nIt’s a startup, I do like the culture and opportunity to be entrepreneurial, but I’ve realized that there’s even more pressure to produce from mgmt in these landscapes.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'Here to chat with you if you need bro. It’s wild cause some days I love sales so much but when the doom hits I think there’s no way this is sustainable long term. And that doom has been hitting far too often, maybe if I was hitting numbers I could manage it better but the rollercoaster is destroying my mental health and other aspects of my life. Tough questions I have to have with myself thinking 5, 10 years down the road.'",
        "In response to 'The pressure of a having a quota is so uniquely damaging to some people. I lived my entire life unable to understand what people meant by \"anxiety\" until I started falling behind on my quota. Every phone call, every email, felt like a fight for survival. And once I convinced myself I wouldn't hit attainment, I became the most unconfident and unproductive version of myself I've ever known. On top of all that, I developed a psychosomatic sleep disorder thats still effecting me 6 months after quitting. Maybe I'm just a weak person, but I never imagined that a career in sales could have such a mental downside.', a user said: 'Do you know what career path you’re thinking about going into? I feel exactly the same way as you about quota, and now that it’s the last week of the month I feel like I’m fighting for survival and not being the confident person I can be. It’s a toxic cycle especially when there’s so many things you can’t control about prospects who ghost you, push timelines way back, don’t speak to the DM, are just window shopping etc.'",
        "In response to 'My man I am 30 and already starting to feel the burn out of Sales.  Thinking of getting a specialised Masters degree in my field and getting out.\nLove closing deals, love the chase, but really starting to wonder if the perpetual stress is worth it.\nI've had a few major deals slip the last two quarters so I'm probably just salty.  But it's tough seeing friends take 2 week international vacations without a stress in the world while I feel bad even taking a Friday off.', a user said: 'I feel the same bro, not even 30 yet. I like the freedom of sales but is it truly freedom when anything longer than a 1 week vacation will hurt your ability to hit quota? IDK if it’s worth it.'",
        "In response to 'Yes. I’ve been experiencing burnout for years. I used to be incredibly tenacious and motivated. I did eight internships in college (graduated in 2008) and got my MBA a few years ago in hopes that I could get out of sales and into something more strategic. Here I am… a sales manager with two reports and the entire Midwest territory. I am constantly on a plane or holding someone’s hand and I am just so. Incredibly. Over it.\nI feel like my $70K MBA was a complete waste and I will never be able to escape this miserable profession. Taking a week or two off won’t do anything to help me out of this ongoing feeling of misery. I used to have so much motivation and I think this changed when I saw corporate for what it is. It’s all politics and optics. No thanks.', a user said: 'Your last statement on corporate is exactly how I’m feeling. I’m realizing more and more how much corporate is all politics and optics. I’m so burnt out trying to please others while hitting my KPIs & quotas. I’m realizing this isn’t the grind I want and I’ve turned into a shell of my former, happy self.\nI’m considering switching careers entirely and gong into something that isn’t controlled by the corporate ladder.'",
        "In response to 'When you figure out what that looks like, please let me know. I’ve been trying to find my way out for about six years now without any luck. I am also a shell of my former self and feel so incredibly stuck. The realization of possibly having to do this the rest of my life makes me want to die.', a user said: 'What did you get your MBA in? Your experience as a sales manager could open lots of doors for you, good on you for making it this far.\nAlso a former shell of myself, I’m beginning to work extensively with a therapist once a week until I find myself. Some career paths I’ve thought about are sports psychologist, physicians assistant, computer science. I love health so much and it’s ironic because sales has destroyed both my physical and mental health. I’m also a problem solver who’s more introverted so I think becoming a developer has potential as well, they don’t stress, make good money and can work their own hours.'",
        "In response to 'I’ve done the therapy thing and the result is that my core values don’t align with what I do. To align my values with a profession would mean I need to take a MASSIVE pay cut. Even then, my therapist warned me that most companies have a way of turning your passions into stressors. She also told me that we are all cooking in the same soup; there is chaos all around us and we are doing what we can to survive. When you’re in a constant state of fight or flight, you’re going to inevitably burn out. The human brain has not evolved much beyond what it was thousands of years ago and we just weren’t meant to live the way we do in modern society. Unfortunately, she doesn’t have the answer. Late stage capitalism has most of us kind of stuck.\nMy MBA was focused in marketing and I have tried at length to get into marketing roles within my field. For whatever reason, I’m only seen for sales which absolutely kills me. Im also an introvert at heart, so the performance of sales is exhausting. I got sober 4.5 years ago, so the entertaining that we are required to do is no longer fun for me. I hate it.\nI hope that you and I can figure it out eventually because I can’t imagine going on like this for much longer. Something has to give.', a user said: 'Your comment is eye opening, thanks for sharing. I can’t stand the corporate environment and it feels so morally wrong for me to be sucked into the thick of it.\nIt sucks that sales is so heavily engrained in drinking, kudos to you for going sober. It’s soul sucking and I realize why addiction and unhealthy habits are so rampant in this job.\nBeing in sales makes me want to leave the corporate world altogether and become a Psychologist or doctor where I can actually help people heal. At least there’s meaning in that and you don’t have to suck up to the company your with to look committed'",
        "In response to 'Yes, definitely getting out of tech sales. Been in this game for 10+ years, it ain’t what it used to be. The golden age is well over.', a user said: 'What’s next?'",
        "In response to 'I’ve most certainly quietly quit at this point.  I may have even loudly quit without formally doing so.  That said, my situation is different: was successful for multiple years as an AE in a few different SaaS businesses, made a mistake in joining a company, ran into some mental health troubles, took a leave to deal with them and was fired the day I got back from leave.  Then I compounded that mistake by going into staffing and I knew it wasn’t for me.  4 years in with a couple different agencies and I still know it isn’t for me.  I’m just not the 100-150 dials a day hammer looking for a nail kind of guy, but that’s what my boss wants.  No strategy, no research, no email or voicemail, just pound the same cell phone 8x per day hoping to trip over something.  It’s not my style.  I’m desperate to get back into sales but I’m seriously concerned that this little foray into staffing has hurt my chances. I’m also in the wrong side of 40.  Frankly I’m feeling like the mistakes of my past have doomed my future.', a user said: 'Stay strong bro. You can get a better sales role with your AE experience. And who the fuck fires you the day after you get back from medical leave? Absolute cowards.\nYou can get out of staffing just talk about your relentless cold calling and how it translates into making you a good AE always filling the pipeline. You got this!'"
    ]
}