{
    "username": "proverbialbunny",
    "contributions": [
        "In response to 'This is your gentle reminder that quiet quitting isn’t actually quitting, it’s simply “completing one's minimum work requirements without going above and beyond”.', a user said: 'Back in the day Gen X'ers called this \"working\".'",
        "In response to 'Just like how Millennials started job hopping frequently because we saw how GenX got laid off from companies they worked years at during the Great Recession.\nCompany loyalty is dead and the corporations are the reason for it.', a user said: 'Older millennial here.  During The Great Recession companies prioritized letting off workers who were more junior, so the millennial's got let go while the Gen Xer's got to continue working.  Millennials didn't job hop because they wanted to, they did it because they had to.  Not for a pay raise, but because layoffs would hit them instead of everyone else.  Meanwhile Gen X got to buy into the cheapest stock market in 40 years, and a couple of years later buy into the cheapest housing market in 50 years.  Banks will not let you get a mortgage if you do not have 2 years of consistent income, so even if you saved up for a down payment on a cheap house, you couldn't get it.  Once you could work a stable 2 years housing prices rocketed up then similar to today.\nGen X loves to bitch about their hardship, but their entire life they've made as much as the Boomers (only 2 percent behind), and they missed all of the hardships Boomers went through.  In many ways Gen X had it quite a bit better than the Boomers did.\nToday there are a record number of homeless people, the high majority of them Boomers.  Likewise, there are a record number of people retiring early right now, all of them Gen X.'",
        "In response to 'Yea even older millennials were in a nice spot, but middle to younger were screwed along with everyone else below them.\nThe whole 2010s was a mess of underreported inflation and too quickly increasing property prices.\nYounger millennials watched properties go up so much faster than their shit wages, while they’d go home and parents tell them their wages are good and they should be thankful to watch prices rise faster than their wages.', a user said: 'Older millennials did have it better.  If they got a salary job before 2008, even if let go for years, they were able to get back on their feet.  Middle millennials (≈90% of them) had it the worst.  Once they were ready for a job there was 300 people applying for every McDonald's position, let alone the rest of the economy.  When jobs did open up the economy was afraid to hire them due to how long they had been looking for work, choosing the younger millennials over the middle ones.  The younger millennials had it the best.  Get out of college, struggle to get a job, but if you landed one you were golden.  Not golden in a Silent Generation or Gen X kind of way, but you had a stable job and could pay rent golden.  Meanwhile Gen Z has it the best since the Gen X and they have absolutely no clue.  Most of the bitching on this sub is embarrassing.  Gen Z might as well be rebranded as the privileged generation.  Too lazy to Google a simple question?  Ask someone on Reddit instead and get angry if they tell you to Google it.  You have to work to get a job?  Oh no!  Not that.  Every generation after The Silent Generation had to do that, but early Gen Z got a rare couple of years where jobs were being handed out like candy and they thought that was normal.  That was the best it has been since the 1950s.'",
        "In response to 'If they got a salary job before 2008\nNot a lot of them got salary jobs and those who got the salary jobs before 2008 were generally the first ones laid off. Then they were competing with the middle millennials later for entry level jobs when the economy got better, except they had been out of college and out of work longer, so it was much harder for them to get good jobs.  If a company is looking for an entry level software developer and one guy graduated 5 years ago and has been a bartender since then and one graduated 2 years ago, they're going with the one that graduated 2 years ago.\nThen long-term recovery of older millennials is much worse.  Because they sat in a job moratorium for half a decade longer than others, they were older, had little or no savings by the time they were 30, are way behind on retirement, and had long gaps on resumes.  A LOT of them were never even able to get into a job in their field, and that ship has sailed.\nI'm in my early 40s.  I got in just under the wire. I got a salaried job while I was still in college so I was lucky.  I'm also friends with people from my age down to late 20s.  Most of the mid and younger millennials have bounced back but the older millennials haven't.  They're doing much better, but they're approaching their 40s at the same place in their careers as people approaching their 30s.  Because they sat for 5 years and were passed by the younger generation, they're a good decade behind where they should be.', a user said: 'You do realize 42 and younger is an older millennial, right?  It was the people who are 35-37 right now who got shafted the most.  Those are middle millennials.'",
        "In response to 'Once Gen Z becomes a larger portion of the workforce...people who do go above and beyond are going to have it really good.', a user said: 'You'd think so.  I LOVE what I do and am a total workaholic.  I can do a teams worth of work easily.  My entire career my bosses have shit on me for it.  If I run out of work I'm lectured on it, and eventually let go.  I'm too effective.  Likewise not playing politics means you don't get promoted.\nMy solution pre COVID was to work remote and lie about my hours.  Worked like a charm.  I found out 5 years later an old boss of mine was raving about me being the most productive worker he had ever hired, despite me lying about my hours.  Took me 30 minutes to 2 hours of work to do what I said took 40 hours.  ¯\\_(ツ)_/¯\nQuite quitting is propaganda (called PR today).  You have to \"quiet quit\" in a lot of white collar jobs to get ahead.'",
        "In response to 'Yeah it’s strange, as a gen z I’ve realized that being proactive it’s screwing me over as my team and the other teams I’m working with aren’t. Honestly I’m focusing on improving my presentation skills and I do certs during working hours. Feels like a better use of time.', a user said: 'That's what I first did too.  I got a degree online from MIT because I was bored.  (I entered the industry without a degree.)\nI eventually moved into research roles, which is far more entertaining.  Getting paid to learn all day and report it is nice.'"
    ]
}