{
    "username": "PsychologicalBee2956",
    "contributions": [
        "In response to 'They don't even walmart anymore, china does. And Sam Walton who founded it was actually a really nice guy, would go around all his stores and just chat with the employees, while dressed like a customer.', a user said: 'You've been lied to.\nANYONE can chat in a friendly manner to random people.\nHe also happily broke Federal labor law and threatened every hourly in their first Dist Center with termination if they talked to the Teamsters.\nHe was also quoted, in his book, with saying \"pay your top people as much as you can afford to, and your bottom people as little as you can get away with\"\nAnd what does \"dressed as a customer\" mean?\nSam Walton couldn't be a secret shopper, his picture was everywhere back then. Like pictures of dictators in their countries.  Our employees handbook had his portrait on the first page.'",
        "In response to 'Before someone jumps on your comment saying Sam Walton was evil, which in some aspects he arguably is just like every other capitalist ever, he would be a hell of a lot better than what we have now. The way our economy and company is ran is absolutely pathetic and it's depressing to be a part of', a user said: 'Your corporate officers aren't worse than Sam Walton, they are better at it than he was. The problem is \"better\" means lining their own pockets. Walton didn't care about his employees any more or less than they do now. The Corporate world that he believed in and worked at has just continued to grow since he died. He would be overjoyed to see the profit and reach of his company today, and wouldn't change a thing.'",
        "In response to 'Original Post: \"quiet quitting\" is apparently a trend now Basically means you do what you were hired to do and nothing more. The \"bare minimum\" as it were. Gen Z adopted the term and its a tik tok thing now.\nI always thought it was called \"not being taken advantage of\"', a user said: '\"Act your wage\", the phrase in the title is what employers are calling it, employees shouldn't.'"
    ]
}