{
    "username": "psycho-mouse",
    "contributions": [
        "In response to 'Original Post: How do people feel about the ‘quiet quitting’ trend? From an employers and employees POV. I’ve seen lots of articles about this recently and it’s made me curious.\nI personally don’t think you should have to go over and above your job description should you not want to, and you shouldn’t be looked down on for not doing so.\nI did some research and found some resources that support people with quiet quitting such as saying no professionally and setting boundaries (I can link if anyone is interested) but it just made me wonder about this from an employers point of view too.', a user said: 'The phrase “quiet quitting” needs to go.\nBeing paid to do what you do and not letting yourself get exploited isn’t quiet quitting.\nEdit: I appreciate the awards but rather than wasting your money on fake internet points I’d much rather you donate it to a charity which helps people still caught in the industry trap that I’ve talked about below.\nDonate or go any buy some gear from\nThe Burnt Chef Project\n.'",
        "In response to 'Absolutely this. Working silly hours and bragging about it is extremely strange to me.\nIf you pay a plasterer to plaster a room, do you expect them to plaster the room, and also carpet it, paint it, maybe fit some curtains too while they’re in?', a user said: 'Eeeugh bragging about the hours is one that was chronic when I was a chef. You’re not a real chef unless you’re working 16 hour days for 2 weeks without a day off apparently. The only person they’re mugging off is themselves.\nThe trouble is companies know a lot of chefs have this old school mentality and exploit it, putting them on salaries and making their situation impossible unless they pull stupid hours.\nThe last place I was a head chef at before I quit, my contract was 45 hours. So that’s what I worked one week just to make a point. I came into work on Monday and left packed up for a long weekend off at the end of service on a Wednesday leaving them without a chef for 4 days till I came back on Monday. Weirdly, immediately after that he hired 3 more cooks.\nFortunately I got out of it just last month after years of mental anguish which at one point put me in hospital lol.'",
        "In response to 'Same here mate, theres plenty of good chef jobs about now that dont kill you, anything other than restaurants and hotels is pretty sweet. I was doing exactly that 16h a working through my splits and working all my days off for a shitty salary, when id ask about getting payed they would always say it will get added on, it never was. Also never recieved tips or any proportion of service charge which apparently \"goes towards our hard working staff\" the whole industry is built on lies. It took me getting to 8 stone and looking like i was on deaths door. I didnt even have the energy to quit i just said i had to go to the shop, had a mini breakdown turned my phone off and went to my mothers and slept on her couch for a day and a half.', a user said: 'Yeah my final kitchen job was working for a caterers which cooked for about 50 nurseries and schools and delivered to their door from a remote kitchen. Monday to Friday, 7am till 2:30pm. For kitchen work it was a sweet life, didn’t pay very much but the work life balance trade off was entirely worth it after abusing myself for 15 years prior.\nI got out last month and work for the BBC talking about trains all day now haha.'",
        "In response to 'Might be a bit of an unpopular opinion, but...\nIf you are doing it, absolutely fine. More power to you. It shouldn't be looked down upon to just want to come in, do your job, no more, and go home. \nI am currently doing this, myself. In fact I have asked to be taken off of some extra duties that I have been given over the last year.\nHOWEVER...\nIf you actually want to progress within your job and make it a career, don't be surprised if you do \"quiet quit\" and you get overlooked for promotion.\nTaking initiative, helping other people/departments, going above and beyond are all things your employer will tend to look for, just to make their shortlist.', a user said: 'Or, going above and beyond too often in your current position makes you too valuable to be moved up the ladder.\nSeen it happen many times and had it done to myself once.\nThere is a middle ground, do your job well but don’t give freebies unless it’s a desperate situation, and if it is don’t let it happen twice without financial compensation.'"
    ]
}