{
    "username": "Psypho_Diaz",
    "contributions": [
        "In response to 'There are millions of people who own a house and a newer car that are completely oblivious to what's going on out there. Many are shocked beyond belief when life happens and they find themselves looking at having to buy a house or a car.\nMany people here would scoff at paying more for a Jeep Grand Cherokee than a fully loaded Lexus SUV. But somehow they're okay with over-inflated home values.\nA mortgage payment is DOUBLE what it was four years ago. This is unsustainable. My mortgage payment 4 years ago was $1200. You're going to have a tough time convincing me that I should pay twice that for less house. This is not a normal or healthy housing market and interest rates aren't the problem.', a user said: 'I'm kind of one you speak of but I made certain decisions that put me in a place where luck was able to find me easier and help me more.\n2018, buying my first home. Every house i want gets bought in cash, over asking before i leave the viewing. Very disheartening as we were looking at the cheaper homes in our area. Start getting fed up, but instead of skipping important steps for buying a home (making bad decisions), I decided to change my plans, and start looking for a fixer upper. House i bought was on the market for 3-5 months, dropped ~30%. Took it. Affordable house to live in with growth potential.\nNow the lucky part. 1967 home with little updates. Father calls some favors from his bike club. Get expensive upgrades at cost of material. 2020 COVID hits, i want to refinance home with partner when rates at 0. Partner tries to fuck me over. Don't get to refiance house at time desired but still get to with lower rates than original.\nI know what decisions i made and where i got lucky. My brother, in the same area, can't even qualify for an apartment now. Hell, last year I couldn't but i could afford my home?!? It's fucking stupid. Not too mention when you have a kid and realize 2 adults in the home doesn't seem like enough either.'",
        "In response to 'Original Post: ‘This has to stop’: A young man on TikTok says he and his wife make $120K/year — but can only afford this run-down house. Why Gen Z, millennials are using 'quiet quitting' to cope [External Link]: https://moneywise.com/real-estate/real-estate/young-man-quiet-quitting-cope', a user said: '\"The boss earns a dollar to my dime and that is why I shit on company time\", I heard this in the early 2000's and it was the best \"advice\" I learned before i entered the working class.'"
    ]
}