{
    "username": "ptfc1975",
    "contributions": [
        "In response to 'This is your gentle reminder that quiet quitting isn’t actually quitting, it’s simply “completing one's minimum work requirements without going above and beyond”.', a user said: 'Otherwise known as \"doing your job\"'",
        "In response to 'Problem is if the most junior people in a company aren’t internally or externally compelled to stretch their skills and job description, the individual, company, and general economy will stagnate.\nI’m here for a conversation of fair compensation but frankly there’s a trade between labor and marketable skills that happen with junior corporate workers.. the people getting shafted are in the middle training the juniors and creating all of the shareholder value for the top. These are also likely the ones with the most financial obligations at home. If a Gen Zer wants to do the bare minimum that’s fine in theory but it violates the “contract” and they’ll stagnate or get bounced for someone with curiosity and ambition', a user said: 'If someone is doing the job they are asked to do but nothing more and somehow that is not enough, then the problem may be that you aren't asking enough.\nYou said it yourself, \"if workers aren't internally or externally compelled.\" Well, clear expectations and fair compensation is a pretty compelling way to get folks to do a good job.\nIt's very easy for poor leadership to blame \"junior workers.\"'",
        "In response to 'And would the.local frame shop cafe or mechanic pay workers better to retain them without raising prices and alienating customers?', a user said: 'Generally better paid workers create a better experience for clients. The better experience is worth paying more for.\nIf you need an example of this concept, compare the kind of service you get at a fast food place that pays minimum wage to the service you get from a fine dinning restaurant.'",
        "In response to 'Otherwise known as doing the bare minimum, and then wondering why you are not advancing in life.', a user said: 'A worker who consistently does the job that is asked of them is pretty valuable. It's not something to be disappointed about.'",
        "In response to 'As a Gen-X, it will be interesting to see the cold war of Gen-Z and firms.  As a principle, firms seek the least sufficient labor for lowest cost.  If Gen-Z work quality isn't great, it will further promote firms to offshore and automate if those pursuits are more cost effective than meeting Gen-Z total compensation demands.\nIf history is any guide, Gen-Z will start competing with each other in the labor market as willing sustained unemployment is only an option for people who come from means/privilege.  The market works based on willing participation in the market, even if firms have created an imbalance in power that favors the employer in the labor market.\nTo raise my family in a middle class lifestyle and to help prepare our children for a bright future... I'm willing to show up to work and work to exceed expectations.  I'll change jobs as needed to maintain meaningful compensation growth, but I'm also putting in the work.', a user said: 'Quiet quitting is putting in the work. It's doing what is required but not doing extra without compensation.\nAnd that last part is important: \"without compensation.\"\nMany folks that are out there working have found that if they give extra, they do so without any reward or hope for reward. If places want workers to give their all, it has to be a reciprocal relationship.'"
    ]
}