{
    "username": "publicworker69",
    "contributions": [
        "In response to 'Original Post: What are your thoughts on “Quiet quitting” / “Acting your Wage”? [External Link]: /r/AskReddit/comments/xwwzxk/what_are_your_thoughts_on_quiet_quitting_acting/', a user said: 'I’ve been doing this for years lol. Just common sense to me.  I do what I get paid to do. I do my hours, no more no less. If I have to work overtime I’m claiming every single millisecond of it. It’s a job. Not my life\nHad a situation once where someone called in sick and no one could come in to replace them. Which is not the end of the world. Had to stay 30 minutes passed my scheduled time to ensure everything was done, so I put that on my timesheet. When I came in the next day I saw someone scratched out my 30 minutes extra and put in my normal finish time. Obviously that pissed me off so I went to the boss and asked what the fuck was this. They said they don’t pay overtime and other shit.\nSo I said well here’s what’s gonna happen. Either you pay me for the extra time or I’ll go straight to the department of labour and file a complaint. Don’t think they expected a 20 year old (at the time) to stick up for themselves.'",
        "In response to 'Someone changing my clock out time like that would set me off, just reading about it made me feel rage.\nDid they change it back?  Did you stay at that job?', a user said: 'Yes they changed it back cause they didn’t want to deal with the labor board. I stayed at the job cause I actually enjoyed the work while I was in school (it was a retirement home).'",
        "In response to 'I was a maintenance tech at a nursing home before, I called in a day before because I was in the hospital and fired me but not stating any reason because we are a at-will state.\nBut anyways they denied my unemployment and got it but it took 2 weeks for unemployment to get shit sorted out. It pissed me off they actually tried to deny me.  So I called the department of health and told them every building infraction and cost them a lot to fix.  Friend told me they were fucking pissed at me at the next monthly meeting.', a user said: 'Lol that’s hilarious. Love that you did that.'",
        "In response to 'I would have gone straight to the labor board as soon as I saw that shit. If they did that to you, they're almost certainly doing it to others who might not stick up for themselves.', a user said: 'Yes in hindsight I should’ve done it no matter what, I agree.'"
    ]
}