{
    "username": "PuckGoodfellow",
    "contributions": [
        "In response to 'It’s weird that there is a new term for having self respect and boundaries. But at the same time I’m glad more people are growing spines.', a user said: 'It makes me think of the ol' \"work/life balance.\"'",
        "In response to 'Original Post: What are your thoughts on “quiet quitting”? Is it something you’ve been doing for a while or something you’ve recently started implementing? For those who don’t know, quiet quitting refers to not over extending yourself and going above and beyond at work such as taking on more responsibilities or staying late. You do what’s asked of you then go home on time.', a user said: 'Setting aside my feelings on the term itself... I'm a workaholic and I've been incorporating these behaviors in my career for a few years now. I was constantly overextending myself which caused stress and anxiety in my personal life. After many conversations with people who had done the same and convincing myself that it was a good idea for me to do less, I started pushing back on things that I didn't have the time or resources for. The conversation doesn't have to be difficult, either. Talk to your boss and list out everything you're doing. Then tell them that you only have time to do # of them. Ask your boss to prioritize it and decide what can fall off your plate. That puts the responsibility on them, not you. I'm currently working on feeling comfortable taking time off when I need it, not when it's convenient for work coverage.\nFor other workaholics (and control freaks, let's be honest here, I'm among you!) it can be really hard to feel comfortable letting go. It took me a long time to work up the courage and I'm\nstill\nworking on it. But you know what? Once you start, you start to realize that things don't actually fall apart when you let go, it becomes a little bit easier every time.\nI like to explain it like this: You don't have to be the parachute. If you step in and keep saving the company, the higher ups only see that things are working well. They don't see the hours you put in or the stress you go through to get it done. All they see is that there are no problems. Why would they change how they operate if everything's working? They need to see that things aren't working this way, that it's not sustainable, before they will make changes. The more people who act as a parachute (swooping in and \"saving\" the company from negative impacts), the more harm it does for the employees.'"
    ]
}