{
    "username": "PumpkinPieIsGreat",
    "contributions": [
        "In response to 'My abusive ex doubled down and tried to propose 4 months before I finally left him lol. I don’t know on what planet someone realizes their partner is checked out and thinks that a flashy ring will somehow fix the problems that lead to them wanting to leave in the first place. Solid logic.', a user said: 'There are definitely women that would take that offer. Say you were in a situation like OP where you feel like his needs always override your needs, and that he doesn't care about you, suddenly the ring is \"proof\" he cares.\nIt's good that you could see the truth, and I'm glad he's an ex, but sadly not everyone would see it as the manipulation tactic that it is.'",
        "In response to 'A lot of the TikToks in the video mention how men are usually \"blindsided\" when their partners just up and leave, when the reality is they didn't care to notice the signs since their partner's unhappiness wasn't directly affecting them.\nThere was a good post about how men think there is a tolerable level of permanent unhappiness that women are cool with staying in. They are fine with our suffering because they still get to do the things they want and not do the things women want them to do. When hetero women start to pull away, a lot of men are actually happy because they think they won. No longer are you \"nagging\" or telling them you are unhappy. Then when you dump them, they are shocked because to them, the relationship has never been better!', a user said: 'This makes a lot of sense to me. Especially with all the talk of submitting to a man... yeah they must think they've cracked the code and that they finally get the silent obedient wife they wanted.'",
        "In response to 'I suppose it's more so for his benefit than it is mine. I was ready to pull the trigger on it 2 weeks ago, but then he told me that day happened to be a negative anniversary, and that the whole month of February was a sore spot for him. So here it is March, I'm planning on doing it within the next couple of weeks.', a user said: 'So this is just another tactic. He's going to keep delaying you. He feels his power over you slipping away and he's not going to just \"let\" you go. This is where you are going to have to be brave, you want out and you should get to be out. Don't keep catering to him and giving in because he's always going to have another excuse about why you can't.\nPlease stay safe and keep focused on why you want to leave. Look up love bombing if you don't know what that is, because I suspect that's the next card he'll play from his deck.\nCome back and give us an update about your new and improved life in a few months time.'"
    ]
}