{
    "username": "Punchasheep",
    "contributions": [
        "In response to 'Many older generations in the US still operate that working hard and going above what you are asked to do makes you look good. Bosses will give you more attention and thus a raise or better reviews. This culture is now used to control people.', a user said: 'My sister gave me the best advice when I started working. Always give 70-80%, because when your boss asks you to give more you aren't burning out. Only give 100% on a temporary basis.'",
        "In response to 'And now they see you're capable of more and make that the new normal expectation.', a user said: 'Eh fair enough, probably the better advice is only give 80% max.'",
        "In response to 'Original Post: Why is quiet quitting even a thing in America? I mean, in Western Europe you're supposed to forget about work once you've spent your 8 hours (hour and a half for lunch and breaks included) at the service of the company.\nI can't understand why is quiet quitting even a thing... How could it be \"quitting\" to do just your regular job and refuse to do overtime or completing tasks outside of your job description? Isn't that what you were hired for? Why should you do unpaid extra work?\nThis mindset of \"you must sacrifice yourself for the company and you must be happy about it\" is downright exploitative and undermines any kind of work—life balance.\nIn countries like France, even contacting an employee during their vacation period may get the company into legal trouble, that's the standard in the developed world outside America.', a user said: 'I really wish we had laws preventing being bugged about your job 24/7. I actually work at a place that gets on to you if you respond to work stuff on your day off, but I still have an urge to check my slack messages when I'm out because I've been conditioned by other crappy jobs to always be available no matter what. Ever since people were able to get email/messages on their portable devices (thanks blackberry) it's been expected that people always be available and always respond back immediately.\nHonestly it all comes down to companies caring more about their profits and bottom line than their employee's wellbeing.'"
    ]
}