{
    "username": "Purple_Reality6748",
    "contributions": [
        "In response to 'Original Post: Quiet quitting could be the best thing for education. Everyone's definition of quiet quitting is different. Mine is not working outside of your contract ours. Work from 7am to 3pm and then you're done. No lesson planning outside of class, no chaperoning, no working gates unless it involves extra pay.\nWhen you ignore these boundaries, you overwork yourself, can't sustain the position, and you end up leaving the profession and in return your students lose a great educator.\nIf you can't do all the tasks a school asks for you to do during the day, that is not the fault of you, it is the fault of your boss requiring too much of you. If you continue doing these tasks outside of your hours you are effectively telling your admin that this is okay.\nWhen you put your value in working extra hours because it makes you feel like you are \"doing it for the kids\" you are doing the opposite long term. The precedent that teachers have to put so much time in outside of work is toxic and leads to teacher burnout. A shortage of teachers is not good for any educational system.\nI'd like to blame admin, government, or students but the easiest fix is in the teachers themselves. When we overwork ourselves, we effectively hurt education. Only work your hours and if you can't get your work done, let your admin know you don't have the time. Healthy work life balance can keep us going and bring more teachers into the profession.\nEdit: Sorry y'all. I didn't realize how problematic the term \"quiet quitting\" is. I am glad though that it brought some attention to the post which led to some good discussion. I will use a different term from here on out and I am happy a lot of you only work your hours or work your contract.', a user said: 'For the love… can we stop using this term.'",
        "In response to 'People arguing over semantics on what to call it when the real issue is all the bs us teachers are fed up with. Solidarity', a user said: 'No because calling “following your contract and doing what you’re paid to do”, “Quitting”, is disrespectful to our profession'",
        "In response to 'Semantics!', a user said: 'It doesn’t mean the same thing though..'",
        "In response to 'You're building artificial boundaries. The contract\nnever\nstates that teachers are required to work only during those hours. It says that those are the hours for school. It also then states what you duties are, and what you're being paid for attending to those duties.\nThis is just as foolish as students saying that school hours are 8-3 and so they don't have to do any work outside of those hours and teachers can't penalize them for it. What would you tell that kid? Obviously, you'd point out that those hours only represent the time period we require the kid to be at the school.\nIt's really quite similar for teachers.', a user said: 'Completely different 🤣 high school is not the students career.'",
        "In response to 'Original Post: Is anyone “quiet quitting” this year? I’m curious if anyone else is doing this and how it’s going. My mental health was a mess after last year and my home life is messy— my daughter has a chronic illness that is not in remission. I decided at the end of last year that I was done overextending myself for this job.\nSince then, I’ve just said no, over and over. Can I help take tickets at a football game for four hours and $30? No. Can I lead a PLC? No. Can I mentor a new teacher for an extra plan bell? No, because I’ll just get called to sub for free every day— learned the hard way last year. I’m contracted to work from 7:45-3:15 and so that’s when I arrive and when I go home. If I have to stay extra for any reason— like my daughter’s late practice— I watch Netflix on my school computer and get a Pepsi.\nIt’s been a real relief so far— knowing there’s no pressure for what else may be lurking ahead. It doesn’t matter, because I’m not doing it anyway.', a user said: 'I hate that term. Setting boundaries and working only school hours has nothing to do with quitting. It’s just how it should be. I wish ppl would  stop saying “quiet quitting”'"
    ]
}