{
    "username": "Puzzleheaded-Snow269",
    "contributions": [
        "In response to 'The problem with your view is that while capitalism is not always equal and fair, it's far superior to the other systems. Capitalism isn't perfect and it's never claimed to be, but history has shown the power of capitalism and how it has transformed society for the better.\nCapitalism provides a platform of unlimited possibilities. Indeed, the worker who goes above and beyond may not get the promotion and respect at their organization, but they have the freedom to pursue other opportunities such as switching to a new job, career path, or starting their own business. Look at the history of some of the big US companies and you will find many case studies.\nContrast this to communism for example, where the economic mobility and opportunity simply aren't there. If you think capitalism is corrupt and doesn't provide the necessary payoff for hard work, I think you will be shocked to understand the economic prospects of those who labored within Soviet Russia.\nAt the end of the day though, it's all about mindset. Those who have the drive and passion to succeed will ultimately end up succeeding in the long run. Those who simply sit back, do the bare minimum, and constantly complain about the flaws in the system will find their prospects diminished.', a user said: 'Capitalism provides a platform of unlimited possibilities. Indeed, the worker who goes above and beyond may not get the promotion and respect at their organization, but they have the freedom to pursue other opportunities such as switching to a new job, career path, or starting their own business\nI strongly oppose your use of the word 'freedom'. Even within the narrow parameters that you placed on the word, freedom is not the right word. I simply cannot abide one more capitalism apologist deploying the word freedom in the same conversation as this economy. We are indentured servants. I might go so far as to say we are slaves, even at the risk of being hyperbolic. The 'choices' that we all have are so constrained so as to evaporate entirely.\n​\nThose who simply sit back, do the bare minimum, and constantly complain about the flaws in the system will find their prospects diminished\nNow we're lazy, too? The Americans that I know work like animals and still cannot afford to pay the bills, and I'm talking about housing, food, and other basic needs, not Gucci bags and Hawaiian vacations. You may believe the things you are saying here, but I would like nothing more than to disabuse you of these ideas. The top 1% of earners are capturing 90% of the wealth and then shaming me while they do it, so pardon me, but I shall reserve my 1st Amendment right to \"constantly complain\" whenever I see catastrophic wealth disparity mixed with a propaganda campaign extolling the invalid virtues of meritocracy.\nWe must\nall agree\nthat hard work and positive attitudes are not going to thwart the status quo. We don't need to grin and bear it and pretend that things will get better on their own. Instead, we need to unite and collectivize and liberate all of the wealth that has been stolen from us.'",
        "In response to 'I might go so far as to say we are slaves, even at the risk of being hyperbolic. The 'choices' that we all have are so constrained so as to evaporate entirely.\nIf you think the choices available in a capitalistic system are constraining, you will be shocked to see what's available via other methods. However, the fact remains that there isn't a system where folks have the option to not produce while still reaping consumption benefits. You are looking for a fantasy world that does not exist. It's disgraceful for you to even mention the word slavery in this debate and shows that you have a complete lack of understanding of what the millions of true slaves throughout history had to endure.\nNow we're lazy, too?\nOf course I didn't say lazy, but clearly, your mind has been warped by your absurd beliefs. No one forced your hard-working friends to take the jobs they have, and they should evalute their circumstances and choices they've made throughout their life that led them there. Next, consider this: you are a manager with 2 employees under you who are essentially work equals, and you have the choice to promote one of them. Employee A shows up on time, does the minimum, and consistently achieves the production goal. Employee B shows up an hour early, goes above and beyond, and consistently surpasses the production goal. No effective manager is promoting Employee A over Employee B.\nI shall reserve my 1st Amendment right to \"constantly complain\" whenever I see catastrophic wealth disparity mixed with a propaganda campaign extolling the invalid virtues of meritocracy.\nIndeed, it is your right to constantly complain as you see fit, and no one is arguing against that. However, while you are busy complaining, the next Bezos, Gates, Musk, and that self-made millionaire down the street will be working and pushing themselves to achieve something greater. Again, I'm not saying capitalism doesn't have flaws, but the system has proven itself and is a big reason why even the poorest among us have a higher standard of living compared to the vast majority of people who have ever lived on this earth.\nInstead, we need to unite and collectivize and liberate all of the wealth that has been stolen from us.\nFinally,  let's wrap this up by thinking about this gem of a comment. How do you expect to liberate stolen wealth when you and everyone else gave it up willingly in the first place? You wanted to consume, and there is a price for that. There's no such thing as a free lunch.', a user said: 'Hey man, thank you for your reply. I was in quite a place last night when I wrote this. I was clearly emotionally compromised. I appreciate you taking the time to reply, and I hope you didn't find it to be too time-consuming. Your time is valuable, and I appreciate you replying at all to my tirade. Thanks again, have a good one.\nΔ'"
    ]
}