{
    "username": "Radiant2021",
    "contributions": [
        "In response to 'Original Post: Quiet Quitting: What is it Really? Quiet quitting is a confusing term to me, but maybe I just don’t understand it. I have rarely ever given 120% to a job… maybe when I was fresh out of college when I had that mindset. But the years have jaded me. What people call “quiet quitting” (doing the minimum) is what I just call doing my job lol. It’s not like I refuse when they ask me to do more work (tho rarely do they ask), but I don’t SEEK more work out unless I’m just bored. For example, in my work, we work in Sprints and get assigned stories to do for those sprints. I just do those stories — not more or less — unless I’m just bored and have finished my stories weeks in advance, then I may grab a story for the next Sprint. I get paid by the hour so no work means no pay. But it’s not like I can ADD more stories to the current Sprint because someone else still needs to test them and THEY may not have capacity. So, a lot of times I just do things around the house since there always seems to be something to do at home. Have I been quiet quitting for years and just didn’t know it or is doing the minimum not really what quiet quitting is all about?', a user said: 'Before, ppl used to work really hard expecting promotions and accolades. Some still do that but others just do the work in a normal way, no after hours...no attempts to make it exceptional...no volunteering to help ..etc\nWhy?\nBecause when the job makes the unilateral decision to lay off or fire someone or not promote someone none of your hard work matters. They literally make the decisions based upon recommendations from HR and whether people higher up like you.'",
        "In response to 'My opinion - if you are hourly and need to have billable hours... you aren't quiet quitting.\nWhat quiet quitting meant to me was essentially - doing just enough to not get fired or trying to just slip through the cracks so people didn't really notice how much you were or werent working.  For example - my wife manages an executive assistant who is supposed to support a team of people.  She essentially started doing things slow enough where they would just do it themselves.  Now she essentially has the people she's supposed to support, supporting themselves.\nThis has been an issue for around 6 months, but HR moves so slowly so she's still employed and will just be getting on a PIP now, and have another few months before she's let go.  Thats what quiet quitting has always been to me.  Stop doing most or all of your job and hope no one notices.\nPeople who do the minimum of what they're asked and get it done in the requested time are just normal...', a user said: 'Most ppl aren't trying to be let go. They are trying not to work themselves to death only to be overlooked or mistreated'",
        "In response to 'But I guess I’m confused why doing the bare minimum is considered quiet quitting. Isn’t that what the job description says? If you’re hitting your minimum performance metrics, and for us it’s easy because it’s just “Did you do your stories or not?”, I don’t know why that would ever get your fired eventually.', a user said: 'We are raised to go above and beyond. Quiet quitting is doing enough work to keep your job but not so much or so exceptionally that the bosses label you a \"hard worker\"'"
    ]
}