{
    "username": "ragingbuffalo",
    "contributions": [
        "In response to 'I think Biden completely let his ego and emotions get in the way, but I don't think the Biden loyalists are actually a powerful force. They're loud on X, but he was so overwhelmingly unpopular - I don't think the betrayal line would have stuck.', a user said: 'Biden completely let his ego and emotions get in the way,\nTbf this is extremely common in older folks that start to lose their mental acuity. Less blame on Biden and more on his aides around to fucking convivence him to be reasonable'",
        "In response to '[Deleted or Empty Comment]', a user said: 'Maybe, just maybe. These things are important to Tommy. Thats why they are consistently top of the dome for him.'",
        "In response to 'They’re all the same. “I’m just like you, listener! My dad was a plumber teacher steelworker nurse and I once had a loan!” Nobody is challenged, much is proposed but there is no follow through, the successes they tout in district A never manage to make it to district B - it’s exhausting. What a waste of everyone’s time.', a user said: '“I’m just like you, listener! My dad was a plumber teacher steelworker nurse and I once had a loan!” Nobody is challenged, much is proposed but there is no follow through\nI mean this was Trump's strategy in podcast trail. Not getting too deep, no challenges, just shooting the shit for the most part. The problem is most of these people don't have the chiasma to hold people's attention.'",
        "In response to 'I agree on the \"not too deep no challenges\" part. But the real key difference is in the \"just shooting the shit\" part. Trump can \"just shoot the shit\" with people that makes him seem human and relatable even though he's pretty much neither of those things. He just doesn't sound like a politician, he sounds like a dude having a conversation. And that actually plays into his \"weave\" rambling bullshit because none of it is polished, and that works to his advantage and works to his image of an outsider who will shake up the system or whatever.\nIt seems like PSA interviews are just a chance for politicians to come and recite their list of talking points, rather than have a conversation. They're CNN or MSNBC talking head pieces, just happening on a podcast instead.', a user said: 'tbf trump's podcast were non-political podcast, where PSA is specifically a politics podcast. So a little advantage there. Idk if you can switch up the interviews into more a freeform and still be PSA? But I do agree that Dem politicians need more freedom to be more passionate about topics. BUT that means dem voters need to be more tolerant on things that don't match up 1:1 with their personal topics.'",
        "In response to 'If Harris is serious about continuing her career, then she should absolutely run for Governor of California in 2026. She probably starts as a prohibitive favorite for one of the most powerful political jobs in the country. If she does well in the role, she could credibly take another shot at the White House in 2032 or 2036.\nIf she just chills out for a few years and tries to run again in 2028, I don’t see any way that she breaks through the field. Who would want to run the previous loser again when there will be a long list of new candidates to choose from?', a user said: 'She would be 68 or 72 in 2032/2036. Nah she either runs for president in 2028 or shes done. And im my personal opinion she has 0 chance for the presidency in 28.'",
        "In response to 'They can’t be serious, defending the time change.\nLOL \nLiterally, nobody wants that.\nAlso, it’s not practical for some states to observe it and other states not widely across the board as they suggest. Very strange argument. I know there’s a couple of examples right now, such as Arizona, but imagine the US were half the states observed the time change and half don’t. It makes no sense.', a user said: 'I mean what they are really saying is Far western sides of the eastern timezone essentially moves to central time instead forever.'"
    ]
}