{
    "username": "Ragnarok314159",
    "contributions": [
        "In response to 'I have a remote job where I literally work maybe ten minutes an hour. It’s fucking glorious. I don’t live for weekends. I don’t dread going into work.\nThis has been the best job of my life and not because I am happy and fulfilled, but because there is zero stress.', a user said: 'I thought about working two remote jobs and never telling them. Just give the higher paying job priority when scheduling time.\nIt would be a ridiculous income.'",
        "In response to 'They can probably find out about your employment history in the background check so I’m not sure if it would work I’m afraid', a user said: 'My current employer would show up anyways during a transition period, which is 100% normal when looking for a new job. Would be a matter of working a solid 8-10 hours a day non-stop, but could be making two mid level engineer salaries which would be ridiculous.\nI just could not take a job that required a security clearance. That would cause problems.'",
        "In response to 'I wonder what would happen if I called up one of these companies that's complaining about \"quiet quitting\" and asked them to go above and beyond on the goods/services they deliver to me? I mean, if doing the duties I was hired for as an employee is \"quiet quitting,\" then I providing, say, the internet service I contacted for has to be \"quiet breach of contract,\" right?', a user said: '“Quiet quitting” is a distraction, all it means is middle management and HR are completely ineffective at creating expectations and helping employees manage workloads.\nIf you want me to do more, just tell me. You are the boss, stop such a little bitch.'",
        "In response to 'It makes me think of the ol' \"work/life balance.\"', a user said: 'Which is exponentially better than “quiet quitting”. Whatever idiot came up with that and the next idiot that approved it should be fired.\nAsking around at my office, everyone answered “is that just when you put in your two weeks and don’t really make a big deal about it?”\nDoing what you are told is not quiet quitting, it’s just meeting expectations. These HR clowns need to be purged along with most middle management that serve a function that is only a taskmaster.'",
        "In response to 'Your message is really important. The narrative is generational differences, but the reality as always is class war', a user said: 'Who wins when poor people are divided?\nAlways ask this when looking at these situations.'",
        "In response to 'I’m Gen X. What livable wage? Seems like half of us have e same struggles as the younger gens. I’ve seen wages stagnate and even drop for various jobs over the years.', a user said: 'Oldest millennial here - came to the realization most people under 55 are fucked.'",
        "In response to 'Gen X never got a livable wage.', a user said: 'The older ones did. I remember several people getting those good union jobs at factories, but those all pretty much went away except for some specialized fields like aerospace.\nThe great divide is really pre and post Jack Welch style management and Reaganomics. Why most people under 55 are legitimately fucked when it comes to retirement.'"
    ]
}