{
    "username": "RahulRedditor",
    "contributions": [
        "In response to 'Original Post: How many of you have \"quiet quit\" and when did it start for you? I got to say for me I quiet quit my last job 5-6 years into it after realizing I didn't have a future with that company, but I never left because I was at least getting paid and now have a decent savings account because of it. I legit started my new job early this year and I've already quiet quitted. I hardly do the bare minimum since I gave them a whole summer of hard work and not a single fucking praise. Or even any kind of \"hey keep it up you've been doing an awesome job\". The moment I make a mistake I feel like it destroys everything i worked hard for so what's the point anymore? I'm just going to keep working enough so I don't get fired, but if I do I doubt I'll be upset over it. It also just seems the way 2023 has went if the economy and housing market continues to stay awful next year I can already see people quiet quitting for 2024 and it hasn't even started yet!', a user said: 'I said a quiet fuck-you to my employer when I learned they were checking badge reader logs for RTO compliance. Some days I don't do a damn thing but answer a few emails.'",
        "In response to 'Original Post: It’s now “quiet quitting” to not go beyond your job responsibilities [External Link]: https://i.redd.it/rb5pth0h04i91.jpg', a user said: 'I could swear that when I first started hearing this phrase a couple months ago, it meant doing as little as possible without getting fired. How is it any kind of \"quitting\" to do the job you're paid to do?'",
        "In response to 'ngl, I've only seen \"quiet quitting\"  talked about on this sub.', a user said: 'It's out there in the mainstream media too.'",
        "In response to 'when i used to work in payroll departments any time an employee filed for unemployment i'd get a notice giving us the option to contest and i'd just throw em out every time lol.', a user said: 'The hero we need'"
    ]
}