{
    "username": "raltodd",
    "contributions": [
        "In response to 'It seems like you have a misunderstanding of what quiet quitting is.  It isn't that productivity is steady, it is instead that the minimum effort is put forth so as to skirt the line between being fired and holding onto your job.  Generally speaking you see a loss in productivity, not a maintaining of productivity.  For example, you are given a deadline of 4 weeks for a project.  In reality, you could complete it in 1 week by putting in extra hours, normally you'd complete it in 2 weeks without extra hours, but in a quiet quitting scenario you'd wait until the day it is due to finish, waiting the full 4 weeks.\nSo your initial assumption is based on a false premise.\nNow for the rest of your weird statements.\ninevitably trending towards record-breaking profits for the top 1% regardless of wider economic factors\nThe only way you can call profits record breaking is if you look at them in raw dollar value.  Which, if you are economically educated, makes absolutely no sense.  Profits are records nearly every year in a healthy company because inflation creeps up every year.  When you look at the profits of these companies in the way that every single economist and financial person does, you see a decrease in profitability.  Yes that company that sold 1 billion in goods made 100 million in profit last year, but they made 90 million on 800 million in sales the year.  It's a record profit!  But the percent of profit made was less.  As we look through the economy you see this more and more.\na laborer under a functioning capitalist society exchanges an agreed-upon quantity of labor for an agreed-upon wage\nThis isn't really true unless you are contractually obliged to such a thing.  For example, a cashier at a store will inevitably have downtime, so their labor isn't being utilized but they are being paid for a such a time.  Conversely a construction worker may agree upon a contract that they spend 1000 hours building something but due to an unforeseen issue or complication they end up spending 1200 hours instead.  They don't get to bill for additional hours unless you agree upon that first.  Labor is not a quantity to wage driven process.\nand a consistent degradation of the wage, purchasing power\nI'm not entirely sure what you think this means, but wages have trended up, not down.  Purchasing power has changed, not degraded as well.  The only way you can come to these conclusions is by using bad data points.  For example, the purchasing power of someone in 2023 would include things that someone in 2010 did not.  Streaming subscriptions, for example.  The problem with purchasing power charts is that it makes no distinction for how the costs of people have modified over time.  Someone in the 90's would be amazed at not just the fact that we carry a computer in our pocket that has access to the internet at speeds faster than they ever did, but that those devices cost over a thousand dollars a piece.  Similarly, wages can only been seen as degrading if you look at the same job over time.  The value of many types of labor goes down as advancements in technology go forward.  We do not bemoan the stagecoach driver being a job with no wage potential with the advent of the car.  But today we do that all the time with things like automated order taking reducing the number of people needed thus decreasing the wages required for such a position.  Likewise tools which a carpenter or plumber uses have increased productivity requiring us to need less and less of their labor.\nmaybe actually read a campaign platform or two\nUgh, probably your worst argument.  Campaign platforms are the most useless, generic items that a politician puts out.  They have very little bearing on what they actually end up doing.  For example, if we listened to the platforms of republicans, we'd see them in favor of small government and responsible budgets.  In reality, we see neither.  If we listened to democrats we'd hear about the need for data driven spending and responsible budgets.   In reality, we see neither.  There's a reason that the joke in the US goes \"How do you know when a politician is lying?  His lips are moving\".\nYou have competent politicians, you just refuse to give them power for some reason...\nThe problem here is that there is no such thing as a competent politician.  I would also imagine that the ones you think are competent wouldn't actually address any of the things you want them to.  You seem to understand that in a capitalist society there is widespread prosperity to be had, but then you want politicians to do what?  Enact the policies that you fled from?  That is a great way to squash that prosperity.\nSome part thoughts to ponder on before you reply.\nIn the US, generational wealth, isn't a thing.  70% of all wealth is lost by the second generation and\n90% is lost by the third\n.  The idea that someone being wealthy means that you family is set for life is a poor one.\nIf you look at IRS data, you see that someone in the bottom 25% of income almost always has moved out of that bracket within a decade.  We have very recently had a skewed system in which more young people stayed in college, many for more than the 4 years for a degree, skewing age based statistics about what age you should acquire wealth at.  Previous generations didn't attend college at nearly the numbers todays youth did meaning when you compare average wealth at 25 today versus 50 years ago, there will be a vast difference.\nA large summation of everything I've said can boil down to, you've been lied to using statistics to manipulate you.  But when you boil the data down into usable data, none of the things you hold dear are true.  You read the headline of a news article from someone who didn't understand the study conducted and believed them.  When in reality, the data shows a much much different picture.', a user said: 'In the US, generational wealth, isn't a thing.\nI'm sorry but it's hard to take anything you say seriously after this. If you want to take the word of a wealth consultancy group trying to persuade you that you need them, that's your prerogative, but the 70% figure is a laughable estimate from a small, poorly executed study in the 80s. In that study, if you started 2 new businesses and sold the old one, you'd be counted as one of the 70% \"failures\".\nIn reality, the wealth of parents is a huge predictor of the wealth of their children. Nationwide statistics show that wealth is \"sticky\",  intergenerational income elasticity is high, intergenerational social mobility is low. For example\nin Table 3 here\nalso shown\nhere as a chart\n, you can see that more than half of the top tier wealthiest people have parents in that same top tier. Generational wealth is very much a thing.'",
        "In response to 'I'm sorry but it's hard to take anything you say seriously after this.\nI literally sourced it for you.\nIn reality, the wealth of parents is a huge predictor of the wealth of their children.\nWhich is not generational wealth.\nNationwide statistics show that wealth is \"sticky\", intergenerational income elasticity is high, intergenerational social mobility is low. For example in Table 3 here also shown here as a chart\nIt is amazingly sad to me how few people read the studies they push on reddit, instead pretending that the data purports what they say.  Both this study and mine say the same.  Parents dropping wealth on their children is not a thing.  The table you linked is a measure of how successful children are, not how much money their parents gave them.', a user said: 'You cited a a study by a wealth consultancy company about the perils of what might happen if you don't hire them to manage your wealth, a study which I addressed in my comment stating that a case of someone starting 2 new businesses and selling the old one counts for failure. A far cry from \"a fortune being lost\". You then concluded that \"The idea that someone being wealthy means that you family is set for life is a poor one.\"\nIn reality, the wealth of parents is a huge predictor of the wealth of their children.\nWhich is not generational wealth.\nI am struggling to see why you think that generational wealth is something different than wealth being concentrated in the same families, generation after generation. The table I linked is showing how many of the people at the top made it there on from rags to riches (very few) and how many started from the top (the majority).\nThe table you linked is a measure of how successful children are, not how much money their parents gave them.\nAnd now you're moving the goalposts. Who cares about how much of the money the parents invest in their children is directly inherited. A lot of that wealth comes in play indirectly, through education, support (housing and expenses), networking opportunities, internships, influence, etc. But if generational wealth was not a thing and it didn't matter who your parents are, then we wouldn't have the majority of wealthy people being children of wealthy people.'"
    ]
}