{
    "username": "RamenJunkie",
    "contributions": [
        "In response to 'I was in this situation with my previous job (I was in management at a Seattle-based coffee company). My store was the busiest non-drive thru in my district. Customers would always complain about how dirty the store was, about wait times, angry/grumpy employees, etc…I remember a Teams meeting where another SM (store manager) was venting to our DM (district manager) over how overworked and stressed their employees are, and many of them have two jobs because they don’t make enough working 30+ hours at this job. That SM said “they’re giving their 110%” to which the DM replied “then that’s not good enough!”\nA few months later, the DM visits my store during the morning rush. DM puts themself on the floor doing a super easy role (“warming” wherein you put the food in an oven and wait for it to warm up to then serve to the customer. This is done for pastries and sandwiches). The DM’s usual ostentatiously chipper attitude dropped within around 5 min of working, and after about 10 the DM actually yelled at a customer who was complaining about the wait time for food that the DM was working on. DM can’t even do for 10 min what they expect us to do for 5+ hours a day with 75% less pay.\nTo top this, customers always provide their feedback via the app (if they use the app to pay). The responses are nearly universal in “wait times are too long,” “too few employees,” “this store is too busy for how few people there are,” “dirtiest store I’ve ever seen,” etc…of course the DM doesn’t see this as an issue of being understaffed, rather that the staff are lazy and not following the proper routines.\nSuffice to say I found employment elsewhere.', a user said: 'Look, on paper, it takes one person exactly 6 minutes and 38 seconds to sweep the floor the size of a store, an empty floor, with no customers, and a perfect (simulated) amount of debris tossed about.\nI don't understand why a real employee can't do that in a crowded store after an exhausing lunch rush, while dealing with debris thats been grounded in by people walking on it etc.\n-- Corporate Execs.'",
        "In response to 'That vibe when it takes you destroying a significant portion of your workforce and departments, handicapping yourself to underperform what you were doing 5 years ago, in order to maintain the profit growth…. You’re just signaling to your customer base that you don’t acrually give a shit about your service or them. It’s all profit for you. From a consumer perspective you just shouldn’t exist then. You’re profit does nothing for us if it isn’t actually going towards improving what you do. This system of investment is really starting to let us down.', a user said: 'Shareholders are the customers, the profits are the product.\nEverything else is just a line item that eats i to profits.  The idea company would have no employees or patrons, it would just be an ever widening chute of money into the hands of rich assholes with more money than anyone would need in 1000 lifetimes.'"
    ]
}