{
    "username": "Randomn355",
    "contributions": [
        "In response to 'Unless you are making them far far more than what they pay you. I which case you are a 'vital employee'.\nIt doesn't change anything though, in my experience. You still get paid the same salary no matter what, make a million for the company or make nothing for them, the only difference is a pat on the back and perhaps being overlooked on the next round of redundancies.\nIn my industry it is work to contract not work to rule, and the contracts are shit. According to the contracts I have had to sign to make a living at least 5 different companies own every and any idea that comes into my head.\nI am fucking tired.', a user said: 'So.... Leave.\nEither you're terrible at guaging companies, not as good at work as you think, or simply haven't moved around that much.'",
        "In response to 'I’ve moved around 6 times in 6 years, all companies are the same (different industries and locations).', a user said: 'Then you're terrible at guaging companies, or you aren't as good as you think and you're only getting offers from companies who are desparate.\nThe people who are better able to guage it jump ship sooner rather than later if it's important to them.\nWhen I was looking for my current job, I prioritised culture and there were interviews where 15 minutes in and I'd already eliminated them from potential candidates in my head.\nI'm far from the only person who values working somewhere they enjoy.\nObviously, there's always the chance that actually none of the jobs have been that bad and you're just aggrieved you're having to work, but it's unfair to assume that's the case.'",
        "In response to 'I don’t think you really know what you’re saying tbh and I also don’t think you know how moving up the career ladder as a minority works. But keep talking, big shot.', a user said: 'I am a minority.\nI'm not the one who's moved 6 times without getting what I want.'",
        "In response to 'Then you’re not actually any good either because if you were you’d know how quickly moving up becomes impossible because you’d be seen as a threat. You’re likely just someone whose average and has never shined at anything.', a user said: 'Except I've got better jobs both by looking around and internal promotions.\nFinding a good job isn't about just seniority, or just pay. It's about the whole package.\nI'm already at a point where I'm actually quite happy with where I am in my career and won't be looking for to progress much further because I don't want the responsibility.\nLike I've said, if every job you've got worked at (6 right?) has been so bad, you need to look at the common factor.\nIf you had 6 car crashes in 6 years, would you not consider your own driving?\nWhat if you had 6 reltionships fail because \"they're a psycho\", would you consider if you were a factor in those?\nIf you had a whole week where literally everyone you interacted with was an asshole, would you ask yourself if maybe you were part of the problem?\nMaybe you're just not playing the politics of it, maybe you arent visible enough to the people that matter, maybe you just aren't that good.\nMaybe like I've said from the beginning, you are working for shit companies because you can't read the culture well.\nIf you would rather believe that you can't get to where you want to be because you're a minority and perceived as a threat and everyone you've been passed over is just distinctly average and clearly worse than you.. Then sure. You do that.\nYour 6 jobs in 6 years with industry changes show that you're clearly happy with how your career is going.'",
        "In response to 'Massive unemployment in the 80's mate, the employers could pick and choose.', a user said: 'And there's loads of jobs going right now..'",
        "In response to 'Yeah it’s definitely a workers market at the moment… there’s a labour shortage.', a user said: 'People are romanticising the past and making excuses for why they have it so much harder than everyone else, and why it's DEFINITELY nothing to do with them.\nLogic and facts have no place in the conversation.\nIf the job is so bad, and they're genuinely as good as they claim, they would leave for a better company.\nThey either haven't been working that long, aren't actually as good as they think, or simply don't know how to guage a company.'",
        "In response to 'I think it’s more complex than that. We all have it hard. It’s rare that an employer is\nperfect\n. It can be hard to gauge a company. And it can also be a difficult decision to change jobs…. It’s a lot of upheaval.', a user said: 'As difficult as working terrible jobs for 40 years as some people have been claiming?\nEither it's not that bad (hence the upheaval being worse), or you simply aren't as innocent as you pretend.'",
        "In response to 'If you want boil down people just trying to make a living, we can.\nBusiness's need to make money. That's how they operate, hardly a shocker to anyone. You make money by selling a product or a service. The running costs (whatever it costs to actually run the business) must be balanced by the money you bring in to break even, and exceeded to make a profit, which is the goal. One such cost is labour - you can't run a business without staff. Even if you automate everything, someone needs to make the robots or fix them when they break. Labour is probably one of the biggest costs and people need to make enough, at the very least, to afford a basic living (rent, bills, food).\nThe past is irrelevant. We don't live in the past, we live now. It doesn't matter if you had to live out of your car on tin beans and stale bread for 15 years. That's the past, this is now and we'd rather no one had to live like that. I assume we can agree on that.\nSo let's apply some reality to the situation. You don't need excel at your job, you don't even need to be that good, as long as the job gets done and the company makes a profit, thats good enough for a lot of businesses. Even if you are very good, you're still expendable and can be replaced if you cause more trouble than you're worth. Let's say you run a service that allows people to travel vast distances in hours. Let's say your staff are unhappy with the working conditions and pay and they end up striking because you don't want to treat them fairly. Automate the system, the technology exists and you remove a problem and reduce costs. Let's say at least half those people don't have the qualifications to get a good enough job before they need to start worrying about rent, bills and food. That's probably why they didn't leave in the first place, maybe they even liked their job but didn't like the way they're treated. Guess they should've just shut up and dealt with unfair treatment, eh?\nYou're not going to change your mind I'm fully aware. But at the very least you'll actually think about the reality of the situation rather than reducing people to machines that always make the best decision or are capable of doing so. Your situation is not everyone else's, people have their own reasons for the things they do or do not do.', a user said: 'Change to a different company, choose a career that allows you to keep your options open, start doing something about it when you're unhappy rather than waiting to be made redundant etc.\nThere's people in this thread talking about not having had a single \"good employer\" since the 80s.\nI'm sorry, but if it's\nthat\nbad, either you need to reassess your priorities, or more often problem is the individual than they realise.\nI've had terrible jobs, everyone will at some point.\nThe problem is when apparently someone gets decades of bad jobs and think they have nothing to do with it.\nIf you meet 1 asshole, you met an asshole. If you meet nothing but assholes, the problem is likely you.'"
    ]
}