{
    "username": "randomatic",
    "contributions": [
        "In response to 'Original Post: I’m quiet quitting my PhD I’m over stressing about it. None of this matters anyway. My experiment failed? It’s on my advisor to think about what I can do to still get this degree. I’m done overachieving and stressing literally ruining my health over this stupid degree that doesn’t matter anyway. Fuck it and fuck academia! I want to do something that makes me happy in the future and it’s clear academia is NOT IT!\nEdit: wow this post popped off. And I feel the need to address some things.\n1. I am not going to sit back and do nothing for the rest of my PhD. I’m going to do the reasonable minimum amount of work necessary to finish my dissertation and no more. Others in my lab are not applying for as many grants or extracurricular positions as I am, and I’m tired of trying to go the extra mile to “look good”. It’s too much.\n2. Some of yall don’t understand what a failed fieldwork experiment looks like. A ton of physical work, far away from home and everyone you know for months, and at the end of the day you get no data. No data cannot be published. And then if you want to try repeating it you need to wait another YEAR for the next season.\n3. Yes I do have some mental and physical health issues that have been exacerbated by doing this PhD, which is why I want to finish it and never look back. I am absolutely burnt out.', a user said: '“It’s on my advisor to think about what I can do to still get this degree”.\nI’m going by to plainly tell you that you are responsible and accountable for your own outcomes. If your words are true, your advisor is not only completely absolved, but also every future relationship where you blame your outcome on them. Professional and personal.\nIt’s fair to quit. It’s fair to decide something’s not for you. It’s morally reprehensible to blame that on someone else.'",
        "In response to 'hasn't been my experience but based on content from this sub, it's fairly clear to me that many advisors are the precise reason certain students fail at obtaining their doctorate.', a user said: 'In this sub, advisors are a primary reason students are miserable. At some point this became a rant channel. But to say advisors are the reason students fail to get a doctorate is absurd because it shows no personal responsibility.  Quit, change advisors, change schools, etc. it’s the students degree to earn, and putting the lack of a degree on someone else just sounds entitled as hell.\nEveryone with a modicum of intelligence can understand “I wasn’t going to succeed under advisor x” and at the same time understand “and I decided to quit and not try again” with full empathy. Just don’t turn it around on the advisor as why you couldn’t get a PhD in your overall life.'",
        "In response to 'Yeah, the only exception to that would be if their advisor is intentionally preventing them from graduating due to the experiment failing. In principle, if you complete the experiments in your agreed upon proposal, you should be able to write up the results regardless of what they are. If it \"fails,\" then it becomes, \"Well, we thought x would happen, but actually y happened, and here's some hypotheses for why.\" But even if that's the case, unfortunately, you have to be your own advocate in arguing for that.', a user said: 'I don’t know this is always the case. A PhD is granted because of novel results, not because of a contract, at least where I am at.\nNegative results can be novel and add the the scientific knowledge, but obviously not always.  A committee shouldn’t give a PhD to a student who tried to prove gorillas and giraffes could mate, only to have negative results, even if the advisor didn’t shoot down the idea.'",
        "In response to 'I do agree that many PIs see it this way, but I think it's completely wrong. If a committee approved the dissertation proposal, then the student's job is to fulfill it. The project itself should be novel. The goal of a PhD imo should be to ask important questions, create novel but relevant experiments to answer them, and demonstrate the ability to carry out scientific experiments of rigor. The gorillas and giraffes example would not fulfill that criteria and should fail the dissertation proposal.\nThe idea that a PhD is only successful if results are statistically significant feeds into the problem of academia that only significant results are publishable. Null results matter, and if we really want to talk about the problems with the pressure to publish, that has to be addressed at the student level too.', a user said: 'You just switched from advisor telling to a thesis committee approving, which is a higher bar. Once again though it’s not a contract.\nThe goal isn’t to ask important questions or just conduct experiments. To get a PhD, you have to have contributed in a meaningful way the overall body of knowledge. The word “meaningful” is subjective and what the committee decides during a defense.\nTo out another way, there is no point to a defense if the committee approving a proposal results in a PhD 100% of the time. The proposal is a rejection criteria: if the proposal sucks, you reject it as implying a PhD. It’s not an acceptance criteria, where a successful proposal means a PhD if the experiments are done.\nAnd yet another way, more bluntly, is no one is entitled to a PhD.\nThe pressure to publish is a straw man argument. The whole point of publishing is to make sure you don’t have a self contained world. I reflect on the current us Supreme Court, and note that since there is no actual way to push back against a justice that they lose perspective.  Peer review is that feedback mechanism in science, because someone just deciding a null result is meaningful doesn’t make it so any more than a Supreme Court justice having a particular world view make it so either.'"
    ]
}