{
    "username": "Random-Rambling",
    "contributions": [
        "In response to 'The best antidote to their class solidarity is to spread the good word of unionization.\nThis is how we win, and it may take us a while to gather momentum on unionization. But as the 60s showed, culture can change quickly. We have green shoots at Amazon, Starbucks, Apple, REI, etc.\nEven if there is no chance of your company unionizing, you can still point out to your coworkers the obvious hypocrisy of our current system. Like the loyalty the rich demand of us when they see us as plebs unworthy of job security or any respect whatsoever.\nWhen Bernie goes on FOX, he is doing the same thing - trying to win over a few people or at the least make them think about their views a bit. It's a long & slow game, but we have the right ideas & we must never give up.', a user said: 'Yep.  The flood starts with a few raindrops.'",
        "In response to 'Royalty existed for millennia for the exact same reasons.   Some people are just\nhappier\nwhen they have a set of boots to lick.', a user said: 'I can definitely see the appeal of giving away your responsibility to some higher person and letting them deal with it.  I'm not saying it's a good thing, but I can see why people do it.'",
        "In response to 'This has forever been a class war, with the rich, their politicians and the corporations against the worker. I'm sorry to say that everything else is just a distraction from that.\nIs abortion an important issue? Yes. Will Democrats fuck over the worker while supporting abortion rights? Yes they will and the problem is that fucking over the worker is fucking over abortion rights, because it leaves the people most in need of the service without the financial wherewithal to even get it if it is available.\nPoliticians love to run on issues that have no consequence at all for their corporate masters.\nBipartisan support has always been against labor.\nThe Taft–Hartley Act of 1947 curbed the power of labor to organize after major strikes in 1945-1946 showed that the people were still dissatisfied with the status quo. This legislation alone has been incredibly effective in curtailing union activities and was passed by both parties in an override of Truman's veto.\nThe very recent bipartisan support for stomping on the right of railroad workers to strike are an example of the power of Taft-Hartley in action even today.\nRepeal Taft-Hartley.', a user said: 'I've always said that the only \"privilege\" that has ever existed is the privilege of the wealthy.  Race, sex, orientation?  All distractions.'"
    ]
}