{
    "username": "Random_potato5",
    "contributions": [
        "In response to 'Original Post: I \"quiet quit\" my marriage and my husband acts like nothing changed. Edit below original post.\nTLDR: I quiet quit my marriage after years of financial strain and broken promises from my husband. I've been intentionally distancing myself, physically and financially, for the past year and he has little to say about it, as long as we still \"look\" married.\nThe last few years of my 13-year marriage have been tense. After spending the first decade feeling like a mother/roommate to my husband more than a partner, I was done. I made it known that if he did not turn things around, we would not have a future together. He spent a week at his friend's before coming back home and I hoped it was the wake-up call he needed.\nHe never told anyone about the falling out. He promised me that he would change. He would stop draining the bank account. He would stop forcing us deeper into debt. He would listen to me when I explicitly told him what I need. He would follow-through with action instead of broken promises.\nWe went through another year of bullshit. He maxed out my credit card while he was unemployed and just six weeks after I had paid it off. His follow-through was non-existent and he was becoming hostile when I would bring anything up. He would do the things for me that made him feel like a good husband while ignoring the things I needed him to do as a partner. We made more than enough money to live comfortably, yet every month we were sinking deeper into debt. I agonized over different debt repayment and budgeting strategies, trying to choose the one I thought would be the easiest for him to follow. I blamed myself. I demanded we split everything 50/50 from now on so that he would know he is accountable for his share instead of forcing me to pay 100% of everything when he runs out of money, despite him making 40% more than me every month. I had a future I needed to plan for. I had family across the country and a terminally ill father I wanted to see (who has since passed). We had two kids who we needed to be able to support. I was trying to maintain a decent credit score. When I verbalized all of this, he responded with all the things I needed to hear. He told me he understood and would do better.\nHe didn't. After a couple of weeks, he acted like nothing happened and went right back to his destructive habits. I decided to rent my own apartment and when I moved out, I felt such immense relief. My husband stayed involved, committed to continuing to work things out. After a month, I was convinced that we still had something to fight for and, like an idiot, I moved back in. Again, he never told anyone about the falling out. He promised we would continue with weekly check-ins and he would communicate better while watching his spending more closely. However, things soon reverted back to the way they were and would always be - deeper in debt with a plummeting credit score.\nSince then we've had a number of very honest, heated discussions that were mostly about money. At one point I accused him of being more satisfied with the image of a successful marriage than actually having one. He insists that I'm his best friend, everything he does is done for us/our future, and he's nothing without me.\nFinally in September, after yet another month in overdraft, I demanded he get his own bank account for spending so we can continue to use the shared one for splitting the bills instead of him overdrawing it every two weeks... then reminded him twice after that but \"the lines were too long\". Instead, I went through the agonizing process of having everything moved over to my own separate bank account in December and now I pay for everything with my own income and benefits, excluding his car payment and insurance. That was my final breaking point. I moved out of the bedroom and cemented our roles in my brain - co-parenting roommates. Since the total separation of finances, I've paid my credit cards down by 50%, built up a small savings, and have been able to buy myself things that I want (like skin care, hobby supplies, and new clothes) for the first time in over a decade without having to worry about being short on our mortgage. I feel like I'm finally free from being held financially hostage for way too long.\nThis still wasn't the wake-up call I needed it to be. Over the past two months, he continues to leave me hanging at the grocery store, out of money and unable to help pay to feed his kids despite the fact that he only has a car and insurance payment to make now. We sleep separately every night. He has never offered to discuss the status of our relationship and I don't care enough to talk about it at this point. I have nothing new to say and I am not repeating myself. I've given up and have started the process of building up enough resources to leave and start a new life once the kids graduate in 4 years, but hopefully sooner. Despite this, he is still expecting me to attend trips to see his family as if nothing has changed (and I will, for our kids). He is still focused on the appearance of a healthy marriage while we operate as roommates and seems perfectly content as long as I am living within the same four walls as he is.\nIs it 2029 yet?\nEDIT: Wow…\nFirst - Thank you for the comments. Instead of replying to each one, I‘m going to just provide as many answers as I can in this edit.\nThe post was written as more of a vent for something I needed to get off my chest, but I’m happy to provide extra detail.\nI know how ridiculous this must sound to those who haven’t lived it, but it’s a lot harder than just saying you’ll leave, packing up for your new life, and heading out the door. The month I moved out provided a dose of reality that maintaining a home and apartment long-term is not financially possible. I’m in Canada. We are in the middle of a housing crisis with a cost of living that keeps trending upward. I’m honestly lucky to be a home owner at all and I just started building a ladder to climb out of this hole. I know that if I am going to leave, I need to prepare. Yes, it’s stupid that I’m paying for everything. However, I need to secure some kind of financial stability in order to gather the resources to prepare to leave. Should I kick him out? Absolutely. Will he leave? Doubtful, but I’m willing to find out when the conversation happens. It just hasn’t yet.\nI’ve done what I can do from a legal perspective. To divorce for marriage breakdown, I need to be separated for a year and I’ve met the criteria for separation under the same roof. I plan to do more research and speak to someone in detail about the process, but my focus is saving now and filing for divorce at the end of the year. I’m grateful to those of you who mentioned my liability in him incurring more debt, because I had always assumed his abysmal credit would keep him from being approved for anything, but you never know.\nFor those wondering why I have stayed silent - I haven’t. I’m a recluse, but I have close people in my life who are aware of the situation. He just keeps it from his friends and family. I have gone back and forth about continuing to go to his family gatherings and you guys are right. I really do hate the idea of putting on an act and will happily decline.\nAs for the kids - they aren’t privy to our financial struggles. I do everything I can to maintain that. That being said, the tension is palpable at times and they probably are sensing it. I’m not setting a good example, but I’m doing what I can with the resources I have. I don’t intend to drag this out for four years. If I can get out sooner, I will. I’m in a position to set myself up properly, and not everyone gets that opportunity. I’m across the country from my family. I only have myself to rely on and the last thing I want is to half-ass my exit.\nI hope that clarifies things a bit. Thank you for the perspective I needed.', a user said: 'Everyone has said it, leave. But if you stay at least get him to set up a standing order for half the mortgage and bills, that leaves his account the day he gets paid, because this is ridiculous. He has a salary, he should be contributing something, and that will help you save up. God knows what that money is going to, I have a really bad feeling it's nothing good.'"
    ]
}