{
    "username": "rants_unnecessarily",
    "contributions": [
        "In response to 'Quiet farting eli ns. hiljainen hiihtäjä', a user said: 'Jätin muuten häyhät tonne hissiin'",
        "In response to 'Olen tehnyt tuon tempun muutaman kerran lähtiessäni hissistä ja kuunnellut seuraavian asiakkaiden hyi helvetti kommentteja.', a user said: 'Aivan oikein niille. Mitäs ovat asiakkaita.'",
        "In response to 'Japanissahan tämä ilmiö on tunnettu jo pitkään. Kun edellytyksiä ei ole antaa potkuja suoraan, työnantaja päättää olla antamatta  mitään työtehtäviä työntekijälle, ainoastaan pelkän tyhjän kirjoituspöydän. Työnantaja toivoo, että työntekijä lopulta kyllästyy pelkkään peukaloiden pyörittämiseen ja kellon tuijottamiseen, vaikka palkka juokseekin normaalisti.', a user said: 'Mutta... He ottivat nitojani.'",
        "In response to 'Original Post: Quiet quitting eli tämän syksyn yksi ärsyttävimmistä uusista termeistä on saanut vastaparin: quiet firing Quiet quitting (\nHesarin maksumuurilinkki\n) josta suomeksi käytetään termiä hiljaiset loparit. Termi on määritelty niin, että se tarkoittaa työn tekemistä niin, että suoritus on tarkalleen juuri se mitä on vaadittu. Tämä taas on markkinoitu meille jonkinlaisena alisuoriutumisena vaikka se tarkoittaa vain normaalia työntekoa.\nNyt ilmeisesti samasta koneistosta on putkahtanut uusi termi: quiet firing eli hiljaiset potkut (\nHesarin maksumuurilinkki\n). Hiljaiset loparit tarkoittavat työntekijän savustamista firmasta ulos estämällä tältä ammattitaidon kehittäminen, eteneminen uralla ja muilla tavoilla kiusaamalla.\nHiljaiset potkut ovat puhdasta kiusaa ja täysin epäasiallista kohtelua. Ilmiö ei ole uusi, firmasta ulos savustamiselle on vain keksitty pöhisevämpi termi. Jos työntekijän työsuorite ei miellytä, tulee työnantajan ottaa aihe kahden kesken puheeksi työntekijän kanssa rakentavassa hengessä ja pohtia yhdessä siitä mikä estää suoriutumisen ja miten siitä päästäisiin yhdessä yli eikä millään lapsellisella kiusanteolla.\nJos olette uusia työelämässä niin älkää langetko tällaisiin riistokapitalistisiin kusetuksiin. On täysin ok tehdä töissä juuri se mitä siellä kuuluu tehdä, tämähän on aivan normaalia. Palkkakin on neuvoteltu sen työtehtävän mukaan ja jos se normaali taso ylitetään niin pitää siitä silloin maksaakin enemmän. Ei ole mitään järkeä venyä äärimmilleen joidenkin katteettomien lupausten toivossa. Joustaa voi tietenkin kunhan se tapahtuu molempiin suuntiin. Kohteliasta on olla se joka joustaa ensin ja aika nopeasti se tulee ilmi, että toimiiko se molempiin suuntiin vai ei, ja joustamisen voi nopeasti lopettaa, jos se paljastuukin yksipuoliseksi ja resurssitappio jää pieneksi.\nJos koet töissä hiljaisia potkuja eli ulos savustamista niin ota se pikimmiten puheeksi luottamushenkilön ja mahdollisesti työsuojelun kanssa.\nPäivän vitutusannoksen tarjoili tänään Helsingin Sanomat.', a user said: 'Tuosta savuttamista oma näkökulmani:\nPuhut pelkästään työntekijästä, jonka\ntyönsuorite\nei miellytä. Tosiaan näitä tapauksia on, en tiedä missä määrin, mutta rohkenen arvaamaan, että siihen verrattuna  mistä aion puhua, niitä on vähemmän.\nVähän taustaa:\nOlen ollut osallisena saavuttamiseen, enkä kadu sitä yhtään. Olen yksikön johtajien sekä HRn kanssa yhteistyössä tahallisesti ja tarkoituksella yrittänyt saada 4 eri henkilöä omasta tiimistäni lopettamaan tai vähintään lähtemään toiseen yksikköön, jossa he saattaisivat \"pärjätä paremmin\".\nKolme neljästä onnistui, ja tämän neljännen hankaluudet loppuivat, kun viimeinen muista siirtyi muualle. Viidenteen en suostunut, sillä näin hänessä potentiaalia parantaa tapansa ja pystyin keskustelemaan hänen kanssaan järkevällä tasolla. Hän kuitenkin otti loparit elämänmuutoksesta johtuen, joten johto lakkasi minun painostamisen.\nPointti:\nMainitsemani työntekijät suoriutuivat työstään enemmän tai vähemmän hyvin, osa jopa toisinaan erinomaisesti. En kuitenkaan voinut panostaa liikaa heidän kehitykseen tai suositella heitä korkeampiin asemiin, sillä he olivat erittäin toksisia ihmisiä. He ns. myrkyttivät osastoamme ja sitä kautta koko yksikön hyvinvointia. En mene tarkempiin detaljeihin, mutta kyse oli useammasta menetelmästä kuinka he käänsivät toisia tosiaan vastaan, saivat jotkut jopa itkemään työpaikalla, levittivät vihaa, epäluuloa, kateutta, jne. Ei edes yritystä kohtaan, vaan ihmisten välistä.\nToki eräs oli vain aivan tajuttoman ilkeä kaikkia kohtaan.\nOlimme kaikkien kanssa keskustelleet näistä asioista, sen verran mitä työantajan on laillista puhua toisen henkilökohtaisia asioita/puolista lipovista asioista. Monta vuotta yritimme kaiken moisia eri tapoja, mm. työympäristön, työtehtävän, vastuun määrän, työkavereiden jne.jne. muuttamalla.\nLopulta ainoa tapa miten näimme voivamme parantaa koko muun toimiston hyvinvointia oli päästä heistä eroon.\nVihatkaa minua tai mitä vain, mutta meidän toimistosta ja koko yksiköstä tuli aivan erilainen maailma, kun viimeinen lähti talosta. Kyllä se vain on, että yhden henkilön hetkellinen hyvinvointi ei mitenkään ole tärkeämpää, kuin sen 100+ muun.\nTLDR:\nSavustamiseen on muitakin, ehkä painavempia, syitä, kuin tyosuoritus. Mm. se, että he vain ovat paskoja ihmisiä, eivätkä suostu parantamaan tapojaan. Savustaminen voi olla monen muun ihmisen hyvinvoinnin suojelua.'"
    ]
}