{
    "username": "RatDontPanic",
    "contributions": [
        "In response to 'What country is that because the United States employers expect a notice but aren't required to give one', a user said: 'Some company (Whirlpool? I think?) gave their factory workers notice. Layoff incoming, train your foreign replacements to get severance pay. Then they closed it and took the work offshore.\nBurns me up to hear economist dirtbags going on about how taking away those millions of jobs helped the economy. Instead it created a giant domino effect that took down the entire working class. It's not even allowed to say on Reddit what We the People should do about that.\nAnd now we have a giant enduring shortage of\neverything\nbecause COVID wrecked the foreign outsourced workforce.'",
        "In response to 'I worked for home depot during the peak of covid and alot of the older workers stayed home during that for safety concerns, so I was the only pro loader ( person who helps customers load their cars ) and also the only cart collecter. Well naturally I started to \"fall behind\" as my boss's told me.\nAnyways one day they asked me into their office and sat me down then told me that im terminated from this company due to me not being able to pick up the slack.\nLast I have heard they have gone through at least a dozen other pro loaders because everyone keeps quitting that position.\nMy friends who I worked with there said that the place basically went to shit when I \"left\" because I was actually really good at my job🤣\nBasically what im saying is no, they will fire you on the spot for any reason they can.', a user said: 'File for unemployment, \"misconduct work performance\" is almost a guaranteed win if you point out that your work performance standards\nwent up\n. I've seen post-COVID stories like that in the media, too.\nr/Antiwork\nLOVES it - and sometimes\nthat\ngets in the media. Home Depot is on the level of a major and profitable target for the media.\nMake them hurt for that.'",
        "In response to 'I guarantee you there isn’t an office in the country where you could successfully pull this off. They’d fire you and hire some new schmuck to do the job of both old employees, no question.', a user said: 'Go to the media about it and file under \"fired for failing to meet increased work performance standards.\" Keep your termination paperwork and send a copy to your state's EDD. You'll win the case for sure, and they might have a media circus to deal with, depending on how big they are. For sure their unemployment account will be taxed, and premiums raised. That'll hit them where it hurts.'",
        "In response to 'Well what did you expect? The\nmanagement\nto do it? They're managers, you can't expect them to manage things, where would you get the idea that it would be their responsibility? I mean it's work, you're a worker so it must be for you.\nThis comment brought to you by HR and the top floor office vampire', a user said: 'If you can't work, teach, if you can't work or teach,\nmanage\n.'",
        "In response to 'And they're trying to quiet wage theft you - if you're OT exempt. If you ARE OT exempt, don't do a minute of OT. They can threaten your job, but it would be an idle threat; who are they gonna give two people's work to? If you do make OT pay (especially time and a half) and if you can spare the time off and are OK working extra, then that's extra money. My first job out of college I had a tyrant of a boss but was paid OT - boss didn't pay much attention to my hours - so I banked all that OT, bought my first computer, software, printer/scanner and after two years put together a great portfolio and got the hell out of there. On the job, time is money, and if you're spending time not making money, you have to better protect your time or you'll never have any money.', a user said: 'Never underestimate an employers' willingness to fuck around (fire someone and give their work to another already overworked employee) and find out (watch their operations fall apart).'"
    ]
}