{
    "username": "RChickenMan",
    "contributions": [
        "In response to 'This is where I'm at. I still do\nsome\nthings outside of contract hours because I'm not tenured and can be fired, and my state doesn't have\nquite\nthe shortage that others do, especially in my content area. So I do grade some over weekends and I stay late a couple of times a week, but other than that... I'm no longer volunteering to chaperone. I'm not going to take on additional duties. I will take my laptop with me to lunch duty and work while I stand there for over an hour. I take my laptop during roaming duty (literally walk around the school for an hour) and post up somewhere and work. I leave as soon as I can and if that means I only have the next day planned, so be it. I have summatives from last month that aren't in the gradebook because I haven't had time. I had Covid for a week (that I got at a fucking pep rally at school) and didn't do a goddamned thing. I've had residual effects from it and have been really fatigued, so I haven't gotten to it. I used to work as a para and work an additional job and I'm STILL more exhausted coming home every day from a full time teaching job than I was as a full time paraprofessional and doing an additional part-time job every day. I'm just really over working harder than literally everyone I know, with more experience and qualifications, and STILL having to put gas on my credit card at the end of the pay period.', a user said: 'I only have the next day planned\nGranted I'm only in my second year, but I've literally never had more than the next day planned.  Ever.'",
        "In response to 'My school wants me to implement “centers” in my classroom—I asked when I’d have time to prep materials each week and they told me to do it over fall break. When I told them I have other plans, they seemed thoroughly confused.', a user said: '\"Centers\" or \"stations\" (assuming they're the same thing?) has always struck me as one of those things they talk about in grad school that simply doesn't translate to the real world.  I don't know, maybe suburban and rural schools have physically larger classrooms, but my room barely has enough space for the students/desks in their normal configurations.  I just have trouble envisioning how something like this could physically work.\nEven something like pulling a group for re-teaching (something which I'd love to do)... where?  Any time I've tried doing that it's this massive logistical hassle of having people switch seats and getting confused.'",
        "In response to 'People arguing over semantics on what to call it when the real issue is all the bs us teachers are fed up with. Solidarity', a user said: 'Disagree--language matters.  \"Quiet quitting\" is language invented by the exact people we're lamenting--the people who want to exploit workers beyond their wages.'",
        "In response to 'There’s a special place in hell for teachers who do that extra work for free', a user said: 'There's a special place in hell for untenured teachers?  Well damn, I hope I don't die in a freak accident before I get tenure!'",
        "In response to 'You're building artificial boundaries. The contract\nnever\nstates that teachers are required to work only during those hours. It says that those are the hours for school. It also then states what you duties are, and what you're being paid for attending to those duties.\nThis is just as foolish as students saying that school hours are 8-3 and so they don't have to do any work outside of those hours and teachers can't penalize them for it. What would you tell that kid? Obviously, you'd point out that those hours only represent the time period we require the kid to be at the school.\nIt's really quite similar for teachers.', a user said: 'It's really quite similar for teachers.\nRight, exactly--thank you for phrasing the problem.  In fact, I thank you for sharing your homework analogy, since it really makes it clear how absurd our situation is.  It really helps us to better understand why it's so hard to attract and retain top talent in our classrooms.\n\"Hey, I know that by virtue of being qualified to teach math, you're most likely also qualified to make 3x the salary in other fields, but I really think you should consider teaching.\"\n\"Oh yeah?  Tell me more.\"\n\"Well, you'll have homework.  Like a child.\"\n\"Thanks but I think I'll pass.\"'"
    ]
}