{
    "username": "Realigned13",
    "contributions": [
        "In response to 'Most of you barely graduated high school and have no real life skills…..yet you demand high wages. For what? Something that most teenagers can do right out of high school?\nGo Corporate if you want to make money. That will require bettering yourselves though….and most of you are too lazy to do that. The proof? Read your posts here about your work ethic.', a user said: 'Don’t be such an arrogant ass.  Most kids right out of high school could put nuts and bolts together on an assembly line with zero education or life skills. Well guess what? Millions of them did just that back in the 50s and 60s and got paid enough to buy a house, support a family, buy a car and retire with a pension. Those days are dead and gone. Honestly, the average retail associate has to have a larger skill-set than factory workers from decades ago yet makes significantly less money when adjusted for inflation.\nThe competency and motivation of the workforce is the same, but corporate greed has grown exponentially.  You are greatly underestimating that. Unions did wonders for the middle-class in the 1st half of the 20th century. We desperately need them back.'",
        "In response to 'Im actually 30....i just am not a snowflake. I was raised on the value of a dollar and i know that because i didnt go to college i wont make 50k+ a yr. I am ok with that. I have an easy job that keeps me and my family out of poverty. And ill probably promote one day because i dont do the bare minimum. Sorry im not one of you....get over it....', a user said: 'If you think not going to college means that you are either incapable or not deserving of anything more than 50k/year, then you are the type of “victim” that CEOs go to bed at night thanking their lucky stars for.\nPerhaps you should consider going to college if for no reason than to de-program yourself and learn some critical thinking. You seem to be on a lifelong path of being habitually taken advantage of (regardless of whether or not you get promoted).'"
    ]
}