{
    "username": "Realistic-Tie2701",
    "contributions": [
        "In response to 'It’s not. It’s propaganda. Have you ever heard the term prior to maybe 6 weeks ago, when everyone started writing think pieces on why it’s bad or making the same “hurr it’s called acting your wage” joke in reaction? I bet the answer is no. Someone who benefits from people working far beyond their job description came up with applying the term to people doing their whole job in an attempt to make fully competent workers feel they are being lazy.\nEven saying that it’s a rebranding of work to rule is highly, highly inaccurate. Work to rule is an organized tactic and is obstructionist. It’s so far beyond doing your whole job during your scheduled work hours. It would involve doing\nnothing\nthat is not in your job description, including the kinds of things even D- workers are usually okay doing (such as changing a toilet paper roll or handing your coworker something from the supply closet) and following all rules and laws to the letter, even if those rules are ridiculous and normally ignored.  Filling out superfluous forms, asking permission for every little thing, looking up the OSHA guidelines for an hour before doing anything, etc. This is intended to grind productivity to a crawl while also giving no legitimate reason to fire someone.\n“Quiet quitting” is not that. Every description I’ve seen ranges from “doing your job entirely well” and “being kind of mediocre at your job.” Not working voluntary overtime, not signing up for extra projects, not volunteering to pick up slack when another coworker is out of the office, or not doing tasks that are actively outside of your job description (meaning things like heading the party planning committee or making a slideshow for another department’s presentation, rather than things like grabbing post it notes for Bob when you’re already standing at the supply cabinet). Sometimes it extends to not having friends at work or participating in off-the-clock activities. It’s also an individual behavior that is more reflective of a person’s general attitude towards work, not a collective tactic for an end goal, at which point the behavior will stop. One person, or even an entire workplace, “quiet quitting”\nshould not\ngrind productivity to a halt, because everyone is still actually doing their job in good faith, with the intention of doing the work they were assigned in the time they were assigned to do it.\nWhich is why “quiet quitting” isn’t quitting. It isn’t\nanything\n. But so many workplaces have become accustomed to hustle culture and employees giving 110% that “I’m going to do my job to the best of my ability during my standard work hours” sounds like slacking. So many workplaces have spent the last 2 decades cutting corners and working with skeleton crews of people desperate for a paycheck, any paycheck, while reaping the profits, and they now think that that is standard. That they can lay people off every year and never replace them, just give their work to whoever’s left. That they can give people the job loads of senior employees while they retain the title and pay of an intern. That they can demand unpaid overtime, and dictate how people spend their off the clock hours. This became the norm in the post recession work but it is getting pushback in the post pandemic world and they’re choosing to demonize appropriate work ethic rather than adjust their management styles.', a user said: 'Thanks for your comment, before reading it, I felt like an alien, that I am alone with this opinion. I was trying to explain this to some exec. level management guys couple of days before, and I had the feeling that they just don't want to understand and/or accept that their management style/thinking is completely outdated and wrong.'",
        "In response to 'Thanks for your comment, before reading it, I felt like an alien, that I am alone with this opinion. I was trying to explain this to some exec. level management guys couple of days before, and I had the feeling that they just don't want to understand and/or accept that their management style/thinking is completely outdated and wrong.', a user said: 'The \"funny\" part of the story: i am an HR leader. So they were really shocked. :D'"
    ]
}