{
    "username": "realSatanClaus69",
    "contributions": [
        "In response to 'My god the CBC loves these stories, coming up with new ways to say workers suck and businesses are being abused by its workers. \nThere is no such thing as centrist or dare I say centre left news organization in this country any longer.', a user said: '…you think the CBC has a right wing bias?\nEdit: fuck this ridiculous echo chamber. ALL that is implied by this particular comment is the CBC does NOT have a right wing bias. Person above clearly implied they did. Do you see the words “left” or “liberal”? That’s a different argument entirely.'",
        "In response to 'A liberal bias is not a left wing bias. They are centrist with corporate leanings and some right tendencies. Pretty much the Liberals in a nutshell.', a user said: 'https://mediabiasfactcheck.com/cbc-news-canadian-broadcasting/\nor\nhttps://www.allsides.com/news-source/cbc-news-media-bias\nEdit: wtf? Ok, I included “allsides” just to have more than 1 (fuck me), but you people actually have a problem with Media Bias/Fact Check?\nhttps://mediabiasfactcheck.com/about/\nIt says “CBC’s straight news reporting is consistently low-biased, factual, and covers both sides of issues. Editorially, the opinion pages tend to be balanced […] On the whole, slightly more opinion pieces favor the left.”\nYou all have a problem with this? Are any of you even reading before downvoting??'",
        "In response to 'Linking a poorly sourced website created by someone who has self-proclaimed biases about a subjective and Canadian specific matter is pretty pointless. Yes in the US it would be considered left. Our Conservative Party would even be fairly left. 🤷\nCBC is centrist in Canada. They support the Liberals, who are also centrist. That’s pretty well understood by anyone who understands that there is more than a left vs right dichotomy.', a user said: 'Not by US standards, or Canadian ones, but universal / international ones.\nMedia Bias Fact Check, which is plenty reliable, says the following:\n“CBC’s straight news reporting is consistently low-biased, factual, and covers both sides of issues. Editorially, the opinion pages tend to be balanced with some stories leaning left, such as this: […] and right-leaning: […] Opinion pieces have also been critical of liberal Prime Minister Justin Trudeau. On the whole, slightly more opinion pieces favor the left.”\nYou seem to agree with all of that, BUT the last sentence?\nI’ve been listening to CBC every day for my entire adult life, but I am conscious of what I’m hearing, and the occasional centre-left tilt. Definitely NOT right leaning (which was my original point.)\nLikewise, the LPC (the so-called “natural governing party”) is centre-left. We don’t actually have a centrist and/or moderate party in this country, maybe we used to, not anymore.\nThe left-right spectrum is a simplification, absolutely, and any nuance is lost, but really in most cases it’s a pretty good one.\nAlso… poorly sourced? What other sorts of sources would you have liked to see? Did you even read?'",
        "In response to 'Not what I said. I don't think CBC is right wing. \nCalm yer tits bud.', a user said: 'I am largely responding to everyone else in the thread, BUT…\nYou say “there is no such thing as centrist or dare I say centre left news organization in this country” (and got a ton of upvotes for it too.)\nWhat else could that mean? How do you reconcile that?'"
    ]
}