{
    "username": "Reason_Training",
    "contributions": [
        "In response to 'Original Post: Quiet Quitting: What is it Really? Quiet quitting is a confusing term to me, but maybe I just don’t understand it. I have rarely ever given 120% to a job… maybe when I was fresh out of college when I had that mindset. But the years have jaded me. What people call “quiet quitting” (doing the minimum) is what I just call doing my job lol. It’s not like I refuse when they ask me to do more work (tho rarely do they ask), but I don’t SEEK more work out unless I’m just bored. For example, in my work, we work in Sprints and get assigned stories to do for those sprints. I just do those stories — not more or less — unless I’m just bored and have finished my stories weeks in advance, then I may grab a story for the next Sprint. I get paid by the hour so no work means no pay. But it’s not like I can ADD more stories to the current Sprint because someone else still needs to test them and THEY may not have capacity. So, a lot of times I just do things around the house since there always seems to be something to do at home. Have I been quiet quitting for years and just didn’t know it or is doing the minimum not really what quiet quitting is all about?', a user said: 'From what I have seen as a manager there have always been people who do the bare minimum that their job requires. I don’t see a problem with that as long as the person is not expecting to eventually be promoted or get the highest raise. For example, HR set raises for up to 5% this year. An average employee doing the bare minimum will get an average raise, which would be 2.5% percent rounded to 3%.\nJust because someone has labeled those who are not passionate about their work as “quiet quitting” doesn’t make this a new trend. People are there for their paycheck only and nothing else should not be looked down on.'",
        "In response to 'The reality I have seen is employers budgeting 2.5% for raises. The difference between a solid and mediocre performer could be less than a 1% difference, which makes the solid performer wonder why they work so hard and do so much extra to never be rewarded for it.', a user said: 'I’ve worked in those companies too. Where I work currently they do budget raises based on income as well as projected income. There have been slow years where we’ve actually suspended raises but the last few years have seen a lot of growth so for 4 years now HR has allowed 5% for the top 20% of the company, 4% for the next 20%, and so on. People who work hard not only get a better raise than someone who is mediocre but also our bonuses are both tied to our tenor as well as our employee reviews. Anyone who gets the highest reviews will receive the highest bonus.'"
    ]
}