{
    "username": "Redditoristi",
    "contributions": [
        "Quiet quitting eli tämän syksyn yksi ärsyttävimmistä uusista termeistä on saanut vastaparin: quiet firing Quiet quitting (\nHesarin maksumuurilinkki\n) josta suomeksi käytetään termiä hiljaiset loparit. Termi on määritelty niin, että se tarkoittaa työn tekemistä niin, että suoritus on tarkalleen juuri se mitä on vaadittu. Tämä taas on markkinoitu meille jonkinlaisena alisuoriutumisena vaikka se tarkoittaa vain normaalia työntekoa.\nNyt ilmeisesti samasta koneistosta on putkahtanut uusi termi: quiet firing eli hiljaiset potkut (\nHesarin maksumuurilinkki\n). Hiljaiset loparit tarkoittavat työntekijän savustamista firmasta ulos estämällä tältä ammattitaidon kehittäminen, eteneminen uralla ja muilla tavoilla kiusaamalla.\nHiljaiset potkut ovat puhdasta kiusaa ja täysin epäasiallista kohtelua. Ilmiö ei ole uusi, firmasta ulos savustamiselle on vain keksitty pöhisevämpi termi. Jos työntekijän työsuorite ei miellytä, tulee työnantajan ottaa aihe kahden kesken puheeksi työntekijän kanssa rakentavassa hengessä ja pohtia yhdessä siitä mikä estää suoriutumisen ja miten siitä päästäisiin yhdessä yli eikä millään lapsellisella kiusanteolla.\nJos olette uusia työelämässä niin älkää langetko tällaisiin riistokapitalistisiin kusetuksiin. On täysin ok tehdä töissä juuri se mitä siellä kuuluu tehdä, tämähän on aivan normaalia. Palkkakin on neuvoteltu sen työtehtävän mukaan ja jos se normaali taso ylitetään niin pitää siitä silloin maksaakin enemmän. Ei ole mitään järkeä venyä äärimmilleen joidenkin katteettomien lupausten toivossa. Joustaa voi tietenkin kunhan se tapahtuu molempiin suuntiin. Kohteliasta on olla se joka joustaa ensin ja aika nopeasti se tulee ilmi, että toimiiko se molempiin suuntiin vai ei, ja joustamisen voi nopeasti lopettaa, jos se paljastuukin yksipuoliseksi ja resurssitappio jää pieneksi.\nJos koet töissä hiljaisia potkuja eli ulos savustamista niin ota se pikimmiten puheeksi luottamushenkilön ja mahdollisesti työsuojelun kanssa.\nPäivän vitutusannoksen tarjoili tänään Helsingin Sanomat.",
        "In response to 'Ja sitten on myös quiet promotion, saa enempi määrättyjä töitä ilman palkankorotusta.', a user said: 'Totta, huutikset tälle!\nOlen todistanut useita tapauksia työelämässä sekä muilla että myös jopa omalla kohdallani nuorempana ja hölmömpänä, että hyvin hoidetusta hommasta on saanut \"palkaksi\" lisää vastuuta ja vaikeampia hommia ilman asiaan kuuluvaa palkankorotusta ja mahdollista työnimikkeen muutosta.'",
        "In response to 'Quiet quittingista tulee mieleen kaikkea muuta kuin mitä sillä yritetään tarkoittaa. Minulle tulee kyseisestä sanasta mieleen vain että olet omissa oloissasi pohtinut irtisanoutumista ja mahdollisesti päättänyt toteuttaa sen. Kyse onkin ilmeisesti siitä että päätät tehdä vain sen mistä on sovittu (??).\nOn todellakin enemmän kuin hyväksyttävää tehdä vain se mitä työsopimuksessa on sovittu. Jos työntekijöitä ei ole ja työn määrä on vakio (esim. toimistotöissä jossa ei ole kyse ihmisen elämästä), silloin tehdään vähemmän vähemmällä eikä enemmän vähemmällä.\nTuntuu että työelämässä ihannoidaan jatkuvasti stressissä ja kiireessä tekemistä. Todennäköisesti et saa palkankorotusta vaan lisää töitä samalla palkalla \"palkinnoksi\" ahkeruudesta. Tietenkin on tapauksia missä perustellen hyvin saat palkankorotuksen hyvin tehdystä työstä.\nToisin sanoen ärsyttäviä ja väkisin keksittyjä termejä joita ilmankin pärjää hyvin työelämässä.', a user said: 'Tuntuu että työelämässä ihannoidaan jatkuvasti stressissä ja kiireessä tekemistä. Todennäköisesti et saa palkankorotusta vaan lisää töitä samalla palkalla \"palkinnoksi\" ahkeruudesta.\nLuulin itsekin vielä jokin aikaa sitten, että tämä olisi jo jäänyt historiaan, mutta ilmeisesti 80-luvun juppikulttuuri on täysissä voimissaan ja itseasiassa renessanssin aallonharjalla vahvempana kuin koskaan.'",
        "In response to 'Paitsi kun tekee työnsä hyvin, niin palkankorotuksen saaminen on huomattavasti paljon mahdollisempaa. Ainakin itse sain moisen.', a user said: 'On toki, mutta rajansa kaikella. Kyllä se aika nopeasti selviää, että onko korotukset realistisia ja ovatko ne olleet venymisen arvoisia. (Tuossa postauksessa mainitsinkin joustamisesta.)'",
        "In response to 'Kuulostaa vain kiertoilmaisuilta pelkuruudelle. Kun ei ole munaa kohdata ihmisiä/asioita selkä suorana, niin sitten tehdään tuollainen quiet whatever manööveri.', a user said: 'Sepä se. On olemassa todella paljon hyviä valmiita toimintamalleja mitä voi soveltaa tilanteen korjaamiseksi, jos työntekijä\noikeasti\nalisuoriutuu.'",
        "In response to 'Sulla on molemmissa määrityksissä hiljaiset loparit kun toisen pitäisi olla hiljaiset potkut?', a user said: 'Olen niin vahvasti quiet quitannut postaamisesta, että on laatu jo kärsinyt.'",
        "In response to 'Quiet blockasin ja quiet reportasin sut.', a user said: 'Quietisti mä apriissieittaan tätä.'",
        "In response to 'Termi on määritelty niin, että se tarkoittaa työn tekemistä niin, että suoritus on tarkalleen juuri se mitä on vaadittu. Tämä taas on markkinoitu meille jonkinlaisena alisuoriutumisena vaikka se tarkoittaa vain normaalia työntekoa.\nNormaaliin työntekoon kuuluu kyllä joustaminen puolin ja toisin. Itse ainakin tykkään tehdä töitä yhteisössä jossa tuollainen onnistuu.\nHiljaiset loparit tarkoittavat työntekijän savustamista firmasta ulos estämällä tältä ammattitaidon kehittäminen, eteneminen uralla ja muilla tavoilla kiusaamalla.\nAika harva firma haluaa hyvän työntekijän lähtevän joten eikö tuossa ole myös työntekijässä syytä? Jos olisi helpompi irtisanoa niin huonoista tekijöistä pääsisi eroon. Jokainen on varmaan urallaan törmännyt tapaukseen jossa yksi mätä omena pilaa koko porukan tunnelman. Itse ainakin haluaisin moisesta kaverista eroon.', a user said: 'Aika harva firma haluaa hyvän työntekijän lähtevän joten eikö tuossa ole myös työntekijässä syytä?\nRiippuu täysin tilanteesta. Jos työntekijä ei suoriudu tehtävistään niin työnantaja on täysin oikeutettu ryhtymään toimiin ja tästä olikin postauksessa mainittu. Itse sain käsityksen, että savustaminen on juurikin seurausta esimerkiksi näistä hiljaisista lopareista tai ihan vain siitä, että naama ei miellytä, jolloin ollaan täysin epäasiallisisilla vesillä.\nJoustamisestakin oli mainittu postauksessa.'"
    ]
}