{
    "username": "reddit_time_waster",
    "contributions": [
        "what's up with quiet quitting? I've heard this term \"quiet quitting\" over the last year, indicating that people doing their jobs are somehow not doing enough. If the minimum requirement isn't enough, shouldn't the minimum be reset?  I feel like I'm misunderstanding the meaning of this term.\nhttps://www.investopedia.com/what-is-quiet-quitting-6743910",
        "In response to 'Answer: You aren't misunderstanding it, you're just missing context.\nA fundamental goal of business is making the best product for the lowest cost. How to make a better product isn't always obvious, but cutting costs generally is. One of the most ubiquitous ways of doing that is to get employees to do more work for the same pay.\nQuiet Quitting is a term invented to describe the current trend of employees, especially customer service and office employees, who oppose or reject that pressure to go more work for free.\nThe reason this has gotten attention in the last couple years is that the job market has shifted away from favoring employers to one that favors employees. Because of this, employees don't feel as much pressure to provide the free labor that and businesses have built their profits on. Many businesses aren't adapting to this well and have spent considerable effort to vilify it.', a user said: 'Thanks for a real answer! To summarize, you're saying that it's a bs term?'",
        "In response to 'It's a buzzword. Quiet Quitting has existed for decades, the word for that has been \"coasting\" - just doing the bare minimum and putting in your 8 hours. What has changed is that as the previous poster said, the market has shifted to favor employees, you now have significantly more people coasting at their jobs, so HR decided to start calling it quiet quitting to make it sound like it's bad.\nDon't let companies take advantage of you and only do the work you're paid for.', a user said: 'Coasting does sound more appropriate. They're still working.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'But like other articles, there's no mention of minimum requirements being set incorrectly. Ex, I expect my team to help each other out, and I put it on their job descriptions. If I didn't, that's on me.\nAlso, they're stills doing their jobs.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'Maybe. The term \"quit\" just indicates that the work isn't being done, when clearly in the definition it is.'"
    ]
}