{
    "username": "RedRapunzal",
    "contributions": [
        "In response to 'This \"quiet quitting\" thing has such a weird name. It's literally \"Doing your job.\"\nYou don't pay the price of a 97' hyundai and expect the performance of a F1. If you want you car to run at that speed, well... it will certainly cost you.\nI really hate how this corporate hustle culture eventually became a scam to have workers give their 100% while giving them a 20% salary. What was the point of that in the first place? Why did we allow ourselves to be used like that? I remember people shitting on the french for being on strike all the time, supposedly being \"lazy\" and demanding their rights. Guess what? They are correct and we were the suckers.\nPaying X and getting X\n10\ndoes not apply anywhere else in the market, (certainly not profesional services) why are employees any different?', a user said: '100 percent? They expect our 125 percent with the 20 percent pay and benefits.'",
        "In response to 'That's a fallacy spread to keep us fighting with each other. I'm a Gen x dropout whose parents abandoned me at 16, worked the service industry for 25 years then worked in a mailroom, then reception, then a support Admin. I'm 53 and have no retirement, live paycheck to paycheck and never had kids bc I can't afford it. I'm a lifelong renter who has never owned a house, and the majority of my peers are in the same boat. Don't believe the hype.', a user said: 'Louder for those in the back.\nAt this point, those that have wealth and power will do and say anything to keep their class above us all.\nMany of us go above and beyond for our jobs. In the end, wages have been stagnant for decades, the ratio of CEO to workers is way beyond out of wack, housing, education and healthcare costs that skyrocketed.\nYet, this is an old story. Every few generations, the workers are forced to rise up against the abuse. It looks like that is about to happen again. Here comes yet a class war that could have been prevented.'",
        "In response to '\"Quiet quitting\" makes it sound like the worker is acting maliciously by not constantly going above and beyond.\nAnother case of malicious miscategorisation.', a user said: 'Ah, you have discovered the PR spin.'"
    ]
}