{
    "username": "RedSteadEd",
    "contributions": [
        "In response to 'How did education debt become the one type you can't escape with bankruptcy etc?', a user said: 'It makes sense\nif student loans are interest free and not predatory in nature.\nWith the current shitshow of a system, it would make good financial sense for a high school graduate to get a degree, a masters, a doctorate, whatever, and then just declare bankruptcy. No assets to fork over to offset it, just $250,000 of debt that doesn't get paid.\nOf course, there's this crazy, commie idea of just...\nproviding post-secondary for free or at a nominal cost.'",
        "In response to 'would it be possible for an American to get s degree and then move to another country and simply never pay? would they get stopped at the airport?  what could the bank do?', a user said: 'Good question! I don't know enough about it to really answer confidently, but I found\nthis article\nand read a couple others. Sounds like if you plan on leaving permanently and you don't leave any assets behind, creditors have a very hard time doing anything other than getting a court judgment in their favour. Depending on where you move, how much you owe, and who your creditors are, they may be able to get a court order in your new country to recognize and enforce the debt if they're motivated enough.\nEdit:\nhere's one specific to student debt\n. The consensus (bearing in mind that a lot of these articles seem more like fear-based marketing than journalism) seems to be, \"it's risky and difficult, but doable.\"'",
        "In response to 'Especially not when he could do 10k just before the midterms, then cancel more debt before the next presidential election.\nWhich is still good and will help people, even if it's a bit scummy.', a user said: 'even if it's a bit scummy.\nDoes it still count as being scummy if it's used as a tool to defend against the existential threat that fascism poses to American democracy?'",
        "In response to '[Deleted or Empty Comment]', a user said: 'I don't quite think so - saying \"it would be a scummy thing to do because it would be a political move\" is a criticism of Biden's (still-hypothetical) decision, and I don't know that it's a fair one. Different story if the message ends up being, \"\nif\nyou vote us back in, we promise we'll cancel it.\" The upcoming midterms are the most important ones\nat least\nin recent history, the polls are tight, many of the red states are gerrymandered to hell and have passed voter suppression laws, and we know the results of this election are going to be widely, aggressively contested.\nHow much is 10k in student loan forgiveness going to fix if it comes at the cost of the Republicans wining the House/Senate? They'll stymie all efforts towards meaningful legislation for two years (again), convince enough Americans that it was Biden's fault that he couldn't pass anything, and easily win the 2024 presidency. If the Republicans take power of the House, Senate, White House, AND Supreme Court? They've made it clear from their conduct and rhetoric thus far that they'll functionally dismantle democracy to the point that it will be impossible for the Democrats to ever regain power. We watched the Supreme Court strip Americans' rights away at an alarming rate before they went on their break, so don't bank on them stepping in to stop anything either.'"
    ]
}