{
    "username": "Reedrbwear",
    "contributions": [
        "In response to 'Original Post: My last paycheck didn’t deposit. Hey yall!! I posted last week about how my boss blew a hissy fit when I called in once because I was grieving the loss of my dad.\nNow my last paycheck didn’t deposit this morning!! I texted my coworkers and I know at least one of them got paid. But this is a common occurrence, she always seems to fuck up payroll somehow. (This is the 7th time payroll has been fucked in the year I worked there). I’m pissed because now I have to reach out to her and I “quietly quit” so I was hoping I wouldn’t have to do that.\nSpeaking of which, I approached her about the text hoping to have a productive conversation. I took accountability for calling in after having so much time off for his hospital stay, death and funeral. She started going on about how she’s been looking for her “fourth token” meaning she has had 3 employees that work for her who are all subpar human beings, and she’s looking for a 4th person to help her run the shop/support her/be a normal human being… well I don’t feel like I’m her fourth token and I don’t want to be. So I left this letter and my key, packed my shit and didn’t go back.', a user said: 'Similar issue with me. I quiet quit (then very loudly walked out suddenly 3 weeks ago) on my job that had a whole host of issues, and this was #3 in the list.\nMy paycheck had been only half paid 2x in several months. It was our job to put in our hours into Tesseon, our boss's to verify, and the payroll accountant to review and process. But this payroll lady, a 20 yr veteran of the job and a huge ass-kisser of upper management, hated me thanks to a 3rd week in the job altercation where I refused to help her break into a coworkers desk while they were out of town.\nI was the only person this kept happening to. Even the CEO heard and offered to help while payroll \"got it sorted\" the second time. Payroll saw the discrepancies and intentionally ignored it and were never reprimanded for it. I have a family to provide for, and missing checks were insanely hard.\nWalking out on that place felt AMAZING. And I'm still getting texts from former coworkers praising me for \"doing what they wanted to but couldn't.\"'"
    ]
}