{
    "username": "ReflectionLess5230",
    "contributions": [
        "In response to 'I have a genetic mutation that causes my body to create many polyps and if unchecked they turn into cancer. Thought I was having issues because of diet and after forcing my doctor to schedule me a colonoscopy I found I was stage 4 cancer patient and in 24 hours my life got turned upside down.', a user said: 'Oh you poor thing you have FAP? I just got checked for it because of some really bad digestive issues. It’s 5am rn and I was just awoken out of a sound sleep to go barf. Life is so exciting. Wish I could hug you random stranger'",
        "In response to 'Not too worried about all that as I know she would make sure it goes to taking care of my kids.', a user said: 'No no no please separate them in your will. Give them a trust and set someone you are not in a “romantic” relationship with (your parents, sibling, etc). I have literally been in this situation and I had NO idea why my father separated my mother and I in his will in until well… She became super controlling with my trust. I wasn’t allowed to access the money until I was 21, but she was allowed to make withdrawals on my behalf for my care, such as my first car, college, rent for college, etc. All of a sudden, it was her car and I needed permission to use it. I wasn’t allowed to go to college where I wanted. She sent me to a huge city university and I was on the brink of getting kicked out cause my grades were so bad and I wanted to transfer to a much smaller uni. She went batshit insane and it took my aunt, an uncle, my cousin attorney, and my trust attorney to get me transferred to a uni that was great for me and 20 minutes from my house. Then she refused to pay for housing and forced me to live with her for my first semester and would erupt on me for getting home after 10pm, when my last lab let out at 10… I think back on this and I KNOW how much my parents loved each other, but fast forward ten years and she turned into a crazy controlling nutter.'"
    ]
}