{
    "username": "relaci",
    "contributions": [
        "In response to 'And all of that ignores that some jobs don't have upward mobility (small businesses) or people get promoted for reasons other hard work (kissing ass, nepotism, favoritism).\nI have to underscore this last part, having worked my way up the corporate ladder and gotten my own team individuals multiple promotions each.  When a given manager has three people who have worked hard enough to earn that promotion, and the manager can only get approved for one, who do they go with?  Studies show (and my experience echoes) that it's who the boss has the best relationship with.\nThat's salient right now because a lot of workers are pushing back on the \"return to office\" mandates etc.  In the great equalizer of COVID and remote work, everyone was on that even playing field, but the data show that remote workers get passed up more often, and end up making less money.  In other words, simply schmoozing and putting in face time with the boss is one of the greatest factors in being promoted.  At my company, a lot of people are starting to spend a day here and there in the office, but after the great dispersal of COVID, very few people are in the same region let alone city as their boss (who are spread around the US, and world).  It means when they bring in the new department leader, who lives in Chicago, everyone in Chicago knows they have an inherent leg up on upward mobility.  It's basically their game to lose.', a user said: 'Unless you're stuck in a situation where your boss is prejudiced against you for some reason, in which case seeing them in person more is only going to allow more people to overhear the slanderous degrading nonsense the boss says, further degrading your professional reputation and therefore inhibiting your opportunity for advancement.'",
        "In response to 'People who go above and beyond are the people who get promoted to the next position.\nThat's the myth, and to be fair it's a compelling one.\nThe reality more often is that you get to a position and then stop advancing, either from too-stiff competition at the positions you're applying for or because you're perceived as\ntoo\nvaluable in that position. At that point, it becomes more beneficial to go to a different company for better pay, or a perceived chance at upward mobility.\nAnd all of that ignores that some jobs don't\nhave\nupward mobility (small businesses) or people get promoted for reasons other hard work (kissing ass, nepotism, favoritism).\n\"The hardest workers get promotions\" sure looks good on a coffee mug, though.', a user said: 'Or because you're female or not the Manager's preferred race.  Or a bunch of other reasons.'"
    ]
}