{
    "username": "Repulsive_Society_21",
    "contributions": [
        "In response to 'I think that a lot of first-world / developed country residents, in particular Americans but not only Americans, have in recent decades been sucked into a weird maximization/optimization trap. Like, everything you do in life needs to be optimized in some sense, without attention to exactly what is being optimized overall. Specifically, over-tuning for efficiency means reducing resiliency to the point of non-existence.\nIn practical terms, this means we end up in situations where we optimize for things like seeing as many sights / having as many unique experiences as possible while traveling, at the expense of stuff like just vacationing or hanging out in a different place. I have always been by nature opposed to this kind of life so I guess I can see it from the outside.\n(OP, note that in no way am I criticizing you: I’m just reflecting on the larger context that seems to be producing so many experiences like yours!)\nIf we leave where we live and also leave behind our optimization mentality, we may find ourselves not only having more interesting experiences while traveling, but coming home refreshed and potentially with new habits we can continue in our home life.\nA lot of other people have made great suggestions, like stay in one place for a while, do day trips rather than changing your lodging too often, etc etc.\nI want to add one thought: when you’re staying somewhere for several days or longer, prioritize becoming a “regular” rather than trying every restaurant. Once you find a place you like, just eat there for the rest of your trip.\nI honestly think, too, that people who go back to the same place year after year have experiences that are worthwhile in ways that those of us who only chase novelty don’t experience.\nSo maybe pick one place you absolutely love, and put that on your list of travel destinations every year. In particular, stay in the same hotel every year, better still, book your next stay when you’re on your way out. I’ve never been in a position to do this, but I do cherish the experiences I’ve had of revisiting the same places repeatedly over the years.', a user said: 'As an American I relate to your first point a lot. I notice this in myself (especially since covid). Thanks for verbalizing it :)'"
    ]
}