{
    "username": "Richard_Ovaltine",
    "contributions": [
        "Quiet Quitting DD style I was just going to ignore her but then she said I could've just called. Maybe Karen could've been by her phone at any point throughout the whole interaction. But no, she's a dummy and now we're here.\nThe second I cancel after the timer is up she messages back. I order as a customer sometimes and know just how many notifications you get sent by dd. It's basically all of them lol.\nAnywho she didn't message back and I got a super good dinner tonight I didn't have to pay for. Thanks boo!\nThe alcohol goes to my favorite smoke shop since I have no friends or people I see daily other than my shop😂",
        "In response to 'Can't stand when people magically lose their phone or tell me it died after placing an order.  I do screenshot my call log and send it to door dash when disputes happen regarding my attempts to reach a customer.', a user said: 'Fr this, it's like they chuck their phones off the roof after placing the order😂\nI can't send photos in the dispute so I've stopped calling and only text because doordash logs the texts through the app'",
        "In response to '[Deleted or Empty Comment]', a user said: 'I love you lol I need more customers like this'",
        "In response to 'Exactly especially alcohol bc you already know ID is required.. phone should always be in hand if u order anything to be delivered like this. Wrap it in a plastic baggie if u in the shower.. and please don't get an attitude if u mias the delivery bc u werent available..  ppl have no idea how frustrating it is trying to deliver something someone ordered with limited contact and pertinent info like gate codes.  Like.. don't you want your stuff? Or did u forget u ordered? Never fear as OP said you do get lots of alerts.. I have never ordered from any delivery platform and not recieved at minimum 5 alerts lol', a user said: 'I found my people lol, yall are really living my life too😂 also psa to everyone don't get in the fucking shower if you have a delivery on the way that's dumb.'",
        "In response to 'I NEVER not look at my phone when I know someone is coming to my house per my request', a user said: 'Because you're an intelligent customer who wouldn't ever get a message like this from me. Thank you for being awesome'",
        "In response to 'Just curious, why didn’t you call though? It’s always easier for me to call because people aren’t always by their phones. 95% of the time people answer calls if they are slow with texting. I can understand the frustration of the customer in this situation. She contacted you right after the timer ran out so you..say tough shit and screenshot this to post on Reddit? Ok lol', a user said: 'I really don't like to talk on the phone unless I have to, plus call logs aren't tracked by dd so I had a customer lie and say I didn't reach out before when I did repeatedly so now i stick to only texting.\nI had just ended the delivery and then she messaged me back and that's exactly what I did lol in a less direct way'",
        "In response to 'Is quiet quitting just doing your job or something?', a user said: 'Doing your jobs bare minimum and nothing more or less.'",
        "In response to 'Crystal Geyser is out of stock so often everywhere I shop in AZ and I know that's not what this post was about but it made me laugh seeing that', a user said: 'In Texas can confirm Crystal Gyeser sells out asap 😂'",
        "In response to 'Damn. And Ethiopia has been in dire need of water for centuries. You're just part of the problem huh?', a user said: 'I'm cackling 🤣😂🤣'",
        "In response to 'This was actually pretty well handled...\n<image>', a user said: 'Just gotta be straightforward and tell them how they are wrong if they get a lil snippy. Like hun I know you get a dozen notifications through the process you can't play me you just don't care about other people's time obviously.'",
        "In response to 'I dig the vocabulistic skills, you're one of the very few people I've seen that text exactly how you would speak, and I just want you to know....I appreciate that.', a user said: 'Hey if I wouldn't say it to your face I wouldn't type it lol! I like to think I'm a no nonsense-tell it how it is person, might be why I have no friends 😂 I also use text to speech mostly when I'm telling customers off because my brain thinks of comebacks faster than I can type and I'll forget if I dont😂'",
        "In response to '<image>', a user said: '\"You could put a banana in your holster\" has never been more real'",
        "In response to 'Sometimes texts or notifications don’t go through or make sound. But usually calling rings or at least vibrates multiple times', a user said: 'Turn your ringer on if you ordered delivery. You want the food you supply the necessary info to get the food to you. If not you don't get squat, or you go get it from the gate yourself\nthis was alcohol so I couldn't just leave it'",
        "In response to 'Yeah customer was dumb for not paying attention. But have some self respect and at least do the bare minimum for whatever job you do. In this case a phone call would have taken almost no effort', a user said: 'This is the bare minimum lol, what do you think Quiet Quitting is?'",
        "In response to '[Deleted or Empty Comment]', a user said: 'Ah sheet, missed that one😂'",
        "In response to 'This is a thing of beauty. I hope they enjoy that bottle of nothing. Good for you!', a user said: 'It was Lamarca prosecco, it's like the most popular brand of alcohol I shop for I'd say I pick it up 10 times a week or more'",
        "In response to 'Did you call her?', a user said: 'Nah I don't call customers unless it's the only option, I prefer paper trails to prove my times'"
    ]
}