{
    "username": "Robincapitalists",
    "contributions": [
        "In response to 'Here is the link to the underlying report, digging into it it seems to largely be a story of a long divergence in the average life expectancy beginning in the 1980s.  Then in 2020 life expectancy falling through the floor for men with a lower decline for women.\nThe ten countries we are compared to all have better public options or single provider healthcare systems.  The US isn’t rebounding because these are future projections and without massive reform to our healthcare system people will continue to die at younger ages compared to people living in countries with better healthcare coverage continuing the trend that began before Covid.\nhttps://www.healthsystemtracker.org/indicator/health-well-being/life-expectancy/', a user said: 'It's not limited to having better healthcare systems.\nThe indulgence of violent antivax right wing wet dreams can't be overstated. No matter how much better the healthcare is, they don't believe in vaccines anymore because of politics.\nAlso. Guns. Guns are now one of the top killers of children, which has big impacts on average life expectancy.\nAlso. Big Pharma Pain Pill Overdoses.\nAlso. Air, water, soil pollution.\nThe answer most would turn to would be strong regulation to protect people's health against deadly things. But as we can see, we can't even touch a gas stove in *new construction* without someone saying \"CoME aNd TaKe IT!\"\n(The real actual answer is to start making capitalists afraid and take them down. Since it's clear they give not two fucks about peoples health if they get even 1 more penny of capital return.)\nI swear to God. If Trump happened in the 60s, there would be no EPA, no seatbelts, led would be everywhere, the Ozone layer would be obliterated.'",
        "In response to 'Original Post: The news media ignoring declining American life expectancy in favor of nonsense like \"quiet quitting\" is one of their most heinous lies of omission to date [External Link]: https://i.redd.it/5vgz6ij9blea1.jpg', a user said: 'That life expectancy decline is almost entirely US failure to respond to COVID, indulging antivax looney tunes right wingers, and right wingers trying to own the libs by doing various things that shorten their life expectancy.\nThe difference to comparable countries overall is unregulated capitalist driven health care, capitalist driven opioid overdose epidemic, guns.'"
    ]
}