{
    "username": "robot_ankles",
    "contributions": [
        "In response to 'Original Post: When you quiet quit/ride it out till you get fired, it negatively affects others in this community I had a teammate who had been dropping the ball for a while and was finally let go this week. His output was so bad that my manager noticed and did some digging. Turns out he barely worked at all and was clearly just coasting till he got fired.\nWell, my manager and skip are PISSED and literally called out how they think our old teammate was working multiple jobs. In my xp, they definitely were as they had many signs.\nRegardless, it’s now coming back to bite my team and me with new policies. Yes I’m pushing back on all the BS coming our way and trying to minimize it, but I wouldn’t be surprised if activity monitoring software came up soon to flag suspicious activity as well. This gig has been great for OE for years and now it’s in jeopardy because someone couldn’t just quit when they were done… I have friends (OE and not) at multiple other companies who are dealing with fallout like this as well.\nMy point being, when you pull the anti work card and coast like this just waiting to be fired (which I see recommended here daily), it’s not an isolated event. You get your bag a bit bigger and your teammates (and fellow OEers) deal with the fallout.\nIt helps to push for more RTOs that may have not as it eliminates the possibility of many of these issues. This also affects remote offerings (wayyyy down from what I’m seeing myself in new job hunts)\nHow would you feel if others put your extra paycheck(s) in jeopardy?\nGet your bag, but don’t screw others over while you do it.', a user said: 'You might be right, but this is the most \"Imma-get-mine\" crowd I know.\nAnd more power to 'em. Companies been gettin' theirs for years.'",
        "In response to 'Thousands upon thousands are getting laid off in the USA right now… now it’s coming down to whether your bag getting bigger or having humanity is more important to you - in the US specifically.\nI think what a lot of OE’rs miss about the form here is doing the work you’re paid for at the minimum to not be an ass and just take a job out of the job pool ONLY for a fraudulent paycheck. I haven’t ratted on two in my own org who I have confirmed are OE because they’re stupidly behaving like it - screwing ME is fine I guess but  fucking over everyone else daily with their crap behavior and not doing any work at all while someone who’d love to have any job at all right now, and healthcare, sits at home crying while filling out applications that are automatically binned by a shit ATS “review” system and taking 18 months to get a role again.', a user said: '...not be an ass and just take a job out of the job pool ONLY for a fraudulent paycheck.\nThis is such a weird take.\nCompanies are not allocated a set number of jobs by some higher power. They're free to hire as many or few people as they want. The \"job pool\" is not some finite resource.\nAnd what's fraudulent about getting paid to complete work? As long as the work is completed as requested and the person is paid, then both sides of the agreement have been met.\nLet's take OE off the table for a moment...\nA company needs to hire more people. They believe they need 2 new hires that can each complete 10 tickets per day. They hire someone who starts handling 10 tickets per day. The company continues interviewing for the remaining open position. After a few weeks, the recent hire is completing 20 tickets per day. Management realizes; \"Hey, we actually don't need that second position, let's close that req for now.\"\nDid that new hire just screw over \"...someone who’d love to have any job at all right now, and healthcare, sits at home crying while filling out applications...\" ? I don't believe they screwed over anyone.\nThe previous comment reminds me of poor performers who complain about high performers making them look bad. Forget the OE stuff, this is just a crabs-in-a-bucket mentality.'",
        "In response to 'But don't \"get yours\" at the expense of others. Coworkers are in the same boat and aren't the enemy, corporations are. Get our bag at their expense. Because, eff them.', a user said: 'Employees can under perform for all kinds of reasons. Lazy, bored, distracted (OE, Reddit, WoW), under skilled, unclear goals, too many project managers, crappy tools, and more. These are issues to be managed by the company.\nCoworkers with such issues are not screwing over their coworkers. Their working arrangement is between them and the company and has nothing to do with you.\nWhen a company chooses to react to a specific situation (an under performing employee) by enacting draconian policies for all of the employees\nthat remain with\nthe company, it's the\ncompany\nthat's doing that to their employees -\nnot\nthe ex-employee who\nisn't even there anymore\n.\n\"But their actions started the whole sequence of events\"\nNope. Their actions exposed unskilled management and management is panic-reacting to cover up the fact that management did a poor job managing the lack of results.'",
        "In response to 'Mostly agree, but they’re not just screwing the man when they do this, they’re screwing actual people… some people have no morals and are totally fine with that until it happens to them but still.', a user said: 'Misplaced frustration. Everything negative in OP's post is the behavior of the company. It's the\ncompany\nthat...\nDidn't pay enough to attract someone's full attention\nDidn't provide enough interesting challenges to keep someone fully engaged\nFailed to measure results effectively\nFailed to hold an employee accountable\nAllowed an under performing employee to remain in the org\nComplained to employees about a former employee\nMight start using activity monitoring software as a crutch for poor management capabilities'",
        "In response to 'This company is definitely not perfect, but they do pay well, have a good stack, and have enjoyable challenges. They def could have done better to get him out earlier but he also could have just done the minimal amount? Now my extra paycheck is at risk because of their selfishness.\nHow would you feel if someone else put your OE in jeopardy?', a user said: 'This perspective sounds like something from an abusive household\nArresting officer: \"Sir, why did you beat your children so bad we had to call an ambulance?\"\nDirt bag: \"I was angry! The old lady really pissed me off when she didn't make me dinner. It's all her fault.\"'"
    ]
}