{
    "username": "rollingForInitiative",
    "contributions": [
        "In response to 'I quite agree with the general feeling of your post, but I think that it cannot apply to all companies.\nI see at least two kind of companies where \"just doing your job\" cannot be expected:\nThe first one would be the companies that are temporarily running under profits margin. Think for example of a kindergarten that got its subventions cut/late for whatever reason and will go bankrupt, leaving tens of children without daily care if employees don't go an extra step to make sure the structure survives those difficult times.\nSecond one would be start-ups. When you sign for working in a startup, the un-written rule is \"\nwork as hard as you can, till your stocks makes you a billionaire\n\". That's not something that can be contractually written, as it's a fuzzy requirement, but everyone that sign there know about it. If some colleagues start \"quiet quitting\", that could mean that the extremely hard work from all others members of the startup can go to the drain just because some decided to stop following the implicit rules. Basically, don't do startups if you want a personal life, but if you choose not to have one, you can't change your mind in the middle of the growth period.', a user said: 'For startups it is an explicitly written rule though, isn’t it? I’ve worked for a startup, and X amount of shares was a part of my compensation package, all very formally written down in a contract. At that point you’re not just an employee, you’ll have shares and such benefit from the profits.\nAs for 1), I don’t actually think it’s reasonable for us to expect that people in those jobs should work extra hard. We should expect that schools, daycare and hospitals have the money needed to hire everyone required for a reasonable workload. Expecting that the employees should work harder our do sympathy for children or patients is exploitative and emotionally abusive.\nNow if there’s some unexpected emergency that requires people to put in more effort? Like, a couple of people are suddenly unable to work? Sure. But they should be compensated for that extra time.'"
    ]
}