{
    "username": "RoomMain5110",
    "contributions": [
        "In response to 'Please stop. For your health. Go watch some youtube on the shitter. For your health', a user said: 'But be warned;\nsitting on the toilet for too long can adversely affect your health'",
        "In response to 'work to rule\nQuiet quitters are under-performers, typically underperforming enough to be a problem, but not outwardly enough to bother with formal HR processes. Most quiet quitters are going to end up having suitability conversations to nudge them towards another role, or otherwise end up on performance management pathways. It's typically a motivational issue.\nWorking to rule, typically used in relation to industrial action, is a form of protest where you refuse to do activities that are typical of your work, but not explicitly required in your job description or prpcess responsibilities. The impact on productivity is much more pronounced. You could extend this sentiment (of protest and refusal to do tasks that are not formally documented in the role description) to an everyday situation, but it's likely to quickly result in performance management without the framework protections resulting as part of planned industrial action.\nFinally, there's doing your job, which is not work to rule, nor quiet quitting. This involves doing your job in the allocated time, within a satisfactory band of productivity/performance. This sounds like what you are describing.', a user said: 'I don’t think so.  Underperformers don’t (initially) know they’re underperforming and not meeting a benchmark. Quiet quitters are consciously playing a game where they try to just hit that benchmark and do no more.'",
        "In response to 'That's underperforming. You are performing below expectations, just not to such a level that it's worth pulling you up on it. You are expected to\ndo your job\n, that is do what is reasonably required in the allotted time.\nWorking more or extra is performing\nwell\nand doing your job (at least the\nbare minimum\n) is performing satisfactorily. If you don't think quiet quitters are not on management radar, you're deluding yourself. As I said, most quiet quitters will get quietly pushed into another role that better suits them/the employer (I.e. something the employee actually wants to engage with). It doesn't typically require HR nor onerous process to meet unfair dismissal obligations.', a user said: 'I didn't suggest \"\nquiet quitters are not on management radar\",\nso I don't think I'm deluded.  I'm just saying that underperformers are a different breed to Quiet Quitters.  If you don't agree that's fine.  But if you're in an organisation where under-performers aren't actively managed to try and improve their performance that's a rarity, in my experience.'",
        "In response to 'We don't have the same unpaid overtime culture as in the US, so people are less likely to expect the same amount of extra effort.\nOutside of the big four hellscapes anyway.', a user said: 'And the Telcos.  And the big 4 banks.  Sure there’s others I’ve not worked in too.'",
        "In response to 'Shitting in company time? For years', a user said: 'I’d see a doctor if I were you.  If you can find time to leave the shitter you’ve been on all these years.'"
    ]
}