{
    "username": "roostertree",
    "contributions": [
        "In response to 'Because decades of sports really fucked up my work ethic. Constantly hearing \"give it 110%\" really pushed it deep to constantly work harder and harder. It wasn't until much later in life that i learned balance and that constantly pushing is just not physically or mentally possible', a user said: 'And the phrase itself is culture war bullshit. My first time reading \"quiet quitting\" was in a publication that sells advertising to employers.\nThis is all about the moneyed class demonizing the working class for not handing over their lives for free when the rich demand it.'",
        "In response to 'We can hand out lead for free if they want.\nI mean, if we are going back to gilded age mentality, then lets do it, but the working class had far more, shall we say, *spicy* ways of thinking back then as well.\nThe rich seem to have forgotten worker rights and unions were the COMPROMISE, not the problem.', a user said: 'Yes. In turn, the workers might wish to keep a healthy\nrespect\nfear of the surveillance state, if \"spiciness\" is a path forward.'",
        "In response to 'Yeah cause \"nobody wants to work anymore\".  More like people want to pay their damn rent assholes.', a user said: 'I've seen social media posts by employers claiming that a living wage is \"not how they think\". That an employee's ability to pay rent has nothing to do with the job.\nIMO that's a punchable face.'",
        "In response to 'Yeah dude this guy I was working with used to be in charge of big projects and was trying to convince me that if he hires someone to do a job, it's not his responsibility to pay them a wage where they can live under a roof. Said it wasn't his problem and he pays people what he thinks they're worth.\nIf you are offering a full time job that is not deserving of a living wage, you should not be offering that job at all.', a user said: 'One of the best sentences in the English language:\nBeing an employer is not a right, it's a privilege.\nIf you can't pay a living wage, DO IT YOURSELF.'",
        "In response to 'I prefer the term \"meeting expectations\".', a user said: '\"Your money tells me what you expect.\"'",
        "In response to 'That's an odd way to phrase \"fulfilling your contractual responsibilities and nothing more\"\nedit for typo\n2nd edit to appease the asparagus gods', a user said: 'Staying employed and doing one's job is the new quitting, apparently.\nIt's Orwellian bullshit. Words used to mean something (or so the asparagus gods would have us believe).'",
        "In response to 'Original Post: Saw this posted on LinkedIn: “Quiet Quitting” [External Link]: https://i.redd.it/g2rczsex4xh91.jpg', a user said: 'Quitting is now doing one's job and being unreachable during off hours?  What kind of Orwellian bullshit is this?\n\"Hi! I'm employed by you! Did my job today, gonna show up and do my job tomorrow!\nI have totally quit!\nSee you tomorrow when I show up to do my job!\"'"
    ]
}