{
    "username": "Rough_Shelter4136",
    "contributions": [
        "In response to 'Hi so I'm not going elaborate much more, please re-read my post and you can see I'm making a difference between \"can\" and \"should\".\nYou absolutely can be dismissed on the spot with bogus reason. There's no magic work police that comes out of nowhere and forces the company to continue paying you. This is a CIVIL case, not CRIMINAL case.\nYou should not be dismissed with a bogus reason but it happens a lot. Good companies will not dismiss you pretty much ever. But they could...\nYour only recourse in that case after you've been served your dismissal letter is to sue, all other avenues rarely get you your work back.\nThis costs minimum 200-250k and hence, makes it unappealing to a lot of families. And that's what the companies bet on.\nSome companies handle this better, some worse. Especially some small/mid gaishikei. I've been dismissed this way, yes I've almost went to court but all wanted to settle before that. I've had long discussions with lawyers and the law is clear.\nHence the part, if you have the money and the will, the dismissal was illegal and you get a nice settlement. But the ball is in your court, not the company's, and they already stopped paying for you.\nbtw if you go to court, you will most likely not get your job back, but instead company pays you a settlement. Only like a fraction of a percentage was re-instated by their companies.', a user said: 'In Japan, probably, in Europe? Nope. The argument was more \"worker's rights protection is pretty decent in some parts of the world\"'",
        "In response to 'I’ve never experienced Japanese work culture first hand, but from what I’ve heard you work long hours, to the point that you’re not supposed to leave before your boss, even if work is complete?\nAll the pics of salarymen asleep in Tokyo shows that burnout is strong. Which leads to low productivity when you’re actually in the job', a user said: 'The problem when overwork and long working hours is\nexpected\nis that there's really no incentive to be efficient at work. It's a vicious cycle, when you have to get everything done in XX hours per week, you'll be pressured to be creative in finding efficient ways to do better your job. Sometimes Japanese workplaces are very inefficient as a conclusion :/ You see all those posts in other Reddits about a lot of bureaucracy? Fax use (lol), endless meetings where nothing gets decided? Yup'"
    ]
}