{
    "username": "royalpheonix",
    "contributions": [
        "In response to 'Corporations created the term \"quiet quitting\" to normalize unhealthy work habits. Don't play into it folks!', a user said: 'Got any proof of corporations inventing the term quiet quitting? I definitely saw it on tiktok early on where people were using the term to mean \"doing nothing at your job until someone notices and fires you\".'",
        "In response to 'They may not have invented it but it's definitely taken on a new meaning...', a user said: 'Why would it take on a new meaning that is less intuitive considering its name?'",
        "In response to 'Original Post: It's NOT \"quiet quitting!!!\" \"Working your contract,\" \"working to rule\" and \"acting your wage\" are all MUCH better terms. Why would you use the word \"quit\" to describe you adhering to your contract and doing your job? It has nothing but negative connotations AND denotation.\nI highly encourage everyone here to lose that term. We're working our contracts. We're not quitting anything. Some may STOP giving away their physical and/or emotional labor, but that's not the same as quitting!\nEdit: For those of you saying \"It's called 'doing our job'\" The implications of teachers \"just doing our job\" are:  volunteering for events, grading/planning at home, taking over other  peoples' responsibilities, adding more to your plate every year, etc...  Admin considers this \"just doing your job.\"', a user said: 'I said this in another thread: Everyone telling you quiet quitting just \"doing only what's in your contract\" is engaging in revisionist history of what the term actually meant in its inception. I remember when the term was first being thrown around on tik tok and it was DEFINITELY meaning doing nothing at work until someone notices and you get fired.\nIt's reasonable people trying to whitewash what is actually not a noble idea. Kinda like how everyone said \"noooo 'antiwork isn't about laziness and not working, it's about working conditions and workers rights\" when anyone who popped into that sub at its inception knew what it was originally about. It took an interview with the founding mod where he said stuff like \"laziness is a virtue\" for people to realize that the sub isn't as noble or healthy as people were claiming.'"
    ]
}