{
    "username": "rtb001",
    "contributions": [
        "In response to 'Bobby Bonilla in shambles', a user said: 'I will be sad when there are no more Bobby Bonilla days to celebrate.\nThankfully that won't be until 2035!'",
        "In response to 'Bobby Bonilla Day is my favorite day', a user said: 'Every pro athlete should try to negotiate such a deferred payment scheme. Instead of being paid 6 million in 2001 and possibly blowing it all quickly and becoming bankrupt,  instead Bonilla gets almost 30 million sites throughout his old age, 1 million at a time so he'll never be broke!'",
        "In response to 'The biggest brain play.', a user said: 'Seriously though,  if a financial advisor actually cared about a pro athlete they should try to take a good chunk of their earnings and put them into this type of scene which is essentially an annuity plan.\nI read that Iverson blew through a lot of money he had on hand after his playing days,  but someone close to him at least made sure that a sizable portion of his money was locked away in something similar to this,  so Iverson would never be fully broke since help get some income every year and then after some years his NBA pension will also kick in.\nHonestly the major sports leagues should set up a standardized financial scheme for this so every player can choose to enroll. It might really cut down on how many players go broke soon after their playing days.'",
        "In response to 'Fun Fact:. Bobby Bonilla Day is also Rick Dipietro Day for hockey fans.  The NY Islanders will pay him $1.5m every year until 2028.\nDipietro has not played since 2013.\nYes, the fact that both players are being paid by teams on Long Island is hilarious.', a user said: 'I think that's just a standard contract buyout situation,  and may possible be used too hero with a salary cap if a league uses salary cap.\nFit instance the Blazers bought out Didi Louzada in the summer not because they can't afford to give him his 1.8 million, but because by rule they can use the stretch and waive policy to give him like 280k a year for 7 years, which might help the team get out from paying a much bigger  luxury tax bill.\nThe funny thing about the Bonilla contract is that the Mets did this one time deal with Bonilla because of BERNIE MADOFF. Then owner of the the team was invested with Madoff and he thought he was making so much money that it would be more profitable to invest the 6 million they owed to Bonilla with Madoff, which would make so much money that it wouldn't matter if they had to pay Bobby 30 million from 2011 to 2035.\nOf course they lost all their bogus investments, and even Madoff has died,  but they still have to pay Bobby for another 13 years!'"
    ]
}