{
    "username": "Rude-Tree-8351",
    "contributions": [
        "In response to 'Original Post: I've stopped doing the \"fun\" extra office stuff after I didn't like the way my boss handled something, AITAH? I guess background is important and sorry it's long:\nMy job performance is exceptional. I meet every necessary mark 100% of the time and have done so for the last ten years. Maybe an odd month or two in there due to travel and things that would make it impossible. I've also stepped up and carried the load for coworkers when things have come up to ensure our area isn't dinged for performance issues. Clients get along well with me, I've never had a complaint filed against me, etc. You get the idea.\nI also am known to do all the holiday decorating, coordinating the gifts for office celebrations, baking the desserts, writing formal thank yous from our department, and making holiday baskets to help maintain positive relationships with the other agencies we work with.\nA couple months back, there was a policy change and none of us were happy about it. I made the best of a bad situation and adapted to the change immediately. My coworkers did as well, but they all called me to complain and vent. This is normal. We tend to complain amongst ourselves for one good bitch session and then just \"it is what it is\" and continue to work hard and not complain again.\nHere's where the issue is, while one of my coworkers was venting my boss was eavesdropping selectively on my side of the conversation as that's what he could hear. I was commiserating with them, but also pointing out how it wouldn't be that bad, it's in our contract, how we can make it fun/less obnoxious etc etc etc. We hung up and I didn't think about it further, especially since neither of us really said anything that you wouldn't expect an employee to say with the kind of change they're wanting. It was pretty damn tame....\nI didn't think about it again until my boss called me in a few days later to do an employee evaluation in response to it.\nIn every review I've had here I've always hit the \"exceeds expectations\" in nearly every category. He cut me down to \"meets expectations\" on everything. He reamed me for my \"attitude\" for not cutting my coworker off and letting them vent. Telling me I should have told them to call him. He accused me of being negative/a negative influence and that if he didn't \"nip it in the bud now it could fester and create a toxic work environment\".... I was and still am pretty pissed about it. Coworkers should be allowed to vent to each other without it being treated like this.\nAfter this, as you may have guessed, I'm just not in the mood to head up everything extra I'd been doing to make the office environment \"fun\". I keep my door closed when he's here, I didn't bring dessert for the March birthday lunch. That lunch isn't mandatory, but I didn't want more problems so I went and just sat quietly the entire time. Now there's another \"appreciation week/month\" for one of the departments we work with and there's been an email chain about cards/gifts and I've responded the amount I'll put towards it and asked who I should send it to.... People are noticing I'm not picking this stuff up and that chain has gone in a circle for days now and I'm not budging. I've had one person approach me about it and I just said I don't have the time to take it on right now.\nI guess I'm feeling like all the shit I did on the regular to foster a positive work environment got thrown out or was never appreciated because I lent an ear to a coworker and then got viciously reprimanded for it. Like what's the point if ten years of going out of my way gets thrown out just like that?\nAITAH for just quietly stepping out of all of these extras due to my feelings on how this was handled? Am I being overly petty?\nUPDATE\nI hope I'm updating correctly.\nSo a lot of people had asked for an update. I've waited a while after some movement/developments.\nThere was an event that usually requires someone to head up the card, gift, staff coordination things. I had told the team and my boss several weeks in advance this event was pending and I wouldn't be free. No one did anything until the day before and then one of them called me to ask that I do all the leg work.\nI declined citing that I just did not have the time. Which was/is true.\nMy higher ups cornered me on this a few days later stating that I've been pulling away, teamwork makes the dream work etc. And citing this event as evidence. They also cited me being on my phone during unofficial mandatory fun times as further evidence of drawing back.\nI told them that I had given everyone, boss included, weeks of notice that the event was coming up and I wouldn't be available to head it up. I pointed out that I'm still helping the team with tasks directly relevant to work, but with my current caseload I just can't afford to allocate time to the social/event planning right now. As for the mandatory fun, I reminded them that I often don't get lunch breaks due to community meetings that get held at those hours and my having to flex out early on those days. So having to lose out on a good break on a day I don't have to is burning me out.\nThey fumbled around for about thirty minutes trying to convince me, and I just held firm that with my current caseload, I don't have time to allocate to non-essentials. I was told I'm allowed to prioritize my breaks.\nI've been so busy I haven't had a chance to attend the community meetings recently, and honestly, this might be another thing I end up cutting back on in the long run.\nOverall it came across like they're panicked I'm considering leaving. There was a comment about that concern and I let them know I'm not planning on leaving, but I am taking time to restructure my priorities now that my caseload has increased.\nUPDATE 2\nAnnual performance evaluation is in and it's just as dismal as the retaliatory one. I've declined signing it without discussion and I've contacted my Union. This feels like punitive retaliation. If they can't justify the decreases despite my consistent quality performance I will be quiet quitting everything that's not a core job function as continuing to do so will feel like chasing an unattainable metric.', a user said: 'For 25 years I organized every bridal shower. Baby shower, farewell party, and decorated for them. I bought the card and had everyone sign it, you name it. When I Retired I didn’t even get a card.'"
    ]
}