{
    "username": "Saandrig",
    "contributions": [
        "In response to 'This happened at my now former employer. Supervisor asked me to pick up extra work. I said I'd be happy to for more money and a timeline for hiring replacement. Got no answer so I found another job and quit.', a user said: 'Had a similar experience, except I was taking the extra work for months. Asked for a raise, denied, quit.\nLong story short, my \"replacements\" botched things so fucking hard in the next 6 months, that the company brought me back as a freelancer, even after I asked for 12 times the amount of my previous salary. Spent over a year on these conditions until the mess got fixed.'",
        "In response to 'That's awesome! 12 times dude, so you did in a month what you previously did in a year lol. Could you share a range, around how much was that? Sounds incredible\nMakes you think how much better we can do if we stand up for ourselves and change jobs more often', a user said: 'I was making about 1500 euros after taxes per month, before I quit.\nThe 12 times bit happened because I was tired of them calling me back with offers and just said the first number I thought would shut them up for good. Felt kinda obligated to accept when they matched it. Frankly I believed I would be there for 2-3 weeks. That was before I saw the mess they did in 6 months.'",
        "In response to 'I learned this lesson the hard way at my first job where I was woefully underpaid (I was supervising people making 1.5 times more than I was), and doing multiple jobs. They had given me so many jobs that they didn’t realize it until I was gone. They had to hire 3 people to replace me. And eventually brought me back on contract to teach the new hires (yes, I asked for a ridiculous amount of money). They went through 6 replacements in 3 years. They’re paying the latest one double my salary. Turns out the money was there.', a user said: 'The money is absolutely there. It just requires extreme events before you are given any. It happened to me once, but only after I quit and my replacements screwed up unbelievably hard - so much that there would have been less damage if the company didn't hire anyone in my place.\nWhat I noticed from all of it was that apparently my work goals were wrong in my first tenure at the job. I like to go in, do the tasks, minimum socializing, not bothering the higher ups for anything unless it's critical. And I never had anything critical enough for the company owner to meet with me.\nMy coworkers on the other hand were mostly socializing. They didn't bother learning the intricacies of the job, but jumped at any chance to talk to the management all the way up to the owner, given the chance. And as I learned later on, that made them much more visible and important than me. They practically bragged about any minor task they did, including taking credit for my work without my knowledge.\nWhat changed is that, after I left, the situation in my department got so bad that the owner eventually was told I was the guy who knows everything and can fix it all. I got back as a freelancer on a huge pay and was reporting only to the owner. At this point he treated me almost as the second coming of Jesus. That's when I learned what my coworkers have been saying about me in the past. And how much gossiping, lying and stabbing in the back apparently helps in a corporate environment.'"
    ]
}