{
    "username": "sad_cold_tea",
    "contributions": [
        "In response to 'The fact that employers are trying to make just 'doing the job you're paid for' into something weird or lazy by calling it \"quiet quitting\" is evidence that everyone should be quiet quitting on principle.', a user said: 'I don't think it was employers who made up the term. I think it was americans on TikTok, like work / lifestyle entertainers I guess? Then it makes the round in all editorials because it's something new to write about.'",
        "In response to 'Original Post: How do people feel about the ‘quiet quitting’ trend? From an employers and employees POV. I’ve seen lots of articles about this recently and it’s made me curious.\nI personally don’t think you should have to go over and above your job description should you not want to, and you shouldn’t be looked down on for not doing so.\nI did some research and found some resources that support people with quiet quitting such as saying no professionally and setting boundaries (I can link if anyone is interested) but it just made me wonder about this from an employers point of view too.', a user said: 'I think it's more a US thing. Let me give you some context:\nMy US colleagues will regularly work over 40 hours, and generally speaking will bend over backwards more - like stay late or start early if it would be kind of helpful but not really necessary. They're not pushovers by any means, it's just that if you weren't doing it, you're the odd one out. It's part of the work culture there.\nHere, if I have stayed late in the past, I've got that time back the next day - and it's rare. Like it has to be really required. If I'm on a meeting and it's half 5, 8 times out 10 I'll say I've gotta here guys, let's pick this up tomorrow.\nSo for them quiet quitting would be actually impactful, I'm not so sure here. Doing what you're paid to do is typical. I think this has just made the opinion piece editorial mill in the UK purely because opinion piece writers are not working a typical job and just take cues on office life from american dramas or sitcoms 🤷‍♂️. For the rest of us, don't think it's really relevant.'"
    ]
}