{
    "username": "SamplePop",
    "contributions": [
        "In response to 'Original Post: I’m quiet quitting my PhD I’m over stressing about it. None of this matters anyway. My experiment failed? It’s on my advisor to think about what I can do to still get this degree. I’m done overachieving and stressing literally ruining my health over this stupid degree that doesn’t matter anyway. Fuck it and fuck academia! I want to do something that makes me happy in the future and it’s clear academia is NOT IT!\nEdit: wow this post popped off. And I feel the need to address some things.\n1. I am not going to sit back and do nothing for the rest of my PhD. I’m going to do the reasonable minimum amount of work necessary to finish my dissertation and no more. Others in my lab are not applying for as many grants or extracurricular positions as I am, and I’m tired of trying to go the extra mile to “look good”. It’s too much.\n2. Some of yall don’t understand what a failed fieldwork experiment looks like. A ton of physical work, far away from home and everyone you know for months, and at the end of the day you get no data. No data cannot be published. And then if you want to try repeating it you need to wait another YEAR for the next season.\n3. Yes I do have some mental and physical health issues that have been exacerbated by doing this PhD, which is why I want to finish it and never look back. I am absolutely burnt out.', a user said: 'Hi OP,\nI know you are frustrated and tired. There seems to be a lot going on in your life as well with regards to your health and family life. This is all heavy stuff. On top of that, PhDs are tough! You don't get much or any pay and you receive zero to no recognition as well. PhDs are not linear and they are wrought with failure after failure. You are experiencing that right now, but learn from it and keep going, you will be much better for it if you learn to over come this bump in the road.\nThere is a saying \"some get bitter, others get better\". You are not reflecting on your contributions to your current situation and how you have influenced how you got there and you are getting bitter.  You cannot control your prof, but you can control yourself.\nTalk to others in your department, talk to other profs as well. If your supervisor is truly this problematic, you need to address the problem head on. You will need to talk to them. Discuss how their supervision is not supporting you in a way you need. Come up with actionable things that both of you can work towards to make this a better situation. If that does not work, talk to your committee members, talk to your department head, talk to the dean of graduate studies if you have to.\nI had 3 major failures for experiments. Whole summers of field work and supplies went out the window because of it. I could have blamed my absent prof, but I didn't. I worked my ass off to get better to the point where I didn't need my professor. I worked as a lecturer, I worked a full time job as a software developer in order to keep improving and to support myself during my PhD studies. I was not equipped for any of those things, but I held my breath and jumped in. You have to do the same. The world is not going to come to you, you have to go to the world.\nI hope you can figure this out, you have figured out everything else up until this point. So just keep going. You got this.'"
    ]
}