{
    "username": "sapphon",
    "contributions": [
        "In response to 'It seems like you have a misunderstanding of what quiet quitting is.  It isn't that productivity is steady, it is instead that the minimum effort is put forth so as to skirt the line between being fired and holding onto your job.  Generally speaking you see a loss in productivity, not a maintaining of productivity.  For example, you are given a deadline of 4 weeks for a project.  In reality, you could complete it in 1 week by putting in extra hours, normally you'd complete it in 2 weeks without extra hours, but in a quiet quitting scenario you'd wait until the day it is due to finish, waiting the full 4 weeks.\nSo your initial assumption is based on a false premise.\nNow for the rest of your weird statements.\ninevitably trending towards record-breaking profits for the top 1% regardless of wider economic factors\nThe only way you can call profits record breaking is if you look at them in raw dollar value.  Which, if you are economically educated, makes absolutely no sense.  Profits are records nearly every year in a healthy company because inflation creeps up every year.  When you look at the profits of these companies in the way that every single economist and financial person does, you see a decrease in profitability.  Yes that company that sold 1 billion in goods made 100 million in profit last year, but they made 90 million on 800 million in sales the year.  It's a record profit!  But the percent of profit made was less.  As we look through the economy you see this more and more.\na laborer under a functioning capitalist society exchanges an agreed-upon quantity of labor for an agreed-upon wage\nThis isn't really true unless you are contractually obliged to such a thing.  For example, a cashier at a store will inevitably have downtime, so their labor isn't being utilized but they are being paid for a such a time.  Conversely a construction worker may agree upon a contract that they spend 1000 hours building something but due to an unforeseen issue or complication they end up spending 1200 hours instead.  They don't get to bill for additional hours unless you agree upon that first.  Labor is not a quantity to wage driven process.\nand a consistent degradation of the wage, purchasing power\nI'm not entirely sure what you think this means, but wages have trended up, not down.  Purchasing power has changed, not degraded as well.  The only way you can come to these conclusions is by using bad data points.  For example, the purchasing power of someone in 2023 would include things that someone in 2010 did not.  Streaming subscriptions, for example.  The problem with purchasing power charts is that it makes no distinction for how the costs of people have modified over time.  Someone in the 90's would be amazed at not just the fact that we carry a computer in our pocket that has access to the internet at speeds faster than they ever did, but that those devices cost over a thousand dollars a piece.  Similarly, wages can only been seen as degrading if you look at the same job over time.  The value of many types of labor goes down as advancements in technology go forward.  We do not bemoan the stagecoach driver being a job with no wage potential with the advent of the car.  But today we do that all the time with things like automated order taking reducing the number of people needed thus decreasing the wages required for such a position.  Likewise tools which a carpenter or plumber uses have increased productivity requiring us to need less and less of their labor.\nmaybe actually read a campaign platform or two\nUgh, probably your worst argument.  Campaign platforms are the most useless, generic items that a politician puts out.  They have very little bearing on what they actually end up doing.  For example, if we listened to the platforms of republicans, we'd see them in favor of small government and responsible budgets.  In reality, we see neither.  If we listened to democrats we'd hear about the need for data driven spending and responsible budgets.   In reality, we see neither.  There's a reason that the joke in the US goes \"How do you know when a politician is lying?  His lips are moving\".\nYou have competent politicians, you just refuse to give them power for some reason...\nThe problem here is that there is no such thing as a competent politician.  I would also imagine that the ones you think are competent wouldn't actually address any of the things you want them to.  You seem to understand that in a capitalist society there is widespread prosperity to be had, but then you want politicians to do what?  Enact the policies that you fled from?  That is a great way to squash that prosperity.\nSome part thoughts to ponder on before you reply.\nIn the US, generational wealth, isn't a thing.  70% of all wealth is lost by the second generation and\n90% is lost by the third\n.  The idea that someone being wealthy means that you family is set for life is a poor one.\nIf you look at IRS data, you see that someone in the bottom 25% of income almost always has moved out of that bracket within a decade.  We have very recently had a skewed system in which more young people stayed in college, many for more than the 4 years for a degree, skewing age based statistics about what age you should acquire wealth at.  Previous generations didn't attend college at nearly the numbers todays youth did meaning when you compare average wealth at 25 today versus 50 years ago, there will be a vast difference.\nA large summation of everything I've said can boil down to, you've been lied to using statistics to manipulate you.  But when you boil the data down into usable data, none of the things you hold dear are true.  You read the headline of a news article from someone who didn't understand the study conducted and believed them.  When in reality, the data shows a much much different picture.', a user said: 'This is long af but Premise #1 takes a dive immediately so the rest is iffy\nIt seems like you have a misunderstanding of what quiet quitting is. It isn't that productivity is steady, it is instead that the minimum effort is put forth so as to skirt the line between being fired and holding onto your job.\nOh, so the\nrange of acceptable performance\nhas a minimum and a maximum, does it?  And so we define being\nwithin but towards the bottom of that range\nas being \"quiet quitting\" and in some way unacceptable, do we?\nNow given that just a minute ago that was the bottom of the\nrange of acceptable performance\n, and that numbers have meanings - how did it suddenly become unacceptable?\nSince that's impossible mathematically, there's one answer: A moving goalpoast.  You are seeing a moving goalpost and regarding it as the useful basis for a process or definition of a term. Moving goalposts that can be unilaterally moved are always fallacies de facto, however.'",
        "In response to 'Oh, so the range of acceptable performance has a minimum and a maximum, does it?\nYes.  Have you never been through a performance review with your employer?\nSince that's impossible mathematically, there's one answer:\nI skipped responding to your leading questions because they assert a false notion.  The answer is \"The minimum required will get you the minimum results.\"\nA moving goalpoast. You are seeing a moving goalpost and regarding it as the useful basis for a process or definition of a term. Moving goalposts that can be unilaterally moved are always fallacies de facto, however.\nWhile this isn't what you want to hear, yes, your goals yearly are going to move based on the workload you are given.  This is pretty basic concepts.  It doesn't change what quiet quitting is.', a user said: 'You have not addressed the issues I've raised with your way of thinking successfully at all, if anything your reply's crowning achievement\nWhile this isn't what you want to hear, yes, your goals yearly are going to move based on the workload you are given. This is pretty basic concepts. It doesn't change what quiet quitting is.\nis just appeal to emotion, hope that I (or some audience) will be intimidated by your assertion that we do not understand \"basic concepts\" or that we think on the basis of \"what we want to hear\"\nwe're not intimidated, we don't share your biases, and we think propositionally\nyou're not right that job descriptions should be lies, they should be truths\nwhat this means is, if one is doing the job description, that should not be considered any form of quitting; for you to consider it so is to render your job description spurious - which is realistic, but then we have a separate conversation to have about contracts and good faith\na worker's output being in the bottom quartile or whatever of\npeople's who are doing the described job\nis irrelevant; it's patently ridiculous that the goalposts could move to \"top 75%\" without either the job description being updated or the pay adjusted\nif you want to be taken seriously you must address:\nif we are out here setting minima for performance\n(and we are),\nbeing below a minimum cannot be synonymous with being near a minimum.  That is not how minima work.'",
        "In response to 'is just appeal to emotion, hope that I (or some audience) will be intimidated\nIt's literally not that at all?  It's interesting that you find this emotional appeal.\nyou're not right that job descriptions should be lies, they should be truths\nWho's doing the emotional appeal now?\nwhat this means is, if you're doing the job description, that should not be considered any form of quitting; to consider it so is disingenuous in the hope that you'll take home slightly more profit as a manager or owner\nIt seems that you have ignored what I've said in favor of the argument you want me to have made.\na worker's output being in the bottom quartile or whatever of people's who are doing the described job is irrelevant; it's patently ridiculous that the goalposts could move to \"top 75%\" without either the job description being updated or the pay adjusted\nThe people who do the most work get rewarded with pay adjustments.  Why is that \"patently ridiculous\"?', a user said: 'The people who do the most work get rewarded with pay adjustments. Why is that \"patently ridiculous\"?\nI see the disconnect now, if indeed there ever was one - I'm getting sort of a WAAC vibe\n\"Quiet quitting\" is not about pay adjustment.  (Pay adjustments have been around for millennia and wouldn't merit any kind of neologism.)  It's an appellation used as a preface to firing someone.  That is why it matters whether the person in question has actually been\nbelow\n, or\nabove but near\n, a stated performance minimum that was the basis for a contract.'",
        "In response to 'This may cause a slowdown or decrease in productivity if the employer does not hire enough employees or pay the appropriate salary and as such does not have the requirements needed to run at the level they desire.\nSounds like an employer problem to me.', a user said: 'Yeah, my mans nailed his own rhetorical coffin and 46 people helped\nThe term is being bandied about in an attempt to increase the precarity of the precariat by normalizing attacks on anyone not perceived as hustling\nMeanwhile the wiki: \"maybe try paying people appropriately\"'",
        "In response to 'Original Post: CMV: \"Quiet quitting\" is not only hypocritical & nonsensical, but the very existence of the term marks a deplorably unequal economy. Recently, many major corporations have started to use the term \"quiet quitting\" to refer to employees whose productivity remains consistent, implying that not continuously increasing one's output at work is akin to stealthily quitting one's job. This is, to anyone who wasn't born into the top 0.5% and then went on to become a CEO who never worked a job below $60/hr in their life, a ridiculous idea. The entire point of working a job under a capitalist system is that you are exchanging your labor for a contractually agreed upon wage. While the tenets of capitalism fundamentally require that you be paid less than your work is worth to the company, this CMV doesn't aim to touch on the fundamental inequalities of capitalism, but rather the bastardization of the capitalist system that Westerners in 2023 are forced to face.\nWhen a laborer agrees to work for an employer for a wage, the principles of ideal capitalism dictate that the agreement between the laborer and employer is mutually beneficial: the laborer is happy performing the required labor in exchange for the offered compensation, and the employer is happy reaping the profits of said labor in exchange for paying said compensation.\nEvery single nation employing this style of capitalism also uses fiat currency: currency which is inherently inflationary and will always reduce in value (at varying rates, but always tending towards a reduction in currency value through inflation). In the US, the proprietor of the global reserve currency and the most influential capitalist republic in a world brimming with capitalist republics, the rate of inflation has significantly exceeded the rate of wage increase for over a year now; that's not including the even further blown-out cost-of-living skyrocket nor the record-breaking strides in the efficiency of labor thanks to technology.\nIt has been shown time and time again that, while the economic stagnation brought on by the pandemic surely did inhibit the global economy, more than half of the increase in both inflation and cost-of-living in advanced Western economies has been solely due to greed-driven exploitation of global unrest by corporations who have posted record profits despite devastating drops in demand through pure price gouging and exploitation.\nThe use of the term \"quiet quitting\" betrays the not-so-secret key to maintaining profitability for shareholders despite negative economic trends: employers have always expected workers to sacrifice whatever necessary in their own lives for the increased profits of their already exorbitantly wealthy shareholders. For the past few decades of increased productivity and prosperity, this has been fueled by laborers' belief that hard work and blind dedication will result in financial advantages: work hard, provide more value to your company, and you get paid more: capitalism at work. Except now, we live in a world where even the most generous of incentivized bonuses still amount to a reduction in wages according to purchasing power.\nIf your wage is not actively adjusted for inflation, you are taking on a recurrent decrease in salary.\nTL;DR a laborer under a functioning capitalist society exchanges an agreed-upon quantity of labor for an agreed-upon wage. The economy under which most of the Western world currently exists has become vastly preferential of business owners and corporate elite through pure corruption, and the idea of \"quiet quitting\" is just a small yet potent example of how the wealthy have been actively and increasingly exploiting the working class for decades, inevitably trending towards record-breaking profits for the top 1% regardless of wider economic factors, and a consistent degradation of the wage, purchasing power, and political representation of the workers actually creating value.\nPlease change my view because, as a highly politically and economically educated person who was born into a problematically socialist society and raised in another, now living in the US, I desperately want to be able to support the widespread prosperity afforded under a capitalist system, but the US has already easily passed the threshold from capitalism to oligarchy.\nAs an immigrant US resident who believes in this country but can't vote, I desperately remind Americans that you're allowed to vote for someone who isn't a corrupt geriatric billionaire - please just stop watching CNN, FOX, and MSNBC, and maybe actually read a campaign platform or two. You have competent politicians, you just refuse to give them power for some reason...', a user said: 'The part of your view I'd like to posit can be changed is that this\nbut the US has already easily passed the threshold from capitalism to oligarchy.\nis an \"Always has been\" kinda situation; anyone who thinks it wasn't was just the astronaut in front\nRich white men overthrew richer whiter men across the Atlantic to get the taxes that had been going to the richer men for themselves.  The rich men are now richer than the richer men once were, and call the shots.  It was always destined for this, though - you can't go around like \"freedom and individual equality\" but also endorse slavery, chattel- or wage-, and they endorsed both.  The first acts of the new sovereign state's Army were to go crush co- and counter-rebellions with what should've been extremely sympathetic ideological goals that just\nweren't run by the right rich guys\n.  The game was rigged from the start.\nWhat makes me sad is that the US was probably\nnot\nnecessarily destined for sole-superpower status, which accelerated enormously the damage its founders could do with their ideas.  People in a country can be as fucked-up stupid as they want, and if they don't militarily and economically run the world, the world doesn't have to care.\nIf they do, though...'"
    ]
}