{
    "username": "sapphirekiera",
    "contributions": [
        "In response to 'There is no union power in my state, so I am on my own.\nYes and no. I'm certainly not going to tell you there's no value in having a union. But you don't need to be recognized by the NLRB to organize your coworkers to work to rule with you. The more people do it, the easier it'll be for everyone, and also the more impactful.', a user said: 'In some states, like mine, attempting to organize can get your license suspended'",
        "In response to 'Organizing to follow your contract? I highly doubt it.', a user said: 'have you worked in a public school?'",
        "In response to 'Original Post: Is anyone “quiet quitting” this year? I’m curious if anyone else is doing this and how it’s going. My mental health was a mess after last year and my home life is messy— my daughter has a chronic illness that is not in remission. I decided at the end of last year that I was done overextending myself for this job.\nSince then, I’ve just said no, over and over. Can I help take tickets at a football game for four hours and $30? No. Can I lead a PLC? No. Can I mentor a new teacher for an extra plan bell? No, because I’ll just get called to sub for free every day— learned the hard way last year. I’m contracted to work from 7:45-3:15 and so that’s when I arrive and when I go home. If I have to stay extra for any reason— like my daughter’s late practice— I watch Netflix on my school computer and get a Pepsi.\nIt’s been a real relief so far— knowing there’s no pressure for what else may be lurking ahead. It doesn’t matter, because I’m not doing it anyway.', a user said: 'I'm working on it. There's a program I really love that I signed up to do (for free) but I think I'd volunteer with this organization if I wasn't teaching. \nI try to not work outside my contract hours but its just really hard. So instead I'm tracking all of my time that I work and next year I'm going to try to cut back more than I already do. Once or if I become an established teacher I think it will be easier to only do contract hours. The problem is that I teach 5th grade all subjects and during my contract hours I only have 2 hours total each week that i don't have a commitment (meetings) or children in front of me. From the time I get there until the time I leave (except during specials) I'm with the kids. \nI've got a good routine going and expectations are high so at least before the bell when kids are arriving I can do some stuff, like run to the copier, and after school is a similar situation where I can grade papers while they do hw and wait for their bus or car to be called.'"
    ]
}