{
    "username": "sashahyman",
    "contributions": [
        "In response to 'Traveling at a sustainable pace is important so I don't think you need to be ashamed of needing a break. If anything you might try to slow down the earlier parts of a trip to reduce that risk of burning out by the end', a user said: 'This is exactly what I do on longer trips. So many itineraries I see on here are people moving to a new city or country every three days, and that would totally burn me out. I’ll usually pick a few places where I stay for a couple weeks (sometimes a month or two), and then add the quick city breaks between those longer stays. Some people put a lot of pressure on themselves to see everything, and I understand some people have limited time, but I love getting to know a new place, relaxing, exploring at a leisurely pace.'",
        "In response to 'Yeah I think the more I travel the more I embrace mixing up the pace to suit my comfort level and mood. First few times I traveled internationally I had a bit of a false sense of urgency, like \"maybe I'll never be able to do something like this again.\" Nowadays I feel a lot more assured that I can make travel a priority and don't need to make every trip as packed with activity as possible', a user said: 'Exactly! Even though life seems to pass by the quicker the older I get, I no longer have the sense of urgency I once had. Travel is what feeds my soul and I find ways to make it work, and over time I’ve found that ticking boxes and seeing everything isn’t what really makes me happy. I want to have experience life in new places, and that’s hard to do in a couple days.'",
        "In response to 'So much of reddit trends toward novice questions and basic takes. I wish there were a way (beyond upvotes) to filter for novelty.', a user said: 'It seems like some people really overdo it on their first big solo trip, like there’s a pressure to spend six months or a year exploring an entire continent. It’s probably better to start with shorter trips and gauge your comfort level.'"
    ]
}