{
    "username": "savagelysideways101",
    "contributions": [
        "In response to 'Absolutely this. Working silly hours and bragging about it is extremely strange to me.\nIf you pay a plasterer to plaster a room, do you expect them to plaster the room, and also carpet it, paint it, maybe fit some curtains too while they’re in?', a user said: 'If I'm getting paid to do it all, I most certainly will. Otherwise you can fuck right off.\nAs a tradesman that often gets the old \"while your here could you just look at this wee job?\" I find that answering back \"sure once I finish the current priced job, I'll take a look at that and give you a quote to fix\" generally cuts them off short'",
        "In response to 'How should I ask you to “just look at this wee job” in a way that makes it obvious I’m not expecting you to do it for free? We’re in exactly that situation right now where someone’s given us an estimate and is coming back in a few days, but we’ve noticed something else in the meantime. Might literally be a three minute job, might not.\nDo we just need to say “can we get a quote on this while you’re here”, then he can decide whether to wrap it into what he’s already doing? Or something else?', a user said: 'That's exactly what you say. \nSorry while I've got you here, there's this tiny job we'd like you to have a look at cause we didnt notice it before and give us a price.\n 9/10 times I'll do it or only add £5 if it truly is small. If I think it'll be larger I'll tell you straight out and price it.'",
        "In response to 'Good. That’s what we were gonna say, I’m glad that puts us in the “not dicks” category!', a user said: 'Somebody telling us about it when we're just into the job feeling fresh and that they expect they'll have to pay extra to get it done is going to be looked at alot better than the one that's breathed down our necks for 4hrs wanting something awkward thrown in for free when we're in a rush to get to the next job.\nHad a guy last week trying to negotiate my price from the £150 quoted to £100, for supplying an outside junction box, outside light, connecting it up and then mounting a 60inch tv inside with plastic trunking and cables managed (he was supplying tv wall mount)\nAt £150 I was already being nice and easy on him, as I know plenty charge £100 just to get there for 1st hour then materials and hourly rate on top of that.'"
    ]
}