{
    "username": "sbenfsonwFFiF",
    "contributions": [
        "In response to 'It’s unfair to others Rolls Eyes have you asked them if their idea of fairness also extends to bumping up your pay to match the pay of those earning more than you? Because it’s unfair that you’re being paid less. If they give you you the \"oh well they are doing different jobs\" ask why different jobs with different requirements applies in this case but not to you working remotely', a user said: 'You think all jobs should pay the same? Lmfao what is this logic'",
        "In response to 'If you take a moment to apply those good ol' reading comprehension skills, you would see that in fact I don't believe that, and was using it as an\nallusion\nto how bosses are saying that everyone should return to office for \"fairness\" to underline how ridiculous their point is.', a user said: 'lol would it make you feel better if your role was required to be in office but others weren’t?\nRealistically, if anything the higher paid folks are the ones that wouldn’t be asked to RTO'",
        "In response to 'I'm about to get RTO-ed after having it announced over a year ago (we're not the most organized place, like a lot of big companies). I'd always heard, unofficially, that coffee badging was considered by management and, therefore, they configured the offices to force \"badging out\" to exit and would be monitoring for it (coffee badging).\nIn a team meeting yesterday, my manager said something which made me go \"hmmmmm\": My manager is the only person who will get the badge-in reports, so they don't GAS if we coffee-badge. I will be in a location with none of my team members (which makes RTO double stupid), so I'm really considering it. My concern is that some Karen in the office will eventually notice what I'm doing and squeal over my manager's head, getting us both in trouble. Is that a concern for you?', a user said: 'Of course it’s a concern. Just because your boss won’t punish or report you for it now doesn’t mean it’s not an issue.\nYour boss isn’t the one coming up with RTO policy after all. If the company is going to set up badge out monitoring, then you can assume they’ll eventually use that data or ask managers to enforce using it. If you both continue to ignore it, you’re leaving it up to chance with what the company does'",
        "In response to '\"Quiet Quit\" is such a bullshit term. I do my job for the agreed upon time.', a user said: 'There’s a difference between doing the bare minimum, doing your job properly and going above and beyond though\nQuiet quit is doing the bare minimum, sometimes less and hope you don’t actually get fired'",
        "In response to 'It's not about lack of work. I was hired to do 40 hours. On the rare occasion, I work extra (life or death situations) but this is not long-term.\nI am a  professional. I don't work for free for decades. People who work 50-80 hours for years are just getting exploited because they are doing the labor of 2-4 people.\nI do exceptional work but I  am not doing the work of several people without a raise/promotion, etc.\nPeople need to stop being exploited.', a user said: 'Not all jobs are 40 hour a week jobs, though fortunately some get compensated a lot more for it\nIn the end, it’s up to the individual to decide if the job’s demands are something they’re willing to do for the pay they get or if they should get a new job'",
        "In response to 'This isn't the stone age. No job should be more than 40 hours. And if you are working more than 40, you should be a high earner.\nMaking low wage earners work longer hours is inhumane.\nAnd everyone has other work to do. Managing my house/property/land is a part-time job . I sure as hell won't sacrifice my life force and give it away to a job. They have me for 40 hours and that's it . Sometimes there is a life or death issue and I step up but I am not an indentured servant', a user said: 'Agreed, though high earner and low earner is subjective'",
        "In response to '[Deleted or Empty Comment]', a user said: 'Obviously your choice but unless you’re in a position to retire, I wouldn’t quit without something lined up. It could be especially difficult for someone your age to find a new role with similar pay and benefits, despite age discrimination protections'",
        "In response to 'Original Post: Has anyone \"Quiet Quit\" as a response to RTO? I'm not in this position, so I don't need advice, but I'm curious to hear everyone's thoughts on this.\nI work remotely, which is why I follow this sub. I've seen a lot of people in this sub who are being asked to RTO. I've been thinking about this the past few days as the sub has been full of people discussing how to respond to RTO mandates.\nLots of people, including myself, are speculating that the recent push for RTO is force people to quit their jobs. If they don't fire you then they don't have to pay out unemployment. And, you have to have significant savings to go without a job.\nWhat do you think about about returning to the office and quiet quitting so you can still draw unemployment? Anyone done this?', a user said: 'Nothing like intentionally being bad at your job to prove you were definitely productive at home'",
        "In response to 'I quiet quit as a result of being massively underpaid for the profit I bring in for my company simply because I was not born with wealth during a time when other competitors were 10 people operations', a user said: 'If you’re so underpaid, can you find another company that is willing to pay you more?'"
    ]
}