{
    "username": "Sccjames",
    "contributions": [
        "In response to 'What’s the new corpo buzzword for general strike?', a user said: '“Adolescent wet dream.”'",
        "In response to 'Working conditions suck for a\nrandom selection of professions\nand it is mostly a crapshoot for students to pick a direction that will renumerate them appropriately.\nOld professions that used to be gold-plated have been defunded and shittified. Bullshit jobs with hardly any real worth are catapulted into high-value cushy jobs. And some historically valuable jobs haven't changed. But even if\nyou\nknew which was which when\nyou\nwere in school, the water has been incredibly muddied by a bloated lying university and college system that the truth is hardly evident to the masses.\nShitting on the people losing out as shiftless 'unskilled labour' is minimizing an actually problematic situation. The fact remains that some people have a major leg up in this market and a ton of people have lost-out in spite of hard work and education.\nAnd those people are most certainly not just stumbling over new positions worth $25k more than their last job. Do you even\nknow\nany job hunters in this market, apart from the upper class? I actually do know several in the middle class with degrees behind their names, and this job market is hardly doing them any favours anywhere near that. I'm talking about people actively job hunting and working for their own future good, not shiftless fools slipping on their own drool. This job market is great for getting another equally shitty job, but succeeding in climbing the ladder is still reserved for a lucky relative few. Especially if you consider getting a new job in another city, in\nthis rental market\n, will lose you a significant proportion of the money you might have gained in increased ballistic rent rates.\nPeople like you are just ignorant to your own status and circumstance. Good for you, you and all your fancy friends can't help but stumble on cash if you just toss out a few resumes. But you're hardly emblematic of the working class and you should know your opinions don't count much for shit, except in upper-class circles.', a user said: 'This is just loser talk. Society will always have (and need) its classes. Some people are ambitious and industrious, others are not. I would love to take a look at the life choices of your degree friends and see what they did in their youth and young adulthood to prepare them for the real world.'"
    ]
}