{
    "username": "SciTechPanda",
    "contributions": [
        "In response to 'Original Post: Having to read about \"Quiet Quitting\" instead of the long-established \"Work to Rule\". And of course it's on TikTok.\nQuiet quitting: The workplace trend taking over TikTok - BBC News\nKids today need to learn more about unions and industrial action.!', a user said: 'I definitely quiet quit my last few job roles because there was no possibility of advancement without sucking up to management, which is not something I'm inclined to do, plus I was never their 'kind of person'.\nIn my current job working in a kitchen for a very well known pub chain (the dark blue and white logo one) I'm willing to do more than I'm expected to do because I know that there is ample opportunities for advancement up to the next few levels of staffing, and my managers are actively encouraging me to go for them (just applied for the next level up with my managers blessing after being there for only 10 months despite also facing the possibility of multiple surgeries in the not too distant future).\nI firmly believe that you should only push yourself of you know and have confirmation from those above you that you can and will advance if you work hard and have a staff force that supports you.'",
        "In response to 'despite also facing the possibility of multiple surgeries in the not too distant future\nIn the same way as you take a risk on the health of the company by working there, the company takes a risk on your health by offering you the job.\nNever let any manager try to tell you otherwise. I drum this into all my first jobbers at work, and I'm their manager.\nAny decent employer will support you through a health issue.', a user said: 'Totally agree, my last few managers at previous jobs always threw a hissy fit if I needed time off for medical or hospital appointments whereas my current managers will move the moon and the stars to ensure I can attend any appointments even if they are arranged last minute.\nHad one in January that I got told about 15 hours before the appointment, it was for a steroid injection to treat tendonitis, and they arranged it so that someone could cover my shift until I could get to work after the appointment, I nearly cried because of how supportive they were about it.'"
    ]
}