{
    "username": "sconnors1988",
    "contributions": [
        "In response to 'No matter the industry, the difference between quiet quitting and work to rule is the internal attitude of the workers.\nWith work to rule, the workers generally care and are trying to put pressure on the employer to improve working conditions.\nQuiet quitting, the workers generally don't give a fuck anymore. They are going through the motions and doing what is required but they are in no way or shape attached to their job.\nBoth scenarios can be driven by working time requirements, as with teachers, but it doesn't have to be. Quiet quitting can also be the result of micromanagement. Not less hours, but you don't even pay any extra attention to catch mistakes of others because you don't care.\nQuiet quitting is much worse for employers because the workers have disengaged. Threaten a write up? Don't give a fuck. Close your unit and transfer the somewhere else? Don't give a fuck.\nBut quiet quitting in my ears doesn't blame the worker. It's very similar to a high turnover. Says more about the employer than about the employees', a user said: 'My current place of employment is amazingly effective at creating a quiet quitting environment. It's pathetic how much money we lose because we don't incentivize anything. Turnover rate is over 100 percent for years as well. If I was the CEO or a stockholder, I would immediately begin incentivizing people based on work performance and this is evrn if you exclude all ethical motivation.'",
        "In response to 'You are exactly right, and I think the original post misses the mark, or maybe people are conflating \"Quiet Quitting\" with \"working to the rule\" and they're actually different things.\nQuiet Quitting is doing less than you are contractually supposed to do, but enough to keep your job (or at least draw out the firing process).\nWorking to the Rule is malicious compliance to slow down productivity.\nBoth are a form of protesting working conditions a d compensation, but they are not the same.', a user said: 'Pretty sure your definition of quiet quitting is not the norm. Quiet quitting is doing your responsibilities and not going above and beyond.\nQuiet quitting is NOT intentionally making mistakes. \nQuiet quitting is NOT neglecting job responsibilities.'",
        "In response to 'Maybe my understanding is different from most people's understanding. It doesn't make sense to me that it's a type of quitting if you are doing your job.', a user said: 'And that's why it is a pejorative new branding by coporate bootlickers. Although some employees enjoy the term for the overt attention it brings to not motivating your workforce. Its the type of BS you see people say on fox news.'",
        "In response to 'Maybe it's called \"quietly quitting\" because you're sure to be let go for doing it. If anyone even notices, the business will eventually just close.', a user said: 'Quiet quitting shouldn't usually lead to being fired. It is just a refusal to go above and beyond and is naturally more prevalent when there is insufficient motivation to do so.'",
        "In response to 'I don't think they are the same thing.  A work to rule strike is an attempt to slow down as much as possible without violating the rules, often by using the rules that are otherwise ignored because they slow things down.\n\"Quiet quitting\" is a boss complaining an employee isn't go above and beyond their job duties.  Not working free overtime, etc.   Someone just doing their job normally isn't performing a work to rule strike but can still have a boss complain they are quiet quitting because the boss wants more from free.', a user said: 'Your definitions are in line with what I've seen. And I find the whole quiet quitting thing to be so funny. These corporations are either run by stupid people or are pretending to be stupid for exploitation. People dont tend to invest more time and energy into things without sufficient motivation!? WHAAAT!? Behavioral motivation exists!?'"
    ]
}