{
    "username": "ScoobaStevex",
    "contributions": [
        "In response to 'Gets hired to do a job for X amount of money.\nDoes job and meets stated goals.\nDoesn't take on extra work for which they are not being paid.\nFinancial writer accuses workers of \"quiet quitting.\"\n(\nsuspiciousfry.gif\n)', a user said: 'This is kind of inaccurate and taken out of context (rip my karma).\nSo this is talking about white collar workers, specifically project managers. Project managers have a salary usually around 180k ish. Construction Project managers are the cream of the crop and the ones being referenced. At the end of a project, a PM usually gets a percentage of the project they've been working on as a bonus. Typically anywhere between 2-10%. When your project has a million dollar budget, these numbers fluff the fuck out of your salary. It's easy to make 500k a year as a construction project manager if you work for a decent firm.\nNow because of the labor market, taking on a job you know isn't going to have the proper manpower to get it done in a timely manner is just extra time money and stress you don't need in your life. And since that job won't get done in a timely manner, you can kiss your bonus goodbye. So what we do is purposely fluff the budget so that it way to high and other contractors out bid us on that job, then we won't get awarded the job and life goes on.\nGets hired to do a job for X amount of money\nYes we are hired to do a job on salary for x amount of money, but this is not what this is actually referring to.\nDoes job and meets stated goals.\nCorrect. We do the bare minimum and still get paid a shit load of money to do it. Just no bonus's.\nDoesn't take on extra work for which they are not being paid.\nIt's not that we aren't taking extra work on, we just aren't doing jobs we know we won't get a bonus out of.\nWith that being said, companies like my company refer to this as quiet quiting because we aren't actually quiting our jobs, we are just turning projects down. This obviously negativity effects the company because they aren't generating as much profits...'"
    ]
}