{
    "username": "sdawsey",
    "contributions": [
        "\"Working to Rule\" NOT \"quiet quitting\" [External Link]: https://imgur.com/a/LAimDzs",
        "In response to 'I noticed you left out the feelings of the fish...\nCurious...', a user said: '\"It's ok to eat fish because they don't have any feeeeeelings.\"'",
        "In response to 'It's Working to Rule and it's a part of your right to protest.\nNo.\nDumbass.\nIt is not a protest. It's doing your job as contracted. It's called \"work\".\nGoing above expectations is boot-licking, going below expectations intentionally is a protest/strike.\nExactly meeting expectations is \"working\".\nThere's nothing special, either good or bad or from either side, about working to expectations.\nIt is not a fucking protest.\n(To be clear, I'm NOT including any unwritten expectation of going above and beyond.)', a user said: 'Throwing insults and animus at other workers is part of why you'll never be part of anything important. You'll just rage on the sidelines while the rest of us understand that when we disagree we can have a conversation and find a common ground to work on improving both our situations. You'll be hiding behind a tree calling us names and going nowhere.'",
        "In response to 'I'm only taking issue with calling it \"protest\". The issue is if you normalize the thinking that working normally rather than \"exceeding expectations\" is a form of protest then \"working normally\" becomes not normal.\nPushing the idea that it's a form of protest only works in favor of normalizing \"exceeding expectations\".\n\"Quiet quitting\" (aka working to exactly meet expectations) is the status quo. All articles treating \"quiet quitting\" is something other than normal is basically propaganda, even if you decide you want to call it a \"protest\" action instead of \"quiet quitting\".\n\"Working to expectation\" is NOT a protest action. A\nstrike\n(or even an intentional slowdown) is a protest action.', a user said: 'Frankly I don't care what you have to say when you begin with \"Dumbass.\" I will always immediately discount the words of anyone that cannot remain civil and opens with insults. If your second post had begun with, \"I apologize for being a jerk. Here's what I meant to say,\" then I'd be willing to listen. Our society is too divided to give energy exchanging ideas with people that don't understand this. Grow up and try again.'",
        "In response to 'Yes. And “working to rule” is not a protest - it’s simply doing your job. Demanding uncompensated overtime is not a “right” that employers just naturally get to exercise - it’s abusive, and it’s one of a plethora of reasons why workers may choose to form a union.', a user said: 'Agreed 100%.'",
        "In response to 'I work in retail as a lessons department manager, my boss came up to me and told me I have to go and help the sales floor (salespersons make commission, managers dont), ringing customers and making sales and said verbatim “you’re what i want you to be in the moment”. Of course no pay raise and im barely able to do my job because i now worry about a million other things. Certain aspects of my job are being left behind because i have no one else helping me in my department, no one to make calls or process payments, so it gets missed sometimes\nAny action i can take here?', a user said: 'It depends on where you live and what the rules/laws are there. My first and only suggestion would be to document the times your boss instructed you to perform tasks that aren't in your job description. Then, if you get reprimanded for performance issues on your actual job you have a record you can point to and say, \"I could not perform my job as described because of these 14 times I spent 23 hours total doing other tasks.\" Or something like that.'",
        "In response to '...and obeying the rules is less susceptible to disciplinary action.\nI saw this in the Wikipedia article on \"Working to Rule. You are \"less susceptible\" to \"disciplinary action\" for \"obeying the rules\" but apparently not free from it. Wtf??\nThis remind me of a court case where convictions in a multi million dollar drug bust were thrown out after the redneck cop actually stated on camera that one of the things he looks for when deciding who to pull over was them driving the speed limit. The lawyers appealed the conviction on the grounds that he couldn't use them NOT breaking the law as probable cause and the judge agreed stating that basically that opened the door to having \"probable cause\" to pull literally anyone over and search their vehicle for speeding or not speeding as the case may be. I guess this cop had a really good track record of busting drug mules and lots of them had their convictions overturned. I mean, the people that they were hauling for probably had them killed for losing the dope but that's beside the point. This was in Georgia or Alabama or someplace where it's not uncommon to fuck immediate family members, i can't remember exactly where.', a user said: '“GA or AL where it’s not uncommon…”? You can fuck RIGHT OFF with your ignorant stereotypes.'",
        "In response to 'Hey, come on. We all know incest is best,\nrelative\n-ly speaking.', a user said: '🙄'"
    ]
}