{
    "username": "Sea-Legs_99",
    "contributions": [
        "In response to 'I know you texted which was good, but I feel you should have called as well. That’s why there are two forms of communication to reach the customer. I have been in your position where they didn’t respond  to texts and then I called and they answered right away. They are paying a decent amount in fees for these services and I feel every avenue of communication should be used.', a user said: 'They made an order. They know someone is picking up their order and delivering it. They can unmute their phones and keep them within arms reach. Nothing more annoying than a shopping dash for an absentee customer.'",
        "In response to 'There you go! Let's do the bare minimum through life. No more. No less. That'll surely get us ahead! Well done!!!!!!!', a user said: 'Just at work. Don't assume it applies to the rest of life.'",
        "In response to 'The dasher waited 5 minutes as well as tried to communicate with the customer. There are other orders that need to be delivered and with being a alcohol delivery, it can not be left unattended.\nThe customer knew the order was placed.  The customer knew a code was needed to get into the community but did leave instructions on how to get in.  I am willing to bet the gates never opened during the 5 minutes so the dasher could not slip in.\nI don't see anything wrong with this.  Other people are waiting on orders, it is not fair someone has to wait longer because this customer could provide the proper info.  I hope the driver got their half pay for this.', a user said: 'In my town we have a 500+ unit apartment building next to a big university. Never have I ever had an apartment number attached to an order. They all have the apartment address and it says leave at my door. I asked some students going in once if I was even at the right address and they said I was and that all deliveries go to a specific table outside a specific door to the building. I now drop off at that table and most of the time the customer is in the waiting room waiting for the order.\nI don't know why I felt the need to type this all out.'"
    ]
}