{
    "username": "SeanBlader",
    "contributions": [
        "In response to 'yep. i work in the food industry where you're cut when the work is done and the service is slow, so naturally i always work my ass off to just get home asap. boss saw this and asked if i wanted a little extra responsibility, i said no, then he said it'd pay more so i reluctantly agreed. i ask for details and he says he'll come back to be and get me something more concrete.\nsince then my work load has increased but when i asked about the details again, i was told they'd have to get back to me\nagain\nand that i was in fact not being paid any more than before. don't put in more effort than you have to, it'll never be worth it in the current culture', a user said: 'since then my work load has increased but when i asked about the details again, i was told they'd have to get back to me again and that i was in fact not being paid any more than before.\nWhen I was young and naive, I accepted a promotion to my bosses management job where conveniently the district manager had accidentally left the contract at the main office 2 hours away.\nTurns out the management role was more hours for less money than I was making previously, unless you hit certain \"goals\" most of which were outside your control entirely. Everyone I've worked with since learns from me when they ask that I don't trust the company any further than I could throw it, and I'm not busting my ass to make them more money. I purposefully flip the story, so if they want me to represent a management position, they need to show that they can afford my effort and stress a few months in advance before I'll take on the training they want.\nIn a nutshell, I'm usually fine where I am currently and if you want to change the status quo, my status needs to change in advance or I'm sure you can find someone on your staggering list of excellent managers to do the job for the pennies you want to pay them. Oh and I'm a decent leader, and I can fully identify a leader that's beneath me, so if you don't find someone better, then you'll also be looking for my replacement too.'",
        "In response to 'Log off at 6 now', a user said: 'I'd also log out for state mandated lunches and breaks, and I'd get my manager's suggestion to \"stretch the workday\" in writing so I could have it as evidence of wage theft for the state labor board.'"
    ]
}