{
    "username": "SeasonPositive6771",
    "contributions": [
        "In response to 'I think the whole era of \"Men are from Mars, Women are from Venus\" did so much damage to the modern relationship. That book and it's spin offs were everywhere, and it seemed like everyone alive in the early 90s was drinking the kool-aid. Honestly, I never read more than a summation, but it seemed like what everyone culturally took away from it was \"men and women inherently act and think differently, and have different goals.\"\nThe result was a generation of men who came away believing they couldn't actually be friends with women, and women who were forced to turn a blind eye to poorly socialized behavior and say \"boys will be boys.\" That men and women needed to be tricked into supporting each other because the same things couldn't make them both happy. So plenty of men brought up in that enviroment (and now their kids) believe their friends are the guys they drink, game and watch TV with, and women are there to do the mother work and otherwise function as goaltenders to sex and \"fun.\" They really don't believe that women could get into sports, be fun to game with, like sci-fi, or actually enjoy sex.\nOn top of that, far too many men don't have friends they can talk to about anything that is emotional in nature. They are men and not emotional. That's what women do and are for. So, they dump their emotional baggage at home and go hang in the man cave, or wherever the fuck, with their friends. Friends that are almost purely topical. They rarely touch outside of mock or real violence and rarely discuss anything in a way that has any component of vulnerability. It would just be sad if it didn't cause so much strife with women who want true connection.', a user said: 'That entire comment, especially the last paragraph just summarizes my ex to a t. He has a group of friends that have supposedly been his best friends since elementary school but he will cry and cry to various girlfriends about how no one ever hugs him but if you suggest he hugs the bros he gets hysterical about how it's not the same.'",
        "In response to 'I wonder how they can age us out when so many of them don’t want to work, and the boomers are all retiring. Won’t they need senior leaders?\nI have been in hospitality my entire career and it sucks - I am so over the expectation that I have to pick up the slack or help when we are short staffed; “duties as assigned” is the biggest boomer scam. Basically means working evenings and weekends the entire peak / tourist season with “lieu days if you work an 8 hour shift” and no other compensation.\nQuiet quitting for me means saying no, I will not work these extra hours for free. I will leave early on a Friday if I have to work extra hours, I will ensure I get MY TIME back.', a user said: 'It's wild that Boomers invented both \"it's not in my job description\" to protect themselves\nand\n\"other duties as assigned\" to make their employees' lives more difficult.'"
    ]
}