{
    "username": "Second_Breakfast21",
    "contributions": [
        "In response to 'Do you think a lot of people will \"tone it down\" to punish their companies for RTO?', a user said: 'Not punish. Compensate. That’s just capitalism. The goal of capitalism is to increase your benefit while reducing your investment. They upped the investment, so they should expect workers to compensate in ways that are within the employees’ control.'",
        "In response to 'Being asked myself to go from full time WFH to hybrid. You better bet I am going to deliberately slow down my productivity on those office days, besides the fact it will naturally happen due to all the “collaboration”.\nAlso pulling way back on my flexibility with my hours when asked, no more jumping on for the odd thing for 5 mins after hours.\nI always thought my employment accommodations and compensation were a negotiation with my employer independent of my work colleagues. Apparently no it’s unfair to others who are hybrid if I’m WFH.', a user said: 'My dad and I were talking about this the other day, as it pertains to the banking industry, and I asked if it was unfair that people in our corporate office don’t have to wear uniforms. He thought that was an odd question and I explained that employees in our branches have to wear uniforms, though you might not notice it because they don’t all wear the exact same thing but it’s all approved clothing from an apparel company that branch employees have to purchase with their own money. They’re wearing slacks and business shirts but I can wear jeans and a tshirt. And they’re not going to make all the corporate employees wear branch uniforms. Why? Because we don’t deal with customers. Different jobs have different needs. Should truckers complain that workers who aren’t truckers get to be home with their families every night? When did people stop using common sense? I think he actually got it lol'",
        "In response to 'It’s unfair to others Rolls Eyes have you asked them if their idea of fairness also extends to bumping up your pay to match the pay of those earning more than you? Because it’s unfair that you’re being paid less. If they give you you the \"oh well they are doing different jobs\" ask why different jobs with different requirements applies in this case but not to you working remotely', a user said: 'I always ask if it’s fair to truckers that the rest of us get to sleep in our own homes every night. Different jobs, different needs.'",
        "In response to 'Original Post: Has anyone \"Quiet Quit\" as a response to RTO? I'm not in this position, so I don't need advice, but I'm curious to hear everyone's thoughts on this.\nI work remotely, which is why I follow this sub. I've seen a lot of people in this sub who are being asked to RTO. I've been thinking about this the past few days as the sub has been full of people discussing how to respond to RTO mandates.\nLots of people, including myself, are speculating that the recent push for RTO is force people to quit their jobs. If they don't fire you then they don't have to pay out unemployment. And, you have to have significant savings to go without a job.\nWhat do you think about about returning to the office and quiet quitting so you can still draw unemployment? Anyone done this?', a user said: 'To answer the question I think is at the heart of this, without taking the quiet quitting bait, yes. I have considered holding out for actual layoffs. My employer hinted in Q4 that layoffs were coming, but they haven’t manifested. An RTO order came instead. So it’s reasonable to consider that layoffs could follow if enough people don’t quit and the company tends to give a generous severance (I can at least applaud them for that). So, yes, I’m looking for a full remote option but am keeping my search very picky right now because I’ll jump ship for a good offer, but I’d rather wait a little bit and see than jump at any offer I can get.'"
    ]
}