{
    "username": "SecretRecipe",
    "contributions": [
        "In response to 'The bikers could be arrested at the very least and their bikes impounded', a user said: '*Seized and sold at auction.'",
        "In response to 'You might be right, but this is the most \"Imma-get-mine\" crowd I know.\nAnd more power to 'em. Companies been gettin' theirs for years.', a user said: 'You're not screwing the company, you're screwing the other workers on your team.'",
        "In response to 'Original Post: When you quiet quit/ride it out till you get fired, it negatively affects others in this community I had a teammate who had been dropping the ball for a while and was finally let go this week. His output was so bad that my manager noticed and did some digging. Turns out he barely worked at all and was clearly just coasting till he got fired.\nWell, my manager and skip are PISSED and literally called out how they think our old teammate was working multiple jobs. In my xp, they definitely were as they had many signs.\nRegardless, it’s now coming back to bite my team and me with new policies. Yes I’m pushing back on all the BS coming our way and trying to minimize it, but I wouldn’t be surprised if activity monitoring software came up soon to flag suspicious activity as well. This gig has been great for OE for years and now it’s in jeopardy because someone couldn’t just quit when they were done… I have friends (OE and not) at multiple other companies who are dealing with fallout like this as well.\nMy point being, when you pull the anti work card and coast like this just waiting to be fired (which I see recommended here daily), it’s not an isolated event. You get your bag a bit bigger and your teammates (and fellow OEers) deal with the fallout.\nIt helps to push for more RTOs that may have not as it eliminates the possibility of many of these issues. This also affects remote offerings (wayyyy down from what I’m seeing myself in new job hunts)\nHow would you feel if others put your extra paycheck(s) in jeopardy?\nGet your bag, but don’t screw others over while you do it.', a user said: 'This is why I always recommend throwing sandbagging low performers under the bus.  If someone is \"quiet quitting\" or unable to keep up then get rid of them quickly before their incompetence / apathy becomes a problem for you and the rest of your team.\nThis isn't a team sport.  If someone sucks to the point it impacts you or brings unnecessary scrutiny/attention on to you then you shouldn't feel bad dropping a tip to management to get rid of them.'",
        "In response to 'Bad advice.\nLow performers are literally there to make you look good and be layoff fodder. Imagine a team that gets rid of all it's low performers and then has to layoff 20% across the board. That's insanity.\nLearn to not pick up their work for them, EVER, and refer to your own performance metrics against theirs. You'll never have an issue. I've not once had a situation where getting a teammate fired would help me in any way, even if they are incapable of doing anything. They are human shields.', a user said: 'To use your analogy, there's no better way to use a human shield than to direct all the fire on to them.  Leadership isn't going to suspect the dude who's overtly looking out for the team and company's best interests.  Having a high performing team to delegate work to is a net benefit, being surrounded by low performers doesn't make your job easier, it makes it harder.'",
        "In response to 'I don't see how that helps you at all. Lol on the contrary, you have effectively raised the bar just by getting rid of the low performer and put a brighter light on yourself. That people of your persuasion don't see that is quite laughable. Unless you are HR, then this post makes *perfect* sense.', a user said: 'If you perform well and deliver then the brightness of the lights don't matter.  OP's example of the quiet quitter bringing down scrutiny on the whole team is all the example you need.  All these remote workers slacking off just feed ammunition into the RTO narrative.  The most successful people in the community aren't the antiworker \"grey men\" hiding in the shadows avoiding notice and doing the bare minimum.'",
        "In response to 'Original Post: You’ve Heard of Quiet Quitting. Now Companies Are Quiet Cutting Layoffs are down, but employers are still finding ways to cut jobs -  Is this normal or economy tanking? More problems expected in late 2023 or 2024?\nWorkers are waking up to emails and team-meeting requests with a jarring message: They aren’t fired but their jobs are gone.\nPeople on the receiving end of these memos describe running through a range of emotions, from relief that they’re still employed to a sense of dread that their bosses secretly want them to leave.\nhttps://archive.ph/cYXyk\nhttps://www.wsj.com/lifestyle/careers/youve-heard-of-quiet-quitting-now-companies-are-quiet-cutting-ba2c326d', a user said: 'You usually don't plan your opex based on today's performance but on what you expect next years performance to be.  If they're cutting costs despite good current performance they may not have a good outlook on 2024 or they may just be trying to optimize and trim bloated staffing levels.\nNo need to keep people you truly don't need on regardless of your profits or revenues'",
        "In response to 'Original Post: Quiet quitting big bank I work at a very large bank that is mandating RTO 5 days a week. (Big on the news I’m sure you can figure it out) I had perfect reviews at year end. I had no issues with attendance when we were 3 days. HR currently has zero track record of me not preforming. Anyone do this and how long did it take to finally get the axe?\nEdit: \nI plan on doing basically nothing and using my month of vacation aggressively over the next 8 weeks', a user said: 'Why would you screw up your reputation like this?  Just find a replacement job and resign and keep your relationships intact.  Your network is the most important thing you carry with you across your career and with the prevalence of back channel references one burned bridge can have a really bad habit of following you around.'"
    ]
}