{
    "username": "SeliciousSedicious",
    "contributions": [
        "In response to 'Anon figured out that the modern (corporate really) work environment is scam for the most part meant to keep you busy AND exhausted. And allow a vent for unhinged, sociopathic middle managers who should otherwise be in mental institutions.\nWhy we don't have a 4 day 30-32 hour work week is beyond me?\nGet a job from home anon! It lives up to the hype.', a user said: 'Get a job from home anon! It lives up to the hype.\nEh unless you’ve got a family already and/or a good social circle you can dependably rely on to hang out on the regular with this isn’t the greatest.\nEven if it seems great you can end up suffering from social isolation.'",
        "In response to 'I'm talking about having a good social circle 😂', a user said: 'Its actually very common for people to not have reliable social circles these days.\nSomething like over half of the population is experiencing loneliness in this generation. Rates of depression and anxiety are also at all time highs. High rates of work from home is probably just going to intensify this issue tbh.\nAs for myself i have a decent-ish social circle but it could be better. Im lucky enough to be working with my 10-year really good friend tho and work at a mall and know a lot of the people who work here which helps a lot in supplementing that. Helps a lot in serving as a good social outlet which i wouldn’t otherwise have if i did wfh.'",
        "In response to 'And the strength of the connections is typically far more flimsy than people assume. One of the first things most people experience after a late-stage cancer diagnosis is their social circle dropping off to an extreme degree. The people there for you when your worst day is a bad breakup aren't necessarily going to be there when your worst day involves trying not to vomit your meds up when looking for burial plots.', a user said: 'This.\nI experienced this personally when i broke both of my feet and couldn’t walk for a year.\nWas a good splash in the face for how social isolation effects you and a good show at the time for who my real friends were.\nThis is also why IMO a stronger emphasis should be placed on building a family/strong romantic partnership than we currently place. Those connections are much more likely to stick around when your body starts failing than your broader social circle.'",
        "In response to 'Ik that's why I said it', a user said: 'Ahhh kk.\nThought you were suggesting it was rare to not have a dependable social circle.'",
        "In response to 'No one has friends anymore. It's sad.', a user said: 'At least irl ones they regularly hang out with.\nI blame social media tbh. Dating apps too.'",
        "In response to 'That's a band-aid, not a fix.\nYou're already socially-isolated, your job just covers it up. Get a hobby and make real friends.', a user said: 'Depends on how well you connect with co workers. Just because its a job doesn’t mean the connections can’t be fulfilling. My entire current social circle i hang with outside of work is actually a crew from an old job i used to work 3 years ago. We still hang out, do things, play games upon occaision, etc.\nIts also fine to consider work to be a social pillar even with a friend group. You can’t hang with friends every day for instance and family can get stale, and sometimes you can even be in between friend groups,  that’s where work connections come in and fill the gap.'",
        "In response to 'Original Post: Anon tries quiet quitting [External Link]: https://i.redd.it/hajzm9g6jyxb1.jpg', a user said: 'Just roll with it. Gravy train job now.'"
    ]
}