{
    "username": "SenatorPardek",
    "contributions": [
        "In response to 'Original Post: Reddit was so hot on \"quiet quitting\" but now when you talk about using slowdowns to interfere with the fascist takeover, all you hear is crickets We are at a pivotal moment, where either we choose to plunge the system into darkness on our terms temporarily, or the oligarchs drive the system into darkness on their terms for the foreseeable future.  And yet, so many people seem willing to just continue, business as usual, even as our protections (worker protections, immigrant protections, social services) evaporate before our eyes.\nThe ruling class may own the companies, but the working class still runs them, and we have a chance to use that to help ward off the darkness.', a user said: 'I’m gonna be honest.\nI’m really, really effing tired. I’ve been marching, organizing, union eventing, phone banking, and more since 2017. (i assumed better of my fellow americans that they would never elect a man like trump).\nand people can’t be bothered to stop this anti labor, ultra corrupt, wanna be authoritarian at the ballot box?\nWhy? Because even though he is worse on gaza: couldn’t vote for killer kamala.\nEven though he’s worse on labor, joe biden didn’t do “enough”.\nEven though he’s talking about dismantling public health and academia and special education: you know eggs went up in price and inflation….. from the pandemic…. that trump mismanaged for a year causing a massive economic black hole we barely scraped out of.\nJust toss that shit away because democrats aren’t perfect and represent a broad coalition. fascists have it easy. coalitions of different minded people are hard.\nBut no, biden to harris turn out crashed among left leaning voters.\nSo I hate to say it. i find it really hard to risk my god damn livelihood directly when so many people couldn’t be bothered to get their hands dirty at the ballot box. I realize i might have no choice. but i’m not going first that’s for damn sure'"
    ]
}