{
    "username": "SenoraRaton",
    "contributions": [
        "In response to 'If you want me to go above and beyond you should give me shares of the company.', a user said: 'I never understood this.\nScenario A:\nYou pay me a fixed hour wage, that is independent of my work output, which creates a culture where you try and maximize my output, and minimize my wage/hours.  I try and maximize my hours, while minimizing my labor.\nScenario B:\nYou pay me a base stipend that covers my cost of living, and include ALL employees as members of the company.  My work, and my coworkers work, directly benefits us in a tangible financial way.\nWhy would system two not be the better system for actually getting quality work done?  Now I know that my labor is directly benefiting those around me who I interact with on a daily basis, and large scale social pressure would encourage people to work harder, with the desire to earn more.  This would lead to increased work flow, more productivity, and ultimately happier employees.\nIf you say this though, your a communist.  Americans claim to believe in democracy, but not in the workplace, where for some reason we praise dictatorships.'",
        "In response to 'Because the same people who squeeze every hour and \"maximize efficiency\" would be the ones deciding what the base cost of living is.', a user said: 'Again, give the workers power. If we are all owners, then we should be able to democratically decide that.  Why do we need a parasitic managerial class?  The divide between managers and employees is one created intentionally to A) Dangle a carrot to employees that they two someday might get promotions.  B) Essentially create slave drivers who's only job is to pressure employees into working more.\nJust eliminate the divide.  Create a democratic system where instead of being top heavy with compensation its more egalitarian, and less lopsided.  Let the employees set their own salaries.  Everyone would know \"The company must succeed or I will lose my job, and if we raise our wages too high, the company will fail, this is the amount we can agree on that we all need to sustain our families, and our lives\".  I mean capitalists already do this in order to run companies into the ground while extracting every ounce of profit  from it in the decline, the workers might as well be the beneficiary of their labor directly, instead of \"shareholders\" who bought the company, have no real investment in the longevity of the company, and are just looking for a quick profit.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'If you're not actively positively contributing to the company and increasing it's value,\nExcept you can be doing just that, you can contribute to a company, and add value, and not do more than defined contractual obligations.\nThere are not an endless supply of workers, finding, and hiring employees is expensive, and difficult, especially in skilled trades.\nPeople can continue to attempt to maximize their production, and chase perceived promotions and wage increases, but the stress that comes along with this grind is just simply not worth it.\nFire me, I don't really care, my skills are in demand, and there are numerous businesses willing to hire me likely for more pay, and better benefits than you are already paying me.\nAt the end of the day its disrespectful to employees to present an employment agreement, and then proceed to alter the terms of that contractual agreement by adding more labor, without increased compensation.\nI don't get to go into McDonalds and demand that they give me 3 hamburgers for the price of one, anymore than my employer gets to demand I do the work of 3 people for the pay of one.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'You're just putting your own feelings above everything else.\nOf course I am, the people at my job aren't my friends.  My boss isn't my friend.  They do not hold my interests in mind, the companies doesn't give a shit about me personally.\nI'm fine with being replaceable... The job is replaceable too.  Its a two way street.  I think that is what your failing to see.  I'm taking the EXACT same attitude that your projecting for the company.\nImagine this, and instead of seeing it from the company viewpoint, its me saying it about the company:\nYou're replaceable. You claim to have \"benefits\" but who doesn't nowadays? I can work wherever will hire me, if I choose to. I  don't have to work for you personally, I can work for someone else. You're not unique or special.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'Isn't this the inevitable outcome of capital accumulation though?  This IS capitalism, this is how it works.\nAs capital concentrates in the hands of a few, their interests outstrip the interests of the employees, the consumers, and society as a whole.\nThe company that acquired you was working within a capitalist framework.  I'm unsure how this \"isn't capitalism\".'"
    ]
}