{
    "username": "series_hybrid",
    "contributions": [
        "In response to 'Under the union rules, overtime is strictly voluntary. They can't tell me to work overtime, let alone ask me', a user said: 'This is supposed to incentivize the companies to hire more people instead of overworking a smaller crew.'",
        "In response to 'Today's favor is tomorrow's obligation.\nIf a hero sticks around long enough,  eventually, often through no fault of his own, he gets to see himself become the villain.', a user said: 'True. You work a dozen Saturdays and then...one week you don't \"sign up\" to work Saturday, and then they say \"why didn't you agree to work Saturday? we already planned around you being here?\"'",
        "In response to 'It’s like climate change.  Don’t ask someone if they believe in it, ask them if they understand it.\nAnyone who says “I don’t believe in inflation” or “I don’t believe in climate change” is really saying “I don’t (want to*) understand inflation / climate change.”\nedit, at suggested of\nu/Magnus56', a user said: 'The boss believes in, and understands inflation. He openly says he doesn't believe in it to establish the company talking points.\nIt's like a Russian general telling Putin that the war is going badly, and he needs more troops and more equipment. Putin responds that the war is going just as he planned, and the general will accomplish the set goals or the general will be promoted to a position in Siberia.'",
        "In response to 'I was a supervisor at an automotive plant where the quota production goal increased almost every quarter. This was because some of the try-hard supervisors would continue to run the machines through prescribed break and lunch times, without any positive incentive other than to be \"that guy who never stops working,\" and reach 108%-110% of their quota. I had several arguments with them, which eventually turned into shouting matches, about how eventually quota is going to become unobtainable and its going to be their fault.\nOf course, I was an idiot for thinking this. I quit there a while back and goals were already getting unobtainable in multiple areas and the company was having processes that needed 2 people to maintain quality control and efficiency worked by a single person.\nThere were tons of quality mistakes, but of course that was the lowly production line workers fault and not management stretching them too thin. Oh, and unionizing was actively discouraged and we were told \"corporate will pull out of this location\" if we tried.', a user said: 'One of my responsibilities in maintenance at my current job is mowing grass  a couple days a week in the spring/summer/fall. Last year we had a series of events that kept putting the first mow of the year back farther more days. Finally we had a sunny day, and the mower was working, and my other work was caught up.\nThat morning, my boss said THREE TIMES that I was really going to need to hustle, to get everything mowed as quickly as possible, since the grass was taller than normal and ragged looking.\nSo I bust ass, and I get the whole thing mowed in a couple days, even though it was a jungle. He goes to inspect, and all he could say is how poor the quality was (it was sh!t). First of all, this mower was not made for tall grass, and it would take a couple of mows before it looked professional.\nSecondly, he knew it would look good eventually because he was familiar with my work, and I told him it would take a while for it to look good.\nNow he has shot himself in the foot with me. I will go over each section until it looks good, and the other sections will be tall and ragged until I get done with the previous section. This is going to drive him nuts, because he sincerely believes I have been skating along and taking it easy, and he wanted to prove to me that now he knows I can do it good in a short amount of time.\nYou can have it fast, or you can have it good. I cannot break the laws of physics, nor will I pretend that I can.'",
        "In response to 'And aside from pay...what about health insurance? My health insurance hasn't changed in 10 years but the cost of health related services has exactly doubled. So my health insurance covers half of what it used to.', a user said: '\"Thanks for the thousands of dollars you have paid us every year out of your paycheck, and also your employers contribution, but...we are afraid this current illness is not covered by your policy\" -Your companies healthplan rep'",
        "In response to 'The thing is, Muhammad, it's not that I'm lazy, it's that I just don't care. It's a problem of motivation, all right? Now if I work my ass off and the Taliban beheads a few more infidels, I don't see another Afghani; so where's the motivation?', a user said: 'By the beard of the prophet, these TSP reports must have the proper cover sheet...'",
        "In response to 'I can see the UK doing that', a user said: 'The receptionist Pam has such pretty eyes. I wonder what she looks like under her burkha?'",
        "In response to 'Have you seen my stapler?', a user said: 'May peace be with you, brother, but...this is not your stapler.'"
    ]
}