{
    "username": "SerialMurderer",
    "contributions": [
        "In response to 'Because genZ is done with their stupid parents. Religion is losing traction as it's a massive scam. So many religions because it's such a good scam on dumb people', a user said: 'There are plenty of left-leaning Christians from liberal Christianity to Christian socialism. The historic abolitionist, progressive, and civil rights movements often drew from religious thought and swelled from Christians in their ranks (Muslims and religious Jews too).\nReligion itself isn’t an enemy here. Conservative Christianity (and, of course, the abuse of religion) is. For the record, I’m not proselytizing. Or religious.'",
        "In response to 'I mean, let's remember that most people were religious (whether their belief was a non-interventionist divinity or some bullshit alien is a longer conversation) in those days so it's not really a big deal to say that both good and bad were historically done by religious folks. Developing nations tend to cast off the crutch of religion as they mature because it's an insane heuristic that isn't necessarily tied to reality, which causes problems down the road.\nI think religion\nis\nthe enemy. A particular instance of religion may not be bad in its current form, but give it one or two generations. It will become the conservative extremism that you think is the enemy. (Personally, I think we should figure out a different way to create communities that doesn't involve fantasies.)', a user said: 'That’s an okay-ish overarching narrative but it doesn’t seem to reflect the historical evolution of the U.S and I’m willing to bet that’s partly because of both non-conservative and conservative Christianity.\nI’m not sure I understand your angle or your conclusion. Religion has importance because it is prescribed importance by the religious. Whether “the religious” simply practice their religion or affiliate with organized religion is more analogous to culture than anything.\nFor that reason I’d consider myself both religious pluralistic and secularistic. Both religious freedom in a pluralistic society and the separation of church from a secular state are compatible.\nI’d go so far as to argue the removal of religion from the public sphere (ie. public policy) is as well. Secular civic organizations\ncan\neffectively perform the same important role that religious civic organizations have played throughout U.S history and today (and without contrarily hoarding wealth) but organized religions require the latter for their followers.\nWithout the voluntary abandonment of all religion (to a critical…\nmass\n), that’s not going to happen.'",
        "In response to 'Also, current aspiring entrepreneurs could implement profit-sharing, and we could copy Germany's system of having a split labor/exec board (checks and balances anyone?).\nI think there are lots of smart, well-intentioned people who are avoiding starting companies because of \"ew capitalism\", when they could be the start of  a massive labor reform movement.\nDo it, do it better, and customers and employees will notice.', a user said: 'I can see the headlines now.\n“Richest Man on Planet Earth Is Literally Stalin” In other words, money in politics would begin to backfire on the current system’s benefactors horrendously.'",
        "In response to 'At this point, it's fair to say companies are willing to sacrifice profit out of spite.\nBecause their control & power over us is of utmost importance. And they hate us & hate that the pandemic inspired us to ask for just a tad more.\nIf even Walmart admits higher wages at their stores has led to better outcomes... there is no excuse for these companies to be crying about quiet quitting when they give 2% raises & demand a return to office', a user said: 'Continued experiments with [X progressive thought] show positive results for everyone involved. Insert anything from better pay, fewer day or housing first.\nWhich we’ve known for a while now but they’ve gone ignored in actual policymaking or by corpos.'"
    ]
}