{
    "username": "series-hybrid",
    "contributions": [
        "In response to 'I prefer the phrase \"setting proper boundaries\" rather than \"quiet quitting.\" No one but the employer benefits if extra work or accommodations are given by the employee. Its well past the time that those boundaries are clarified - if you want more work, you get more pay, time off or bonuses. Period.', a user said: 'Someone is trying to redefine \"quiet quitting\", IMHO.\nQQ is doing the absolute minimum to avoid being fired. This includes \"slow walking\" tasks that are part of your actual job description.'",
        "In response to 'Quiet Quitting is just treating an employer the same way they treat you...but bad** , because it impacts rich people.\nno one \"quiet quits\" good jobs with quality employers.   Literally, thats what QQ boils down to, Its holding a mirror to the employer through \"work ethic\".   nothing more, nothing less.\n\\\n* As defined by rich people)', a user said: 'Pay shit wages, get shitty work-ethic.'",
        "In response to 'And let's face it, if an employee is committing an actual QQ, it's probably still the employer's fault.', a user said: 'how many times have we seen an employer say \"X\", and then as soon as the employee is hired, the company does not give them the promised raise, and their workload is increased.\nSomeone quits, and mmanagement refuses to hire a replacement, demanding that the remaining staff simply do more work in less time.'",
        "In response to 'I worked at a college where we had to write \"annual goals\"  ever year and submite them to our supervisors. This was a trick to make people willingly add things to our job descriptions.  I was burned out and stopped caring, so I submitted this as my (last) annual goals, \"Keep doing exactly what my job description says is my job.\"', a user said: 'but....but....dont you want to fight for a promotion that will never come, but is still dangled in front of your face when it benefits management?\nGood lord, you got free pizza on Friday last quarter. What more do you vampires want?'",
        "In response to 'Original Post: Quiet Quitting I monitor the AP email at work and get a lot of strange solicitations but this one really pissed me off.  It was an add for a webinar about ways to combat quiet quitting but their definition was ridiculous.  \"Quiet Quitting is when employees only do exactly what is expected of them never more\" how is this quiet quitting and not just doing your job. I'm both engaged and confused.  I'd heard the term before but never had it defined and man the revolution can't come soon enough!', a user said: 'The bosses are trying to move the goalposts. You don't get a touchdown unless you run 110 yards down the football field, not just 100 yards like those QQ assholes.\nA particular used car is \"worth\" $2,000, so seller lists it at $2200, and buyer offers$1800, with each side hoping the other side might be desperate for some reason...'"
    ]
}