{
    "username": "SethLight",
    "contributions": [
        "In response to 'Except \"quiet quitting\" isn't a thing. If you're showing up to work and doing the job you're paid to do, then you aren't quitting. You're literally doing your job. It's an incredibly arrogant, upper class American notion to think that everyone who works should necessarily go above and beyond what they are paid to do and come up with a derogatory term for people who don't.', a user said: 'It's called quite quitting because mentally you've already quit the job.  You're treating the job like it's perpetually your last two weeks as you do the minimum on everything.'",
        "In response to 'It's a corporate rebranding of work to rule. Work to rule as a concept has been around for decades.', a user said: 'Corporate rebranding is when they put a spin on something to change the focus on a topic like 'No one wants to work' or 'We have a labor shortage'.\nI fail to see where the spin is.'",
        "In response to 'You don't understand that labelling someone adequately performing the duties of their occupation based on the letter of the employment agreement as \"quiet quitting\" is an anti labor spin?', a user said: 'Ok, apparently there is some weird and wacky miscommunication here.\nIt sounds like everyone here is tweaked at the idea of  doing things out of scope of their job description.  Like if I hired you to wash windows and then they expected you to wash a table.  I don't agree with managers doing that, but that's not what I'm talking about here..\nIn my world quiet quitting is when you're literally doing the bare minimum and/or push things off till the point of catastrophic failure.  (Hell, literally what Homer is talking about)  You're washing the window, but you do in a sloppy way that is literally just enough to get the job done without being yelled at.\nOne is out of scope of what you do and the other is in scope but done in a sub par way.\nIt's bonkers people are not understanding the difference.'",
        "In response to 'No, you haven't. Doing the minimum that you are paid to do is still literally doing your job. Doing the minimum on everything doesn't mean you've mentally quit the job, you are still acting within the realms of exactly what you are paid to do. If that's a problem, then the issue isn't the worker, because (I want to keep stressing this) what they are doing still complies with their job description. The issue is that their job description (and associated job title, salary, perks etc) aren't reflecting the job that you need them to do.', a user said: 'Maybe it's a difference in what we do professionally, but there is definitely a difference in doing your actual job and doing the minimum to squeek buy in my field.'",
        "In response to 'This is the entire point. You've been convinced of some kind of work ethic value system that your company is exploiting. Have they ever paid you above and beyond the work you did? Then why tf should you do work above and beyond what they pay you for?', a user said: 'Ya... There is some miscommunication here and you're making a lot of assumptions.  I don't not do the minimum because of pride or satisfaction. I do what I need to so I don't give myself a bigger job and headache down the road.\nIf I did the minimum my systems would slowly go down hill and I (or some poor soul who would curse my name for doing the minimum) would have to scrap and rebuild our entire infrastructure as the entire organization is facing work stoppages.'",
        "In response to 'Found the boss', a user said: 'Lol I have no taste for management.  I don't like lying.'"
    ]
}