{
    "username": "SevaraB",
    "contributions": [
        "In response to 'true, im sorry i used the term (and used it incorrectly).\nI think that's the problem - the business im in has expected the hustle culture from the workers, and now they aren't getting it - so instead of adapting I believe we will all be fired and replaced with a MSP. It will result in DISASTER for the company, I'm sure... but that doesn't really matter for me cause ill be out of work. LOL', a user said: 'that doesn't really matter for me cause ill be out of work.\nThat's what your employer is banking on you to think- you'll be fine in this labor market if you have half a skill set. Your employer doesn't owe you anything, so you shouldn't feel like you owe them anything, either.'",
        "In response to 'Original Post: Anyone else's departments like completely falling apart due to people quitting / quiet quitting? We are a growing business, as such we went from supporting about 300 people and 100 servers to 1500 people and 200 servers, multiple office locations, and 1000 azure resources.\nOver the last two years, our sysadmin / cloud team went from 3 to 2, to 3, to 4 (for only a few weeks), to 3, to 2, to basically 1.\nThe candidates we are getting want 120k+ fully remote and aren't even that knowledgeable.\nInstead of letting me build a team how i see fit, and giving me a director role, the current VP and director seem to think we can just get through this... They are rolling the dice and think that it will get better by 2023 somehow.\nCompany implosion coming... which will probably result in me losing my job. HA.', a user said: 'Let me just leave this here; this site has salary data by state per occupation with job descriptions for each occupation. What your call \"support specialist\" or \"sysadmin\" might actually be creeping up into architect roles- it's on your employer to match the right salary to the right job description; they're the ones with the problem of expecting too much job for too little money.\nhttps://www.bls.gov/oes/current/oes_stru.htm#15-0000'"
    ]
}