{
    "username": "Severe-Ladder",
    "contributions": [
        "In response to 'It’s weird that there is a new term for having self respect and boundaries. But at the same time I’m glad more people are growing spines.', a user said: 'Right?! \nMy last few jobs I tried so hard. I went above and beyond hoping I would be appreciated but ultimately was tossed out like garbage as soon as it was convenient for people who failed upwards.\nI'm fucking done.\nIn fact, I know this is a long shot and probably yet another ill-advised pipe dream, but I'm going to start a business.\nI know the system is rigged, and that capitalism rewards the most those that exploit others, but the unfortunate truth in this society is that money is power.\nSo I'm going to exploit the weaknesses  of those that exploit their workers. The cards might be stacked against me, I know - but from my experience from working for these assholes is that many of them don't usually have things thought out too well.\nThere's no plan, or analytics, or God forbid actual math involved because most of their management is run by honest-to-God morons and most of their decisions are purely reactionary. If their competition were to intentionally target their weaknesses the whole shebang would collapse and they would have no idea how to react.\nSo I'm going to keep working. Bare minimum. Watching and learning and taking notes, scrimping and saving and eating rice and beans, and remaining completely invisible until I get all of the dominoes set up and all of the ducks in a row, and when the time is right bring them all to heel.\nAnd I'm going to do it all by maximizing the potential of my people instead of maximizing the potential of my short-term cashflow.\nNo more bullshit! I would rather provide fair pay and benefits and opportunity to my workers and fail then not. And there are SO many fat and stupid and juicy targets who have no fucking idea what is in store for them and all of their employees are tired of their shit.\nSorry for the rant, it went longer than it was supposed but I just typed all this shit out and I might as well press send because now I'm pissed.'"
    ]
}