{
    "username": "SGME_",
    "contributions": [
        "In response to 'Det har ingenting med \"quitting\" å gjøre heller. Det er et tullete begrep laget for å gi negative konnotasjoner til det å ikke yte 110%.', a user said: 'Uten å vite helt sikkert har jeg inntrykket av at quiet quitting termet er amerikansk. Der er det velkjent at mektige amerikanske kapitalister og store organisasjoner gjør alt for å undertrykke arbeiderne for å få ting som de vil. Ergo å gi negative konnotasjoner til folk som ikke godtar deres skamdårlige arbeidskultur.'",
        "In response to 'Dette er litt av det jeg oppfatter som problemet med de som \"støtter\" quiet quitting.\nDet er ingen ting som heter ekstra arbeid innenfor samme arbeidstid. Man får betalt for tiden man er disponibel for arbeidgiver og skal levere en eller annen form for arbeid i det tidsrommet. Hva bedriften anser som riktig menge arbeid kan i mange tilfeller diskuteres, men det er ikke som at man har rett til å bremse opp mot slutten av dagen fordi man synes man har produsert nok.', a user said: 'Det du sier er (delvis) riktig men her tror jeg også det er viktig å annerkjenne diskrimineringen som fremtrer i arbeidslivsrelasjoner. For ta et personlig eksempel på slik diskriminering opplever jeg at alderen min og tilværelsen som student gjør at min avdelingsleder har andre forventninger til meg enn det han har til andre arbeidstakere. Jeg opplever å få flere og «dårligere» arbeidsoppgaver enn andre eller at jeg blir ringt på ubekvemme tidspunkter for å bli spurt om ekstra vakter (grytidlig på morgen eller i helgene).\nArbeismengden jeg føler jeg må kompensere for når jeg er på jobb som andre i samme stilling (med høyere lønn) ikke må, gjør jo at når jeg ikke er på jobb så vil jeg heller ikke ta på meg noe «ekstra». Jeg får jo uansett ikke høyere lønn eller blir promotert på noen vis for det ekstra jeg legger inn. På den måten kan man jo si at for min del så er det en sammenheng mellom arbeidsmengde når du er på jobb og villigheten til å strekke seg lengre når du ikke er på jobb.'"
    ]
}