{
    "username": "SHABDICE",
    "contributions": [
        "In response to 'I'm not sure why the word 'quitting' is even in there.  I'm not quitting (i.e., leaving) my job, I'm just not going above and beyond for an employer that doesn't respect my personal time.', a user said: 'That's why most job descriptions now have \"other duties as assigned\" somewhere in the mix.\nThat way anything the job/company/boss asks you to do is, in fact, in your job description.'",
        "In response to 'And I'll strike that part out of any work contracts I sign.', a user said: 'That only works if you have a job contract that's enforceable. Most places in the US don't have contracts that are legally enforceable from the workers standpoint anyway.\nMost places that I have personally worked, hiring is contingent on signing the job offer as is, which always includes the phrase \"other duties as assigned\".\nIt wasn't until about 6 months ago that I even learned that job contracts were a thing, much less working to an explicitly stated set of duties that didn't have extra shit built in for whenever management wants.\nMy particular industry doesn't allow for strict job duty lists anyway. Sometimes it's chaos, and all you can do is try and manage the chaos, which will often includes things like disaster response, which can't exactly be codified into a list.'",
        "In response to 'Anything can be codified into a list, you just need better listwriters.', a user said: 'It me.\nI'm the list writer.\nI'm not trained for this stuff.....'",
        "In response to 'And I'll strike that part out of any work contracts I sign.', a user said: 'That only works if you have a job contract that's enforceable. Most places in the US don't have contracts that are legally enforceable from the workers standpoint anyway.\nMost places that I have personally worked, hiring is contingent on signing the job offer as is, which always includes the phrase \"other duties as assigned\".\nIt wasn't until about 6 months ago that I even learned that job contracts were a thing, much less working to an explicitly stated set of duties that didn't have extra shit built in for whenever management wants.\nMy particular industry doesn't allow for strict job duty lists anyway. Sometimes it's chaos, and all you can do is try and manage the chaos, which will often includes things like disaster response, which can't exactly be codified into a list.'",
        "In response to 'I think quiet quitting applies to white collar workers with minimal supervision who get to fuck off at work all the time, so no one notices.\nI slack off for a week, I'm gone, and the landlord puts me outside. The job description doesn't matter. It says right in there \"... and whatever other duties your supervisor assigns to you,\" meaning, whatever the fuck they want.\nThey wanna pull me off my desk and have me go pick in the warehouse? That's what happens.', a user said: 'I was waiting for this response.\nI'm 40. Every job I've ever had was one with \"other duties as assigned\" in the job description. That's what happens when you don't have a degree to leverage.'"
    ]
}