{
    "username": "shadow247",
    "contributions": [
        "In response to 'Which is why people only do minimum work. You want people to work harder? Give them a stake in the profits.', a user said: 'I never worked harder than when I was on commission....\nMy paycheck was directly tied to how much I worked...\nI usually had more work than I could even handle, so it was just a matter of doing the work to get paid..'",
        "In response to 'As a purchaser it's fun to use \"You get what you paid for\" when talking through the price of a machine or upgrade and management quickly approve the extra expenses. As soon as you talk about staffing or personal issues and use the same comment they do mental gymnastics to try and make it not the same.', a user said: 'All people are exactly the same.  The amount of money I pay should have no bearing on how hard they work! - CEO of Schmucks.com'",
        "In response to 'I'd say that describes quiet quitting. Soft quitting, as described by the article, seems more like what happens when you attempt to genuinely buy in to the company's mission, only for them to wring you out like a rag again and again. Jaded, disillusioned, cynical; these are the qualities instilled by corporate management culture.', a user said: 'Thos right here.\nGet hired.  Told I will be up for a promotion in 6 months.  Took 1.5 years.  Been there 6 years, applied for over a dozen roles that I'm qualified for... still in the same position I was 6 years ago...'",
        "In response to '[Deleted or Empty Comment]', a user said: 'Yeah when I got that Meets Expectations after being put on the worst work all year, making the 2nd most phone calls and having the least # of complaints in my unit...\nDespite being told all year how great I am doing, how my performance is great, and that I'm on track to exceed expectations....because I exceed every Metric...\nI was justifiably placed in a position to stop giving a fuck.  Then when they laid off 75 people, none of which have performance issues, I really stopped caring.'",
        "In response to 'Original Post: New type of quitting discovered \"Quiet quitting is easy to identify; employees who are quiet quitters visibly reduce their effort and avoid going the extra mile. Soft quitting, on the other hand, happens quietly over time. Employees don’t necessarily reduce their work output, but their enthusiasm fades, their curiosity dwindles, and their emotional connection to their work diminishes.\"\nThe cure is to lick the boot harder.', a user said: 'I do exactly what I'm paid to. No more.  Enthusiasm costs extra, and they have the balls to give us 2.6 percent raises for meeting expectations, and a 2.9 percent for exceeding...'"
    ]
}