{
    "username": "ShakespearOnIce",
    "contributions": [
        "In response to 'Original Post: Reddit was so hot on \"quiet quitting\" but now when you talk about using slowdowns to interfere with the fascist takeover, all you hear is crickets We are at a pivotal moment, where either we choose to plunge the system into darkness on our terms temporarily, or the oligarchs drive the system into darkness on their terms for the foreseeable future.  And yet, so many people seem willing to just continue, business as usual, even as our protections (worker protections, immigrant protections, social services) evaporate before our eyes.\nThe ruling class may own the companies, but the working class still runs them, and we have a chance to use that to help ward off the darkness.', a user said: 'If you want to sabotage the fascist machine at work you need to work for the fascist machine\nYou're not gonna like to hear this but if you really want this to work you're gonna need to scrub your existing social media presence and start posting slurs on Twitter so you fit in with The Boys and can get a job at DOGE where you can actually start sabotaging the fascist machine'",
        "In response to 'The rich feel pain from many directions, because their assets are not in one basket', a user said: 'Please explain to me how slowly stocking groceries at Wal Mart helps prevent Congress from passing a law abolishing OSHA'",
        "In response to '[It's weird, 99% of the time people complain about how rich people have Congress in their pocket, and then suddenly posts like this come up and they forget]\nBut yeah, if it ain't stocked, you ain't selling.  And if you ain't selling, you ain't making money.  And if you ain't making money because people are protesting, you're going to start listening to what they're protesting about, and you're going to try to fix it so you can make money again.', a user said: 'President Musk and his cronies have done more damage to the pocket books of the wealthy with tariffs in a week than I could hope to in the rest of my life'",
        "In response to '', a user said: 'Stop expecting to get more than you pay for. You want extra, pay for it.'"
    ]
}