{
    "username": "shapeofthings",
    "contributions": [
        "In response to 'Original Post: How many of you have \"quiet quit\" and when did it start for you? I got to say for me I quiet quit my last job 5-6 years into it after realizing I didn't have a future with that company, but I never left because I was at least getting paid and now have a decent savings account because of it. I legit started my new job early this year and I've already quiet quitted. I hardly do the bare minimum since I gave them a whole summer of hard work and not a single fucking praise. Or even any kind of \"hey keep it up you've been doing an awesome job\". The moment I make a mistake I feel like it destroys everything i worked hard for so what's the point anymore? I'm just going to keep working enough so I don't get fired, but if I do I doubt I'll be upset over it. It also just seems the way 2023 has went if the economy and housing market continues to stay awful next year I can already see people quiet quitting for 2024 and it hasn't even started yet!', a user said: 'Stop using their stupid pejorative expressions. You're working to rule, or acting your wage. When you go above and beyond do they pay you more than what you would have earned in overtime? No, so stop giving them free labour, give them exactly what they pay for.\nThere's nothing wrong with doing that, stop buying into the bs idea that you are doing something naughty.'",
        "In response to 'Original Post: funny that quiet quitting is even a term... [External Link]: https://i.redd.it/7tpkh1cisgj91.jpg', a user said: 'It's a made up pejorative term for working to rule.'",
        "In response to 'Original Post: I've been \"quiet quitting \" for a week and have never been more relaxed. I work in a high stress medical setting and have been for 8 years now. I've always been talk to go above and beyond for work. Over the last 4  years I've been increasingly burnt out and my paychecks do not seem to match my effort.\nHowever this past week, after a particularly nasty mental breakdown a few weeks ago, I've been doing the bare job requirements and it's been lovely. I now feel like I have more energy for my life outside of work, and more energy to further myself personally.\nRemember it's only a job, do what you have to and clock out.\n***edit: as many have said it's \"acting my wage\" I was using \"quiet quitting \" ironically', a user said: 'FFS stop calling it quiet quitting, it is spreading this inane idea that doing your job and keeping to what is contracted is not sufficient. Working is a two-way relationship, and the employer is paying you for your time to perform specific functions. If you are doing what is contracted you are fulfilling your responsibilities and this should be more than sufficient for any employer. I am sorry about your breakdown, but it sounds like you are on your way to rewiring this toxic \"we need to overperform constantly\" propaganda!'",
        "In response to 'Original Post: Guys, did you realize quiet quitting was over?! [External Link]: https://i.redd.it/6357ek17i7w91.png', a user said: 'What is this quiet quitting thing? Oh, working to rule? Hate to break it to you, not a fad, it's as old as the cavemen.'"
    ]
}