{
    "username": "Shigeko_Kageyama",
    "contributions": [
        "In response to 'The kids are alright', a user said: 'No, not really. Things have been on decline for a while now, a couple generations.'",
        "In response to 'Can you elaborate? How, specifically, are entire generations inherently worse than previous ones? And how is the next generation even worse, as was claimed by original commenter that I replied too?', a user said: 'The silent generation thought that the boomers were a bunch of whiny hippies and they had a point. Growing up the way they did gave them a great respect for what stability they could find in social structures. Boomers thought that gen X was a bunch of whiny slackers and in some ways they had a point. A lot of the hard work of social change had been done, the boomers had grown up in post war prosperity, and they couldn't understand the ennui of gen X. Gen x thinks that millennials are self centered and we kinda are. Gen z, whether we want to acknowledge it or not, is being pretty thoroughly fucked up by web 2.0 where you have to be on all the time, there's no escape from whatever your phone feels like spewing at you, and social media is creating more problems than the traditional media ever did.'",
        "In response to 'There is an escape from your phone spewing things at you. Just turn off notifications on all social media apps. It takes the willpower to set aside the fomo and do it, but that's all it takes.', a user said: 'They don't do that because of FOMO. Everything about their lives is on that phone. Friends, family, hobbies etc. It's not like before when people called or texted to set something up. A lot of them have never even hung out with someone IRL outside of school.'",
        "In response to 'ur trippin, zoomers absolutely hang out with friends outside school and are generally more annoyed about the fact that their whole lives are on the phone than anything', a user said: 'IRL Hangouts have been statistically down for a while. It comes from a combination of the prevalence of the instant dopamine machines in our pockets and downright draconian loitering laws.'",
        "In response to 'Are you actually a teacher? Don’t you see how irrational it is to characterize an\nentire\ngeneration, tens of millions of people, as “lazy slackers” or “whiny hippies”? These characterizations aren’t based in anything tangible, just vague feelings and emotional reactions to things that are different.\nWhy did you start with the silent generation? Is it possible that the greatest generation had negative opinions of the silent generation? What about the generation before that?', a user said: 'Long term sub. I'm saying that's the general consensus. Obviously the people taking surveys, giving them, writing retrospective books, writing documentaries, and the individual people I've spoken to have not had time to get up close and personal with every single living human being on the planet. I started with the silent generation because that's the oldest person I've ever spoken to, my great grandmother, and her friends. I can go back further but I'm going to have to get back to my reference books for that. I'm not really that into that period in social history. But yeah, off the top of my head I know that a lot of people had problems with the excesses of the 1920s. The loosening social and sexual mores, changes in fashion, changes in leisure time, and the decline in church attendance among city people really upset a lot of older and more conservative people. A lot of young people too. Not every woman in the twenties was a flapper. The flappers did upset a lot of women though, and a lot of men thought men in the '20s were becoming weaker too due to increased leisure time, more appliances, the beginning of convenience foods etc that's just what I know off the top of my head. I'm going to have to refer to my social history books for something deeper.'",
        "In response to 'So is it likely that\nevery\ngeneration, to some extent, had criticisms of the generation following them? Does an older generation criticizing the following generation necessarily mean that said generation “declined” from the previous one?', a user said: 'They were valid criticisms. We have been on a decline for a while. Just because somebody has a criticism that doesn't mean that they're spitting into the wind. Bloomers really did have less of a respect for social systems. Gen X really did have a lot of unearned ennui. We millennials are pretty damn self-centered. Gen see really does have shrinking attention spans. These have been real problems.'"
    ]
}