{
    "username": "shinobinc",
    "contributions": [
        "In response to 'Original Post: My cousin is SFPD and has the same take on the bikers. Are we basically just paying them 3/4 $billion a year to cry and quiet quit? [External Link]: https://i.redd.it/uhdkr8xy39ld1.jpeg', a user said: 'Yes, you are, but SFPD also has a point. The DA probably won't prosecute all but the most violent (or notorious) crimes, because the DA knows the judges here will not convict. Indeed, they might not even timely schedule the trial and then force a dismissal of the charges.\nhttps://www.nbcbayarea.com/news/local/san-francisco/criminal-cases-in-sf-dismissal/3626171\nI'm not a fan of the way SFPD is failing in its mission, but I can understand how demoralized they'd be with endless catch-and-release.\nEDIT: Yes, yes, juries convict and judges sentence, but SF juries and judges alike show a disposition against either.'",
        "In response to 'No, they don’t have a point.\nI\nknow\nthat some VP or Product person is going to scrap 85% of what I work on in a given quarter. They’re going to say “we’re pivoting to meet new customer needs” or “this project has to be flexible to adapt to changes in technology” or some other bullshit.\nI still do my job. I can’t tell my manager “I’m not going to work on X because VP Asshat is going to change his mind in 4 months anyway”. I just do my job, and collect my paycheck.\nI understand that police put their own health and safety in jeopardy, but that’s what they signed up for. Their role in the executive branch of government is fair and equal enforcement of the law.\nIf they want to collect high 6 figures and do fuck all then they should apply for a director role at my company.', a user said: 'First of all, if you think you can get a high paying job without having to work, nothing's stopping you from signing up for SFPD! High pay! No work! Well, they're hiring. Go for it.\nSecond of all, there's waste and incompetence and poor performance in the private sector (and god knows the tech sector) *every day*. You think the phrase \"quiet quitting\" arose to describe SFPD? People act entitled everywhere, and people only respond to incentives everywhere, not just SFPD.\nAnd entitled/lazy/mediocre behavior in the private sector only gets largely washed out when macro conditions intervene to force the hard employment choices. Lots of people in the private sector and public sector alike \"do their job\" but many if not most fail to do it well.\nAnd most private sector employees can get away with C- performance until the economy no longer allows it. (Unless you think everyone in the tech sector getting laid off since 2022 suddenly got incompetent or magically became 'underperformers' once interest rates rose.)\nSo, there's mediocre performers in the private sector who get away with it and there are mediocre companies within the public sector. But that kind of mediocrity or poor performance in the private sector rarely leads to a crisis in public safety. (But cf. Boeing.)\nYou want SFPD to act better? Find a way to incentivize them, but complaining about SFPD on Reddit ain't gonna do it.'",
        "In response to 'I would give them the benefit of a doubt if they hadn’t cried the same thing when the police union wanted Boudin gone. “He won’t do anything to allow us to do our jobs!” They cried. Boudin has been gone for years now and look at that, the SFPD still can’t do their jobs.', a user said: 'I'm not defending the SFPD. They can do their jobs, and they're paid well to do so. But it's not human nature _anywhere_ to do a job well simply because you're paid well. People do a job well if they fear the consequences of not doing the job well. And SF does nothing structurally to incentivize the police department to do their job well.\nThis is a common problem everywhere of course, but it takes political will of the VOTERS to change things. Expecting SFPD to just get an attitude change because it's \"the right thing to do\" is naive beyond belief.'",
        "In response to 'Judges don't convict.  Juries do.  Judges can toss cases, however.', a user said: 'Yeah, it was not juries who recently dismissed 70 criminal cases over the SFDA's objections, and it was not juries who blamed the SFDA's office for failing to \"prioritize cases appropriately\" (i.e., daring to prosecute misdemeanor cases in addition to felonies):\nhttps://www.dailyjournal.com/articles/380422\nWhether the problem with the SF County Superior Court system lies with ideology or sheer administrative incompetence or both (hint: it's both), the point is that the blame doesn't all fall on SFPD's shoulders.'"
    ]
}