{
    "username": "ShouldNotBeHereLong",
    "contributions": [
        "In response to 'We are traveling around upstate new York right now and it seems like every business has a help wanted sign in the window. Went into a \"Marshalls\" and they didn't have any winter shirts on the racks because \"they couldn't get the people\"\nMaybe having all the housing in a tourist area booking at tourist prices is a part of the problem.', a user said: 'I see the same thing living in northern VT.\nThe rise of VRBO/Airbnb has had a huge impact on housing here.\nDuring Covid, upstate-NY and northern-vt were labeled as highly desirable places to get out of the city. The portion of remote workers in these areas has gone way up. Those people contribute to housing and service demand, but do not contribute to the local workforce. Likewise with retirees. They don't contribute to the workforce but do increase demand for services locally.\nLast thing I'll mention is that the start of school took many part-time workers out of their jobs and back to campus.'",
        "In response to 'Which seems strange to me. I work at a stadium. We are offering $22/hour and getting NO applicants. Granted, most people see it as temporary (just during the season) but we are booked with catering plus the company will fly you around the US to help at one of the 300 other stadiums or other facilities we have contracts with.', a user said: '$22/hr is no longer a huge amount. Stadiums are located in populated cities/regions that generally demand much higher wages in account for cost-of-living.\nThe travel can become a difficult sell if a person is valuing life-work balance.\nDoes the job offer any sort of career path in the industry? Seasonal work generally does not, and it requires the applicant to get right back on the job hunt wheel out of season.\nDifficulty finding applicants makes sense to me.'",
        "In response to 'Exactly. Most Americans surveyed believe the economy is much worse than the Fed or media is admitting. This is due to cost of living beyond wage appreciation. Couldn’t image the majority of people feeling unhappy about their finances while simultaneously voluntarily cutting back on their paid hours or paying jobs.', a user said: 'I agree with your statement.\nCouldn’t image the majority of people feeling unhappy about their finances while simultaneously voluntarily cutting back on their paid hours or paying jobs.\nI'd be interested in seeing a survey of those who've reduced hours. Why are they doing it? How many have childcare or eldercare obligations whose value outweighs that of their wage/salary? How many are just doing it to pursue hobbies or under-the-table work outside of their primary employer? I am very interested in learning more about the dynamics at play here.'",
        "In response to 'We don't see the lack of workers in middle management and up. It's all entry level management and below.\nThe retirement wave pulled everyone up a couple rungs in the hierarchy. Coupled with the closed borders for a long time, the ensuing lack of labor drove the price of those jobs up where it could. Construction workers and kitchen staff saw huge increases in wages. Custodians, not so much (people just decided to put up with dirtier offices, or didn't need as much custodial with people not returning to work).\nBut then we had this hybrid situation thing, and I'll be 100% honest- people working from home are not nearly as productive as people in the office. It's not even close.\nAnd everybody wants to do it. Probably because you don't have to work that hard.', a user said: 'But then we had this hybrid situation thing, and I'll be 100% honest- people working from home are not nearly as productive as people in the office. It's not even close.\nThe studies I've seen about this have been contradictory - some show decreases, other show increases, and some show no change at all.'"
    ]
}