{
    "username": "showmenemelda",
    "contributions": [
        "In response to 'Original Post: I think my remote team mate is quiet quitting And it's ticking me off. Need advice if I should say something?\nMy team is fully remote,  spread  across the US. Our individual and team metrics are tracked by the amount of tickets we process on a weekly basis. This is a FULL time job and I've found that a member of our team is only logging about 4 hours a day - if that! Meanwhile, the rest of the team is putting in 9 hr days just to keep up with the volume.  We've also had to log in and work the last two Saturdays just to clear the backlog.  If this person would just work a normal day,  it would lighten the load on each of us. Our manager hasn't seemed to notice that this  person's \"numbers\" are half of what the other team members are producing. Do I speak up or keep my trap shut,  silently seething all day?\n**Thank you everyone for your input! I'm not going to do my managers job for them,  if they don't care,  I won't care either.  I'll hit my targets and focus on my career advancement in 2025.', a user said: 'You didn't have to specify you're in the U.S.—we already knew because other developed countries probably don't have skeleton crews that breed animosity and disdain for someone following their heart.\nI hope your new group insurance plan has decent mental health coverage. Lots to unpack there.'",
        "In response to 'your job isn't to manage your coworkers.\nthis shouldn't even be a question', a user said: 'It's giving, \"I've never been let down by others on a group project because I was homeschooled\" /s'",
        "In response to 'Completely agree. But just to be fair to OP, they did say that it was affecting them and forcing them to work more to make up for the slack. That’s why it’s not a completely unreasonable question.', a user said: 'That might be a time to ask to clarify duties as assigned and ask for a raise or something. Don't dog your coworker.\nIf they have an accommodation it's no one's business. And if they are struggling with health or otherwise, they probably\nknow\nthey're letting everyone down which is a shitty feeling too. Third scenario is they're a lazy a hole and they won't care—and then you've also aliented things.\nMakes me appreciate not having to work in a collaborative setting going on 10 years. I am like Brooks from Shawshank—I fear I could not assimilate.'"
    ]
}