{
    "username": "Significant_Sky_3142",
    "contributions": [
        "In response to 'Original Post: Quiet quitting Me male HL wife LL Have you reached that stage ? Quiet quitting not leaving because of kids or what not but just quitting on the idea of romance in your head letting go of the resentment for your own mental health  and accepting that she’s just a roommate now ? We had yet another talk yesterday about it which she acknowledged the situation made promises again and that night it was just heavy snoring, told her today that I’m disappointed that our discussion led to no improvement even after her promises she said but we both agreed to make efforts ( because yeah I turned LL4U after all this time) I told her it’s ok I don’t even want to talk about it, I’m not even pissed as usual , she’s snoring as I’m typing this next to me and i don’t even care i don’t want her anymore and the sad part is the idea of getting to this point used to scare me but now I just don’t care, I don’t even think I love her anymore just that I’m used to her.', a user said: 'My wife keeps calling it the roommate phase. She's snide and nasty about it. Always some little snide comment like thanks roomie or some shit like that. I've explained it's just off putting to me and really kills any desire I have to even want to initiate. In my mind there is just going to be some kind of remark about any touching etc.\nEarlier tonight I come home from.work..she says hold out your hand...and says hi roomie..I lean in for a kiss in a playful manner and get the dont touch me speil....instantly  killed any type of desire I have.\nIm eating dinner alone, as she's in the bedroom, probaly playing some game on here phone. Got the dont talk to me, dont come near me Yada yada...\nJust venting....'",
        "In response to 'Keep bringing it up to her is as off putting to her and is likely to kill off any desire she may have', a user said: 'Well that's the thing....I dont bring up the issue. It's always her complaining  about my not initiating, the snide roomie remarks, then I try for a kiss or a hug and it's the dont touch me thing....I'm fucking over it..why would I want to initiate with that shit going on'",
        "In response to 'This sounds possibly abusive.', a user said: 'In what way?'",
        "In response to 'Asking you to initiate more and making snide remarks when you do. Calling you roomie after asking her to stop.', a user said: 'Ok..gotcha now..'"
    ]
}