{
    "username": "SignificanceNo6097",
    "contributions": [
        "In response to 'Original Post: Quiet Quitting is the only response acceptable to Quiet Firing [External Link]: https://i.redd.it/rhhn62s8a13e1.png', a user said: 'The simple answer is pay them better but that’s always the last thing they want to hear.\nAlso, it is actually counterproductive to work harder than you’re paid. Cause if your employer is already getting the job of two people from you for min wage, they have no incentive to hire anyone else. And it is possible to make yourself too valuable to promote. It might be more profitable for them to keep you in a lower position that you’re already overworking yourself in than promote you and have to find someone who won’t be as profitable in that same position.'",
        "In response to 'You're right, but there's more to it.  The only thing that incentivizes rewarding employees for \"working harder\" is the threat that they might leave and take their high output elsewhere.  They'll pay you your\ncost of replacement\n*\nrisk of attrition\n.   If you're busting ass for a promotion, you have to also be ready to jump ship. Good career advice is to make it clear to your manager or leadership that your goal is to be at this higher level, that it's important to your professional development and to be recognized for elevated work.  Ask what they would need to see from you to make this happen this year, and get yourself on the right projects to prove your value.\nVery few companies will proactively look in the market and say \"You know, if person X went to our competitor, they'd make 15% more money.  Let's keep them happy here and just pay them now.\"  It's almost always the case that you would need a competing offer to be matched.\nIf you get 6, 9, 12 months down the road and there's no progress, you have projects you can discuss in detail to your next employer on the interview for the position you're trying to get.  This happens all the time.\nAlso there's this notion that taking a competing offer to your company is a death knell.  I think that's only true if it's surprising to them, see above about being transparent with your goals and make that a quarterly conversation.  I've done this and stayed at the company happily for another 2 years. If you like your job/team/company and want to advance there, this is the best way to do it.  You might not want to play the game, but they absolutely will be, in which case they will just be playing you.', a user said: 'That’s a pretty good strategy.\nI think it will always depend on the position and type of job you’re working at. It would also require management to have that kind of proactive mindset. In min wage retail kind of jobs, for example, it’s rare you will get that kind of forward thinking. Some employers do not look at the big picture and they’ll forever wonder how they can’t make good workers stay for long.'"
    ]
}