{
    "username": "SillyManagement6",
    "contributions": [
        "In response to 'Well that's the thing....I dont bring up the issue. It's always her complaining  about my not initiating, the snide roomie remarks, then I try for a kiss or a hug and it's the dont touch me thing....I'm fucking over it..why would I want to initiate with that shit going on', a user said: 'This sounds possibly abusive.'",
        "In response to 'In what way?', a user said: 'Asking you to initiate more and making snide remarks when you do. Calling you roomie after asking her to stop.'",
        "In response to 'Original Post: Quiet quitting Me male HL wife LL Have you reached that stage ? Quiet quitting not leaving because of kids or what not but just quitting on the idea of romance in your head letting go of the resentment for your own mental health  and accepting that she’s just a roommate now ? We had yet another talk yesterday about it which she acknowledged the situation made promises again and that night it was just heavy snoring, told her today that I’m disappointed that our discussion led to no improvement even after her promises she said but we both agreed to make efforts ( because yeah I turned LL4U after all this time) I told her it’s ok I don’t even want to talk about it, I’m not even pissed as usual , she’s snoring as I’m typing this next to me and i don’t even care i don’t want her anymore and the sad part is the idea of getting to this point used to scare me but now I just don’t care, I don’t even think I love her anymore just that I’m used to her.', a user said: 'I've been this way for over 2 years.\nI've started to miss physical connection, so I've decided to start initiating more physical contact, basically just more hugs. She almost never initiates hugs. I think it just doesn't cross her adhd mind.\nWe did have sex twice in a weekend while the youngest was having a sleepover. It was after I suggested \"just snuggles\" in bed, really not expecting more. For whatever reason she amped it up until we had sex. Maybe the same thing will happen in another 2 years...\nIt is what it is. Biding my time...'",
        "In response to 'Isn’t this abuse to withhold sex at this point ?', a user said: 'No. I don't think not wanting sex is abuse.'"
    ]
}