{
    "username": "Simple_Dragonfruit73",
    "contributions": [
        "In response to 'Since the pandemic provided opportunity for corporations to grossly inflate prices (in line with, but then far exceeding any supply chain disruptions) and reclaim and cement those higher prices by blaming a \"worker shortage\" which is actually just a failure to find workers to exploit for the previous underemployed wages.\nThis is a very Reddit/\nr/antiwork\ntake.\n​\nNo different than the car prices or house prices, labor cost what it cost based on demand and supply before the pandemic, and it went up because the supply shrank not because workers magically became better informed and demanding overnight. Millions of people left the labor pool overnight through retirement or fear regardless of what they were offered to work. The idea that they would have come back if they had just been compensated more is a fallacy. A lot of them were dead, or sick, or filling in for someone who was dead or sick, or taking new positions from the older people who were dead or sick. That disruption was not due to the wishful thinking about labor value.\n​\nCompanies had a tough time getting applications even at much higher wages, and big tech and many other industries are now shedding people who were hired during the pandemic to stop hemorrhaging, but were grossly overcompensated for the weight they were actually pulling.\nLots of sick time off, an environment of fear/paranoia discouraging people from showing up to their jobs, the lockdowns making shortages worse and demand higher, and work-from-home drops in productivity drove, in combination with the social movement of lying-flat and attempts at grass roots worker compensation movements that have already came and went, those drove big pay increases for new hires, drastically driving up labor costs, drastically driving up product costs, drastically driving up inflation.\nWe talk about 'record profits', but often the other half is ignored - the market is still competitive, companies are generally sticking to their % margins, but if you have a fixed % margin and a cost that doubles, your raw $ profit goes up even though you didn't do anything unethical or untoward.\n​\nWhat is happening now is the readjustment and normalization to the market back down. It's happening with houses and cars and labor now all together. It's expected to happen with profits and inflation as well.', a user said: 'I'm not going to shed a single tear for companies. Pardon my shamelessness and my \"redditness\"'"
    ]
}