{
    "username": "Sinsyxx",
    "contributions": [
        "In response to 'Original Post: Gen Z is quiet quitting because we've seen millennials suffer through economic hardship. Companies can't sell us a pipe dream. [External Link]: https://www.businessinsider.com/gen-z-quiet-quitting-work-ethic-millennials-money-struggles-2023-10', a user said: 'I love to see all the fun ways young people avoid calling themselves lazy. See\nr/Millennials\nexistential dread to see how it all plays out.'",
        "In response to '\"People define it differently, but to me quiet quitting is fulfilling your job responsibilities and contract hours without going above and beyond for a workplace that just won't love you back.\" -From the article.\nGoing above and beyond one's duties isn't rewarded. It becomes the expectation without very little in return. At a certain point the burnout becomes very real.', a user said: 'It’s not? I’ve built a career on it. Maybe it’s the bad attitude holding people back?'",
        "In response to 'Might have worked in your career, but your anecdote is counter to the data on burnout rates. It certainly isn't the norm nowadays.\nhttps://www.statista.com/topics/2099/stress-and-burnout/#topicOverview\nhttps://www.bls.gov/opub/btn/volume-6/pdf/understanding-the-labor-productivity-and-compensation-gap.pdf', a user said: 'Neither of those sources indicate that being a good worker is not being rewarded.\n“Going above and beyond” isn’t the same as being more “productive”. WFH may be more “productive”, but it’s a bad method of making a good impression on leadership as an example.'",
        "In response to 'Gawd, I am sure glad my bosses' definition of \"going above and beyond\" is different than yours.\nThis is where the dividing line in this discussion. Being productive should be the thing that gets you noticed. I staying over if asked. I am answering calls after hours if a system goes down. If there's new system l do everything within my scope to make that transition is seamless. I do this because I am relied upon by my coworkers. If I can make my life and theirs a little easier then the extra work is warranted.\nBy your definition I should only do these things to make a good impression on leadership. To get my face in front of the suits. I've seen plenty of people fail up only because they knew how \"make a good impression on leadership\" while not being nearly as productive as their peers. This is system most live in today and that has to change.\nI am not going reply to your next comment. I've already spent enough time on this discussion that will amount to nothing at the end of day.', a user said: 'It’s interesting that people who claim they only work for the paycheck also despise the tried and true method of increasing their paycheck. Soon enough the robots will do all the work anyways. It’s the people skills that are valuable'"
    ]
}