{
    "username": "Sitcom_kid",
    "contributions": [
        "In response to 'Came here to say this. Idk how people don't see the negative connotation of \"quiet quitting\" against the person using the term.\nIt's \"doing my job.\"', a user said: 'Exactly. Working to rule is working. It is not the opposite of working. I'm glad I'm not the only one who realizes the framing violation.\nGeorge Lakoff has entered the chat and wants us all to read (or reread) Don't Think of an Elephant. He says to frame the topic by calling it what it is, never by calling it what it isn't, to never once utter the term, even when quoting others. Every utterance creates a reality. I love Dr. Lakoff and I'm trying to follow this rule, if I can.'",
        "In response to 'The term “quiet quitting” needs to die a fast but painful death.', a user said: 'If we feed it silence, maybe it will go away'",
        "In response to 'You're not quiet quitting, you're Working To Rule, which means you are abiding to agreed upon terms. Our employers are trying to extract more out of us than we signed up for and not compensate us. There's nothing wrong with you not letting them exploit you.', a user said: 'Exactly right.'",
        "In response to 'Original Post: It's not called \"quiet quitting\" That little term is a rebrand of working to rule. It's a labor action been around for a long time where employees work exactly to the terms of their contract and that's why it's getting rebranded. Working to rule is a much harder term to criticize. \nAnytime \"quiet quitting\" is brought up, shut that shit down immediately. We need to undo this particular rebrand as best we can. Doing more than what you're hired for needs to stop, and it can't while people working to rule are being vilified.', a user said: 'I will start with my source and that is Don't Think of an Elephant by George Lakoff. Do not utter the words you don't want said. Do not even whisper them. Otherwise, they become more popular each time you say them, even in objection. The only words that should leave our lips (or our fingertips) are the ones we want said. So if you want to call it working to rule or working your wage, go right ahead. Don't say what it's not, say what it is. Because you can't tell someone not to think of an elephant, or they will think of one. Please note the two words that I did not use in this paragraph. Never use them. Ever. Do not give them life. Let the term be extinguished. And I cannot recommend Dr Lakoff's book or YouTube videos highly enough.'",
        "In response to 'Original Post: Quiet Quitting: What is it Really? Quiet quitting is a confusing term to me, but maybe I just don’t understand it. I have rarely ever given 120% to a job… maybe when I was fresh out of college when I had that mindset. But the years have jaded me. What people call “quiet quitting” (doing the minimum) is what I just call doing my job lol. It’s not like I refuse when they ask me to do more work (tho rarely do they ask), but I don’t SEEK more work out unless I’m just bored. For example, in my work, we work in Sprints and get assigned stories to do for those sprints. I just do those stories — not more or less — unless I’m just bored and have finished my stories weeks in advance, then I may grab a story for the next Sprint. I get paid by the hour so no work means no pay. But it’s not like I can ADD more stories to the current Sprint because someone else still needs to test them and THEY may not have capacity. So, a lot of times I just do things around the house since there always seems to be something to do at home. Have I been quiet quitting for years and just didn’t know it or is doing the minimum not really what quiet quitting is all about?', a user said: 'It is \"working to rule.\" I am hoping for the day when people call it what it is. I wish somebody would start doing that. Because working to rule is working, which is the opposite of quitting. And working to rule means doing exactly what is required but no more. At certain jobs, you can reduce what you're doing.'",
        "In response to 'It's not though, work to rule is an organized collaborative work slow down as a protest for working conditions.\nQuiet quitting isn't a thing. It a buzzword psychopaths coined to whine about people... Doing the jobs they were hired for. Unless someone's job description explicitly includes gojfnabove and beyond anything they do beyond their JD is an exception not part of their job.', a user said: 'I thought that was a slow strike. Not every strike stops work. But maybe it is another name for it.\nYou are right about the buzzword. It is still being used to say that people are doing the exact opposite of what they're doing, which is working.\nGeorge Lakeoff would say to never even utter or type a phrase like that. \"Don't Think of an Elephant.\"'"
    ]
}