{
    "username": "SixGunZen",
    "contributions": [
        "In response to 'Original Post: Quiet Quitting I monitor the AP email at work and get a lot of strange solicitations but this one really pissed me off.  It was an add for a webinar about ways to combat quiet quitting but their definition was ridiculous.  \"Quiet Quitting is when employees only do exactly what is expected of them never more\" how is this quiet quitting and not just doing your job. I'm both engaged and confused.  I'd heard the term before but never had it defined and man the revolution can't come soon enough!', a user said: 'I wish I could quiet-quit. In my job, what my job function is is frequently determined by what others believe it is. It's one of those job descriptions that's like \"and other duties as assigned\" which means, whatever the higher-ups need done. Fuck I hate my career.'",
        "In response to 'I’m right there with you.  I know what my skills are, and what they are not.  I was doing them well, and performing at a high level, for fair compensation, at my prior job.  Oh, I’d loved to have had more.  So, I was posed by a new employer to come to work for them for 25k more.  I positioned that to my then-current employer, asking not to be increased to that, but if I was worthy of an additional bump to stay on, especially in light of much higher cost inflation.\nThey declined.  I left.\nNow, at the new place, I’m getting absolutely ass-pounded daily, and learning first hand why turnover has been such a problem.  Yes, I’m paid more.  Which inflation just this year has also eroded.  And I fucking hate the new job.  Hate it.  Being asked to completely rebuild this shitty business, when I EXPLICITLY TOLD THEM IN ONE OF MY INTERVIEWS, that I am not looking for a job opportunity to recreate the god dam wheel.\nAnd I wore a dark blue tuxedo to that interview.  I’m not kidding you.  I own it.  It’s mine, and I haven’t worn it in 3 years.  I wore it to that 2nd interview.  And they hired me just after the 3rd interview.\nToxic.  Poisonous to my soul.  And I’ve been given the keys to this rattle trap carriage now, as of Monday, as the owner announced he’s sold the company to all 27 employees.\nPeople, this is my real life. Thanks for reading.\nEdit: delete dumb ass comment.', a user said: 'Please don't use the handgun, but please do quit that job. No amount of money is worth getting your spirit crushed every day.'",
        "In response to 'Crushed is correct.  The handgun joke needs to be deleted.  Moment of weakness.  I’ll remove that.  I’m sorry if it was insensitive to anyone.', a user said: 'I'm sure it's fine. Any reasonable person would be able to empathize with the sentiment and not take it literally.'"
    ]
}