{
    "username": "sjb_redd",
    "contributions": [
        "In response to 'I have a remote job where I literally work maybe ten minutes an hour. It’s fucking glorious. I don’t live for weekends. I don’t dread going into work.\nThis has been the best job of my life and not because I am happy and fulfilled, but because there is zero stress.', a user said: 'This is really interesting. I study this feeling in my PhD and believe we express happiness in paradoxical ways.\nYou say:\nbest job of my life\nIt's fucking glorious\nnot because I am happy and fulfilled,\nbut because there is zero stress.\nI don't dread\nIn Nicomachean Ethics, Aristotle wrote that ultimate happiness (which we frame as \"fulfilment/purpose\" of human conscious experience) is the fundamental driver for us to choose to do anything in life. He also states that virtue is the means to \"fulfil\" that end (\"purpose\").\nSo there are two key things there...\nOn happiness: Nothing could be more subjective than happiness, so your subjective experience of life is the only experience you have to know your \"purpose\" on earth.\nWhen people talk of 'work to live v live to work', if you 'live to work', your work purpose fulfils your life's purpose. As long as you're happy. Crack on.\nIf you 'work to live', the purpose of your work is to be conducive to your happiness (literally, 'eudemonic'). Your work now, more than before, fulfils the purpose of supporting your life's purpose. Some people frame that purpose as a 'thing' (random examples: to rescue as many dogs as possible/to own the world's most expensive car), but all are conceptualising it in a way which they hope will make their experience on this plane of existence as good as possible despite all the viciousness in it.\nOn virtue: It seems like your current job is the most eudemonic (conducive to happiness) job you have cared to have because it has less of a vicious (\"stress\", \"dread\")/more of a virtuous (\"glorious\") effect on your happiness, which you may place in other areas of your experience in this world.\nI know I'm jabbering on, but I really like that you wrote \"glorious\", because there is an analogy that Aristotle writes in Nicomachean Ethics to explain that 'virtue' (as the character that we celebrate in others and, by association, ourselves) is all about activities (which become habits if repeated). Aristotle writes that the 'best' (defined by any specific terms) person at the Olympics, including those in the audience, does not get the glory; it goes to the one that performs the activity the best (e.g., wins the race/fight, jumps highest/furthest, etc.). There could be someone better sat in row J seat 42 that could have had glory, but they didn't act such that they could be there an then (Aristotle fully caveats this with the fact that we do not have all the same chances in life). It's easy to define a long jumpers purpose (live to work = jump for glory = work to live gloriously). If a long jumper gets the medal they worked 4 years to get to feel that moment, and live on with it, as \"glorious\", good on them. But only so long as the journey is as worth it without it.\nI'm glad you feel your job is \"fucking glorious\", because you performed the virtuous (conducive to happiness) activities that got you to that state of mind. Good on you. If the feeling changes for the worse, which it may, get to work changing it.\nTldr: Glory or GTFO.\nWhat is happiness to you?'"
    ]
}