{
    "username": "SkoomaDentist",
    "contributions": [
        "In response to 'Jeps. Etenkin alihankkijapuolella vaihtuvuus oli ihan tolkutonta. Niillä rahoilla mitä tungettiin aina vaan uusien kouluttamiseen ja alun virheidenpaikkailuun olisi maksanut melkein tuplapalkkaa niille jotka osasi hommansa.', a user said: 'Oon ite teollisuudessa tuotekehityksessä ja meiltä lähti yks sekundakonsultti pois ja toinen pistetään pihalle kohta. Tilalle hankittiin yksi kalliimpi (firmasta jossa työviihtyvyys jne on ihan eri luokkaa myös) ja sen alueen teho yli kaksinkertaistui samantien. Eli joskus näinkin päin.\nOmaa väkeä ei valitettavasti saada emoyhtiön asenteesta johtuen palkata kovin helpolla.'",
        "In response to 'Oliko suoraan koulusta ilman kokemusta?\nJoskus oli pakko pistää rekryissa kielteistä todella kovilla papereilla olevia, mutta asenne oli katastrofaalinen. \nToisaalta peruskoulupohjaisia, mutta helvetin taitavia nappasin tiimiin mukaan.', a user said: 'Tietenkin oli. Ne oli hankittu ennenkuin itse aloitin nykyisessä työpaikassa. Lobbasin aika vahvasti parempien externalien perään ja onneksi johtokin taipui tälle kannalle. Tää on vähän tätä kun firmalla on enemmän kokemusta mekaniikan ja sensellaisen suunnittelusta kuin softasta. Nyt sitten koitetaan paikata tilannetta kun tulevaisuus on yhä enemmän laitteissa joissa on yksi tai useampi prosessori.\nPs. Kolme parasta devaajaa jotka tunnen jättivät kaikki lukion kesken aikoinaan.'",
        "In response to 'Quiet quittingista tulee mieleen kaikkea muuta kuin mitä sillä yritetään tarkoittaa. Minulle tulee kyseisestä sanasta mieleen vain että olet omissa oloissasi pohtinut irtisanoutumista ja mahdollisesti päättänyt toteuttaa sen. Kyse onkin ilmeisesti siitä että päätät tehdä vain sen mistä on sovittu (??).\nOn todellakin enemmän kuin hyväksyttävää tehdä vain se mitä työsopimuksessa on sovittu. Jos työntekijöitä ei ole ja työn määrä on vakio (esim. toimistotöissä jossa ei ole kyse ihmisen elämästä), silloin tehdään vähemmän vähemmällä eikä enemmän vähemmällä.\nTuntuu että työelämässä ihannoidaan jatkuvasti stressissä ja kiireessä tekemistä. Todennäköisesti et saa palkankorotusta vaan lisää töitä samalla palkalla \"palkinnoksi\" ahkeruudesta. Tietenkin on tapauksia missä perustellen hyvin saat palkankorotuksen hyvin tehdystä työstä.\nToisin sanoen ärsyttäviä ja väkisin keksittyjä termejä joita ilmankin pärjää hyvin työelämässä.', a user said: 'Tuntuu että työelämässä ihannoidaan jatkuvasti stressissä ja kiireessä tekemistä.\nJenkkivaikutteisissa pöhinäkirjoituksissa ihannoidaan tuota. Tosielämässä on sitten tullut 25 vuoden aikana vastaan vain yksi työpaikka missä tuota \"ihannoitiin\" ja lopetinkin hommat siellä varsin lyhyeen.'"
    ]
}