{
    "username": "skywarka",
    "contributions": [
        "In response to 'The uniting characteristic among\nconservatives\nmost people\nseems to be an empathy deficit. It simply doesn’t click until it happens to them or someone they love', a user said: 'The foundational belief of the left is that everyone is equally deserving of a good life, and we should strive to provide that to them. The foundational belief of the right is that everyone has their rightful place in the hierarchy, and we should strive to put them in that place (or let them take it). One of those openly cares about everyone's wellbeing regardless of connection to us, the other is all about putting you and yours above others.\nYes, anyone can lack empathy, but don't pretend both sides are the same when it comes to caring about people outside their tribe.'",
        "In response to 'No, it’s more like the right thinks you should have equality of opportunity while the left thinks you should have equality of outcome.', a user said: 'The right doesn't believe in equality of opportunity in the slightest, they don't want their kids to have to struggle as much as the poorest kids do, and they don't want resources going to poor kids to give them the same opportunity as their kids. White conservatives don't want their kids to struggle with systemic racism, and they don't want resources going to non-white kids to give them the same opportunity as their kids.\nConservatives believe they've earned their place in the hiearchy for them and theirs, and everyone else has to deal with their own problems. They'll\nsay\nequality of opportunity because they know that the truth sounds bad.'",
        "In response to 'The vast majority of tax revenue comes from the rich, overwhelmingly white. And the vast majority of taxes goes to welfare and entitlement spending, and that’s just from the feds. State and local taxes also go largely to public schools, Medicaid, and other programs for the less fortunate.\nI have no idea what city you’re in but I’ll bet you spend more on your public schools than everything else combined. More than what you spend on cops, fire, roads, combined.\nAnd the rich don’t even use those schools, they send kids to private schools.', a user said: 'Correct, and which side of politics generally wants to cut taxes and government spending, especially on welfare programs? Which side of politics tends to expand social welfare programs? The current system in the western world is a foundation of hardcore right-wing policy (capitalism) layered with band-aid patches of left-wing policy (democracy). The idea that all people deserve a vote, instead of just land-owning white men, had to be fought for by the left, it wasn't the default.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'Are you suggesting that unlicensed taxi service employees should have different rights to fair compensation and treatment as human beings than the rest of us?'",
        "In response to 'No. If workers are cutting corners on what they are providing, what will your Uber driver cut out? The seat belts? Coming to a complete stop at drop off?', a user said: 'Sounds like a good reason for employers to pay better wages, and for customers to not use services that are only viable because they drastically underpay employees and cut corners on safety-related costs (not hypothetical, that's just how Uber and similar survive financially).'"
    ]
}