{
    "username": "Slamdoocka",
    "contributions": [
        "In response to 'I’m sure a lot of these drivers hate their jobs, but taking it out on customers isn’t the way to stick it to Amazon. They’re in the job of customer service. If they’re not feeling it, move on to bigger and better things instead of destroying something that someone paid for with their hard earned money. Just my take anyway after working years as a FedEx delivery driver and not throwing people’s packages, ever.', a user said: 'Doing a good service for cheeked up pay is only enabling the system of customers and the company\nTake it out on the product and even the most settled in customers will reconsider ordering their nail polish, toilet paper, and the tried and true kitty litter'",
        "In response to 'See the thing is, no it won’t. That’s not how people work. Know what’s actually gonna happen? You’re likely going to be fired. The customer is going to call and complain and likely get a refund and/or another product which in turn has to be delivered just like the other one had to be delivered. And what did you, the driver, get outta this? You likely got fired, that’s what you got. Now you get to start the rat race all over again until you’ve burned enough bridges that it’s  good luck to ya.\nThere will ALWAYS be people that are MORE THAN happy to be slightly inconvenienced if it means a full or partial refund. If that means you have a bad day and pitch a package and get caught/recorded they have no issue disrupting your livelihood so they can get $10 back.\nThis multi-billion dollar company isn’t gonna go under or get hurt because a few thousand drivers throw packages. They aren’t gonna change shit except make it harder on yall and just just out those DSP centers or have them cut you out.\nThis is the sad reality of the situation. Lobbying and unionizing is basically all I can think that would heel in a company the size of Amazon, and good luck with that. I worked for Wally World like a decade and a half ago and they were trying to unionize then, like they had been for the last 15 or so years and like they still are today.\nAnd no, this ain’t me shilling for Amazon. This is just the actual reality of the human race. Most are happy to fuck you over and fuck your whole life up if it means they got a free product. All you are to most is a means to get what they want delivered, nothing more nothing less.', a user said: 'Been destroying packages for my entire career both accidentally and on purpose with two separate DSPs and three different warehouses, someone is losing money and if its the customer they will reconsider their ways... Or just continue to use a suboptimal service'",
        "In response to 'Maybe so. I’m guessing you got a system to do it. What I can bet money on is that no one has sat and recorded you intentionally destroying a package and then took that footage to your DSP or Amazon as a whole. Regardless of whether or not your career has been 2 years or 20 I’d bet that if you were filmed intentionally destroying someone’s packages you would be fired at worst at reprimanded at best.\nAgain, I’m not saying I’m for the shit work conditions of Amazon. All I’m saying is eventually you and others doing this is gonna be like smashing your head on a wall over and over then Asking everyone else why your head hurts.\nThe point of what I was saying is at the end of the day people do not give a shit. They WILL keep using a subpar service. All it takes is a few clicks and voila they have another product on the way, a refund or both. You’re trying to empty the world’s oceans with a spoon bud. It\nmay\nwork but not without monumental effort.', a user said: 'Of course, but the job is boring, I am pid by the hour, and ahead of schedule, I hate my life, and this package says its fragile, fuck em. Make em wait another day.\nIt is incredibly petty, but I imagine if enough people did it it MAY have some effect'",
        "In response to 'Interesting, I know exactly zero Amazon DSP drivers who would have a problem with delivering *only* toilet paper and nail polish, all day every day', a user said: 'I am quite upset working at amazon and get very unreasonable with my wishes\nThe annoying part with light packages really only comes in to play when I have to drive 8 minutes for a single envelope and then drive another 8 minutes back'",
        "In response to 'That is very understandable if they make you use your own car and pay for gas and don't pay for mileage.', a user said: 'That would be flex of which I am not a part of.\nDriving for someone else using someone else's property\nit does demolish metrics for the day though'"
    ]
}