{
    "username": "SlientlySmiling",
    "contributions": [
        "In response to 'Quiet firing (verb) when a company does not fire  personnel but instead does the bare minimum to ensure workers are taken care of in terms of payment and reasonable hours, usually in favor of higher profits.', a user said: 'Quiet enslaving is more on point.'",
        "In response to 'Original Post: It’s now “quiet quitting” to not go beyond your job responsibilities [External Link]: https://i.redd.it/rb5pth0h04i91.jpg', a user said: 'Loud gaslighting over a percieved decline in work output?\nGee, that's a shame. It would be a real pity if something caused your employees to bail on you. I'll be honest: That something is YOU, Mr./Ms./Zr. MBA douche canoe.\nYou want superior work? Pay a superior wage.\nYou want extra work? Well, Vandal Savage, MBA, there's a way to get what you want: \nTreat your employees the way you expect to be treated.\nPay a living wage that is adjusted to inflation. \nRecognize hard work through just renumeration and a career path, not pizza parties, cheap swag, or a bag of fucking \"fun size\" candy.\nStaff to levels that allow everyone to have a life. Minimum viable staffing should be experienced first by the upper management who think it is a viable, sustainable business model.\nOtherwise, fuck off all the way to the end of all places that can be fucked off to, and don't come back.'",
        "In response to 'You know what would be even more crazy? If that country he was talking about was the wealthiest country in the world', a user said: 'Once upon a time. We blew it all in an orgy of war making.'",
        "In response to 'Let's not forget credit scores are new to us, also. 1980 something is when they started, so back then you could just walk up and buy a house, I guess.', a user said: '1989.'",
        "In response to 'Original Post: Had a fight with my parents over this “quiet quitting” trend. Somehow refusing to answer emails/phones outside of work hours is a trend and my parents think it’s just us being lazy. I can’t seem to make them see the reality. When they were young and working you could leave work behind by walking out of a building, not so anymore.\narticle', a user said: 'Over here in Murica, it's called work/life balance. Just make sure you use the new coversheets for the TPS reports.'"
    ]
}