{
    "username": "slipperytornado",
    "contributions": [
        "In response to 'This.\nThe answer is no.\nLife has to be something beyond work, simply because a single human wants it to be.\nIf 99.999% of humans born wanted to work themselves until they died and that was the way the world was, it still wouldn't be right because that . whatever % left still doesn't have representation.\nMajority rules, sure, but how much are we willing to take away from a human? Where does the \"pursuit of happiness\" end and begin here?\nWe can pursue it all day, but don't think it's real? Is that it?\nNo. The answer has to be no. I don't want to work at 8 hours and 1 second. I'm done. We're done. If I like you, we can hang out, but you aren't telling me what to do, and we aren't talking about work.\nLet's talk about my side hustle. Let's talk about my partner. Let's talk about my children. I don't want to talk about Karen.\nFuck man my girlfriend complains\nALL THE TIME\nabout trauma she experienced years ago.. like 8 jobs ago.. AND all the trauma she experienced since then. And no, it's not just bullshit. People don't rub their dicks on me when we're alone together, so I can't relate to her problems and whether or not there \"traumatic\" and that means \"she's not just bitching\" before any of you assholes say that. Women are traumatized regularly at work. (It occurs to me that this needs some explaining.. I am correlating her complaining about trauma to her\nstill spending time at the same job she worked at 8 years ago even though she has been off the clock for 8 years because some dick wagon rubbed his dick on her in a copy room\n- so it's relative, you see? She's been off the clock for 8 years but she still gives them an hour or two every once in a while when she struggles with that evening in her head.)\nI thought about this today: all the dudes women meet on tinder and emergency friend their way out of because they're super sketch.. those dudes are the same mfrs they are\nforced\nto work with on a daily basis and the company expectation is that everyone gets along. And if shit goes down, she's the one to blame because she has cleavage or legs or fucking feet.\nIt's insane. This is all insane.\nSo, the answer is fucking no.\nPeriod.', a user said: 'Oh. This is really, really good. Thank you for it.'",
        "In response to 'Anytime. I'll do assemblies if y'all organize it. I'm lazy, but I talk good. 😏', a user said: 'I just feel like we don’t have this talk enough with each other. My own dad, who was a blue collar union man, likes to say “nobody wants to work”. I told him, no, nobody wants to PAY. And then it dawned on him.'"
    ]
}