{
    "username": "smilegirlcan",
    "contributions": [
        "In response to 'The phrase \"quiet quitting\" is propaganda designed to make it sound like \"just\" doing your job is something negative.', a user said: 'I have never heard it in a negative light. Quiet quitting just means working your intended hours and your intended job. Whatever you call it, teachers need to start doing it.'",
        "In response to '“Quitting” is negative. Doing your job is not quitting. The phrase would make sense if it was describing not doing your job and making them fire you', a user said: 'I guess you are quitting the extras. Work to rule.'",
        "In response to 'I prefer the phrase, “act your wage”. Quiet quitting sounds like I’m not doing my actual job.', a user said: 'Fair enough.'",
        "In response to 'Original Post: Quiet quitting is happening at my school You all have heard it around the world. Quiet quitting or \"simply doing your job and nothing else\" is going around. Anyway the Fall Fling dance rolls around and teachers are \"required\" to chaperone. Basically we are given a google form to sign up for a shift to chaperone the dance. No this isnt paid, yes its on a Friday night after a long work day and week, and no food is not provided to teachers. Total suckfest all around. Well get this, the day before the dance we get a frantic email from Admin. No one signed up to chaperone. NOT A SINGLE teacher signed up to chaperone. We get some messages about how this is mandatory, teachers must be there for the event, we can choose which shift we work but must be there. No one signs up. Cue Admin start walking door to door with a sheet asking people to sign up. Get this, the teachers stand their ground and say no. Of course a few caved, 1 or 2, but overwhelmingly the teachers say no.\n​\nGuess what happened, well they had the dance, the admin chaperoned, the few people that signed up, basically a skeleton crew. The next week nothing, no messages, no angry faculty meeting, nothing. They know that they cant do anything to the teachers because its not one or two, its everyone. Listen I understand that kids need fun stuff to do, but maybe don't make teachers do it, or if they have to be there pay them??', a user said: 'Woooh! Teacher win.\nSay it with me: We will not work for free.\nAgain for those in the back: WE WILL NOT WORK FOR FREE.\nIt is not our job for kids to have \"fun stuff\". Nor is it a doctor's, psychologist's, etc. job. We are professionals and deserve to be treated better. I hope this generation of teachers do better. We are not volunteers.'",
        "In response to 'Has anyone had to plan during class time yet? I've said it before, but if I were still full-time this year I would be utilizing 2-3 days a week to just plan during class time so I could STOP planning at home.\nThat or teach exclusively off TPT content and adapt as I go lol', a user said: 'I plan during independent work time and I teach second and third graders. It is very possible. I work to my contract.'",
        "In response to 'That's awesome! Definitely rooting for you to have a good year 😄', a user said: 'So far so good, got a good group!'",
        "In response to 'Original Post: It's NOT \"quiet quitting!!!\" \"Working your contract,\" \"working to rule\" and \"acting your wage\" are all MUCH better terms. Why would you use the word \"quit\" to describe you adhering to your contract and doing your job? It has nothing but negative connotations AND denotation.\nI highly encourage everyone here to lose that term. We're working our contracts. We're not quitting anything. Some may STOP giving away their physical and/or emotional labor, but that's not the same as quitting!\nEdit: For those of you saying \"It's called 'doing our job'\" The implications of teachers \"just doing our job\" are:  volunteering for events, grading/planning at home, taking over other  peoples' responsibilities, adding more to your plate every year, etc...  Admin considers this \"just doing your job.\"', a user said: 'I do not care what you call but teachers PLEASE STOP WORKING FOR FREE. You are not a volunteer. You are not a martyr. We do not ask any other profession to do free stuff \"for the kids\". Just stop.'",
        "In response to 'While I understand your points, I am just not understanding why some people are so very triggered by this phrasing?', a user said: 'Apparently somewhere there is propaganda about it. I literally have no clue but it triggers people big time.'"
    ]
}