{
    "username": "Sminahin",
    "contributions": [
        "In response to 'President Elect Donald Trump.\nClearly, it is.', a user said: 'Beg to differ. Donald Trump made a lot of wild promises and it often wasn't clear how he'd get there. But a whole lot of non-vague things came out of his mouth and he definitely made it look like he stood for something--even if it was something awful and we Dems all know he'd change his song for bigger applause in a heartbeat. His base had a much clearer sense of his priorities than Harris's.\nAlso, Trump frankly has way more charisma than Harris and can much more easily string people along on his nothings. We need to stop pointing to Trump like it excuses our own deficiencies, that's just sad. It's like we're trying to get Americans to grade us on a curve and it's just getting embarrassing at this point. We need to start owning our own strengths & weaknesses already instead of pointing to the other side and making lazy excuses.'",
        "In response to 'I think there’s even a way to answer that question without even really brutally breaking from Biden, necessarily, or at least it’s an implied break- something like “knowing what we know now, I’d try a few things differently to accomplish our shared vision on (housing/minimum wage/whatever policy you pick), because I won’t quit until the American people have better (housing/infrastructure/whatever policy outcomes). Joe and I shared that vision, and I want to accomplish that in my presidency..”\nI’d stick with the vague “visions” description, like you both want to see more affordable housing/lower inflation/whatever, but not saying specifically how you’d do it differently in that instant.', a user said: 'I think there’s even a way to answer that question without even really brutally breaking from Biden, necessarily\nI think we can all think of some ways to message this. Personally, I would've gone for an angle on how Biden helped build America's future but could've put more focus on the present where people are suffering now (housing, groceries, etc...) Lets you acknowledge the good things he's done while also subtly steering out of the \"economy's great voters are wrong about their own finances\" narrative we've intentionally cultivated for god knows what reason.\nThis should've been Harris's major test, the messaging that she and her team were working on from the first hour of her candidacy. Because Biden was a historically unpopular president and she was an unproven, somewhat unpopular replacement stepping into the same shoes. This was her first and most important test. And every single person in the country seemed to know it except for Harris and her advisors.\nShe didn't just underdeliver, she didn't even seem to realize there was a test and skipped class. What terrible political instincts and a complete lack of public social skills. Not sure which was more clearly disqualifying, the awful answer she gave or the complete lack of political skills that allowed her to give that answer. Either way, it's a problem. And it frankly reminds me of some of the Clinton 2016 flubs--anyone with decisionmaking power who worked on both those campaigns needs to seriously consider their career.'",
        "In response to 'On whether Harris should run in 2028: please do not rehabilitate her.\nThe campaign itself was ok, but let's be honest, she was a bad candidate. She got asked on the view whether she would have done anything differently than an 81 year old man with 32% approval, and she couldn't think of a single thing! Why not say Gaza, or that the cost of housing would be more of a priority or something\nHer 2019 primary was also a disaster. And in 49/50 states we lost ground. CA governor? Sure, why not. But please not president, she would lose by even more in 2028. Americans want outsiders, not the ultimate insider.', a user said: 'She's a low-to-mid charisma coastal lawyer bureaucrat who skipped straight to Washington insider without any voter approval at any point in the process. I know we like to pretend it's all racism and sexism (which don't help), but I saw her bomb speaking in a room full of African-American women--lead balloon reception compared to Booker, Klobuchar, Buttigieg, every other candidate, etc... None of those people would be my first pick and they still massively outperformed her in an environment we can't make any of the usual excuses. Every time my friends in the rustbelt watched her in ads or speeches, I'd hear words like \"condescending\" and \"lecturing\". And this is from mostly apolitical people who lean Dem.\nShe'd be 64 in 2028 (she's only a little younger than Obama now and he ran 16 years ago) campaigning to be a 72-year-old president at a time everyone is sick of retirees running national politics. It's like she combines the worst traits of Al Gore, John Kerry, and Hillary Clinton. This is not the sort of candidate we have\never\nwon with even before we forced her down people's throats without giving them any say.\nAnyone thinking she ever had it never had their finger on the pulse. Anyone seriously suggesting we run her again should never try to offer political advice except on opposite day.'",
        "In response to 'No one can honestly look at this last campaign and say she has low charisma. She’s definitely got Obama level charisma but we all want to pretend “oh sexism and racism aren’t a thing anymore”. From her debate to her podcast interviews to her SNL appearance - her charisma is top notch. A lack of charisma is not why she lost, but her strong charisma is why she’ll be hard to beat in a primary for the president or California', a user said: 'No one can honestly look at this last campaign and say she has low charisma.\nShe has low charisma. She didn't come off as natural and she was stilted. There's a reason she didn't get traction in 2019. And since you took it there, she's nowhere near the best female nonwhite speaker in our party. Biden and team picked a near-last-place showing candidate voters were widely disinterested in and who would've probably never come any further on the national stage. I think she did...maybe a little better than we could've feared given that setup for a sudden handoff. But there's a reason so many people, including me, wanted to at least have a serious conversation about an open primary over running the very substandard candidate we had been handed like it was gospel. It wasn't because we liked our odds in an open primary. It was because we thought our odds were\nso\nbad with Harris that it might be worth the gamble.\nBarack Obama was a fantastic speaker. Michelle Obama is a much better speaker than her husband but doesn't want to go into politics, which is fair. In flat-out speaking ability, Harris is probably in the bottom 25% of the Dem party. She put in a really good effort and did better than most anyone thought she would. But she didn't naturally know the right things to say (e.g. her answer on The View), spoke like a politician the whole time, and just never won people over beyond being the alternative to Trump. I think that's the sentiment we saw in the primaries, the sentiment when she was announced, then she went missing from the public eye most of VP's presidency and...suddenly was the candidate. With no more momentum than when she left off. She got a slight upsurge from not being Biden because people were desperate to have a not-Biden candidate. But, as we saw on election night, she just didn't have it.\nI don't know why we're pretending she was some gold-plated 10/10 candidate. Again, there's a reason she never caught on in the primaries when voters had their say, and that doesn't change by turning a spotlight on her and maximizing visibility.'",
        "In response to 'She won in California\nWhat are you even talking about?', a user said: 'Exactly. We took a California senator who voters enthusiastically rejected on the national stage in the primaries and promoted her straight to the presidential ticket without giving voters a say at any stage after their rejection. And we didn't expect this to go badly?'",
        "In response to 'Not the ultimate insider like say, a former us president. Americans would never want that.', a user said: 'I mean...Trump ran an outsider campaign and certainly is not another Washington insider. Granted, I'm not sure he could've gotten away with an outsider campaign as an extremely corrupt former president if he\nweren't\nrunning against hyper-establishment bureaucrat types. Biden has been in Washington what, 51 years by now? And Harris is a Cali lawyer turned Washington insider bureaucrat without voters ever having a say on her. And she spoke in politicianese the whole time--part of why her 2019 primary never took off and she got promoted into the presidential candidate spot anyways. You can't get much more insider-branded than that.'",
        "In response to '[Deleted or Empty Comment]', a user said: '...This is the guy storing classified documents in his bathroom lol.\nI...think there may be a miscommunication here. Because what you described is clearly not-normal-politician behavior. I'm not saying his behavior is\ngood\n. I'm saying he doesn't come across as yet another politician, and certainly not part of the Washington establishment. He waltzed into the White House with zero political experience and has only run against politicians' politicians. He doesn't talk like a normal politician at all and proudly says things that we think make politicians unelectable. That's part of why the \"Trump's not normal\" attacks didn't land so well--because that plays into his brand and people don't like the \"normal\" we've been putting up.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'You'd have to be an absolute idiot to think he's not an insider.\nOof. Okay, so you're doing that thing we Dems are really bad at. Where we mix up how someone presents themselves from what they are. Guess which one matters more when you're campaigning for a job you win on public perception.\nTrump's\nentire\nbrand is that he's not like those Washington politicians. He says inappropriate things. He has no background in politics. He constantly rails against \"the swamp\" and is essentially promising to burn down the existing political order. He's running as an outsider, pure and simple.\nThe candidates we've run against him--Hillary, Biden, Biden, Harris? Hillary and Biden have been in Washington for\ndecades\n. I think Biden's been there 51 years now. Hillary was there for 20 years + is a political dynasty pick + is the heir to two administrations. Trump in 2016 had been there\nzero\nyears and was barely in Washington even when he was president.\nI would argue the anti-establishment branded candidate has won every election after Bush vs Dukakis at least with the possible exception of 2020 (weird narratives due to Covid). Bill Clinton was a young, charismatic, Southern governor with no Washington associations. Bush was another Southern governor who went up the most hyper-establishment types around (Gore and Kerry). Obama was a young, charismatic Chicago professor with only a few years in Washington who fought the party at the state level and then fought the party at the national level, going against hyper-establishment McCain and vulture capitalist Romney.\nI'm going to be honest, if you think Trump wasn't running as a political outsider and wasn't seen as campaigning against the Washington elite, then you need to get out of deep Dem bubbles more often. Because that was a dominant, maybe campaign-defining narrative.\nEdit: I know you'll probably take this with a grain of salt, but I whipped together a quick \"how establishment coded are they\" index the other day based on things like...region of origin, age political career, profession before politics, etc... These were some of the outputs when I plugged in recent candidates. Obviously this could be refined a bit, but the results absolutely track from what I've seen:\nValues:\nCandidate\nEstablishment Score (Higher = More)\nBush 2k 1\n1\nKerry 04\n10\nObama 08\n0\nHillary 08\n13\nHillary 16\n14\nTrump 16\n2\nBiden 20\n15\nBiden 24\n17\nHarris 24\n9'",
        "In response to 'Its a losing message right now. Without COVID it probably would’ve been a losing message in 2020, given it was a losing message in 2016', a user said: 'Plus the pro-establishment branded side lost in...1992, 1996, 2000, 2004, 2008, 2012, 2016, kinda 2020 (Covid made that election dynamic odd), and in 2024.\nI have no idea why our party keeps thinking that running hyper-establishment bureaucrats on a status quo message is a winning move when it hasn't been like that even once in my entire lifetime. Especially at a time where public sentiment is more anti-establishment than ever.'"
    ]
}