{
    "username": "smorgasfjord",
    "contributions": [
        "In response to 'Det er et idiotisk begrep oppfunnet for å gi oss dårlig samvittighet over at vi ikke vil jobbe gratis. Og ja, du kan fint komme langt i arbeidslivet og samtidig dra hjem når du har krav på det.', a user said: 'Det er ikke arbeidsgivere som bruker begrepet, det er unge amerikanere som tøffer seg ved å ikke jobbe gratis overtid. Det er visst så nærme punk som de kommer der borte. Idiotisk begrep, og temmelig irrelevant her til lands. Meld deg heller inn i en fagforening'",
        "In response to 'Synes helt ærlig det er ganske relevant her til lands og. Da jeg jobbet på Rema hadde jeg blant annet en kollega som jobbet flere timer gratis \"for butikken sin skyld\". Sjefen min hadde millionlønn, ikke faen om jeg hadde jobbet så mye gratis.\nSjefen min prøvde også å guilt-tripe meg til å dra på jobb da jeg var syk en dag. Var eneste som kunne post-i-butikk dagen jeg ble syk, og sjefen svarte passivt-aggressivt at \"da må posten stenges i dag\". Ja no shit, du skulle ansatt ekstra vikarer til når denne\nekstremt vanlige\nsituasjonen oppstår. Å legge skylden på andre ansatte for ting som kommer til å oppstå er idiotisk, og det er ingen andres feil enn butikksjef.\nEr glad for at jeg ikke fant meg i det, og veldig glad for at jeg slutta en helt ok jobb der sjefen skulle ha oss til å yte for dobbelt så mye enn vi ble betalt for.', a user said: 'Det er mye rare folk i sjefsstillinger i Norge også, men vi har såpass gode rettigheter som arbeidstakere at det bør være uproblematisk å si nei. Men det kan hende man kan trenge støtte fra fagforeningen til å stå imot presset'",
        "In response to 'Ja sant, problemet er da at det uansett ikke blir et hyggelig sted å jobbe når sjefen alltid følger med som en hauk på om du til enhver tid yter 100%, og dømmer og snakker nedlatende til deg om du ikke gjør det. Det er ekstremt mentalt krevende. Fagforeninger får liksom ikke gjort noe med forholdet mellom sjef og ansatt.', a user said: 'Nei, det er vanskelig. Men det er ting de kan gjøre. Det viktigste er kanskje å forsikre deg om at du ikke står alene, så du føler deg trygg på arbeidsplassen din. En dyktig tillitsvalgt kan ta en prat med lederen det gjelder også, eller med lederen hans dersom det ikke nytter. Gjentatte varslinger blir tatt alvorlig, dersom det er en større bedrift i hvert fall. Men det er jo ikke gitt at man har en god fagforening eller en dyktig tillitsvalgt, det krever at mange nok engasjerer seg'"
    ]
}