{
    "username": "SmushyFaceWhooptain",
    "contributions": [
        "In response to 'Original Post: Corporate media condemns job hopping & quiet quitting as \"disloyalty\", meanwhile Wall Street rewarded tech firms firing thousands of workers instanteounsly because they \"ripped the band aid off\" [External Link]: https://i.redd.it/bh1yrn4p6fga1.jpg', a user said: 'The reality is, the cats out of the bag. Everyone knows that employees no longer give two shits about working for the same company until they die, working long hours of unpaid overtime is a thing of the past, and that salaries have failed to keep up with inflation. There’s no going back. So they can cry about disloyalty all they want but everyone was watching when they trashed tens of thousands of workers, sometimes overnight without any advance notice, and everyone will remember that they did this and then reaped millions because of it. There have been so many opportunities to make peace with workers over these past 2 years and these CEOs and corporations failed to do so. Failed on a spectacular level actually.'",
        "In response to 'Quiet quitting shouldn't be work to rule, but way less than that:\nRiding the edge of almost being fired.\nWork starts at 9? Come in as late as still tolerable.\nColleague calls? Only pick up when he calls a second time. Some problems solve themselves. Don't even think about calling back.\nCall in sick if you need to chill after an exhausting weekend. Calling right before  work starts is soon enough.\nGood things take their time. Never respond quicker than 24h to an email. Preferably 48h.\nEating healthy and diverse is important. Heat up your fish in the microwave.\nNeed to estimate duration of workload? Estimate generously and multiply by two. You never know what unexpected things come up. If you deliver earlier, you may even get a pat on the shoulder.\nEducation and training is key. Learn something new that has nothing to do with your job on worktime.\nIf need you to go somewhere, always pretend to be in a hurry. You're less likely to be bothered if you're making a stressed out impression.\nPensions alone are too little to depend on. Learn to invest and trade during work hours.\nCasually sprinkle some complaints about your hardware here and there. Blaming your hardware when you need an excuse one day becomes more believable.\nIsn't losing hours of work to a blue screen just horrible? I told you something is wrong with my machine.\nAn organized worker is a good worker. Meticulously plan your bowel movements in advance, so you never have to drop a deuce at home.\nDon't get caught with your pants down. Always have some plausible excuses prepared and at the top of your head why you\nabsolutely\ncan't cover a shift this weekend.', a user said: 'Oh you’re the fucking sysadmin at my old job with the microwaved fish aren’t you? Curse you and the day our windowless office smelt like a filthy dumpster!'"
    ]
}