{
    "username": "SN8KEATR",
    "contributions": [
        "In response to 'Original Post: Is anyone else “quiet quitting” or just completely burnt out? I’m just completely over it. I used to be so “hungry” and now I’m catching myself doing the bare minimum, and I genuinely don’t care if I get fired.\nI think the largest factor is that I’m not getting paid until equipment ships and we’ve been on a year+ lead-time, so the carrot is essentially gone.\nI don’t have an ounce of ambition left in me, and it sucks because I have “golden handcuffs” to this job because I have over $50k in commissions waiting for me.\nIs anyone else feeling the same?', a user said: '\"Quiet quitting\" seems to be corporate spin for just doing your job lol'",
        "In response to 'I'm genuinely wondering the same thing. It feels most people have been extremely productive or at least glued to their computer the last 2 years (working from home). Now that that period has passed, people are becoming comfortable with balancing other things. Not sure how much legitimacy there is to quiet quitting as the hype alludes to.', a user said: 'Yep you hit the nail on the head. There seems to be an equal number of publications/people who see through the BS and are calling it out though, which is promising'",
        "In response to 'With the downturn I’m sick of all these managers telling me to ramp up my activities or take their bullshit marketing leads while they sit on their assess talking about what they did when they\nused to be salesmen\n.\nI work at a FANG and it’s just shocking to see how this downturn is freaking everybody out, and so people are all just pointing fingers anticipating layoffs and how they will plead their cases despite the performance being abysmal across the board.\nI swear to god if I hear “well X is hitting targets” as a deflection against 99% of the org underperforming, I might just leave sales altogether. It’s absurd.', a user said: 'I relate to your first point so much that I lowkey started fucking fuming while reading it LOL'"
    ]
}