{
    "username": "SnooPets8873",
    "contributions": [
        "In response to 'Original Post: Has anyone \"Quiet Quit\" as a response to RTO? I'm not in this position, so I don't need advice, but I'm curious to hear everyone's thoughts on this.\nI work remotely, which is why I follow this sub. I've seen a lot of people in this sub who are being asked to RTO. I've been thinking about this the past few days as the sub has been full of people discussing how to respond to RTO mandates.\nLots of people, including myself, are speculating that the recent push for RTO is force people to quit their jobs. If they don't fire you then they don't have to pay out unemployment. And, you have to have significant savings to go without a job.\nWhat do you think about about returning to the office and quiet quitting so you can still draw unemployment? Anyone done this?', a user said: 'I don’t work as hard on my office days. I was told that we are there to collaborate and have in person interaction. So I’ll stop for tea breaks, I’ll go to the lunchroom to eat. There’s no one I know around but whatever, I’m doing my part. But I’m not staying late. I’m not rushing to get more done to make up for that break time. And if I leave on time, my laptop stays closed until the next workday. I don’t mind stretching my hours at home and if I’m interested in what I’m doing? I’ll probably forget to take a break. But not at the office.'",
        "In response to 'If your boss can listen in to your conversations, you have to be a lot more careful (learned this the hard way). There is not necessarily anything wrong with venting, but there is a time and place. Your boss, however, is a complete AH for his review based on one overheard one half of a conversation, instead of communicating his concerns to you. He is probably unaware that he has hurt morale, as you are not doing the things that actually helped morale.\nNTA - but please learn not to have these types of conversations in a place or phone line that can be overheard.', a user said: 'Yeah to be honest I had a ??? That Op had that conversation at the office within the hearing of others. That’s what furtive coffee breaks and walking out to the parking lot together is for. Not saying it’s wrong to discuss things with coworkers, but it’s not wise to be unaware of one’s surroundings.\nIn contrast though, when my director basically by chance happened to be behind a group of us in the hallway as people were venting (I did my best to signal everyone but they were slow to pick up on it), she just sent out an email saying that we should all take the rest of the day off since we’d had such big news. It broke up the venting because we weren’t all gathered to do it anymore and also took away the pressure to slap a smile on our faces for a whole work day while we seethed internally. So I think the manager also failed majorly in comparison.'"
    ]
}