{
    "username": "SnooChickens4324",
    "contributions": [
        "In response to 'You are rewarded though. It’s called a paycheck. \nI can’t grasp the concept of quiet quitting. It’s always been: \nI clocked in, what do want me to do!\nI can clean toilets with a tooth brush, I can balance the accounting books, I will even perform surgery if needed.\nAbout 5 years ago, when I give people their yearly review, I started giving them a copy of their job description too. Just to refresh themselves if they wanted too.', a user said: 'I’m not doing surgery if I haven’t been trained for it. That’s a set up. I’m not cleaning toilets with a toothbrush either. I’m a plumber. I make 100k/yr to REMOVE your toilet or replace it. I’m not cleaning it.'",
        "In response to 'It used to be that bonuses or promotions were the motivation for people to go the extra mile. But increasingly, in the US at least, these no longer seem to be worth it. Bonuses and promotions go to the people who belong to the right group, belong to the right frat, went to the right schools, go to the right church, etc.. Actually being good at your job has become an after thought.', a user said: 'Being good at your job has absolutely 0 to do with Weither your promoted or not. And that right there is the biggest lie told to you growing up in America.\n“If you work hard, you’ll be acknowledged and go far!”……..unless your manager or your superior hangs out with this one person…..that messes up all the time…..then they get promoted instead.'",
        "In response to 'Stupid workers choosing to not be born in the social circles conducive to becoming childhood friends with future C-suit executive.  Should have eaten less avocado toast so you could go back in time and transport your consciousness into another body.', a user said: 'How dare them eat the toast!'",
        "In response to 'Doing the bare minimum isn’t a great way to advance your career prospects though. Would you rather hire someone who’s enthusiastic and willing to work hard, or someone who just shows up and only does the absolute minimum and sometimes not even that? Who are you hiring?', a user said: 'No if your enthusiastic, you tend to get fired or managed out because of coworkers being jaded at the world and upset that you want to work hard…..i.e it makes them have to work harder. All it takes is ONE TIME your manager saying “look how good, they did!” To somebody else. Boom it’s over, your a target.'"
    ]
}