{
    "username": "SnooLobsters8113",
    "contributions": [
        "In response to 'Same here.  Major Fortune 500 company.  My circle of me and another 100 or so developers have constantly out performed, met insane goals, over delivered, and met every single crazy idea or switch this company has done the past year and a half. About a year and half ago the company decided to just put the pedal to metal on everything.  We handled it, expecting it to calm down...\nUpper management has been saying how great everything has been going and how impressed they are with us in the face of these radical changes, yadda yadda.  The highest productivity our software division has had ever.  Oh, we know we are under staffed, but no more hiring until mid to late 2024.  Oh, and we are restructuring, for the third time in 4 years, changing teams and responsibilities around and bringing more people back to office, because \"We are always looking for ways to improve.\"   What?  Nothing makes any sense.', a user said: 'This is what they did to enslaved people in this country - USA. They set goals to pick cotton then increased them everyday to unsustainable levels and literally worked people to death or put the maimed or injured or elderly out to pasture to fend for themselves kind of like a certain electric car company'",
        "In response to 'I’ve been in enablement for 20+ years, working for 3 different FAANGs as well as other fortune 10s.\nIt’s a science, not just BS. Some places have it down (Apple), some are terrible (Amazon). But when Amazon broadly cut L&D roles, they suffered and many laid off Amazonians have been offered roles again while hundreds of SWE are job hunting.', a user said: 'What is an enablement team’s function?'",
        "In response to 'Original Post: You’ve Heard of Quiet Quitting. Now Companies Are Quiet Cutting Layoffs are down, but employers are still finding ways to cut jobs -  Is this normal or economy tanking? More problems expected in late 2023 or 2024?\nWorkers are waking up to emails and team-meeting requests with a jarring message: They aren’t fired but their jobs are gone.\nPeople on the receiving end of these memos describe running through a range of emotions, from relief that they’re still employed to a sense of dread that their bosses secretly want them to leave.\nhttps://archive.ph/cYXyk\nhttps://www.wsj.com/lifestyle/careers/youve-heard-of-quiet-quitting-now-companies-are-quiet-cutting-ba2c326d', a user said: 'Chevron and other oil companies had record profits from price gouging consumers and still laid off thousands of people. It’s gross. How do these companies expect to have customers if so many are jobless? They can afford to keep people on and still get their outsize compensation but choose not to. People should be in the ducking streets and boycotting everything and forming unions.'",
        "In response to 'Original Post: You’ve Heard of Quiet Quitting. Now Companies Are Quiet Cutting Layoffs are down, but employers are still finding ways to cut jobs -  Is this normal or economy tanking? More problems expected in late 2023 or 2024?\nWorkers are waking up to emails and team-meeting requests with a jarring message: They aren’t fired but their jobs are gone.\nPeople on the receiving end of these memos describe running through a range of emotions, from relief that they’re still employed to a sense of dread that their bosses secretly want them to leave.\nhttps://archive.ph/cYXyk\nhttps://www.wsj.com/lifestyle/careers/youve-heard-of-quiet-quitting-now-companies-are-quiet-cutting-ba2c326d', a user said: 'Even the nonprofit I worked at was cutting people and the lenders (affordable housing nonprofit) were denying them loans because of lack of capacity - not enough employees to do the work. Also they don’t want to pay a decent salary.  The head of the department thinks he’s Steve Jobs and trying to be efficient but really just making employees work harder for no good reason. at least people got rich working for Jobs even if he was an ass'"
    ]
}