{
    "username": "SnooRabbits2040",
    "contributions": [
        "In response to 'Original Post: Quiet quitting is happening at my school You all have heard it around the world. Quiet quitting or \"simply doing your job and nothing else\" is going around. Anyway the Fall Fling dance rolls around and teachers are \"required\" to chaperone. Basically we are given a google form to sign up for a shift to chaperone the dance. No this isnt paid, yes its on a Friday night after a long work day and week, and no food is not provided to teachers. Total suckfest all around. Well get this, the day before the dance we get a frantic email from Admin. No one signed up to chaperone. NOT A SINGLE teacher signed up to chaperone. We get some messages about how this is mandatory, teachers must be there for the event, we can choose which shift we work but must be there. No one signs up. Cue Admin start walking door to door with a sheet asking people to sign up. Get this, the teachers stand their ground and say no. Of course a few caved, 1 or 2, but overwhelmingly the teachers say no.\n​\nGuess what happened, well they had the dance, the admin chaperoned, the few people that signed up, basically a skeleton crew. The next week nothing, no messages, no angry faculty meeting, nothing. They know that they cant do anything to the teachers because its not one or two, its everyone. Listen I understand that kids need fun stuff to do, but maybe don't make teachers do it, or if they have to be there pay them??', a user said: 'I read something (probably on Reddit, lol) that used the phrase \"work your wage\" in place of quiet quitting. I think it's a more accurate way of viewing this movement.\nI'm not quitting at all. I am doing what I need to do for my students in my classroom, and on the playground every day. I still enjoy teaching, my kids are good, I have good support from admin, lots of positives. But, I'm exhausted and used up by the end of each day. When I go home, I'm at home, and school no longer comes with me.\nNo more going in on weekends to tidy up and prep, if it doesn't get done on Friday by 4, then it will wait. Does it even need to be done? My bulletin boards have never been Instagram ready, they definitely aren't now. Who cares, really?\nNo replies to email after 4pm, until 8am the next school day. No replies ever on weekends. No parents have my cell number, never have. If they were to get it somehow, they will be ignored and blocked.\nNot interested in running a lunch time craft club. Not interested in running after-school sports. I don't feel great about this part - I was involved in more than a few drama and musical productions that depended on after school rehearsals when I was in school, those experiences have me purpose and a group I belonged to, and I remember those days (and those teachers) fondly. I remember feeling grateful, not entitled, and I think that's where the difference lies today.\nGood for your teachers. Maybe this will make admin a little more appreciative of the staff.'"
    ]
}