{
    "username": "snorlaxerr",
    "contributions": [
        "I am an indie dev, earning 4-5L/mo, doing freelance projects and my own products I am a 27-year-old indie dev, I make games/apps.\nI live in Vadodara/Gujarat.\nI started my indie journey 13 yrs ago, making simple android apps.\nThe Beginning (2011-2019)\nStarted at 14 making simple Android apps\nLearned C/C++, PHP, Java, JavaScript, MySQL - built my foundation\nEarned around $500 from early apps and websites\nWent to UK for master's in game development, came back to india\nBreaking Into the Industry (2019-2021)\nGot first job as game designer in mobile games (2019)\nCOVID layoff after quiet quitting - they noticed I'd checked out\nJoined French studio remotely as junior PM during pandemic\nBuilt my own games on the side, worked with publishers\nHired freelancers, made $2000-$2500/month working on own projects\nThe German Detour (2022)\nMoved to Germany for game producer role in January\nGot laid off by October - realized I couldn't work in corporate structures\nDecided to go completely solo after coming back to India\nThe Reset and Breakthrough (2023-2025)\nTook break, read books, decided to focus fully on indie dev\nPivoted from mobile to browser games - less competition\nStarted creating game dev content on LinkedIn - best decision\nMade browser variation of trending mobile game using AI + my programming skills\nHit 30+ million players, Game of the Year on CoolMath Games\nMade 20+ browser games - solo + with freelancers\nOpened doors to publishers, freelance projects, speaking opportunities, game licensing\nI now get freelance project requests regulary from a couple of publishers. I hand them to freelancers or use Cursor to build most of them.\nI have published a couple of games for TV platform and they are already profitable now.\nI earn about 4-5L/month and hopefully it will be doubled by end of this year, and my schedule is not hectic at all.\nI take afternoon naps, hit the gym, working in different slots throughout the day.\nAll bootstrapped, solo, from Vadodara - you can build something big from anywhere.\nHappy to answer questions!",
        "In response to 'no question man, you are living everyones dream, enjoy for us as well ;-)', a user said: '😺 i am pretty happy atm!\nI will enjoy on behalf of all devs here :D'",
        "In response to 'GO LEARN A GAME ENGINE FOR THE FIRST STEP ( easy , level design , character design , mechanic design is the hard part )', a user said: 'Yes - basics of game programming and then game design!'",
        "In response to 'Curious on how one gets started on game dev in today's era ?', a user said: 'Already replied in other comments, but here again:\nBest is to start by learning the basics of making a game, it is pretty easy if you already understand programming concepts, OOPs, etc.\nI am not a hardcore programmer but I understand logic/structure/algorithms\nAnd then understand game design - to understand what makes a game fun. Level design, game mechanics, economy etc.\nThere are many free videos available on YouTube - pls don't take any paid courses, free knowledge is enough!'",
        "In response to 'Best thing is to not start at all. Too much competition and low salary. Only few people make it to where he is right now.', a user said: 'You are right - I have also been indie devving since 13 years. Only few people make it is also true.\nAnd job market for games in India is pretty terrible.\nBut if you have a knack for thinking differently or doing cool stuff visually (creative coding), you should try it out!'",
        "In response to 'Thats true. You can start with godot but you'll need way more passion than skill in this field imo', a user said: '100% true, I have seen highly skilled devs (way more than me) just be stuck in a job because they don't have that fire/passion to make their own games'",
        "In response to 'Your journey inspired me man, I wanna ask you, what’s you overall view on AI/gaming/cloud gaming?', a user said: 'AI has changed developing a lot - overtime I have relied less on freelancers and shifted to AI for small projects (simple word/math/puzzle) games. I use Cursor + React.\nGaming is difficult, I started with android apps - sometimes I wish I continued down that path as I did quite well for my age.\nPast few years were difficult ngl!'",
        "In response to 'How are you managing taxes?', a user said: 'I have a CA who does most of it, I receive most of my payments in Wise/PayPal.\nI am registering a business in Singapore soon'",
        "In response to 'Apart from personal network, which platform do you mostly use to get work or hire freelancers?', a user said: 'Hire Freelancer - I don't like Fiverr, they have that 15-20% comission which I feel is not worth it.\nI find devs/artists through LinkedIn only in most cases and from my previous freelancers.\nGet work - the publishers I work with, or through some game studios over LinkedIn'",
        "In response to 'From your experience, give advices to web developers.\nLike which website offers freelance opportunities etc.. how to get clients.', a user said: 'My main source is LinkedIn only - I have been writing/making content/sharing my journey for ~3 years now!'",
        "In response to 'I am working in QA role, does gaming industry has QA specific roles?', a user said: 'Yes they do!\nmost devs/designers start off as doing QA and then learn while doing the job and switch to different roles'",
        "In response to 'super inspiring to hear your journey!\nim a web dev, interested in game dev...can u give some tips for the switch and what stack would u recommend to focus...', a user said: 'I have made a video, it can help explain pretty well:\nhttps://youtu.be/vZGDeT79fms?si=99JufOaN82cZSiMD'",
        "In response to 'Why is game dev content on LinkedIn your best decision?', a user said: 'helped me network with other founders/publishers, which turned into revenue for my game sales and new opportunities'",
        "In response to '•   ⁠Took break, read books, decided to focus fully on indie dev\nCool inspiring story you’ve there. Which books did you read in your 2023-25 phase?', a user said: 'Sapiens, zero to one, shoe dog - just to name a few!'",
        "In response to 'OP, Love the Humble Brag.\nRegarding your statement \"my schedule is not hectic at all\" ... you don't talk about all the HUSTLING you need to do as a contractor.\nI now get freelance project requests regulary from a couple of publishers. I hand them to freelancers or use Cursor to build most of them.\nSeems like you are on an autopilot. How long will you glide before competetion comes and eats your lunch?', a user said: 'nope I don't really hustle as a contractor. I did couple of years ago, not anymore.\nthere is no competition here, the pie is quite big!'"
    ]
}