{
    "username": "Soilgheas",
    "contributions": [
        "In response to 'Have you noticed all the Quiet Firing going on, where employers only pay the minimum required by contract or employment agreement and no more?  I can't remember the last time an employer went above and beyond on payday.  It's like they don't even care.', a user said: 'I went above and beyond for a job once, and I got a different type of Quiet Firing and then I was Fired for real. Basically my job was to respond to emails/tickets for a web host company. This included the Resellers of a different web hosting company that they had aquired, but didn't actually know how to support yet because they didn't know how to use thier tools.\nSo, just a few weeks after being hired I was tasked with making a guide for other techs about common problems and solutions, it ended up being pretty long and detailed, but the techs that worked days didn't want to deal with it because it was a system they didn't know. Since I was working graveyard hours I didn't have any other techs to help me and I was the only one who would bother with them, meaning that when I was on vacation no one was responding to them despite the fact that I was the new hire.\nA few months in and people also stopped responding to the tickets that went back and forth between tier one, tier two and tier three. Since I was constantly talking with tier two and tier three to handle the reseller tickets I just added them to the list of things that no one wanted to do and got them done at night. I would resolve about 100 to 200 issues a night.\nThing is though, graveyard shift has a lot less people, and constantly needing to talk to the people who handle hardware maintenance during the night shift has limits, they need several hours to do different things and that meant that I would have to stop bugging them. Also, I have ADHD and it's easier for me to work in bursts and then have long periods of down time anyway and since I was turning out 1.5x to 2.5x more work than most techs my supervisor never cared.\nEventually the higher ups found out that I was \"slacking\" and Quietly Fired me by saying that I was to not handle tickets anymore and could only do chats, which are way easier because at least you can actually ask the customer questions instead of having to hunt everything down. They had to hire five more techs to try and deal with the workload that I had been silently solving for months on end, but no one actually ever wanted to actually handle all of the bizarre issues. Response times went from one day to one month. They never recovered and eventually closed all USA based support.\nGuess that Quiet Fire cost them a lot more then all of those Quiet Quitters.'"
    ]
}