{
    "username": "Sonova_Bish",
    "contributions": [
        "In response to 'I remember asking why it was “just 15 minutes” when they thought it was no big deal for me to come in early to open and stock the rooms for free, but 15 minutes was worth making a big production of when they perceived me signing into the computer “late”. It’s funny how the perception of time changes depending on who it benefits, isn’t it?!', a user said: 'I'd have just signed in first. If they didn't like it, they could fire me. Then I'd explain what happened to the state labor board. It's probably a federal crime, since the feds sued Walmart 20 years ago for people working off of the clock.'",
        "In response to 'I was young and just trying to do everything the way I was supposed to. The sad thing is that I did often get in before 8 but still never managed to get my morning stuff done quickly enough regardless. I should also mention that I didn’t notice this was how she was doing it until I paid attention after I was written up and they mentioned her and how I should emulate her because mornings were always busy with a bunch of nurses and doctors walking around and people checking in and general morning chaos. I always assumed that she was rushing around like the rest of us. Nope! Just chillin at the nurses station in her corner desk saying “I got some rooms ready when I came in earlier”- she didn’t, I knew because I was the one who had gotten all the ones on that side of the hallway done. Sorry for the over the top level of detail, it’s just that all of these memories are flooding back, lol', a user said: 'To be fair, I didn't get bold until my 30s.\nLots of bosses get off on the miniscule amount of power they have. I was a salaried manager for awhile. The company was oppressive. It seemed like the assholes and bullshitters got ahead. My boss was promoted twice and he was a terrible people person who \"ruled\" through aggression. He was later terminated. His boss was even worse.'"
    ]
}