{
    "username": "Sorge74",
    "contributions": [
        "In response to 'Someone would definitely hire him. There’s so many bad football coaches and he’s certainly better than some of them', a user said: 'I'll never understand how there are so many bad coaches, or hell bad QBs in the NFL'",
        "In response to 'Quiet quitting is a hilariously stupid phrase that I love because it implies that people have an obligation to work more than they are paid - which they don’t .\nPer Wikipedia:\n“Quiet quitting is an application of work-to-rule, in which employees work within defined work hours and engage solely in activities within those hours. “\n… the fuck do employers think a job is?', a user said: '10 years ago millennials were hungry and willing to do anything for a job, and got shit on...now apparently some Just don't give a fuck and just want to do their job. Apparently just doing your job is bad....\nIm personally still hungry, so let's fucking go.'",
        "In response to 'Maybe people are finally figuring out their employer has zero respect or care for them, so why do more than what's required.', a user said: 'I get that, employers are having whiplash from folks banging on the door to work for shit money....\nI'm lucky enough to work for a fortune 100 that about 90% of employees love to work for. Shit I'm in what is considered the worse experience part of the company and I love the shit out of it.'",
        "In response to 'Quiet firing is more apt. They don't reward you for going above your scope and if they do it's peanuts. Then they wonder why no one is driven to go beyond.', a user said: 'I'm so glad I finally work for a good company, where I can read stuff like this and realize it doesn't apply to me'",
        "In response to 'The amount of cars I see on the roads at random hours during the week like 9 am-1pm is insane. So much traffic  you’re telling me all these people are third shift workers, restaurant workers ? I don’t buy it lol. It just blows my mind how there’s bumper to bumper traffic on a Tuesday at 10:30 am. Maybe these are all work from home people going to the park to do their work lol', a user said: 'I used to sell cellphone back in college and a little bit after. You might think to yourself that cell phone stores are busy after 5:00 and on the weekends when everyone is off. Can't be further from the truth. This is over a decade ago now so nothing changes.'"
    ]
}