{
    "username": "Souped_Up_Vinyl",
    "contributions": [
        "In response to 'It’s also a morale issue. I’ve worked shops where everyone was pretty happy. We would always do more than our ‘job description’, but the pay was good and the owner was a genuinely good person.\nIf people only want to do the minimum, the company has problems. Not the employees.', a user said: 'Like, I’m sorry your entire generation was fooled into thinking that was how work was supposed to be, but it’s not; and this “work/smile harder!” mentality is at the root of a ton of American problems that no one wants to talk about.'",
        "In response to 'I mean to some extent it used to matter if you went above and beyond. You truly could go from janitor to VP with a high school diploma and the companies would actually try to take care of their employees. Boomers love to wax poetic about those old days but don’t realize that companies are now faceless, soulless giants that don’t give a shit about employees the way they used to.', a user said: 'Right, they take the same set of circumstances and attempt to apply them to the modern workforce, without actually acknowledging that the landscape has dramatically shifted since 19’dickety6. The icing on the cake is that a lot of them buy into this logical fallacy and find casual ways to bully young folks into thinking that the mess they made for us is somehow our fault; and then they turn around and wonder why mental health problems are coming to a head at alarming rates.'",
        "In response to 'LOL, yep. Just pull those bootstraps harder snowflakes! We’re fucked', a user said: 'I don’t think we are. I think that this sort of reactionary sentiment is indicative of fear that people are getting informed about their working conditions and rights. Education is absolutely key to tangible change. If the reaction to people getting educated is firing them for a nonexistent problem; you’ll soon have a massive class of people who cannot work to afford food or shelter, and history has shown us that that is precisely when things get ugly.'",
        "In response to 'as a society, even if it collapses, we have the resources to rebuild. as an individual, it's likely that even if your the one to survive,( which is a slim chance in itself) you'll lose people you care about/live in poverty/have chronic health issues/end up homeless, and these are the mid options. and even if you avoid all of these things, you'll probably have to leave everything you've known and move far away due to climate change, take any work including exploitative work, and be incognito with people who love their oppression.\nit's the rare lucky ones who even get to the starting point of resisting, which if your on this board your at least adjacent. so saying we're fucked isn't indicative that the revolution is in jeopardy, it's that nobody not in jeopardy would even think about tearing the system they live in down.\nwe are fucked, and it's not reactionary to say that it's too late for many. what would be reactionary is denying empirical reality, and instead fall prey to false optimism. that's not to say there isn't real reasons to be optimistic, but that many will not be able to partake of those reasons.\nand yes, we will soon have a mass class of people who cannot work, and soon reactionaries will sweep into power to cut survival benefits. Jan. 6th was the start, and not the end. time to get out your knuckle dusters.', a user said: 'To clarify, the “sort of reactionary sentiment” I was referring to was in reference to the concept of people getting up in arms about “quiet-quitting”, not the commenter’s sentiment; but I can see how it may have read that way. \nIn response to your further statements, what I can say for sure is that I refuse to give into doomerism. I think it is one of the banes of the current working class struggle and only serves as an excuse to drag others down (not that that’s what you’re doing, it’s just a very slippery slope and a common trend amongst younger people that I’ve noticed nowadays). If I can help spread a message of genuine hope instead of one of crippling despair, I will have at least done something. I choose to do that through the education of my fellow human beings. \nIf some right-wing person decides that that isn’t good enough, and decides to end my existence because they perceive my actions as evil, I will pity them, forgive them, and die knowing that I loved the world and only wanted what was best for it.'",
        "In response to 'Original Post: Quiet Quitting I monitor the AP email at work and get a lot of strange solicitations but this one really pissed me off.  It was an add for a webinar about ways to combat quiet quitting but their definition was ridiculous.  \"Quiet Quitting is when employees only do exactly what is expected of them never more\" how is this quiet quitting and not just doing your job. I'm both engaged and confused.  I'd heard the term before but never had it defined and man the revolution can't come soon enough!', a user said: 'It’s a response to informed people not taking on any more than what they’re being paid for; and of course, it’s phrased in a way to make it seem like it’s the lazy and entitled approach. It’s just the “avocado toast” bullshit rearing its idiot pro-capitalist head again.'",
        "In response to 'I love that American workers are STARTING to wake up.', a user said: 'It’s not necessarily the workers’ faults. There is a very real and active movement to vilify real workplace education. In fact, a majority of the farming sector was isolated, brainwashed, and militarized to vote against its own interests while we were not paying attention.'"
    ]
}