{
    "username": "SouthernZorro",
    "contributions": [
        "In response to 'Original Post: You’ve Heard of Quiet Quitting. Now Companies Are Quiet Cutting Layoffs are down, but employers are still finding ways to cut jobs -  Is this normal or economy tanking? More problems expected in late 2023 or 2024?\nWorkers are waking up to emails and team-meeting requests with a jarring message: They aren’t fired but their jobs are gone.\nPeople on the receiving end of these memos describe running through a range of emotions, from relief that they’re still employed to a sense of dread that their bosses secretly want them to leave.\nhttps://archive.ph/cYXyk\nhttps://www.wsj.com/lifestyle/careers/youve-heard-of-quiet-quitting-now-companies-are-quiet-cutting-ba2c326d', a user said: 'Senior execs love cutting jobs because that's the easiest way to increase profit margins in the short term. It's really that simple.'",
        "In response to 'It feels like every company has just been doing quarterly layoffs and other forms of headcount reduction to try to maintain the books, until... what? Revenues magically improve? There's nobody left to fire? Total collapse of the balance sheet and bankruptcy?\nI guess it's better to stay afloat/alive another quarter than not, but the end result is the same: if investors don't accept lower returns so as to afford to keep their employees (and therefore keep the business operating), then they'll just strangle their money machines by both crashing their revenue (nobody left to build/develop/maintain their product) and contributing to the crash of their market (nobody has any money left to buy their shit). It's just a slow death spiral instead of a fast one.\nInvestors have no good ideas or ability to solve these issues. That's why they invest, instead of create.', a user said: 'Traditionally, a lot of BigCorps staff up to implement new projects they expect them to bring in new/more income, then lay off the people who implemented the projects after they're done. This is particularly characteristic of companies with large IT footprints like banks.'"
    ]
}