{
    "username": "SpiceEarl",
    "contributions": [
        "UCLA SPORTS Analysis: After years of quiet quitting, Chip Kelly admits he didn’t want to be at UCLA https://www.latimes.com/sports/ucla/story/2024-03-05/analysis-chip-kelly-didnt-want-to-coach-ucla",
        "In response to 'Original Post: UCLA SPORTS Analysis: After years of quiet quitting, Chip Kelly admits he didn’t want to be at UCLA https://www.latimes.com/sports/ucla/story/2024-03-05/analysis-chip-kelly-didnt-want-to-coach-ucla', a user said: 'The Ducks were fortunate to get the best out of Kelly, before he got burned out.'",
        "In response to 'Chip Kelly made Oregon into a powerhouse. I wish we had the playoff back then', a user said: 'Absolutely, he took the Ducks to the next level. In four years as head coach, he took the Ducks to a BCS bowl four times, including Oregon's first appearance in the national championship game. Without that run, and their performance in subsequent years, I don't know if the Ducks would have even been considered for membership in the Big Ten.'",
        "In response to 'Knowing what became of Helfrich, how much credit does Kelly get in your opinion for the 2014 season?', a user said: 'Helfrich does get credit for helping develop Marcus Mariota, when he (Helfrich) was an assistant coach. However, Helfrich inherited a lot of talent leftover from Kelly's tenure.'",
        "In response to 'Eh, they invited Maryland and Rutgers.', a user said: 'True, but those were media market plays. As much as I love Oregon, Portland is not a top 20 market.'",
        "In response to 'Phil Knight made Oregon into a powerhouse. Mike Bellotti built the program. Chip Kelly raised the roof.', a user said: 'I would not disagree with that. Kelly instituted the hurry-up, which got the Ducks to the next level. As much as I absolutely appreciate and admire what Belotti did, Kelly figured out how to take that next step.\nWhat Phil Knight has done for the athletic program, and the university as a whole, is really remarkable.'",
        "In response to 'Kelly, Taggart, and Cristobal all left Oregon voluntarily and have really struggled since.\nI think it's actually less of an indictment on Kelly than it is a testament to how strong Oregon is as a program.', a user said: 'What was nice was that Oregon got paid for Taggart and Cristobal leaving early. Even better, the Ducks didn't have to pay a termination fee for Dan Lanning, as his contract with Georgia allowed him to leave for a head coaching position.'",
        "In response to 'I kind of live for local papers taking shots at football coaches about their honor, integrity, and respect for the institution. They're always so overly dramatic. I love it.', a user said: 'We have John Canzano, in Oregon. He's exactly as you describe. He occasionally gets a scoop, and publishes information first, but it seems like he often spreads rumors and innuendo.'"
    ]
}