{
    "username": "springvelvet95",
    "contributions": [
        "In response to 'Original Post: Quiet quitting Update: wow, the support!  Thank you all!\nWill now only refer to this as \"Just doing my job\"\nStarting today, I quit working for free.  I won't manage the school food pantry, sew for students or school programs ( uniform alterations, letter jackets, CTE jackets, prom dresses), work the gate or track meets, cover hall duty for others, support fundraisers, sponsor or coach teams, provide snacks to students, participate in staff potluck meals.\n I will arrive 2 minutes before my designated duty time and leave 2 minutes after hours.\nI will take off every Friday to help my family, and take off every PD because I have yet to attend a worthwhile PD (I have only been teaching since 2001, a valuable PD is unlikely to occur in the next year).\nI have 80+ days of leave accrued, and I will leave as few on the table as possible. \nThere is no union power in my state, so I am on my own.', a user said: 'One coworker used to comment how amazing it was that I walked out at 3:00 every day. She made it sound like I must be super organized and had my work done. No, I just left it there. The comment also had an edge to it, like me leaving “so early” was somehow sketchy. Duty day/contract hours, if it can’t get done then, it’s not getting done. Fuck the martyrs.'",
        "In response to 'Those types of teachers, the ones who are always there to work for free, do so much damage to the profession.\nOur school has a Saturday school program for kids who are behind. It is actually about $$$ though because we can get attendance money from the state for the kids that show up.\nWhen it started, the principal at the time expected teachers to work for 4 hours on Saturday for free. He wanted at least 1 teacher from each department and, of course, there were teachers willing to do it, \"for the kids.\"\nBut the rest of us said Hell no. We got the union involved and got paid for it.  But I told those teachers that they could still choose to not do a timesheet if they didn't feel they should get paid', a user said: 'I feel so stupid! I think it was 2009 when Saturday school came to our school. My whole team was making out a schedule, and I said “I’m not doing it.” The room froze and I became a pariah. Paid or not, I can’t remember, but no way. They attacked me and my argument was that they had plenty of class time to do work, and they didn’t so why would they do it on a Saturday? It never occurred to me that schools got extra money for Saturday school! I know now, that it’s always about the money.'"
    ]
}