{
    "username": "SpryArmadillo",
    "contributions": [
        "In response to 'Original Post: Can we talk about quiet quitting again? Hi,\nI’m a middle-aged associate professor in the humanities at a private university that is thriving as far as these things go. I used to be quite active on this sub, and it helped me both through and past a long period of burnout in 2021–23. Due to some poor thinking and carelessness on the part of administrators, my salary declined last year because I didn’t get as much summer teaching. Downloading my W2 this past week and seeing the impact has kinda wrecked me. I can’t believe at my career stage I earned less in 2024 than in 2023.\nMy immediate reaction is “they pretend to pay me and I’ll pretend to work.” So I’d like to stop saying “yes” to service requests, pushing scholarship through conference presentations to publications, and freeze development on my pedagogy. The issue is that if I pull back from giving a full effort, none of the people who caused this—my unit-level head, staff and admin in the budget office, the senior leadership of the school, and the finance-bro board of trustees—will even notice. But people who have done me no wrong—my students, my colleagues, my department chair—would be impacted. They’d have to pick up my slack, rope others into doing what I currently volunteer to do, get less interaction with their instructor, etc.\nI know this issue has been raised a million times, but please indulge me: what’s the appropriate response to falling salary when for personal and profession reasons switching institutions isn’t an option? How do you frame a decision to pull back to colleagues or chairs you respect?', a user said: 'Forgive me if this seems callous, but if someone is on a nine-month appointment it really isn't a salary decrease when only making nine months of income. Summer months are bonus, not something we are entitled to receive. It is a peculiarity of the education system (primary, secondary and higher ed in the US), but it is what it is and we all know the deal when taking the job.'",
        "In response to 'This is true; however, when assignment of summer courses has been done in a certain way and then it's changed unexpectedly that's not okay even if it isn't contracted.', a user said: 'Being frustrated and angry in that situation is perfectly understandable, but \"quiet quitting\" as OP contemplates is an overreaction. It is petty and entitled behavior.'",
        "In response to 'With all due respect, fuck that. If you want to be exploited and treated with a complete lack of disrespect you do you, but some people don't like being treated like shit and they do what they can. Work to your contract.', a user said: 'WTF are you going on about? Presumably OP has service and scholarship expectations as part of their nine-month contract. There is room to modulate how much one does, but \"pretending to work\" and \"stop saying yes to service requests\" as OP says is bullshit. It's actually NOT working to their contract, as you say.'",
        "In response to 'Taking on more service than is required... IS NOT REQUIRED.', a user said: 'You’re having a conversation about an imagined scenario. OP wrote about saying no to service requests, full stop. Not extra service. In my experience nearly all service roles come as requests. You can say no to some of them, but saying no to all of them as OP wrote would mean you’re not meeting the basic expectations of the job (unless you have an appointment with zero percent service requirement).'",
        "In response to 'You're wrong. Stop saying yes to requests is not the same as shirking existing obligations. Go read it line by line slowly, you appear to have difficulties with reading comprehension.', a user said: 'Actually it’s pretty clear. OP feels entitled to something not in their contract and is pissed when they didn’t get it. I feel for the person but they are in the wrong. And as I’ve said, in my experience we are not ordered to do any particular service activity but there are explicit expectations that we do something. So saying no to everything service requests will absolutely put you on the wrong side of your job obligations.\nIf you are in a department that orders you around (such that you are ordered to do required service and requests are strictly extra) then you’re in a shit department.'"
    ]
}