{
    "username": "StabbyPants",
    "contributions": [
        "In response to 'Well… sort of. The logic is different if you are a traded company.\nAt a traded entity, if you push employee costs down the line but still make sure you keep shareholders whole and happy, you will get investment… so you get more money to spend incorrectly.\nEven though you will turn over employee resources and pay a premium to get them back, so will your competitors in many cases. If everyone is in a cycle of purging and retooling personnel, then the pain is not seen as self-inflicted. It all seems to be “environmental” at that point… you know, the old “Government is paying people to sit on their asses so nobody wants to work anymore” line of critical thinking 🙄\nSo why don’t boards and shareholders cry about turnover? Sometimes they do; but most of the time they don’t see the impact because their shares still payout. Turnover may even be where the gains they see that period originated.', a user said: 'so you're saying that a company focusing on bottom line isn't seen as that bad, leaving out that focusing on top line is how you get to be F50. keeping good employees and paying them well is a great strategy - just look at costco. they pay above industry standard, have no plans to change, and have no significant recruiting costs'",
        "In response to 'If you’re not 15 minutes early, you’re late\nI prefer, \"If I'm not 15 minutes late, I'm on time.\"\nYeah, I'll bet you do.\nI just told you I do. No wager required. My take is equally as valid as yours unless you feel it's your prerogative to steal from employees.', a user said: 'ah yes, the amazon start time. 1:00 meeting, start at 1:03 or 5'",
        "In response to 'I was the relief worker for a few different positions in a Hospital kitchen a long time ago. One day I might be working the front of house in the cafeteria, another day doing dishes, another day delivering food to patient rooms, etc. I was always scheduled for 40 hours every week. Didn't matter what job I was doing that day, just that I was getting paid.\nMy boss leaves on maternity leave, and a temporary manager comes in. Redoes the schedule for some reason. I look at it, like I did every time it was posted, and noticed that for one entire week I was not scheduled. WTF?\nNo notice, no talking to me beforehand, no warning whatsoever.\nI called up and quit a few days later. That's quiet firing.', a user said: 'nah, the legal term is constructive dismissal'",
        "In response to 'Original Post: Anyone else's departments like completely falling apart due to people quitting / quiet quitting? We are a growing business, as such we went from supporting about 300 people and 100 servers to 1500 people and 200 servers, multiple office locations, and 1000 azure resources.\nOver the last two years, our sysadmin / cloud team went from 3 to 2, to 3, to 4 (for only a few weeks), to 3, to 2, to basically 1.\nThe candidates we are getting want 120k+ fully remote and aren't even that knowledgeable.\nInstead of letting me build a team how i see fit, and giving me a director role, the current VP and director seem to think we can just get through this... They are rolling the dice and think that it will get better by 2023 somehow.\nCompany implosion coming... which will probably result in me losing my job. HA.', a user said: 'Company implosion coming... which will probably result in me losing my job. HA.\ndoubt it. i hear you can get 120k full remote salary even if you don't know that much'"
    ]
}