{
    "username": "steboy",
    "contributions": [
        "In response to 'Original Post: Move over, quiet quitting. 'Rage applying' is the latest form of worker revenge | CBC Radio [External Link]: https://www.cbc.ca/radio/costofliving/rage-applying-1.6759642', a user said: 'I don’t disagree with trying to maximize your income. Do you boo-boo and get that paper.\nBut also, the person in the article got ticked her employer hired someone they “weren’t comfortable around”, whatever that means.\nI mean, barring this specific individual having traumatized the existing employee in some way, you need to suck that up.\nPart of being a functioning member of society is learning how to cooperate with people you don’t like.'",
        "In response to 'But why should she have to? She didn't fight or a make a scene. She found a new job, something she's perfectly entitled to do for whatever reason she wants.', a user said: 'Absolutely, I don’t object to that.\nI’m saying, if you can’t work with others, that’s a you problem.\nThis quote from the article spells that out pretty clearly:\n\"I was sort of hurt,\" Amanda told The Cost of Living, \"very upset with the situation and how my boundaries weren't being respected.\"\nI’m curious to know what those boundaries are.\nWhat if she were just, say, a racist and they hired a black person?\nShould that boundary be respected?'",
        "In response to 'I agree with your sentiment but that example is kind of an extreme \"what if\" and frankly, very black and white (not okay). It could be much more complicated than that but we'll never know.', a user said: 'I think it’s kind of telling that they’re\nnot\nsharing the boundary being violated.\nObviously, there is some category of person she is unwilling to work with, because if it was someone specific who had\nin some way victimized her\n, and she had brought her objection to HR and they still hired them, she might have grounds to take action against her employer.\nI.e. say she was the victim of a sexual assault, and they wanted to hire her assaulter and put them on a team together - that might be actionable.\nAnd obviously that would cause the entire tone of the article to shift. It would no longer be about “rage applying”.'"
    ]
}