{
    "username": "Steve-C2",
    "contributions": [
        "In response to 'My dad gave me this kind of Studs Turkel nonsense when I was growing up. For example, he'd tell me about this guy who wanted a job at a store so badly that he started cleaning it for free for\nmonths\nuntil senpai finally noticed him and gave him a wage for it. I look back on it, and I think this is probably why I put up with terrible jobs for so long. Hell, when I got fired the one time, my mother had a nervous meltdown about how this meant I was going to leech off of her now that I was\nunemployed\n. I literally asked for nothing, but it didn't feel great', a user said: 'I swear, everyone knows the same guy.  Seems like every single adult above a certain age knows a guy who was so desperate to work at a particular place that they cleaned it for free for months until they got hired.\nEither:\nThey're all making it up\nThey all knew the same guy\nThere are an unexpectedly large number of people who are a unique combination of dumb and desperate.\nReality check:\nMost places won't let someone handle a broom for them unless they're employed.  Liability issues\nMost places will kick out the person who arrives with a broom to start cleaning\nReally bad PR\nLiability issue\nThe guy who starts doing that risks getting a trespass warning.'",
        "In response to 'This \"quiet quitting\" thing has such a weird name. It's literally \"Doing your job.\"\nYou don't pay the price of a 97' hyundai and expect the performance of a F1. If you want you car to run at that speed, well... it will certainly cost you.\nI really hate how this corporate hustle culture eventually became a scam to have workers give their 100% while giving them a 20% salary. What was the point of that in the first place? Why did we allow ourselves to be used like that? I remember people shitting on the french for being on strike all the time, supposedly being \"lazy\" and demanding their rights. Guess what? They are correct and we were the suckers.\nPaying X and getting X\n10\ndoes not apply anywhere else in the market, (certainly not profesional services) why are employees any different?', a user said: 'I really hate how this corporate hustle culture eventually became a scam\nto have workers give their 100% while giving them a 20% salary. What\nwas the point of that in the first place? Why did we allow ourselves to\nbe used like that?\nBecause we were trained by boomers, who benefitted from the extra work that they did.  Back in the 50's through the early 80's, hard work would get you ahead.  If Tim the stockboy at the local grocer saw a task that needed to be done that wasn't his task and he did it anyway, he would be rewarded with a raise and a promotion.  Now if Tim the stockboy sees a task that needs to be done and it isn't his task and does it anyway, it becomes part of his job and there's no raise.  I have lived through that.  I did extra work for one company and it was beneficial for a lot of people.  When I asked why my compensation did not reflect that when it came time for a raise, my manager said that what I had done was part of my job now and I should not expect an increase for it.\nBasically the way we were trained to work was based on the way things were between about 4 to 7 decades ago, not the way they are now.'"
    ]
}