{
    "username": "StevesHair1212",
    "contributions": [
        "In response to 'What I totally fail to understand about all this is how China can both have a looming demographic crisis where there aren’t enough workers to cover their retirees and have high youth unemployment at the same time. Anyone wanna explain like I’m a decently well-educated adult?', a user said: 'Think 2008-2012 millennials. You just graduated, but the economy is in a slump and no one is hiring. But on top of that you also have a shit ton of old people.\nChina letting Evergrande declare bankruptcy is huge. Things must be really bad to let a state capitalist agency go under with all the saving face culture they have. Their covid rules really shot them in the dick. They centered their economy around foreign investment and cheap exports but 3 years of no economic activity made those foreign partners go elsewhere for a reliable partner. Also china is way more educated than it used to be so people demand more money and it’s suddenly not cheap labor at all. China wants a blossoming service economy but they are China so understandably no one trusts them with banking and besides the West already has established places to do that'",
        "In response to 'Sounds like China might need an opportunity to get rid of a few million working age men or large portions of foreign land, rich with minerals and natural resources which they can work on.\nEither WW3 or nicking a bit of Putlers slowly collapsing Eastern regions would work.\nEither way, someone's fucked.\nGreat write up OP.', a user said: 'China knows its being heavily watched since Russia’s invasion. Also the region has slowly shifted from wary to antagonistic towards China. An invasion of taiwan would create a Pacific Nato as countries like the Philippines, Vietnam, and Laos sprint to join the US/South Korea/Japan side. Xi cant hide a mobilization and dramatic increase in war production. Training and producing equipment for a million+ man amphibious invasion takes a considerable amount time. The invasion of Taiwan will be telegraphed even more far out than the Ukrainian one was. In that time china will become an economic poison to those invested in it. Hence why the US has been on-shoring so fast. Congress cant agree on what color the sky is but the CHIPS act passed in a couple days'"
    ]
}