{
    "username": "stickers-motivate-me",
    "contributions": [
        "In response to 'I unfortunately worked with a malicious boomer who was actually “slow working” and was rewarded for it because she liked to eat at her desk and try to “work through lunch.” She was simply stalling to build up her time on the clock but the owner deemed her a harder worker, which she wasn’t, because of her constant presence at her desk.', a user said: 'I was a nurse at a doctor’s office, and we had a routine of things to do as we walked in the door (open the patient rooms, checking the gloves/soap/etc) and then sign in. They were these old school doctors and wanted things done in a specific way. Well, they used to get pissed off that I’d sign in to my computer at 8:10 because it was supposed to be 8:00, but they also were adamant that the rooms were opened first. Ok, so I’ll come in for 7:45 and start getting paid from that point or leave 15 minutes early to make up for it? No. I was told people were supposed to come in 15 minutes early, and coming in at 8 meant I was late because I’d be signing in at 8:10. Opening patient rooms “wasn’t really work because I was walking by them anyway”  so it shouldn’t take 10-15 minutes (except that I always had to replenish gloves or sanitizer or whatever, I wasn’t just literally opening doors) That was bullshit, so I complained that they were asking me to work without pay, and everyone acted like I was being ridiculous because it was “just 15 minutes” but the worst is that they’d tell me that my co-worker was so great, she gets there a half hour early and works through lunch!!!! She’d get there at 7:30, sign in, make a bagel and coffee, and read the paper. She wasn’t working! Who cares when she got there to eat breakfast? She’d do the same thing at lunch. Eat at her desk with a bunch of charts stacked up near her and maybe enter one or two over the half hour at the most? I bet she charged for that extra hour per day. Meanwhile, number-wise, I typically entered twice the amount of charts each day just doing it in between patients. But that didn’t matter, she came in early and worked through lunch. I ended up leaving when I heard through the grapevine that I was about to be fired for being consistently late (even though I was always in my first patient room by 8!!!!) even though It killed me to let them get away with it on principle. This was 15 years ago and I still get annoyed thinking about it.'",
        "In response to 'everyone acted like I was being ridiculous because it was “just 15 minutes”\n15 minutes per work day day is 65 hours a year. You should have asked them if they'd be happy working two weeks with no pay every January and seen what their response was.', a user said: 'I remember asking why it was “just 15 minutes” when they thought it was no big deal for me to come in early to open and stock the rooms for free, but 15 minutes was worth making a big production of when they perceived me signing into the computer “late”. It’s funny how the perception of time changes depending on who it benefits, isn’t it?!'",
        "In response to 'I'd have just signed in first. If they didn't like it, they could fire me. Then I'd explain what happened to the state labor board. It's probably a federal crime, since the feds sued Walmart 20 years ago for people working off of the clock.', a user said: 'I was young and just trying to do everything the way I was supposed to. The sad thing is that I did often get in before 8 but still never managed to get my morning stuff done quickly enough regardless. I should also mention that I didn’t notice this was how she was doing it until I paid attention after I was written up and they mentioned her and how I should emulate her because mornings were always busy with a bunch of nurses and doctors walking around and people checking in and general morning chaos. I always assumed that she was rushing around like the rest of us. Nope! Just chillin at the nurses station in her corner desk saying “I got some rooms ready when I came in earlier”- she didn’t, I knew because I was the one who had gotten all the ones on that side of the hallway done. Sorry for the over the top level of detail, it’s just that all of these memories are flooding back, lol'",
        "In response to 'Look at it another way, the co-worker could have known they wanted to exploit her for extra labor. Giving your bosses the impression that they're squeezing those few extra drops out while taking an extra hour of pay without the extra work? Sounds like they were screwing over the bosses you hated, no need to be angry about another employee giving minimum work for minimum pay.', a user said: 'Why should I respect someone for screwing managers over when she made it harder for me? It’s not cool to work with people like that when you’re a nurse- I’ve worked in other industries and while teamwork is always kind of expected, as a nurse in the office setting I was in, her being an ineffective worker made extra work for everyone else. She sucked.'"
    ]
}