{
    "username": "stimulants_and_yoga",
    "contributions": [
        "Is anyone else “quiet quitting” or just completely burnt out? I’m just completely over it. I used to be so “hungry” and now I’m catching myself doing the bare minimum, and I genuinely don’t care if I get fired.\nI think the largest factor is that I’m not getting paid until equipment ships and we’ve been on a year+ lead-time, so the carrot is essentially gone.\nI don’t have an ounce of ambition left in me, and it sucks because I have “golden handcuffs” to this job because I have over $50k in commissions waiting for me.\nIs anyone else feeling the same?",
        "In response to 'Some days I legit look at guys mowing lawns and think they’re lucky to do that work', a user said: 'I was a waitress for 7 years and sometimes I fantasize about working in a restaurant again.  It’s so funny that other people also have a similar longing.'",
        "In response to '\"Quiet quitting\" seems to be corporate spin for just doing your job lol', a user said: 'I think of “quiet quitting” as giving 30%, but still meeting the minimum requirements so I don’t draw attention to myself.\nI feel like the media is now saying that quiet quitting is doing 100% instead of 150%.   Maybe my definition is wrong, but what I’m doing feels more like it…'",
        "In response to 'I think the people who heard about salespeople making absolute bank and want to start a career in sales should definitely read through the comments here. There's a lot of truth and reality that's being said about having a sales career.\nIt's ridiculously common to be motivated and hungry for the first couple months you start a role, and you work really hard, and you can get burnt out very easy. It's not a good feeling. There's a lot of stress that comes with the job. It can be very mentally strenuous.\nSales is a very rewarding career, but it takes a strong mental to be able to weather the constant rejection and pressure of quotas, or if you're commission only, just being able to put food on the table.', a user said: 'I agree with your message, but in my situation, this wasn’t a quick burnout.  I’ve been with my company for about 4 years.  I think the burnout is due to an acquisition by a company that has completed ruined our culture.  Plus, the inability to manufacture anything.\nI genuinely think I would’ve remained hungry if we weren’t acquired.  It just shows what poor leadership, shitty processes, corporate bullshit, and worse comp plans will do to a sales team.'",
        "In response to 'My man I am 30 and already starting to feel the burn out of Sales.  Thinking of getting a specialised Masters degree in my field and getting out.\nLove closing deals, love the chase, but really starting to wonder if the perpetual stress is worth it.\nI've had a few major deals slip the last two quarters so I'm probably just salty.  But it's tough seeing friends take 2 week international vacations without a stress in the world while I feel bad even taking a Friday off.', a user said: 'I’m also 30, which is causing a bit of a crisis in my world.  I keep saying that I don’t know what I want to be when I grow up anymore.\nWhen I started making 6-digits at 24, I thought I would want to be in sales for the rest of my life, but now I’m not so sure…'",
        "In response to 'I’m right there with you. Mentally, the Covid quarantine was a game changer for me.\nLike a lot of people, I spent the quarantine working from home. By home, I meant I left my apartment in the city and moved 600 miles away to be closer to family.\nOnce Covid was over, there was no way I was going back. So, I quit and started working for another company. That company was quickly bought out, and a year later they still don’t have a plan for how they will move forward. So for the last 16 months I’ve been working from home, maybe 20 minutes a day, for a six figure salary.\nI’m feeling the same supply chain/lead time issues as you, so every time I talk to a client I feel like I will only disappoint them by not being able to get them what they need when they need it.\nLike you, I really don’t care if I lose this job. If that happened today I would not even look for another job until 2023. I would spend the rest of the year figuring out what I wanted to do next, because I’d want it to be completely different than what I do now. I’m almost debt free, so I’ll probably make that change soon anyway.', a user said: 'Covid made me slow down for the first time in my life.  It was a slap in the face to not be going 100mph all the time.  Now that I’m used to that pace, I don’t really want to go back to living that way.\nMaybe I would be more inclined to motivate myself if we could actually manufacture goods, but like you said, I don’t even want to try to convince customers to buy when our lead times could be 18+ months due to the huge backlogs.'",
        "In response to 'I needed to read this: my responsibilities have stepped way beyond what I joined for, I'm treated terribly and the director is nothing short of incompetent.', a user said: 'Literally same!!!  They’ve made the sales team responsible for what used to be 4 different support jobs.\nIf I hear “these are your projects, so this is your responsibility now” while also paying me less than they ever have, I’m going to lose my mind.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'Med device'"
    ]
}