{
    "username": "StolenWishes",
    "contributions": [
        "In response to 'Original Post: What happened with quiet quitting? I'm definitively going to start quiet quitting this next month. I'm not proud to work at my current company (quite the opposite) and my boss thinks he's paying to make me his slave.\nBut I was looking for tips on how to start quiet quitting here on Reddit and I could only find old posts. It seems like it's not a thing anymore. Is quiet quitting dead? What have I missed?', a user said: 'I was looking for tips on how to start quiet quitting here on Reddit and I could only find old posts.\nThere have been no revolutionary new discoveries in this area. Follow the old tips.'",
        "In response to 'Original Post: How to quiet quit without being detected after being known to be an extra-mile person at work? Firstly, I know - quiet quitting is just doing your job and nothing extra. Stop repeating the chant.\nSecond, I was known to be THAT person, who goes out of his way to help. I guess I associated my self worth with how company values me.\nIt took a couple of a years and being passed over a promotion to wake up.\nI cannot quit at the moment, or change jobs, I have been looking and nothing suitable on the horizon yet.\nThe question is how do I make the shift in attitude without getting so much attention especially that I am known to be a hard worker.\nEdit: Thank you everyone! Very useful tips! Read every single one! 🙏', a user said: 'how do I make the shift in attitude without getting so much attention especially that I am known to be a hard worker.\nI would think: gradually and apologetically. Start answering select requests with, \"Gosh, I'm sorry, I'd love to help, but my plate is already full [or substitute the preferred jargon of your workplace].\" Do this more frequently as time passes.'",
        "In response to 'I would suggest as well getting a couple of long-time advocates to assist you. Not in a direct way, but in an Outlook Calendar way. Have a 'collaboration session' that you only infrequently actually attend. So that time is blocked out on both of your calendars, but there is a mutual understanding that nothing occurs during that time. Or even just a 'check in' in the first two minutes and then the next hour does not need to be anything.', a user said: 'Or as a plan B, schedule time with yourself.'",
        "In response to 'Original Post: Has anyone \"Quiet Quit\" as a response to RTO? I'm not in this position, so I don't need advice, but I'm curious to hear everyone's thoughts on this.\nI work remotely, which is why I follow this sub. I've seen a lot of people in this sub who are being asked to RTO. I've been thinking about this the past few days as the sub has been full of people discussing how to respond to RTO mandates.\nLots of people, including myself, are speculating that the recent push for RTO is force people to quit their jobs. If they don't fire you then they don't have to pay out unemployment. And, you have to have significant savings to go without a job.\nWhat do you think about about returning to the office and quiet quitting so you can still draw unemployment? Anyone done this?', a user said: 'By mandating my presence in the office 3 days a week, they made commuting one of my job duties - so I perform that duty during working hours.\nAnd an hour in the office is less productive than an hour at home - if only because the office is more distracting and depressing.'",
        "In response to 'Original Post: And they wonder why we quiet quit.... Worked at a this place for about a year, did a major systems overhaul with them where I was the front runner for work completed for the project, which helped us finish on our deadline, got praised and honored for my work, then I was told I'd get a nice raise, my raise was less than a fucking dollar in software development... I got a 2% raise when inflation is absolutely ravaging the country and prices have gone up much more than 2%.. works a fucking joke...', a user said: 'Unless and until you see a consistent pattern of an employer tangibly rewarding hard work, don't work hard. Most employers reward hard work only with more work.'",
        "New type of quitting discovered \"Quiet quitting is easy to identify; employees who are quiet quitters visibly reduce their effort and avoid going the extra mile. Soft quitting, on the other hand, happens quietly over time. Employees don’t necessarily reduce their work output, but their enthusiasm fades, their curiosity dwindles, and their emotional connection to their work diminishes.\"\nThe cure is to lick the boot harder.",
        "In response to 'Who the fuck is emotionally connected to their work?', a user said: 'Masochists?'",
        "In response to 'For me, I like to find the ‘effort bottom’.\nGive 150% at the start, really cement that first impression. Then, every month pull back like 10% effort. Find how little effort you can put in without anyone saying anything.\nCurrently at about 40% max effort, and nobody says sh*t. Funnily enough, I’m still like 3x as effective as most of my coworkers.', a user said: 'I’m still like 3x as effective as most of my coworkers.\nMaybe they're acting their wage better than you  😉'",
        "In response to 'Here to find out I’ve been soft quitting every job I’ve ever had.', a user said: 'You've been ahead of your time'"
    ]
}