{
    "username": "Stranger2306",
    "contributions": [
        "In response to 'I basically did that last year. After months of trying everything to get them to listen for five funking minutes, I put everything on google classroom. Every 10 min or so, I would re-direct and tell them the assignment and urge them to do it. The best part was if parents wanted make-up work…it’s on there. No copying to be done and my butt was totally covered grade-wise. So few did any work, that my grades were current by the end of class on the day things were due. Didn’t even take my laptop home! It was awesome!', a user said: 'Right, learning is a series of assignments on Google classroom.\nSounds like a riveting education.'",
        "In response to 'Original Post: Can we talk about quiet quitting again? Hi,\nI’m a middle-aged associate professor in the humanities at a private university that is thriving as far as these things go. I used to be quite active on this sub, and it helped me both through and past a long period of burnout in 2021–23. Due to some poor thinking and carelessness on the part of administrators, my salary declined last year because I didn’t get as much summer teaching. Downloading my W2 this past week and seeing the impact has kinda wrecked me. I can’t believe at my career stage I earned less in 2024 than in 2023.\nMy immediate reaction is “they pretend to pay me and I’ll pretend to work.” So I’d like to stop saying “yes” to service requests, pushing scholarship through conference presentations to publications, and freeze development on my pedagogy. The issue is that if I pull back from giving a full effort, none of the people who caused this—my unit-level head, staff and admin in the budget office, the senior leadership of the school, and the finance-bro board of trustees—will even notice. But people who have done me no wrong—my students, my colleagues, my department chair—would be impacted. They’d have to pick up my slack, rope others into doing what I currently volunteer to do, get less interaction with their instructor, etc.\nI know this issue has been raised a million times, but please indulge me: what’s the appropriate response to falling salary when for personal and profession reasons switching institutions isn’t an option? How do you frame a decision to pull back to colleagues or chairs you respect?', a user said: 'Question - you got paid less because you taught less courses over the summer, correct? So, where is the desire to punish the school coming from? You already did less work - the less work was done over the summer.'",
        "In response to 'I think OP was saying that it is the disparity that is depressing. That without their usual summer course load added in to what appears on the W-2 form, they see how puny their actual salary really is. It is depressing to see how they earned so much less because they didn't take on summer courses.', a user said: 'Ahh, gotcha.\nWell, Op. We all agree to certain things when we take the job. Saying no to service work or a comittee? Totally fair if your pay isn't worth it.\nBut \"freezing pedagogy developement?\" When you agree to be an educator, you're not agreeing to provide a minimal education. You really should be providing a good class for the students, and if the pay isn't worth it, then make room for the other hundreds of people trying to get into our jobs.'"
    ]
}