{
    "username": "Strong-Product6251",
    "contributions": [
        "In response to 'Original Post: I’m quiet quitting my PhD I’m over stressing about it. None of this matters anyway. My experiment failed? It’s on my advisor to think about what I can do to still get this degree. I’m done overachieving and stressing literally ruining my health over this stupid degree that doesn’t matter anyway. Fuck it and fuck academia! I want to do something that makes me happy in the future and it’s clear academia is NOT IT!\nEdit: wow this post popped off. And I feel the need to address some things.\n1. I am not going to sit back and do nothing for the rest of my PhD. I’m going to do the reasonable minimum amount of work necessary to finish my dissertation and no more. Others in my lab are not applying for as many grants or extracurricular positions as I am, and I’m tired of trying to go the extra mile to “look good”. It’s too much.\n2. Some of yall don’t understand what a failed fieldwork experiment looks like. A ton of physical work, far away from home and everyone you know for months, and at the end of the day you get no data. No data cannot be published. And then if you want to try repeating it you need to wait another YEAR for the next season.\n3. Yes I do have some mental and physical health issues that have been exacerbated by doing this PhD, which is why I want to finish it and never look back. I am absolutely burnt out.', a user said: 'I quiet quit my PhD. I spent years trying to get my project to work and it felt like no one in my lab, even my knew how to trouble shoot it. Everything I tried, failed. Post docs tried and failed, post docs from other labs at other institutions also couldn’t see a way out. I was working 12-16 hour days up until the beginning of my 4th year and I ended up hospitalized and it took me 6 month to make a full(ish) recovery. I lost my ability to walk, and hold even a pencil during that time. I’m now stuck with an autoimmune disorder and physically can’t do the same amount of work I used to do. My boss of course noticed. I continue to get sick regularly and for what? I was in the lab alone all the time and more than anyone and didn’t even get a first author paper. I have 4 relatives die during my recovery, and I selfishly didn’t step away from work because I didn’t want to “lose anymore time.” I realized my mistakes when I would cry every time I remembered my relatives that had passed… so much it would impact entire work days. I quiet quit, my boss noticed, and asked me to graduate in a year. I focused my time on learning important skills for the job I want, and of course have a lot of trust in my PI that’s very famous in their field. I do the things that are important for me but of course do the bare minimum needed to graduate and still be able to get a job.'",
        "In response to 'I quiet quit my PhD. I spent years trying to get my project to work and it felt like no one in my lab, even my knew how to trouble shoot it. Everything I tried, failed. Post docs tried and failed, post docs from other labs at other institutions also couldn’t see a way out. I was working 12-16 hour days up until the beginning of my 4th year and I ended up hospitalized and it took me 6 month to make a full(ish) recovery. I lost my ability to walk, and hold even a pencil during that time. I’m now stuck with an autoimmune disorder and physically can’t do the same amount of work I used to do. My boss of course noticed. I continue to get sick regularly and for what? I was in the lab alone all the time and more than anyone and didn’t even get a first author paper. I have 4 relatives die during my recovery, and I selfishly didn’t step away from work because I didn’t want to “lose anymore time.” I realized my mistakes when I would cry every time I remembered my relatives that had passed… so much it would impact entire work days. I quiet quit, my boss noticed, and asked me to graduate in a year. I focused my time on learning important skills for the job I want, and of course have a lot of trust in my PI that’s very famous in their field. I do the things that are important for me but of course do the bare minimum needed to graduate and still be able to get a job.', a user said: 'I also had another friend quiet quit her PhD due to poor mentoring skills from her PI. Her PI noticed and also asked her to graduate sooner than later, she got a first author paper, and graduated in 5 years opposed to the standard 6 in her field. Her and I still have very nice cv’s. You don’t have to be the best in academia. You don’t even have to be smart. Just stubborn enough to finish'"
    ]
}