{
    "username": "Successful-Style-288",
    "contributions": [
        "In response to 'Original Post: Quiet Quitting: What is it Really? Quiet quitting is a confusing term to me, but maybe I just don’t understand it. I have rarely ever given 120% to a job… maybe when I was fresh out of college when I had that mindset. But the years have jaded me. What people call “quiet quitting” (doing the minimum) is what I just call doing my job lol. It’s not like I refuse when they ask me to do more work (tho rarely do they ask), but I don’t SEEK more work out unless I’m just bored. For example, in my work, we work in Sprints and get assigned stories to do for those sprints. I just do those stories — not more or less — unless I’m just bored and have finished my stories weeks in advance, then I may grab a story for the next Sprint. I get paid by the hour so no work means no pay. But it’s not like I can ADD more stories to the current Sprint because someone else still needs to test them and THEY may not have capacity. So, a lot of times I just do things around the house since there always seems to be something to do at home. Have I been quiet quitting for years and just didn’t know it or is doing the minimum not really what quiet quitting is all about?', a user said: 'I think it’s basically like getting satisfactory or adequate on your report card instead of excellent or above average. Quiet quitting is not new most people do that as the norm. It’s only a new concept to people with a personality type of pleasing or over achieving. I used to go above and beyond but I’m also quiet and introverted so I don’t stand out. My colleagues that would join the conversation and group outings would get promoted. Not to say that some weren’t deserving but others I knew I was more competent than but it came down to who you knew for the promotions. I began to quiet quit until I found my dream job. More pay and less work and they value my quiet introverted self. Best of all I work mostly from home with the occasional office trip. I don’t even try that hard and get excellent reviews from my manager so quiet quitting isn’t necessary here but I still do bare minimum so they don’t start to give me more work. My boss likes that I don’t bug him and figure things out on my own. Apparently I do more than the last person before me that they make my half ass work look amazing.'"
    ]
}