{
    "username": "Sufficient-Bid1279",
    "contributions": [
        "Gen Z isn’t quiet quitting. They’re rejecting outdated leadership I tend to agree. How about you ?\nhttps://www.fastcompany.com/91281732/gen-z-isnt-quiet-quitting-theyre-rejecting-outdated-leadership",
        "In response to 'I completed a masters of Instructional leadership after leaving (disgruntled) my work in a transformational leadership school. It's weird because these leadership philosophies do actually sound quite good, it's just that most workplaces twist them to suit their needs or the egos of their leaders.\nTransformational leadership is about empowering employees. Great. People do get value and happiness at work from that. It does not mean leaving everybody to flounder, ignoring or outright despising any feedback, and sticking to rigid hierarchies.\nWhen I brought my concerns to my boss, that we had lots of staff leaving because they were stressed and felt unheard or taken advantage of, I told her that we had at least 10 people aiming to resign at the end of term. Her response was \"only 10? Who cares, we have a staff of 50.\"\nWhen I advised that we be more transparent about decisions and let people have more say in their working conditions, of which they were experts, she said \"people look to leadership for strong direction. If they want to complain they can just leave\"\nI really do believe that good leadership philosophy in good hands can do wonders. I've seen much better since. It's just weird ego-centric people who can't imagine genuinely caring about people or letting go of any control that makes so many peoples lives hell. I was pleasantly surprised that my course content seemed to align with my philosophy (which aligns with this article) and I'm hopeful that eventually things can change.', a user said: 'Thanks for your insight. You bring up a real good point. I remember my classes in university (I took business ) and you are right, there is a lot out there in terms of philosophies that empower employees. There is the psychological element right. Like how does this work when the “leaders” are narcissistic sociopaths who don’t want to give up control. I feel like there is a juxtaposition here.'",
        "In response to 'It’ll suck but we insist you work under us, in person, every day.', a user said: 'Can’t stand these older individuals who are so fixated in their ways that they can’t accept change. Super frustrating'",
        "In response to 'No one with power gives it up', a user said: 'Yup, I have experienced it. Think about the “leaders” (that’s what they like to call themselves) and the fact that they are all void of all emotion and want power and control. This is the result. Thank you Gen Z (on behalf of a Gen X’er)'",
        "In response to 'He’s right. Congress collectively voting on their own term limits, audits, salaries, lobbyist regulations, insider trading regulations, etc… the constitution dropped the ball in recognizing the importance of separation of powers yet giving congress essentially the power of self governance. I’d even argue that power is what allows congress to benefit from collectively colluding with the “too big to fail” corporations that screw us over like this:\nhttps://violationtracker.goodjobsfirst.org/parent/jpmorgan-chase\nhttps://violationtracker.goodjobsfirst.org/parent/unitedhealth-group\nhttps://violationtracker.goodjobsfirst.org/parent/exxon-mobil\nIn fact, I’d even argue further the collusion is why no one ever seems to go to jail over any of this🤷‍♂️ let’s take a look at ol’ Nancy’s or Mitch’s portfolios and find out…\nThink they’re going to vote any time soon in favor of restricting their own self governance and power? Nope.', a user said: 'Man, their portfolios are INDEED RICH. Coincidentally, they ALWAYS seem to know when to put those trades in. Not SUSPECT at all/s'",
        "In response to 'What’s hilarious is productivity and profits are through the roof due to remote work. But employees are happy and we can’t have that. If we give them bargaining power they might realize they’re getting screwed and go somewhere else.', a user said: 'Yeah totally. I mean look at all the shareholder returns that is occurring. Surely the companies can give a little power to the employees making it happen. Not so much though'",
        "In response to 'What age is older? I'm Gen X, not 50 yet, I haven't worked a traditional schedule in 28 ish years. My schedule was always flexible because I was raising kids and it had to be.\nIt would completely stress me out not having a steady job.  I'm lucky to be in a 2 income household, which has been the only way to live a non-traditional work week, as well as having family helping with child care. We are also not materialistic or live beyond our means.\nMy daughter does gig work, she's lucky to have extremely low rent. She was able to save enough living with us to not work for 2+ years. She no longer has any savings and lives check to check. It's not my business but it makes me sad.\nI think the 'older' people don't understand it. I started working when I was 12. Most people I went to high school with had jobs. We had to work, we had no choice. I was dropped off at the mall by my mother and was told to call her when I had a job. Then she would pick me up.\nInstead of getting frustrated, give us old people some grace and help us understand.\n--no, I have never given her a hard time about working. I worry, but it's none of my business. Not having any financial security in today's climate makes it extra hard to understand. Just my old ass $.02 ✌🏼', a user said: 'I’m GenX - 44. I was in a corporate structure but was forced to go an alternate route after I had a mental health breakdown (due to a toxic work environment). I partnered with a friend to start a company and then do some other gig stuff but it was HELLA stressful not having a structured job with steady income AT FIRST. I am on my own so I don’t rely on a second income . I was in risk and insurance so my threshold for risk was pretty limited. That said, I’m glad I pushed myself. Change is hard regardless of age but I think it’s even harder to do as one gets older. Totally value flexibility over money now.'",
        "In response to 'Making bonuses based on “team based outcomes” sounds like a group project where one or two people go above and beyond, and the rest of the group lags behind but wants the same bonus. Not motivational to me.\nWorkplaces definitely need to change to address generational difference in work-life balance. But Gen Z also has a lot to learn from experienced, successful workers too. Genuine communication and open minds are the key to long-term happiness in work and in life.', a user said: 'Thanks for this response. A lot can be learned from the older generations and can also be very helpful. It can’t be one way. That’s where I think the disconnect is. Older generations really need to listen and work towards a mutually beneficial solution.'",
        "In response to 'For sure. I’m unfortunately a bit in the middle of this as a Gen X “boss” of younger and older generations. It’s definitely an interesting navigation! And I am truly happy that you get generations are questioning the work-life imbalance that so many boomers committed to when they were young.', a user said: 'I have met so many boomers who are so miserable now - they did NOT have any work life balance. Questioning it and making change is a good thing. Who wants to be miserable when they are older, right ?'",
        "In response to 'My old boss when I started would always say she wanted new ideas on how to improve processes and such.  But when you presented something, not only would she shoot it down, she would get mad that you are wasting time instead of \"doing your job\".  So glad she retired.', a user said: 'Well that seems like an oxymoron. I had a boss like that as well. Open to “constructive” criticism. Oh, just don’t put it in an anonymous “survey” . If you hurt their fragile little egos, they will come at you hard. Most of these “so called” leaders are useless in their role and even more useless in “motivating people” which is part of what a leader should do'",
        "In response to 'Heck yeah. I wasn’t trying to play any games, and I quit this fairly cushy job at a really reputed healthcare institution because of leadership. Fuck em.', a user said: 'It’s true, people more often than not leave because of their “leaders” and I use that terms loosely because they are far from “leaders” and more like toxic managers'",
        "In response to 'Millenial here checking in to say fuck yeah. Our (most workers) work situation has been deteriorating for so long and things need to swing back. Unfortunately, Millennial and Gen X had it just \"still good enough\" to not fight the good fight while we could. Now many of us have families or dependents that make such choices more difficult to make. I spent a lot of my 20s thinking \"why is shit like this, why haven't things been fixed yet?\" So I understand that feeling. Thank you all for any little thing you do to stick it to the system.', a user said: 'I am with you as a GenX’er . We need change and I hope Gen Z will usher in this change'",
        "In response to 'We all must. X, Y, and Z together. And shout-out to the rad boomers out there too!', a user said: 'Yas! 👏 preach !'",
        "In response to 'I have 40'ish employees and since 2020 I have only lost 2 of them.  Both because they had health issues and took leaves of absence and didn't come back and retired.\nThey aren't paid the BEST, between 16-24/hour, but that's decent enough to the point where my management style makes sure nobody leaves.', a user said: 'Thanks for your insight. May I ask what your management style is that motivates your employees to stay ?'",
        "In response to 'for one it is understanding the frustrations they deal with on a daily basis, and at least letting them know I am aware of them, and trying to work on ways to make their jobs easier even if I won't always be able to do so, I will always try.\nanother is leaving people the FUCK ALONE if they are doing their job.  no news is good news.  you don't need to have a 1-on-1 with me every week if you're an introvert and doing a good job consistently.  I just leave you alone to keep doing your thing.\nBut when someone starts to go off the rails, they may need a bit of a correction.  After giving them so much flexibility this is where I cash in and let them know \"Ok, I've been as flexible so far as I can, but at some point HR and/or my boss is going to get a whiff of this and once they get involved, there's nothing I can do\".\ntheres your super short answer.', a user said: 'Amazing . So it sounds like a little bit of empathy and letting them know that you are listening goes a long way. Second, micro managing is a big no no. I was a top performer and I remember my “leader” as he liked to call himself watch me from his office when I would go to the washroom. I’m sure when you provide them with what they need, and build that trust, it’s much easier to have conversations around things that need correction. I’m glad you have found a good balance.'",
        "In response to 'How do they survive?', a user said: 'I think long gone are the days where people have to work in a traditional organization. If someone wants to take a break from work, they can just pick up random gigs. Doesn’t always work for everyone but I have seen a lot of people go from super rigid to working for themselves (much more flexibility)'",
        "In response to 'Can that scale? You're looking at virtually an entire generation doing nothing but gig work. Won't that depress wages?', a user said: 'Will it though ? What happens when MOST people get out of the corporate world and the corporate world CAN’T find employees who want to work for them or be managers? That should drive wages up? There are a lot of variables at play here. It will be interesting to see how it shakes out'",
        "In response to 'Okay but by then the zoomers will have resumes of only gig work. Employers would have to overcome their prejudice against gen Z and against several years of no relevant experience since their graduation dates.', a user said: 'But gig work IS work. It’s all how you can apply and communicate that your skills are transferable. For instance, I do gig and partnered and started my own company. That’s entrepreneurialism. People have to become really good at identifying their hard and soft skills and explain it to potential employers. Employers are going to have to accept this because if most people start doing this, they won’t have a choice quite frankly'",
        "In response to 'Alright, good points. I concede.', a user said: 'lol no need to concede. You definitely bring up some really good points and we, as a group, are going to have to be able to sell ourselves ( in a different way). The conversations and what we talk about are shifting so it’s important we have these types of discussions . Thanks for engaging 😀'",
        "In response to 'Keep losing while others get rich actually working hard. Taking your money, your girl , your dream. So many peasants. Keep making it easy to be king.', a user said: 'Oh no, it’s someone who has fallen victim to the capitalists’ propaganda lol'",
        "In response to 'Annnnd, in a good work environment, you would be getting a promotion/ different responsibility/ more pay at that point.', a user said: 'Right. It’s called positive motivation and “incentives” . What happened to those ? lol'",
        "In response to 'I get paid for work not “enthusiasm”. What kind of BS nonsense is this?', a user said: 'Smile goddammit , smile ! Lol'"
    ]
}