{
    "username": "sugarfreegum123",
    "contributions": [
        "I didn't get the promotion. Should I quit or quiet quit? A few months ago everyone in my team was let go apart from me. I was then told I could apply for my old manager's role. I applied but have now been told I didn't get the role and they are going with an external candidate.\nFor these past few months I have basically been doing this promotion role (and have received really good feedback from lots of senior people). I have not gotten a payrise to do all this extra work.\nI want to leave before this candidate starts because I'm tired of giving them essentially cheap labour. I was told if I didn't get this promotion, another role would be made available for me (in the same team), so I would probably have lots of leverage to negotiate a payrise. But I really don't want to have to essentially train this new external candidate who will be making more than double what I earn in the role I didn't get.\nShould I hand in my notice now, do a shitty handover and let the new person flounder? Or should I stay in my role with more money, but be looking for jobs on the side (it could be months and months before I find a good job). If I do immediately quit, I do have savings I could live on for 6+ months (took me years to save this amount).\nWhat would you do? Any advice?",
        "In response to 'Just went through this a few months ago so I’ll share what I decided.\nI tried to decide between quitting and quiet quitting. I’m doing a hybrid.\nFirst, I’ve stopped doing all the ‘extra’ things I did before. Started directing everyone who came to me for help to “our new supervisor.”\nThen I started taking my lunch breaks again. Started leaving when the day was over. Stopped checking my email when I walked out the door. Started taking vacation and sick time. It was very freeing and made me less angry about not getting the job.\nI’ve provided help when asked but am certainly not going above and beyond. I’ve gotten praise for my handling of the situation, weirdly.\nI joked over the weekend that it feels very Office Space. The more I back off from my work, the more people think I’m succeeding.\nAnd I know the perfect job will come my way where my value is really seen. When it does, I’ll leave.\nThat’s my advice. Take some time to let the emotions die down and wait for the perfect gig. Strategize. Don’t rush.\nSorry you’re going through this. It’s extremely unpleasant. Keep your head up and remember that your coworkers are probably talking about what a mistake management made.\nEdit: clarity\nEdit 2: Clarity/spelling', a user said: 'Thank you for this kind response'",
        "In response to 'This happened to me once. I sat down with the newly hired person, who was now my boss, and said “I just want to be transparent; I applied for the job that you just got.  So, I’d like you to help me close the gap in my skills so that I can do your job”. It was probably the best and most influential 5 minutes of my career.  They took me under their wing and together we made some big changes to the company.  We both ended up leaving the company for other opportunities, but still stay in contact. Great manager and mentor.', a user said: 'Being candid here; I don't think I can do that. I've had the most stressful 5 months doing the role of 7 other people,  no payrise with a promotion being dangled in front of me, and then snatched away. I don't want to make any big, positive changes for the company. I feel pretty bitter right now.'",
        "In response to 'I’d seek out honest feedback on why you didn’t get the manager role and do some self reflection. They probably didn’t interview you and think, they are amazing, but let’s pass them up and pull in somebody external because we love disgruntled employees. There has got to be some gap in you or your skills for their needs.\nThat said, put your time into finding the next thing and let this go because you won’t interview well with a big grudge on your shoulder.', a user said: 'Yes, I've asked for feedback from the company on my interviews, so I'll be able to address any gaps once I have that.'",
        "In response to 'I'm in this exact position, with the added cherry on top being that while this person has more years in the industry, they stayed mid-level while I got to a higher level, so they frequently ask me for help on things they should know.  They got the job because they personally knew the hiring director, the other team members, and the person who left the position was their cousin.  While I was doing the job, they were aggressively courted by my company, to the point that they gave her a salary package of over $50k more than the previous employees in the role, who had MBAs, while she has an AS in veterinary care.  I at least have a BA in Liberal Arts.\nI basically do my job functions and anything they ask of me, but when they ask my opinion on higher level stuff, I direct them to ask their boss.  I let their boss see how incompetent they are.  When they drive the team members crazy with their micromanaging (the same team members who recommended them for the job), I'm empathetic, but I reiterate how I would do things differently, then shrug and say, \"but that's not what the company wants in this position, so idk what to tell you.\". I'm nice to my boss and coworkers, but I don't go above and beyond for them like I have at previous companies.\nI've essentially let her do the hard work on her own, to sink or swim as best she can.  Meanwhile, my job is way less stressful, while I'm still making more money than at my previous company.  I don't handle ANYTHING work-related outside of my work hours, and I use ALL my sick/vacation/personal time.  All while I keep an eye on my industry and try to get my company to pay for me to obtain lucrative work certifications.  I'll then take those certs with me when I eventually leave here.\nSo quiet quit, don't do the boss's work anymore once they are onboard, try to grab any freebies from the company that you can, and take all your PTO time, especially the ones that don't pay you when you leave.  Take your time looking for something else, and relax at your job.  They're the boss now - let them work late since they want it so badly.', a user said: 'So true. I need to make use of these personal development benefits!'",
        "In response to 'First off, stop doing managerial work, they've already told you that they won't promote you, and honestly, they have no incentive to when you're doing it for free anyways. Second, absolutely do not train whoever they bring in. If you're not qualified to get the job, you're certainly not qualified to teach it. In the meantime, your top roll at the company, if anybody asks, is acting department head.', a user said: 'Department of 1 😂'",
        "In response to 'It’s not “quiet quitting”, it’s “acting your wage”', a user said: 'Exactly!!'",
        "In response to 'Don’t listen to the advice from redditors here, myself included, and especially the piss-poor anti-work, leave-me-alone, gimme freebies type.\nThe new person did nothing wrong, and especially not to you. Why would you want them to flounder?\nInstead of comparing yourself to new hires - get an honest feedback about your prospects within the company. You are the only one who was NOT let go, obviously, they see something in you. Don’t take “no” for an answer: understand why you were not promoted, and what is the path to broader responsibilities, assuming you want that.\nPromotions have two components:\n- there needs to be an opportunity.\n- you need to be ready.\nGiven that they extended an external offer, seems like it’s the latter. So you need to ask why. If you’re not getting anywhere and getting vibes that nobody cares about you as a person - look for a new job. Otherwise, understand why you couldn’t get what you want and see if you agree.\nNote: this is all assuming you’re not an asshole, and based on the fact that you were the only one not fired I assume you’re not.', a user said: 'It's not that I have anything against the new person, it's that I have something against the company. Why were senior leaders telling me I was doing such a good job? Probably because they didn't want me to leave while they had no replacement. I will absolutely get feedback, as I'm intrigued to know my development areas.'",
        "In response to 'Don’t punish the person that got the job they didn’t make the decision, and you don’t know yet what their experience was and truly may have been the better candidate.  With that said you should as for an interim pay bump for taking on the additional duties to be back paid and continued until they are officially handed off after training time.  In addition let them know you would like to know what the new role is and if the budget for it has been approved since they are working at a deficit (assuming since people were let go)', a user said: 'I will do that, thank you.'",
        "In response to 'Go out on leave the first month the new guy shows up', a user said: 'So tempting'",
        "In response to 'If they didn't find you fit for the role, you are obviously not fit to train the new candidate for said role either. I don't see how they can argue against that. Don't train the hire in anything involving the new role. When the training is done, you document how much they have to come to you for help doing their job. Either they won't ask for your help because they actually were a better fit for the job, or you can go demand a big fat raise, maybe even to get their position also', a user said: 'Good idea'",
        "In response to 'Regarding the \"other role\" they'd create for you, in terms of title, do you know what that'd be? Title/level can equal a larger pay increase elsewhere in a lateral move. If yes, I'd consider staying a little longer, even until Q1. If the answer is no, polish your resume and references (heads up) and look elsewhere while you're employed, and quit when you get an offer that's hard to refuse.', a user said: 'The other role's title would be similar to my current one and wouldn't necessarily mean more money elsewhere'",
        "In response to 'I’ll pile on and echo others.\nDon’t punish the new guy who didn’t do anything.\nTeaching someone about company process is not training them and does not mean you should make as much as them.  Give them the benefit of the doubt that they have skills and could actually do a good job.\nYou took a risk and it didn’t work out. Welcome to corporate world.  Don’t shoot yourself in the foot by throwing a tantrum.\nYou should always be looking out for yourself. That means working extra when it will benefit you. Know how to play the game. Know when your being taken advantage of and don’t let it continue.  Assuming your early career, try and find that balance of kicking ass and having a life that’s not at work.\nAlways be applying.  The best time to look for a job is when you have one. Cherry pick the best jobs and ask for lots of money to leave.', a user said: 'It's not punishing the new guy, it's punishing the company who took advantage of me. I feel used.\nThere are certain systems integral to the business that only I know how to use fully (I help set it up), which they will definitely need training on. In the past I have given my time to train people, but I guess now in my 'quiet quitting' mode, I should point them in the direction of the tool's useless Customer Success Manager 😂\nYes, I will use this time to apply for other jobs.'",
        "In response to 'I would actively start looking for another job. I stepped up when my boss left and lead the department for an entire year.  They then hired an outsider with years of experience (so she claimed). Stupid me stayed on and carried her for another year. She was completely incompetent and let me do all the work while she got paid 40% more than I did.  I left for a better job and more money. She got fired a couple months later for incompetence.', a user said: 'I really don't want to be carrying anyone - I've gone through it before!!'",
        "In response to 'I've been in a similar position for about 6 months. As others have said, don't quit without a plan or another job offer- it's not worth the stress. But if you aren't planning on staying, just do what you need to get by. I think it's crappy when employers ASK you to apply for something (obviously they think you'd be a good candidate) and then move on when something shiny comes along.', a user said: 'Agreed'",
        "In response to 'Find a new job first, then during a busy period just walk out, say I quit.', a user said: 'Would love to do that'",
        "In response to 'My younger self would react from a place of pride, have a massive outburst and quit. \nMy present self would negotiate the best possible raise I could, swallow my pride and burn the midnight oil in finding a new job.\nSorry this happened to you. For what it's worth it's common....we all been through it or will be at some point.', a user said: 'Agreed, but I will be looking for a job on company time 😂'",
        "In response to 'I know this is an old thread, but I'm in a similar situation and looking for strength and inspiration to navigate the next few months. I've been in my position for over six years. I trained the past seven new hires. (Our job is very specific and busy. Usually takes 6 months to really be able to keep up). The company recently went through some leadership changes and as a result, my department's workload doubled. So a new supervisor position was created. I interviewed for it, but assumed it was just a formality. Of course I'd get it. Well I was wrong. It went to one of my coworkers who I trained two years ago. Now she'll be my supervisor. Oh and guess what else... I'll also have to train her replacement. 😮‍💨', a user said: 'I'm sorry this happened to you! My advice would be to start looking for another role ASAP. I looked for another role and found one elsewhere with a higher salary than what I was previously on. It was the push I needed to leave that godforsaken company. Go where you are valued!!'",
        "In response to 'It sounds as if you might be overestimating your value. You probably were passed over for the more-senior position because you don't have enough experience. The manager they hire who does have experience won't need to be trained by you.\nYou're not giving them cheap labor. If you are working a 40-hour week at the pay rate that was agreed upon when you were hired, you are doing your job.\nYes, you should stay in your role and continue to do your job as well as you can until you find another job. This will benefit you by not doing damage to your professional reputation for being a petulant child and you will continue to get projects for your portfolio.\nYour entire post sounds like a four-year-old throwing a temper tantrum.', a user said: 'I wish I was working 40 hours a week. I am working my ass off to keep this department running after everyone else was let go. I've had to do things way above my paygrade for the past 5 months. The manager will absolutely need to lean on me and be trained on systems I help to set up in the company.\nIt is my prerogative if I want to leave a company that has been taking advantage of me. Working for less than you're worth is not exactly unheard of in business.'",
        "In response to 'You should quit but not before getting another job lined up. Start applying now. Apply to both your current job title and your manager job title (in those interviews explain that you have been the acting manager and what are your responsibilities)', a user said: 'That's a good idea!\nOn my resume, do you think I could add my manager role? Put something like 'xxxxx Manager (interim)''",
        "In response to 'I like this idea, but something about the word \"interim\" doesn't quite sit right with me. It may just be that I've only had 1 cup of coffee today, and I'm not functioning at 100% yet, but I'd maybe try finding a synonym to use. Acting maybe?', a user said: 'Yes, acting is probably better'"
    ]
}