{
    "username": "sulking_crepeshark77",
    "contributions": [
        "In response to 'I did until the week prior  puppy pickup because I expressed the amount of work that goes into puppies , he had went shopping with me with the list of puppy supplies and made a few suggestions and even seemed very excited. The day after I had already saved a bunch of resources on puppy training, psychology, etc to help us get on the same page.l for consistency . I offered them to him since he's never had a dog before, I had had many dogs  but mostly duties were shared with my siblings and I as kids and I definitely needed a non-farm dog in the south refresher. He declined and said he'd figure it out. As they say in the memes \"It was then that I knew I had fucked up\".', a user said: 'Oh man. I feel like your current experience is acting as my ghost of Christmas future.\nMy hubby grew up in a cat family, which nothing wrong with that I LOVE cats! He met me when my youngest pup was 2.5 y/o. \nRecently he tried to convince me to get a kitten from his friend whose cat recently had a litter. I told him no. Absolutely not.\nWe currently have 2 big dogs. one is very much getting closer to crossing the rainbow bridge (which will absolutely shatter me) and the other just turned 11 and has always been super needy/demanding. I told him no I don't want the added responsibility of cleaning litter, keeping track of cat food/treats, plus another basket of problems if cat doesn't have perfect health. He says he will take care of all the cat's needs. I know thats a load of shit since I currently take care of EVERYTHING related to our dogs. Food, health, grooming, ect. He is good at making sure the younger gets walked (ya know, the fun parts!) whether it be by walking him himself only on the weekends or guilting me into it because he works full time and I'm currently home during the week. Doesn't matter that I have terrible insomnia and may have only fallen asleep like 2 hours prior... I should still get up (and stay up) literally before dawn (summer in AZ so morning is the only time where pup won't burn his paws) to ensure pup gets his walk. PS pup doesn't go crazy if he's not walked everyday so it's not a crisis if he skips a day.\nI told him if he wants to get a baby pet we are getting another dog. He has NO IDEA of the amount of work that goes into raising a puppy into a well behaved dog. It's like training for a human baby and if he can't deal with everything that comes with raising a puppy then raising children with him may be off the table. He already thinks he's too old for a human baby (hes only 37 btw) and I know for a fact it didn't even cross his mind that maybe his idea of being too old for kids at 37 is insulting to me because my parents were 39 and 40 when I came into the picture, until I told him that...\nSorry for the rant.\nOP- How old are your kid(s) and how did infancy go with someone like your husband?'",
        "In response to 'My kid is 5, it did not go well. It went fairly similarly to how the dog is going and has continued to go that way especially medically. There is some cultural issues, his family emigrated from another country and used medicine that fit their cultural customs growing up and as a result there's a lot of skepticism between their children and modern medicine. This does not jive well with a small child that has a lung medical condition and allergies. It is also a large part of why I am not ready to pursue divorce just yet. There have been multiple requests for another kid from him in which I have answered  in no uncertain terms absolutely not. I love my kid more than anything, but I am not willing to sacrifice what is left of me to go through another newborn or infant almost completely alone.', a user said: 'We even share the spousal doctor distrust from immigrant parents.\nOut of curiosity, what breed of dog did you get?\nI'm sorry your child has medical issues. That has to be so tough. ☹️'",
        "In response to 'It is so fun, right? 🙄 I got a Golden Retriever,  they're very sweet and friendly. I even spoke with a few of my kids doctors to come up with a plan to reduce dust in his playroom and bedroom to reduce allergy impact to him. I hate that my kid has the medical stuff going on for him, it really breaks my heart.', a user said: 'Soooo fun...\nI LOVE Goldens! They can be so sweet and patient. I grew up with a gorgeous red golden. Mine had a real bad case (for his whole life not just puppy phase) of jumping on people when excited but then again he wasn't trained at all or disciplined by my parents so 🤷‍♀️.\nCharlie, you are missed big boy.\nGood luck with all your future endeavors, both puppy and people related.'",
        "In response to 'Stand your ground about the kitten. He isnt entitled to, and doesn't get to demand, your personal trust when he doesn't have integrity, when his words and actions don't match.\nYou are 100% correct that you would get stuck with everything regarding that kitten, and he would just pet it once in a while when he notices it and feels like it. He can pound sand.', a user said: 'Oh I very much am standing my ground. Also he is definitely not demanding anything. He asked twice (with like 2 months between asks) and got a no both times and that has been the end of that. He's a very loving pet parent so that wouldn't be the case. I just don't want more pet responsibilities.'",
        "In response to 'Like you said, couples often gets pets as a precursor to kids, almost like a test run. Let’s replace dogs with kids in your comment:\nHe says he will take care of all the child’s needs. I know thats a load of shit since I currently take care of EVERYTHING related to our kids. Food, health, grooming, ect. He is good at making sure the younger goes to the playground (ya know, the fun parts!) whether it be by taking him himself only on the weekends or guilting me into it because he works full time and I’m currently home during the week.\nDoesn’t matter that I have terrible insomnia and may have only fallen asleep like 2 hours prior... I should still get up (and stay up) literally before dawn (summer in AZ so morning is the only time where kiddo won’t get overheated) to ensure toddler gets his outdoor playtime.\nHe has NO IDEA of the amount of work that goes into raising a child into a well behaved adult.\nSo we already know that he\ncan’t\nrefuses to take care of an animal (through weaponised incompetence). He promises he will but he doesn’t.\nHe already thinks he’s too old for a human baby (hes only 37 btw)\nSo there you have it. I mean, he’s actually telling you that he isn’t really enthusiastic about being a parent. He thinks he’s too old for whatever reason—either he feels too tired to keep up with a kid, or like that time has passed, who knows. But this is him TELLING you that he’s not going to participate. Even if he did participate more than he initially said he would (even if he stepped up), would you really want a kid with anyone who’s less than thrilled? I mean, that’s how you get kids with absent parents who suffer from emotional neglect (your presence wouldn’t make up for dad’s subtle rejection every day).\nSo he’s shown he’s unwilling to care for something, and he’s explicitly stated that he’s not enthusiastic. If you had a kid despite knowing this, it would be unfair to the child. And yourself too, but the child didn’t ask to be born.', a user said: 'He would not be an absentee dad. He would be a good parent but leave all of the mental load for me. Yeah no thanks.\nHe said he wishes he had kids when his parents did. First of all his parents married at like 23 and had him at 25. We didn't even meet each other until he was 28 and I was 25... I told him when we got serious that I need a ring before kids and it still took him 8 years to propose. This is all self imposed but he doesnt like hearing that, probably because he knows in the back of his mind that this is the bed he made. He has always wanted his cake and to eat it too, in fact he still struggles with that in various forms to this day.\nThe truth is I believe he likes the\nidea\nof kids (all the fun positive things, not the often un-fun realities and day to day grind) and wants to have them because society/family/whatever else dictates that \"its what you do\" not because he genuinely wants to be a dad.\nGood thing I don't conform to shit if I don't want to. I'm not one to be pushed around. I state my intentions from the start so there is no confusion about where I stand and nobody can say they \"didn't know\".\nHonestly my only fear is that he will resent me later down the road, even though it will be his own fault.\nIn all likelihood we won't have kids. Note: There's no chance of accidental pregnancy so i dont need to \"safeguard my BC\" like some may suggest.\nHe can be the fun uncle to all the niblings in both families and then hand them back to parents when things get unfun.'",
        "In response to 'That makes a lot of sense. Good for you that you don’t let yourself be pushed around. No one’s gonna stand your ground for you, you’ve got to do it yourself. I hope he doesn’t resent you later, but if he does I know you won’t let him pin it on you.', a user said: 'Thank you friendly internet stranger. Its nice to be praised for something I am actually proud of (im very self critical)\nHopefully he won't have time to resent me since he will be too busy having fun running around doing interesting hobbies and spending his hard earned money how and when he wants.'",
        "In response to 'Cats are easier… I’m confused.', a user said: 'Yes you are right they are but would rather have all cats or all dogs. Multiple species becomes too much for me. I grew up with dogs, cats, birds, hamsters, fish all at different times and different combos but yeah I want to stick with one'",
        "In response to 'I'm sorry to say this, but OP did you REALLY expect this to go any differently, I mean really??  Because just by this one post, I didn't.  You know he is a Just No.  You know they go out of their way to make things difficult.  You KNOW THIS, which is why you didn't get a pet for so long.\nThis is never going to change.  You are now stuck with ALL the duties of a new pet.  He will only ever participate if it inconveniences you or he can pick a fight with you.  This is who he is.', a user said: 'I'm guessing this guy has always been selfish with his time and energy. Or maybe self-centered is a better term because the world must stop if\nhe\nis inconvenienced and everyone else must rearrange their lives to suit his desires/whims/schedule and everyone else be damned. I completely understand why OP was hesitant to get a pet for so long.\nI am\nVERY\ncurious how raising a kid with this person unfolded. But most likely it was just the stereotypical \"practically a single parent but married because their spouse is an inconsiderate asshole\"\nYou are right:\nThis is never going to change.'"
    ]
}