{
    "username": "sunsinstudios",
    "contributions": [
        "In response to 'It does indeed exist. I’ve seen it plenty of times. And it’s a side effect of the shitty system. You work your ass off and you may get a 5% raise if you’re lucky, meanwhile the guy who does the bare minimum gets 3%. Maybe “times are tough” this year and no one gets raises* (except for management's bonuses). The guy who has been there for 15 years gets paid twice what you get but does less than half the work.\nThe reward for working hard is shit compared to the benefit of doing the bare minimum. And many cases exist where people work hard and get rewarded only to be the first to be laid off because you’re more expensive. The companies won’t understand that they’re losing a valuable asset, they just see everyone as an equal.\nCompanies have disincentivized hard work.\nNow add in the soul-crushing and time-consuming nature of most jobs and it just compounds the issue. It's no wonder why making it so people have more time to relax and be happy would increase their productivity when they actually are working.', a user said: 'How is doing the bare minimum (i.e., meeting the established requirement) “quitting”?'",
        "In response to 'It’s doing the bare minimum to keep yourself from being fired. That’s why it’s called quiet quitting. The person has essentially quit trying to do a good job. In many cases that makes the person more of an obstacle than if they actually just quit.\nFor example, I’m a software developer. If I task someone to write a method, they take a long time and write code that is bad quality, then that’s a problem. If I had known they were useless I could have tasked someone else instead\nE: be mad, but you doing the bare minimum hurts all of your coworkers too, not just your boss', a user said: 'You basically proved my point. If the code is bad, then they don’t meet the minimum requirements. They get fired.\nThere is no quiet quitting.'",
        "In response to 'You haven’t spent much time in large companies have you…\nOften times if the person is doing crap work it takes a very long time for large companies to weed them out. Heck, there are a significant amount of people bragging about playing video games for 5+ hours of their workday. That is quiet quitting. It’s doing as little as possible while still keeping the job. Eventually I’ve seen these people get found out and then they get put on a PIP to improve or else they get fired, but it can take several years for that to happen', a user said: 'If you keep the job, then you’re doing the job. 5 hours of gameplay and no one is noticing means the company is wasting the employees time if they work in the office.'"
    ]
}