{
    "username": "supershinythings",
    "contributions": [
        "In response to 'I’ve known about this for a while, and thank you for the write up! I wanted a confirmation from a person I didn’t know personally.\nI think the lockdowns hurt China way more than any other country and it made things way way worse. It made a lot of the world divest from China. Making unemployment even worse than it was prior. I think the CCP expected a different outcome of the event, but got the rude awakening as of recently. The real estate bubble there is outrages, but definitely didn’t know they no longer employ older people in construction. Real Estate is like that in Hong Kong and Macau as well. The difference being that there the populations are smaller, so it’s not as noticing to the public. This is going to get spicy and if some of you have looked at the currency swaps of USD and YUAN it’ll make a lot more sense. Stack cash and wait, cause we are going to see a big drop in everything.', a user said: 'My current employer sold its Chinese 49% share of a holding company last year.  Once it became obvious that making Yuan was no longer going to be profitable, plus a trade war and the optics of continued Chinese investment in the face of, say, future guvmint contracts, they decided to back away slowly, sell while it was still worth something, and disappear.\nOf course, in theory a falling Yuan should make the dollar stronger, making imports from China far far cheaper.  But - there's a trade war going on.  Tariffs on Chinese imports make US production a bit more competitive.  But China needs dollars to import US commodities - like almonds and pork.  If they keep slapping tariffs on import of US goods, they make imported US foods unaffordable.  This of course impacts US food producers who rely on selling to China.\nThen there's Ukraine.  Turns out, Ukraine is a major source of cheap grain for China.  On the one hand, China likes getting cheaper energy and commodity prices from Russia. OTOH, they want cheap grain from Ukraine.\nIdeally the solution would be for the war to stop so China and Russia can profit both ways.  But right now, the Yuan and the Ruble are both pretty much in the toilet. When they buy and sell things to each other using their own currencies, they're trading Poop for Piss.\nToss in the Indian Rupee - Vomitus - and they have their own currency trading exchange that runs exclusively on piss, poop, and vomit.  None of their currencies will have much buying power outside their little circle.\nIndia has one bright spot - it's good friends with BOTH Russia AND the US.  It can trade Rupees for Dollars, it can export freely to the US, it can employ vast phalanxes of Indian engineers at American companies with facilities in India, and it can play both sides against each other.  US dollars are major underpinnings of whole economies in India, as Indian immigrant engineers in the US send money home.  India is a major power in its region, as well as a major supply of various other low-cost labor pools.  India's allegiances have major implications in markets around the world.\nOn the one hand, the US would like India to stop playing nice with Russia.  OTOH, US tech companies like the arbitrage of cheap labor that a strong dollar against the India rupee gives.\nSo International Currency, tariffs, back-room dealings, and corruption are complex interactions.  China keeps finding ways to hide the weenie and evade what people keep claiming is China's inevitable collapse.\nThe reality is that there are many Chinas.  There's the China on the edge of economic ruin, there's the China of the already ruined and impoverished, there's the China of high tech riches, there's the China of the government-funded bureaucrats, and the China of those who make it out and send money back to their families to survive.  Which of these indicates the way the Chinese markets will move?\nThe answer is - it depends.  We can bet that the Chinese government at the very top is doing its very best to hide any reality not consistent with their desired optics.  Manipulating the media is just as effective as actual change, apparently, with respect to getting the results they want.  Saber-rattling with Hong Kong or Taiwan or Japan or The Philippines distracts the people from their day to day misery and gives them a sense of pride when they are otherwise losing the ability to be proud about anything, especially if awash in poverty.  Oh we have to support the government!  We must show we are patriotic and not complain about our own misery!  We're not allowed to protest our conditions when we're on the brink of war!\nWar-talk shuts up hard conversations.\nWill it all collapse one day?  Not in one day it won't.  But at what point will it start to fail unrecoverably?  I don't think we'll see that for awhile. It's probably not a good idea to bet against the people who control the dice, the table, and the croupiers.'"
    ]
}