{
    "username": "SuperDan523",
    "contributions": [
        "In response to 'Original Post: Hey guys, I was “quiet quitting” until I got fired , now what? So I just got fired and they recommended me to file for unemployment insurance. HR was surprisingly nice. She basically told me they don’t contest the claims, so I think if I use the right words in my unemployed application,\nI might be eligible for unemployment insurance.\nHas anyone successfully received unemployment insurance benefits in this situation before and lives in the state of Illinois? One of the questions is below:\nAccurately report your reason for separation from your job when you initially file your claim for benefits.\nEDIT: I  shouldn’t have used the term “quiet quitting” on my post because I used the term incorrectly, my apologies. I meant to say, I was really underperforming on my job, barely doing any work for the past year or so. I did the bare minimum. I was  then placed under an improvement plan for a little over 6 months or so. They saw some improvements, and I was doing okay, until I mislead my manager with 2 assignments. I stated that I had completed the assignment but in reality I used last year’s data to mark it completed, while I attempted to catch up over the weekend.\nI never fixed the assignments and my manager found out what I did. That’s when she went to HR for the next steps. I emailed HR for a written confirmation on why I was fired and she responded “unsatisfactory performance.”', a user said: 'Tell them you were fired with no reason provided.\nWhen I filed just a month and a half pre-Covid shutdown toward the end of Jan 2020, they ended up calling me for clarification. Told them there were no disciplinary issues leading up to the termination and all my termination letter said was they were choosing to go a different direction with the position. I ended up initially getting denied, and I shit you not the denial letter said the company choosing to go in another direction indicates I was fired for misconduct. If something like that happens to you, stay the course. Keep doing your certifications and take it to the next step of appeal. Here in Illinois, that is a \"referee\" who will re-evaluate the claim. So in my request to have my case reviewed by the referee, I put on there that my termination letter indicates that the company will not contest my unemployment claim and also that my last corrective action had been almost two years prior and the behavior wasn't repeated. I didn't even get a phone interview that time, they just passed me and back-paid me for my eligible weeks that had elapsed during the process.\nKeep in mind that from the state's perspective if the termination sounds \"iffy\" they will probably initially err on the side of denial. After all, if they pay out and the company contests the claim and the judge rules in the company's favor it will be a huge pain in the dick for them to recover the funds paid out to you which you probably have already spent. On the flipside, while you may be temporarily broke for a few weeks, backpaying you is easy peasy for the state.\nThose with temporary layoffs and a set return to work date, those with seasonal work (farm hands, school bus drivers, etc), those whose companies did an RIF or closed altogether... they'll get approved without hassle. Fired with no reason given, or at least a shitty vague reason? You may have like one minor hoop to jump through but stay the course its worth it.'"
    ]
}