{
    "username": "Superb_Ad_4464",
    "contributions": [
        "In response to 'About 40% of the people I worked with in Chase are doing it. The other 60% are either happy they are back at the office or quit.', a user said: 'I work at Chase.  I personally love a good “coffee badge” move.  With my team outside the USA, I don’t really care where I call them from.  I was remote ten years before it was “cool” with covid so their attempts to force me back 5 days a week aren’t working.  I show up in sweat pants, badge in, get coffee, make a couple phone calls and go home 30 minutes later and work.'",
        "In response to 'Original Post: Has anyone \"Quiet Quit\" as a response to RTO? I'm not in this position, so I don't need advice, but I'm curious to hear everyone's thoughts on this.\nI work remotely, which is why I follow this sub. I've seen a lot of people in this sub who are being asked to RTO. I've been thinking about this the past few days as the sub has been full of people discussing how to respond to RTO mandates.\nLots of people, including myself, are speculating that the recent push for RTO is force people to quit their jobs. If they don't fire you then they don't have to pay out unemployment. And, you have to have significant savings to go without a job.\nWhat do you think about about returning to the office and quiet quitting so you can still draw unemployment? Anyone done this?', a user said: 'I make all my family’s doctors appointments on the days IN OFFICE.  I also walk around talking/collaborating.  No work calls/contact before or after working hours those days.  They want to “see me” so I make sure to be seen.'",
        "In response to 'Do you think a grownup with a mortgage to pay and 3 other people to feed is going to play games like this? It may get you internet cred from literal basement dwellers on an anonymous message board site, but this isn't real life. All the people gloating here in 2022 saying they would never RTO are unemployed now.', a user said: 'I respectfully disagree for some people.  I’m a single mom and I haven’t RTO full time yet.  But I make good money so the game is on without worry for me.  I’m negotiating a severance package instead.'"
    ]
}