{
    "username": "Surph_Ninja",
    "contributions": [
        "In response to 'Thats exactly the problem most places aren't seeing. Plus everyone wants a fully remote role. If it's not fully remote I'm not interested. It's just how I'm looking since I'm sick and tired of the useless office and being in teams and webex meetings with people right next to me when I can be doing the same things from home chilling in sweatpants. Very ridiculous.', a user said: 'If I were looking for a new position, I'd be willing to drop the fully-remote requirement, but you better believe I would expect extra compensation for it, and even then I'm going to continue looking for another fully remote position in the meantime.\nI'm an IT director, and management tried to take away my team's partial remote (one day per week) last week. I prepped a proposal over the weekend to demand a 20% raise to keep them from leaving, but the complaints had started immediately, and they re-instated the telework first thing this morning.\nEveryone in IT wants to be fully telework. If you're someone who doesn't mind working in the office, use that to your advantage to demand a higher wage right now. Especially considering the high cost of fuel, childcare, etc, and the shortage of people willing to work in the office, it's perfectly reasonable for companies to be paying a premium to in-person IT personnel.'",
        "In response to 'Right now I'm a network operations engineer for a fortune 500 company. However we are 2 days in the office and rest wfh. However I am looking for fully remote positions since I do the same stuff in the office as I do at home. But recently been only looking for remote positions since the gf and I have 1 car between us. But on the bright side I'm currently a contractor so if I get hired on that's where I can negotiate and the like. Otherwise I'm tempted to leave if a better offer comes my way haha.', a user said: 'It's a great time to be in IT, even with a recession incoming. Lots of demand, and lots of leverage. Keep updating your skills, and you can hold that leverage indefinitely.'"
    ]
}