{
    "username": "SweetAlyssumm",
    "contributions": [
        "In response to 'I used to have Cable, then dropped it for Netflix and Hulu. This was damn near 10 years ago now. I ended up with Amazon Prime also during the Pandemic, but now have no subscriptions. I just watch what I want for free, no commercials on streaming sites.\nUntil this country gets its shit together and stops penalizing the consumer for every little thing, I'm not supporting any of the services beyond internet.', a user said: 'It amazes me that people spend money on cable, Netflix, or Hulu. There's so much free stuff. It's not like the old days where everyone watched a show together and you wanted to be able to talk about it (with rare exceptions). I find so much fantastic stuff just on YouTube (though I like comedy, cooking, and true crime, of which there is an abundance).'",
        "In response to 'I don’t like the wording of “quiet quitting”. Because it’s the exact opposite— it’s about finding a way to actually stick with your job and carry on. Messaging matters a lot more than people consider. “Black Lives Matter” should have been “Black Lives Matter Too”. Then we wouldn’t have had all the ridiculous “All Lives” people.  “Defund the Police” should have been “Re-source the Police” as in give them new sources of support, with a wider range of skills in dealing with the public. I wish we would give messaging MUCH greater consideration before just throwing out word soup. “Quiet Quitting” sounds like something a Boomer would come up with. Ugh.', a user said: 'Agree, except I'm done with the police. They don't need more resources so they can kill innocent people and stand around while school children are shot. Their institution is broken. Give the money to social workers and others who can deal with homelessness and the myriad of other social problems. Give the money to the homeless for that matter! Skills don't matter when you are corrupt, racist, and uncaring. And a boomer did not come up with quiet quitting. You can look it up.'",
        "In response to 'I agree wholeheartedly about the cops. When I wrote resource I meant to change our sources of police to re-source them. For example employ a whole bunch of social workers in the force. Also I never said a boomer came up “quiet quitting”, I said it sounds like some thing a boomer would come up with because it’s a bad phrasing. .', a user said: 'Learn a little about solidarity. The youngest boomers are 58, they'll be around for awhile. Ageism should not have a place on reddit anymore than racism.'"
    ]
}