{
    "username": "SweetTea1000",
    "contributions": [
        "In response to 'Good for you all!  Can’t parent volunteers comprise most of the chaperones with maybe one or two staff PAID to be there?', a user said: 'Education would be so much better off in this county if we still allowed families to be supported by a single income. Imagine if most of your students had a parent with 40 hours more time available each week.'",
        "In response to 'I have never heard it in a negative light. Quiet quitting just means working your intended hours and your intended job. Whatever you call it, teachers need to start doing it.', a user said: 'Work to rule has been the term unions have used for decades.\nQuiet quitting implies you don't want the job, are doing something worthy of being fired.\nI don't want to quit, I just want you to quit forcing me to do things I'm not paid for.'",
        "In response to 'You're building artificial boundaries. The contract\nnever\nstates that teachers are required to work only during those hours. It says that those are the hours for school. It also then states what you duties are, and what you're being paid for attending to those duties.\nThis is just as foolish as students saying that school hours are 8-3 and so they don't have to do any work outside of those hours and teachers can't penalize them for it. What would you tell that kid? Obviously, you'd point out that those hours only represent the time period we require the kid to be at the school.\nIt's really quite similar for teachers.', a user said: 'Um, I don't give homework\nfor exactly that reason.\nIf you don't do the work in the provided time, sure you gave yourself homework. Sure, I'll provide you with optional practice/ study material. Yet, all of us assuming we have a right to as much of their time as we want seems like exactly the kind of mentality we need to kill.'",
        "In response to 'This is the way', a user said: 'The #1 argument I see levied against public schools by those who should be their greatest advocates is that \"schools are brainwashing camps to turn us into obedient workers.\"\nWe have a moral responsibility to our students to minimize that effect while maximizing the knowledge and skills they take away. Students can learn self discipline without being cowed into submission.\nThat this is difficult is largely the result of, as always, the lack of resources these institutions are given to adequately support these students (class sizes, counselors, space and adequate supervision to facilitate students autonomy, etc)'",
        "In response to 'I figured someone would say this.\nRegardless of what you do or don't do, you recognize that teachers, as a rule,\ncan\ngive homework, right?', a user said: 'Policies vary by school and district.\nThe permissiveness of such policies is a deferral to the teacher as the pedagogical expert most aware of the context of their specific classroom, far from a mandate.\nThat something is legally\npermitted\nhas no bearing on its ethical merits.'"
    ]
}