{
    "username": "Swiggy1957",
    "contributions": [
        "In response to 'Has nothing to do with right or wrong.  It's not wrong to ask an employee if they can/will take more shifts.  It's wrong to ask them and then not pay them their OT.\nSounds to me like the managers couldn't say \"we want you to take more shifts\" because the union would lose their shit.', a user said: '\"we want you to work more shifts.\"\nUnion: no problem there.\n\"You MUST work more shifts.\"\nUnion goes batshit.\nAlways know your contract. But look for loopholes. AT&T pulled that on us. I've mentioned this story in a few places, mostly in\nr/MaliciousCompliance\n, when, while \"downsizing\" the work force, a hiring freeze was put in place. About a year or so into it, we were slammed. Sure, we got staff from closed offices and facilities, but we also lost trained personnel. We had 1 hour a day, Tuesday through Friday, to work on personal commitments and read up on policies and procedures that changed almost daily. That was removed from our schedule by the \"emergency situation\" we were working under. On top of that, the 3 seconds between each call was gone. Shorthanded? Got worse as about 5% of the workforce was out on \"stress leave\" (work related nervous breakdowns)at any given time. AT&T milked this for nearly two years when I said enough. I started taking my contractual offline time, even though it wasn't on the schedule. Second day I did this, my supervisor approached me about it. I replied that I was taking my daily personal time. \n\"It's not on your schedule.\" \n\"It's in my contract.\"\n\"But we're in an emergency situation.\"\n\"Two years ago, it was an emergency situation, Today, it's a breech of contract as there has been no effort to alleviate the problem.\"\n\"If you needed the time, you could have just asked, and it would have been scheduled.\" \n\"Doesn't need to be asked for: it's in the contract.\"\nFinished my hour offline, and proceeded to take calls. Next day, I go in and am informed by my supervisor that everyone was getting a half hour a day for personal commitments that week, and going back to a full hour the following week. Not just me:\nEVERYONE\n!\nWhy did I wait so long? I wanted them so far back in the corner, they couldn't escape. Funny thing, though. Suddenly the years long hiring freeze was also lifted.'",
        "In response to 'If you got fired for doing your job you should ask them why they fired you and sue them for wrongful termination', a user said: 'Only if OP is in a protected group: minority or disabled. otherwise, it's an at-will employment. You can be fired for no reason, which will justify an unemployment claim.'"
    ]
}