{
    "username": "sziehr",
    "contributions": [
        "In response to 'I’ve known about this for a while, and thank you for the write up! I wanted a confirmation from a person I didn’t know personally.\nI think the lockdowns hurt China way more than any other country and it made things way way worse. It made a lot of the world divest from China. Making unemployment even worse than it was prior. I think the CCP expected a different outcome of the event, but got the rude awakening as of recently. The real estate bubble there is outrages, but definitely didn’t know they no longer employ older people in construction. Real Estate is like that in Hong Kong and Macau as well. The difference being that there the populations are smaller, so it’s not as noticing to the public. This is going to get spicy and if some of you have looked at the currency swaps of USD and YUAN it’ll make a lot more sense. Stack cash and wait, cause we are going to see a big drop in everything.', a user said: 'Trade wars started the money walk away.  Then Covid lock downs made them unreliable partners on a supply side.  The final nail was the ratcheting up talk about invasion.  There is no company with any brain that wants to have a large supply or investment in china right now the gambles not worth it.  Mexico is much safer and much closer and covered by the America umbrella'",
        "In response to 'Exactly right, COVID was a wake up to a lot of people. The red light for me was when Xi made himself dictator for life, in short Mao 2.0. Hue Jintao was so much better, and certainly more peaceful in every aspect. Was about to let western money fully into China but than Xi took power and everything started to go south.\nAs for Mexico becoming our closest trading partner it was a no brained. Why it hadn’t happened sooner is beyond me. We should also trade more with Brazil as well.', a user said: 'It was education and the need for fleets of eng in china.  Now that some of this is reduced to machine operators Mexico is the duh.  Also it’s cheaper to just buy off cartels and all of Mexico than it is to deal with China.  Nafta already exist so all we need do is show up wjth bags of cash'"
    ]
}