{
    "username": "Tableforoneperson",
    "contributions": [
        "In response to 'Big on this! I had to say no to a couple trips with my friend because she always wants to fly to a place on a Friday night then back home on the Sunday to be ready for work. It’s way too exhausting for me and I end up having anxiety issues', a user said: 'Oh god I love and hate such trips at the same time.'",
        "In response to 'Re the churches! Nothing I love more than going into churches to see how elaborate they are! Usually the more random the more surprised i get! I love those little surprises. Recently went to France and felt like Notre Dame was a let down compared to others i’ve seen', a user said: 'I like some small local “side” churches in some touristy cities in Italy on a hot day. When you enter  to get away from hustle and bustle and heat to find a cool and quiet place.'",
        "In response to 'I dunno if this counts, but I went hard every day in cdmx but went back to my hotel early-ish almost every evening just bc i wanted to chill. A shame, really, since the nightlife is also awesome. However, I needed to relax for the next jampacked day.', a user said: 'I never do nightlife. My eyes are automatically closing after dinner.'",
        "In response to 'Original Post: Anyone Ever Quiet Quit a Trip? This has happened probably three times where I get close to the end of a trip and just become over it all and just end to get back home (the US). I don’t want to visit another church/palace/museum, I don’t want to wander anymore (my feet hurt). I’m tired of eating out and just done with it all. Doesn’t mean I’ve had a bad time, but I’m ready to be back in my comfort zone and bed. So when this feeling hits. I sort of find myself shutting down.\nThen, I feel guilty because I’ve flown across the world to be in a city people dream of visiting and I’m not soaking in every moment. I will say when my social connections are low, this quiet quitting happens faster. But despite 100 museums and sites. I have no energy to see anymore.\nHas anyone else experienced this?\nEdit: I’m trying to read all of these responses, on touchy airplane WiFi. But thank you for your responses!', a user said: 'To be honest never.\nMy hardest “burnout” has been resolved by few hours of rest in hotel room.\nEveryone should do as they feel but IMO, I think that even hardest burnout could be solved by relaxing in a nice hotel so maybe better in worst case upgrade hotel than change or buy new plane ticket especially if it occurs in last few days of the trip.'"
    ]
}