{
    "username": "TacospacemanII",
    "contributions": [
        "In response to 'Nope, screw that.\nI used to live like that a long time ago when I was convinced that working hard would somehow pay off and make my family's life easier.\nI've learned my lesson.', a user said: 'How hove you recovered? Would you share your finances with me? I’m trying to unbury our family from the pit I dug us into. I’m tired of working 60hrs a week and not having enough.'",
        "In response to 'It's not fun advice, but this advice has kept my family almost entirely financially stable.\nThe best way to make sure you have enough money is almost always to cut back.\nCut back on what, you might ask? Virtually anything that isn't mandatory.\nIf it doesn't keep the lights on, if it doesn't keep the water running, if it isn't food or water, you should reduce or eliminate it from your budget until you reach a point where you can easily afford it again.\nI've had to be extremely, extremely tight with my money in order to make things relatively comfortable for my family. We can pay bills, we can afford food, but we are slowly building enough money to afford other eventual necessities.\nClothes? Yes and no. New clothes are limited and have to be bought cheap, if cheap is even an option. Work clothes are almost always expensive.\nAppliances? Something broke? If it isn't life-changing, go without it for a while. You will eventually have the money to buy it again.\nHouse repairs? Depends on how serious it is. In reality, you should always strive to keep at least a small amount of extra money somewhere in case of a worst case scenario for house damage. If you are renting and don't have to repair things yourself, keep a small amount as a cushion for rent.\nThis is a huge deal.\nStreaming? Recreation? Fun? You have to find ways to adapt. If you want to have a reasonable supply of money then you will definitely have to go without the cutting-edge stuff. Buy what you know you can reasonably afford when it's possible.\nYes, all of this advice applies to if you are paying back debt. I am still in this situation myself. I am paying back at least 3 sources of debt, one of which is relatively major. Trust me when I say the road ahead won't be easy, but you will be able to catch your breath a bit if you learn how to manage it properly.', a user said: 'Thanks man. I already cut internet from my life and my more than barebones phone plan is next. We bought a DVD player and 400 dvds for $50 and we will have movies for months and I’ll be happy to watch that instead of Netflix,Hulu,whatever for a while.'",
        "In response to 'I wish you luck. I hope it all goes over well.', a user said: 'Ty'",
        "In response to 'I think the record for this is over five years.\nSomeone else did it for 3+, got noticed, fired, and claimed unfair dismissal. Won. Public sector worker in France, though.', a user said: 'I want to read that story lol'",
        "In response to 'Original Post: \"Working to Rule\" NOT \"quiet quitting\" [External Link]: https://imgur.com/a/LAimDzs', a user said: 'The good news about everything costing more and eventually everyone getting paid more, is that if you’re already in debt and each dollar is worth LESS you can pay it off faster lol'"
    ]
}