{
    "username": "tandyman8360",
    "contributions": [
        "In response to 'Love the last sentence. Don’t notice opportunities for process improvement, care to elaborate a bit? I relate to this because I am always suggesting ways to do things more efficiently.', a user said: 'I used to get roped into that all the time. Process improvements are good for the company, but not really good for the person who mentions them. The assumption is that if you identified the problem, you're also capable of creating a new, improved process. More work for you.'",
        "In response to 'Original Post: How to quiet quit without being detected after being known to be an extra-mile person at work? Firstly, I know - quiet quitting is just doing your job and nothing extra. Stop repeating the chant.\nSecond, I was known to be THAT person, who goes out of his way to help. I guess I associated my self worth with how company values me.\nIt took a couple of a years and being passed over a promotion to wake up.\nI cannot quit at the moment, or change jobs, I have been looking and nothing suitable on the horizon yet.\nThe question is how do I make the shift in attitude without getting so much attention especially that I am known to be a hard worker.\nEdit: Thank you everyone! Very useful tips! Read every single one! 🙏', a user said: 'Don't say anything. Make sure not to volunteer when a problem is brought up. Start withdrawing from any group that you volunteered for but isn't part of your job.\nMake a list of what you have to do and de-prioritize what can wait. Make sure you get asked about something a few times before you get to it. Overestimate the time needed. I used to gather data and stopped bothering to do it until asked because no one cares enough on a regular basis.'",
        "In response to 'Liked the tip on waiting till you’re asked a few times before doing it! I feel like most tasks die away on their own if you ignore them.', a user said: 'Here's another good one. Things have a way of working themselves out, even if you don't do anything. I used to do things like verify certain part number got into the sales order system or the service database. It meant having to prod other people because it was at the bottom of their list. I stopped doing that as much. Eventually, I left that job so they probably just forgot about it and wondered why things didn't work right once in a while.'",
        "In response to 'Original Post: We should just call it this to show how stupid the term \"quiet quitting\" is [External Link]: https://i.redd.it/1kfth56gqeu91.png', a user said: 'My old department went from 10 to 2. Some work was eliminated, but a lot was dumped on my and my co-worker. I quit last year. They gave him a big raise to keep him.'",
        "In response to '“No reason provided.”\nThis question is a trap to get you to admit to something disqualifying for UI purposes (school, medical, etc). Nobody is going to dig any deeper than absolutely necessary, so when the person processing the UI claim sees that, he or she will just check a box and move on. If you put something like “I was quiet quitting” or “my mental health was suffering” this can create additional headache.\nThe actual truth is irrelevant at this point. The only thing that matters is what is documented. You were fired for no reason, you are ready and available for work now. Money please!', a user said: 'If it's a reduction in force, (layoff) that's also valid. If the company won't contest it, it shouldn't be a problem.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'It's basically when you don't set boundaries because you wanted to go the extra mile, prove yourself, get noticed, etc. When you pull back to your duties, it effectively decreases your previous efficiency.\nI used to do things that my bosses didn't ask for because it made things better (and my overall life easier) at work. I eventually slacked off on the BS work they wanted me to do because they didn't understand that stuff, either.'"
    ]
}