{
    "username": "Tango_D",
    "contributions": [
        "In response to 'Always remember, “unskilled work” is a capitalist lie designed to devalue your labor. If you work 40 hours a week, you deserve a living wage, period.', a user said: 'This is true even in the trades. My last job was as a custom A/V installer. Despite being low voltage electricians who need at a minimum an electrical trainee card to work construction installs (which we did a lot of), they classed us as \"low skill\" expressly to suppress wages.'",
        "In response to 'Yesterday I told someone who was rushing to do their job\n\"Slow down, don't give them all three\"\nWhen she asked what I meant I said \"reliable, fast, cheap. Never give them all three. Since the boss has decided on cheap on account of the hourly wage and you've decided on reliable because you're here every day, do the job at your own speed\"', a user said: 'I'm stealing that.'",
        "In response to 'Original Post: I've been \"quiet quitting \" for a week and have never been more relaxed. I work in a high stress medical setting and have been for 8 years now. I've always been talk to go above and beyond for work. Over the last 4  years I've been increasingly burnt out and my paychecks do not seem to match my effort.\nHowever this past week, after a particularly nasty mental breakdown a few weeks ago, I've been doing the bare job requirements and it's been lovely. I now feel like I have more energy for my life outside of work, and more energy to further myself personally.\nRemember it's only a job, do what you have to and clock out.\n***edit: as many have said it's \"acting my wage\" I was using \"quiet quitting \" ironically', a user said: 'It is morally correct to push the burden off labor and the customer and onto margins.'",
        "In response to 'Unfortunately Home Depot doesn’t care… if it’s not corporate then you are just the pawn. I work with a person who has the best regional sales for 10 years in a row and all she got was a plaque saying great customer service. Her specialist of the month item just some cheap pots and pans was stolen by someone in Chicago. Corporate people know her and come by all time but it’s just sad that she makes nearly anything from Home Depot', a user said: 'I worked at Lowe's for all of one week in the appliances section.\nI was talking to the person training me and she was telling me about how there are these sales goals that we were expected to meet. I said great, so what kind of commission or bonus do you get if you hit goal? Her answer was, \"oh you don't get anything, you're just expected to do it. Maybe get an attaboy if you do.\"\nI looked her dead the her windows and asked, \"seriously??? You get nothing at all? Then why do you do it?\" Her reply was: \"it's just the job\".\nFuck that. I finished the day and never returned.'"
    ]
}