{
    "username": "tangtheconqueror",
    "contributions": [
        "In response to 'Original Post: Quiet quitting is happening at my school You all have heard it around the world. Quiet quitting or \"simply doing your job and nothing else\" is going around. Anyway the Fall Fling dance rolls around and teachers are \"required\" to chaperone. Basically we are given a google form to sign up for a shift to chaperone the dance. No this isnt paid, yes its on a Friday night after a long work day and week, and no food is not provided to teachers. Total suckfest all around. Well get this, the day before the dance we get a frantic email from Admin. No one signed up to chaperone. NOT A SINGLE teacher signed up to chaperone. We get some messages about how this is mandatory, teachers must be there for the event, we can choose which shift we work but must be there. No one signs up. Cue Admin start walking door to door with a sheet asking people to sign up. Get this, the teachers stand their ground and say no. Of course a few caved, 1 or 2, but overwhelmingly the teachers say no.\n​\nGuess what happened, well they had the dance, the admin chaperoned, the few people that signed up, basically a skeleton crew. The next week nothing, no messages, no angry faculty meeting, nothing. They know that they cant do anything to the teachers because its not one or two, its everyone. Listen I understand that kids need fun stuff to do, but maybe don't make teachers do it, or if they have to be there pay them??', a user said: 'The phrase \"quiet quitting\" is propaganda designed to make it sound like \"just\" doing your job is something negative.'",
        "In response to 'Post covid work propaganda. Ive literally never heard of the term before 2022.\nWhos spinning this shit?', a user said: 'The same people who are complaining they can’t hire anyone because “nobody wants to work anymore”'",
        "In response to 'I have never heard it in a negative light. Quiet quitting just means working your intended hours and your intended job. Whatever you call it, teachers need to start doing it.', a user said: '“Quitting” is negative. Doing your job is not quitting. The phrase would make sense if it was describing not doing your job and making them fire you'",
        "In response to 'Original Post: Quiet quitting could be the best thing for education. Everyone's definition of quiet quitting is different. Mine is not working outside of your contract ours. Work from 7am to 3pm and then you're done. No lesson planning outside of class, no chaperoning, no working gates unless it involves extra pay.\nWhen you ignore these boundaries, you overwork yourself, can't sustain the position, and you end up leaving the profession and in return your students lose a great educator.\nIf you can't do all the tasks a school asks for you to do during the day, that is not the fault of you, it is the fault of your boss requiring too much of you. If you continue doing these tasks outside of your hours you are effectively telling your admin that this is okay.\nWhen you put your value in working extra hours because it makes you feel like you are \"doing it for the kids\" you are doing the opposite long term. The precedent that teachers have to put so much time in outside of work is toxic and leads to teacher burnout. A shortage of teachers is not good for any educational system.\nI'd like to blame admin, government, or students but the easiest fix is in the teachers themselves. When we overwork ourselves, we effectively hurt education. Only work your hours and if you can't get your work done, let your admin know you don't have the time. Healthy work life balance can keep us going and bring more teachers into the profession.\nEdit: Sorry y'all. I didn't realize how problematic the term \"quiet quitting\" is. I am glad though that it brought some attention to the post which led to some good discussion. I will use a different term from here on out and I am happy a lot of you only work your hours or work your contract.', a user said: 'I should just keep my comment from yesterday's post and copy and paste it in every one of these posts:\nThe phrase \"quiet quitting\" is propaganda designed to make it sound like \"just\" doing your job is something negative.'",
        "In response to 'People arguing over semantics on what to call it when the real issue is all the bs us teachers are fed up with. Solidarity', a user said: 'Absolute garbage. There's plenty of solidarity for the idea. \"Quiet quitting\" is corporate propaganda. It absolutely does matter if we are making it easier for them to make us look bad.'",
        "In response to 'Compensation comes in all sorts of forms. And the most important, most motivating, most addictive form of compensation was not even mentioned in this post.', a user said: 'I'm guessing it's not something I can use to pay my bills.'",
        "In response to 'Original Post: Is anyone “quiet quitting” this year? I’m curious if anyone else is doing this and how it’s going. My mental health was a mess after last year and my home life is messy— my daughter has a chronic illness that is not in remission. I decided at the end of last year that I was done overextending myself for this job.\nSince then, I’ve just said no, over and over. Can I help take tickets at a football game for four hours and $30? No. Can I lead a PLC? No. Can I mentor a new teacher for an extra plan bell? No, because I’ll just get called to sub for free every day— learned the hard way last year. I’m contracted to work from 7:45-3:15 and so that’s when I arrive and when I go home. If I have to stay extra for any reason— like my daughter’s late practice— I watch Netflix on my school computer and get a Pepsi.\nIt’s been a real relief so far— knowing there’s no pressure for what else may be lurking ahead. It doesn’t matter, because I’m not doing it anyway.', a user said: 'PLEASE stop using this term.'",
        "In response to 'Original Post: Students refusing to do work because they're \"quiet quitting\" Has anyone experienced students not wanting to do any work (not necessarily \"extra\" work, but any work really) and mentioning something related to \"quiet quitting\" as a reason when asked?', a user said: '\"Quiet quitting\" is a corporate propaganda term that is used to make it sound like \"only\" working the terms of your contract is some kind of negative, so they can shame people who don't volunteer to do more than what they are paid to do.\nIf the terms was actually used properly, it would be something like \"to not do your work so your employer is forced to fire you.\" So if they want to go that way, then the zeroes they receive for their lack of work would be them \"being fired.\" I say take them up on it.'"
    ]
}