{
    "username": "Tarcye",
    "contributions": [
        "In response to 'Exactly. There's no worker shortage. People just finally realized their worth more than employers pay.', a user said: 'Their is a worker shortage actually. It's just not caused by any of the moronic things they think caused it. IE \"WE gAVE PEOPLE $2,000 DURING THE PANDEMIC AND NOW NO ONE IS WORKING!!!!\"\nMore it's a matter of so many people died or have been disabled by Covid and no longer are in the labor force.\nThat and people aren't accepting being paid low anymore. Mcdonalds has to hire people at $17+ an hour just to find closer's. Where as before they paid them $9-$10 an hour.'",
        "In response to 'Anyone who says there isn’t a worker shortage hasn’t tried filling a req recently. For some reason people on Reddit always frame this topic in terms of unskilled labor and about how companies just don’t want to pay. I’m working in a highly skilled environment and have req’s we are trying to fill with comp ranges from 200K+ and we still really struggle to hire. Our comp isn’t the issue, a shortage of skilled labor is.', a user said: 'My company has around 200 un-filled entry level positions right now. Used to require a bachlors degree Then during the pandemic it became even more lax so that an Associates was all you needed to get an interview.\nNow if you have a pulse and a High school Diploma or a GED you just have to apply and you are almost guaranteed an interview.\nAssuming the HR people aren't being moronic again. My company closed their Minnesta branch and I went 100% remote becuese aint no way I'm moving to New York city or \"Pukes\" Mobile, Alabama. got an Email in the spring demanding that I got to 50% in person by HR.\nI told them unless they are gonna pay me to commute by Plane that shit isn't happening.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'Optimistically in my experience that would be a 50 50 chance.\nYeah.. Honestly I hate to feed the sterotype of HR but well they kind of deserve it at this point.\nCompanies keep putting their corporate buildings in the dumbest fucking locations. A good example locally is Targets headquarters in Brooklyn Park nobody wants go to because the location sucks for most of their employees.\nYep. Especially after they closed the location here. Like I'm not moving generally unless I want to. And I'm not moving to fucking Alabama no matter how much you pay me.'"
    ]
}