{
    "username": "Taskr36",
    "contributions": [
        "In response to 'I’m not sure it’s fair to blame the coworker for his workload being dumped on her. She says her manager knows it’s the coworker who’s slacking, but chooses to make that OP’s responsibility. I also understand “quiet quitting” to mean only doing work that is part of your job description. If that’s what OP means, it’s especially unfair to blame the coworker for refusing to do work he isn’t being paid to do if OP chooses to do work she isn’t paid to do. OP is equally capable of declining work she shouldn’t be responsible for.', a user said: 'You've clearly never had to manage government employees. When something needs to get done, it needs to get done. You can't fire people for being useless. You basically have to catch them committing actual crimes on the clock, and even then, there's often a long drawn out battle with the union, where the person may still keep their job. Those useless people could tank the manager's promotion opportunities though, so they end up dumping more of the work on the employees that actually work.'",
        "In response to 'I’m going off of the term “quiet quitting.” This is a derogatory corporate term for “acting your wage” or just “doing your job.”  Basically saying “I was hired to perform XYZ tasks for $ABC salary. If you’d like me to perform additional tasks we can talk about additional salary, but I will not do additional work for free.”  Which makes sense, if you think about it. If I agree to pay you $500 to paint my house, how open would you be to painting my neighbors houses while you’re there for no additional charge?\nNow it could be that OP is using the term incorrectly, and that what she really means is that her coworker is not doing his job. And I’d understand her frustration there.', a user said: 'I get where you're coming from, but I usually hear the term in reference to people who keep showing up to work, but do basically nothing. They've quit working, but remain present so they get a paycheck until they're fired.\nPainting a house is different than being paid an hourly wage, and being given different work to do while on the clock, so I don't think that's a great analogy. Pretty much every job has set responsibilities, with the caveat that you'll be asked to do other work as needed. Painting a house is typically a set job for a set amount of money, rather than an hourly rate.'",
        "In response to 'This right here, in my experience coworkers are very rarely your actual friend.  The amount of betrayal from “friends” I’ve seen over the years is substantial, all to advance their own career.', a user said: 'True. I feel like one of the most common complaints on this reddit is that someone was betrayed when they confided in a coworker or boss. I keep telling people, your work friends are NOT real friends. They're not your family, even if they repeatedly say \"We're like a family here!\"'",
        "In response to 'Original Post: What to do if my counterpart has \"quiet quit\"? One of my coworkers has been quiet quitting for a long time. But we're basically in a workplace where people are unfireable (government job). His boss does not seem to want to confront him about slacking, so instead, she gives his work to me and makes everything about \"we\" and \"us\" instead of \"him\".\nInstead of telling him directly, for example, \"hey PERSON X, why aren't you responding to my e-mails?\" She'll e-mail both of us and say \"Hey Team, why aren't you guys responding to my e-mails?\" (When it's very obviously him, not me.)\nWhen he decides not to do his work, she just gives his work to me.\nHonestly, I don't care if he quiet quits -- that's his business. But when his refusal to do work is falling on my table, that's where I start to see things getting problematic. How would you deal with this situation? Telling on him is not a good option, we are equals in the workplace and he considers me a friend.\nEDIT: Wow, so many responses! Yes perhaps my use of \"quiet quitting\" wasn't the right choice of words. My coworker came into my office on Friday and told me he doesn't \"give a f***\" about this job but he feels powerful because he feels \"unfireable\". He spends the entire day working on his own stuff (he has a few side jobs that he does). Our boss seems to be intimidated by him and takes the easy way out - instead of giving work to someone who's going to push back, she'll dump it on others instead. Firing someone is an extremely complicated and long process here, and probably not something she wants to go through. The boss is in her third trimester of pregnancy and getting ready to go on maternity leave. My coworker and I have similar job descriptions so it's easy to give his work to me. Addressing the \"friend\" issue: yeah, I don't really know if \"friend\" was the right word here either. But we're equals and I guess you could say \"friendly\" to each other. Coworker brings me baked goods sometimes, has invited me to get-togethers, things like that. Situation really sucks.', a user said: 'Dude, I've been there, and I really wish I could offer a helpful suggestion, but there are none. Your only chance of getting out of this is if they transfer him somewhere else. If he considers you a friend, you can tell him that it's fucking up your day that you have to do all his work.\nIn my situation, the guy was a useless sack of crap that didn't like anyone, and wasn't liked by anyone. He wasn't even quit quitting, he was just doing an absolute shit job, showing up late, showing up drunk, literally cursing out children (this was at a public library)  and laughing about it because he knew he was unfireable.\nI did everything in my power as Asst. Manager to get him fired (the branch manager had given up long before I got there and was close to retirement), and nothing worked because the union fought tooth and claw for him, even when we had video evidence of him disappearing for hours when he was supposed to be at the front desk. Eventually, some time after I'd left, the manager did manage to transfer him to another location, making him someone else's problem.'"
    ]
}