{
    "username": "Tau8VnmE0Neutrino",
    "contributions": [
        "In response to 'Original Post: Quietly Quitting and Lying Flat I have wondered over the years why we are constantly told to work harder, work harder, but then things don't always get any better. But it's super-important for Singapore to be competitive against every else, right, so we got to work hard.\nBut I also see that in other parts of the world, there is a bit of a backlash against this kind of idea:\nquietly quitting\nand\nlying flat\nWhat is your opinion?', a user said: 'Get rid of fucking social media first. This is all born from envy and an excessive use of a platform built for flaunting, you're the only one who allows yourself to compete against others. Without social media, you don't even know what to compete against in the first place. Stop being so interested in other people. Focus on a core group of close friends and family, you'll realise other people don't matter in the least whether they just got married, bought a yacht, or are dead.\nDon't you guys feel like jealousy is an ugly emotion? It makes you feel really bad and makes you really weak.'",
        "In response to 'but the funny cat pictures though', a user said: 'Reddit is a good place for it too. It's anonymous and impersonal enough not to be the type of social media that makes you feel bad watching people flaunt their wealth, while at the same time good enough to not be entirely disconnected from news and public sentiment.'",
        "In response to 'Even if you think you have a core group of friends, or some seemingly ok peeps on the surface, they all have their own other social circles with bigger and better parties than you, more friends than you, more income, more holidays and travels etc. Even if u delete social media, u can't escape the \"I'm going to Australia/Switzerland/France\" for holiday next week life update. And some people's life are objectively better than others, even after factoring in the problems. Ie. Employed and super stressed in PMET role vs non-PMET role paying 1k or not working, those with more social support in terms of genuine friends, less financial issues, less physical/mental ailments, those with more purpose and meaning in their lives,those with more hobbies and more holidays to deal with this stressful thing called life. Those with mental or physical ailments have been dealt with a really shitty hand. Admittedly, my life is shit but objectively better than some others as well and vice versa.\nOk enough complaining from me. Hence, I decided to make changes and move up. Making actionable changes to make my life objectively better than just envying people from the sidelines. And finding fun and nice stuff to do.\nInitially, I posted to make people jealous but I avoid people's social media to avoid becoming jealous. Then I realize I am overcompensating for my shortcomings and inferiority complex and shit that happened in my life. Then I tried to post less cause' it's not good to make people feel jealous/put up a front anyway. (Like how you may not have many friends or good job or fun hobbies or nice destinations to travel to, but really try to make ur life look damn glam and fun etc, attending hottest events, pretend u got a lot of friends)', a user said: 'You're right that you still get some information if people tell you intentionally. However that gets rid of 99.9% of the unnecessary news.\nYou might not know this but deleting social media slowly causes you to recalibrate to the new environment.\nYou start off anxious like you lost an arm or something. Then you adapt over a few weeks you take your mind off social media. Over the medium term you lose interest in private happenings of acquaintances/internet personalities because you realise you can't find out without social media anyway. Over the long term you just don't care anymore, nothing you do will be on social media anyway. Your cousin buying his next condo doesn't feel like anything. It's been a while since you last heard any info about people's private business so that's pretty cool I guess.'",
        "In response to 'That's true. It's why the only person I know to have successfully been able to 'lie flat' ( for several decades now) is only able to do so because he has a safety net and a form of passive income anyway: he inherited his mother's apartment after she passed away.\nHe still lives in the old 3 bedroom private apartment (surrounded by the original yellowing paint, hideous brown and orange furniture, and original kitsch from the 70s). He occupies the master bedroom and rents out the two smaller bedrooms. He occasionally does some work, if he feels like it. And lives contentedly on the modest amount of money his work and rental income brings in. He's single (never married, and to the best of my knowledge, hardly ever dated), almost exclusively eats at home, and his main form of entertainment is either playing PC games or D&D all day.\nThe only time I ever saw him show any sign of regret for his lifestyle was when another member of our group of friends was getting married. The wedding was a modest but happy one (both bride and groom were divorcees, an older couple with children who were already in their late teens and early 20s) with a focus on good food and a small but close circle of friends. The groom was telling us where he and his bride would be spending their honeymoon, as their children and friends cheered them on, and our stay-at-home friend quietly commented that he always wished that he could have a family too, with a wife and children, and travel the world with his spouse. He didn't think he would want that someday but now, he felt drawn to it. But he knew he wouldn't have a chance to do that. He was too entrenched in his ways to actually seek out a partner, and he didn't have the money to go on holidays, let alone raise a family at his late age.', a user said: 'And that's ok no? He's free to do exactly what he wants, he's luckier than many people can be.'"
    ]
}