{
    "username": "TeachlikeaHawk",
    "contributions": [
        "In response to 'Original Post: Quiet quitting could be the best thing for education. Everyone's definition of quiet quitting is different. Mine is not working outside of your contract ours. Work from 7am to 3pm and then you're done. No lesson planning outside of class, no chaperoning, no working gates unless it involves extra pay.\nWhen you ignore these boundaries, you overwork yourself, can't sustain the position, and you end up leaving the profession and in return your students lose a great educator.\nIf you can't do all the tasks a school asks for you to do during the day, that is not the fault of you, it is the fault of your boss requiring too much of you. If you continue doing these tasks outside of your hours you are effectively telling your admin that this is okay.\nWhen you put your value in working extra hours because it makes you feel like you are \"doing it for the kids\" you are doing the opposite long term. The precedent that teachers have to put so much time in outside of work is toxic and leads to teacher burnout. A shortage of teachers is not good for any educational system.\nI'd like to blame admin, government, or students but the easiest fix is in the teachers themselves. When we overwork ourselves, we effectively hurt education. Only work your hours and if you can't get your work done, let your admin know you don't have the time. Healthy work life balance can keep us going and bring more teachers into the profession.\nEdit: Sorry y'all. I didn't realize how problematic the term \"quiet quitting\" is. I am glad though that it brought some attention to the post which led to some good discussion. I will use a different term from here on out and I am happy a lot of you only work your hours or work your contract.', a user said: 'You're building artificial boundaries. The contract\nnever\nstates that teachers are required to work only during those hours. It says that those are the hours for school. It also then states what you duties are, and what you're being paid for attending to those duties.\nThis is just as foolish as students saying that school hours are 8-3 and so they don't have to do any work outside of those hours and teachers can't penalize them for it. What would you tell that kid? Obviously, you'd point out that those hours only represent the time period we require the kid to be at the school.\nIt's really quite similar for teachers.'",
        "In response to 'Um, I don't give homework\nfor exactly that reason.\nIf you don't do the work in the provided time, sure you gave yourself homework. Sure, I'll provide you with optional practice/ study material. Yet, all of us assuming we have a right to as much of their time as we want seems like exactly the kind of mentality we need to kill.', a user said: 'I figured someone would say this.\nRegardless of what you do or don't do, you recognize that teachers, as a rule,\ncan\ngive homework, right?'",
        "In response to 'Policies vary by school and district.\nThe permissiveness of such policies is a deferral to the teacher as the pedagogical expert most aware of the context of their specific classroom, far from a mandate.\nThat something is legally\npermitted\nhas no bearing on its ethical merits.', a user said: 'Actually, this entire question is about legality. Are people arguing for us to follow \"ethical hours\" or \"contract hours\"?'",
        "In response to 'The list of duties is too long. My school tells me to call every parent once a week. If we consider just the 36 students in my homeroom, and factor in each phone call as 2 minutes average (some don’t answer, some talk longer) that’s a 72-minute chunk of time I need just to do that one task. When I ask where to fit that in my schedule, I get a blank stare. And that’s just one task that they throw on top of everything else as if it’s nothing. So I don’t do it—fuck ‘em.', a user said: 'I agree with you completely. This is over the top.\nMy argument is not against setting boundaries. It's that the whole \"contract hours\" thing will never be a pathway for us to actually\ndo something\nabout the problem. I just hate to see us as a group get behind an argument that won't actually help us if we bring it to a bargaining table or union negotiation.'",
        "In response to 'Original Post: Students refusing to do work because they're \"quiet quitting\" Has anyone experienced students not wanting to do any work (not necessarily \"extra\" work, but any work really) and mentioning something related to \"quiet quitting\" as a reason when asked?', a user said: 'It perfectly fits the quiet quitting mentality. So, if a teacher supports the notion of quiet quitting, I figure that teacher is a bit stuck.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'No. \"Quiet quitting\" is a term embraced by many of the people who do it, so it's not a term of shame put upon anyone.\nThe trick is that there is no single clear definition. What I mean is that I can't (with any clear objectivity) point at a person and say, \"That person isn't quiet quitting correctly.\" That personal subjectivity is the flaw in the entire \"movement,\" and it's what allows students to say, with just as much authority as anyone else, that they are quiet quitting school by not \"...doing work that is pointless and stupid just to prop up a system that is fundamentally flawed,\" as they might say.\nHow can you tell them that they're wrong, when the whole basis of quiet quitting is the people who do it themselves deciding what counts or doesn't?'",
        "In response to 'Except it doesn’t, because “quiet quitters” (propagandaist term, btw) still do their jobs.   They’re just not willing to go above and beyond.', a user said: 'Ahhh...but the thing you're forgetting is that each individual \"quitter\" decides personally what \"above and beyond\" entails. How is that any different from a student doing the same?'"
    ]
}