{
    "username": "teamglider",
    "contributions": [
        "In response to 'I’d have still kept exceeding if I was OP- reducing to hitting only the goals is technically ok but will not get OP an advancement when Boss retires.\nMy opinion: Big boss knows there are issues and is watching to see if OP excels or phones it in because they hate the boss. Assuming big boss will accept on target (but not exceeding) goals is a risk I would not take if I was OP.\nI think OP is realizing that, which is why they want to craft a review that sounds better than “I did what was asked, not a bit more”.', a user said: 'My opinion: Big boss knows there are issues and is watching to see if OP excels or phones it in because they hate the boss. Assuming big boss will accept on target (but not exceeding) goals is a risk I would not take if I was OP.\nUgh, such toxic bullshit.\nI know there are issues but, instead of working to  solve them as the BB, I'm going to let you twist in the wind and see if you excel regardless. If you do, who knows? Your boss may or may not retire in a few years, and you may or may not get a promotion!\nIsn't the uncertainty\nexciting?\nIt's like buying a lottery ticket, only much harder and more soul-sucking!'",
        "In response to '\"We've hit all our strategic goals for this past year\"\nThat's how I would spin it. Then, if she talks about the drop in extras, talk about how your priorities were focused on the strategic goals and that you prioritized those over the less essential tasks.\nIf she says they're important too, then feign ignorance in saying that you didn't realize she wanted them as they were part of the strategic goals the team had set at the beginning of the year, and that you didn't know she wanted you to focus on them.\nEssentially, you never let the blame move to you. She is your boss. If she wanted those things to be prioritized, she should have vocalized it sooner than your annual review.\nAlso, I'll caution that if you're hoping she retires and you're expecting any chance of slipping into her role, quiet quitting might be a mistake. I'm not advocating for doing unpaid work, or going above and beyond what you're paid for. But, if you're just doing the bare minimum, it's unlikely they try to promote you.', a user said: 'I'm not advocating for doing unpaid work, or going above and beyond what you're paid for.\nThe very definition of quiet quitting is not doing unpaid work and not going above and beyond what you're paid for.\nCorporate America has everyone so bamboozled that doing the job you're paid for is know as quiet quitting instead of . . . doing the job you're paid for.'",
        "In response to 'I thought quiet quitting was when you stop doing the job you're paid for and do as little as possible without getting fired.', a user said: 'No, it's doing the job you're paid for, but not doing the extras. Maybe doing as little as possible to maintain your current job, in some cases, but you're still doing that job.\nFor an hourly person, this might look like leaving for lunch instead of using the work kitchen, so that people can't ask you questions when you're on break.\nFor a salaried person, it might look like doing good work on your own projects, but not diving in to save someone else's project. Or doing good work on your own project, but not working insane hours to make up for the fact that your manager didn't allow for a sufficient timeline.\nIt's \"quiet\" because you're generally not vocally refusing to save someone else's project, but just saying that you'll help as you have time. And you just never have time, because your own projects are a freaking full-time job.'"
    ]
}