{
    "username": "techramblings",
    "contributions": [
        "In response to 'Original Post: Bill Maher being very anti WFH and against quiet quitting the past year [External Link]: https://i.redd.it/6nykqc1bx0pa1.png', a user said: 'Nearly all of my tech industry contacts are permanently WFH now, and there's no enthusiasm at all to go back to an office. Several of them have moved jobs over the last 18 months, and one of the first stipulations they have for a potential new employer is full time WFH.\nAlso, having just returned from an industry event in\n<insert big city here>\n, I've seen several attendees post on the mailing list for said event that they've tested positive for Covid, and I've received several pings from the NHS Covid app. I've been LFT testing myself for the last 10 days, and fortunately, it looks like the FFP3 masks I wore throughout the event have saved my bacon.\nSo yeah, some of us are still\nvery\nreluctant to go into big buildings with lots of other people, for totally legit health reasons.'",
        "In response to 'Original Post: Hey guys, I was “quiet quitting” until I got fired , now what? So I just got fired and they recommended me to file for unemployment insurance. HR was surprisingly nice. She basically told me they don’t contest the claims, so I think if I use the right words in my unemployed application,\nI might be eligible for unemployment insurance.\nHas anyone successfully received unemployment insurance benefits in this situation before and lives in the state of Illinois? One of the questions is below:\nAccurately report your reason for separation from your job when you initially file your claim for benefits.\nEDIT: I  shouldn’t have used the term “quiet quitting” on my post because I used the term incorrectly, my apologies. I meant to say, I was really underperforming on my job, barely doing any work for the past year or so. I did the bare minimum. I was  then placed under an improvement plan for a little over 6 months or so. They saw some improvements, and I was doing okay, until I mislead my manager with 2 assignments. I stated that I had completed the assignment but in reality I used last year’s data to mark it completed, while I attempted to catch up over the weekend.\nI never fixed the assignments and my manager found out what I did. That’s when she went to HR for the next steps. I emailed HR for a written confirmation on why I was fired and she responded “unsatisfactory performance.”', a user said: ''Quiet quitting'\n!= quitting. It's simply acting your wage.\nThey fired you, ergo you should be entitled to unemployment benefits.\nQuiet quitting is irrelevant in this context.'",
        "In response to 'Original Post: Why is “quiet quitting” even a thing? Quiet quitting is defined as someone only doing what’s in their job description and nothing more. My question is: why the fuck is there even a term for this, and why does said term involve “quitting?” Why is it apparently an expectation that someone should do more than what they have been hired to do? This is something that has always appalled me, ever since my very first job.\nIn one of my first jobs, my boss would give serious side eye whenever I refused to do something that pretty clearly wasn’t part of the job I was hired to do. I wasn’t particularly successful in that job and quickly realized that part of doing the corporate dance is doing whatever people ask you to do at all times no matter what.\nThe thing is, doesn’t the term “quiet quitting” imply that you’re inherently not doing part of your job? Shouldn’t that be the proper definition? Not “not doing things that already aren’t part of your job?” What the fuck is happening lol', a user said: ''Quiet quitting' is truly an awful phrase - it's basically criticising people for just doing their jobs rather than hours of unpaid overtime.\nOr to put it another way, this should be the norm, not the exception. People should only be working their contracted hours; if employers want more work done, they can either pay more people, or negotiate additional pay for their existing staff in exchange for extra hours worked.'"
    ]
}