{
    "username": "Technical-Agency8128",
    "contributions": [
        "In response to '\"Oh, I'm sorry. I guess doing all that extra stuff was eating into my work. I barely got a 'meets expectations' for the first time instead of 'exceeds expectations'. I guess my focus has been in the wrong place, and I have to adjust how I spend my time. Talk to the bossman.\" 🤷‍♂️', a user said: 'Yup. Can’t go wrong with that.  Only work.  No extracurriculars.  Others can pick up the slack.  OP has officially retired from being the party planner etc.'",
        "In response to 'Our phrase where I worked was, \"No extras. No extra pay, no extra me.\"', a user said: 'That is a good rule to go by.'",
        "In response to 'They don't need to vent or complain; they're the office sounding board.\nWhenever co-workers come to vent, all OP has to do is explain that the boss had brought them into the office regarding this behaviour already. Then advise them to do whatever the boss instructed.\nPeople will be quick to put 2 and 2 together.', a user said: 'Just tell them to go to the boss.  Conversation over.  Change the subject.'",
        "In response to 'I dont want to risk not meeting my expectations.', a user said: 'Exactly 👍🏻'",
        "In response to 'No, it wasn't like that exactly. Historically we've all called to complain to each other when things change and then we move on. He's been around for that and never taken issue before. I had my door open and I guess he just wasn't having it this time for whatever reason. He definitely misheard things though. It's like he heard key words and phrases and took them out of context or dropped them entirely.', a user said: 'Your job will be easier now.  Think of this as a blessing.  You come in and just work.  And you don’t let anyone vent to you.  Ever. Everything goes to the boss.   Others will now do the extra stuff you were doing or they don’t.  This is a new life for you now.  Fun happens outside of work.  And don’t say anything to coworkers.  They are not friends.'",
        "In response to 'I would suggest that in the meantime you use the free time you have (now that you're not doing office emotional labour) to spruce up your CV and investigate the job market...', a user said: 'Yup.  It is not her job to bring fun to the office anymore.  She can definitely use all this free time to her advantage.'",
        "In response to 'Oh this is one of those \"not what you know but who you know\" situations in regards to hiring and I'm not looking to whack the hornets nest unless absolutely have no other option', a user said: 'Smart.'",
        "In response to 'Yeah, aside from wanting to make an example out of us, it's the only thing I can think that makes sense.', a user said: 'Don’t even try to figure it out.  Go to work. Do job.  Go home and have fun.'",
        "In response to 'Are you familiar with the saying that people don’t leave jobs, they leave managers?\nYou’ve been there 10 years as a positive influence. I think it’s time for you to look around.\nNTA', a user said: 'And retire from being the party planner and morale booster.'",
        "In response to 'Yeah sometimes people don't appreciate you, not because they don't notice or realize how much you do for them, but because they feel entitled to it. When the extra goes away... it becomes a power struggle.\nIdk if that's the dynamic here but it is definitely a dynamic I have seen play out before... in and out of workplaces.', a user said: 'When you do extra people expect it and get really mad when you stop for whatever reason.  Only do what is expected and rarely anything else.  Then people will be like wow lol'",
        "In response to 'Agreed. This is on the manager.\nVenting is healthy - when handled professionally. I mean my friends would love to meet my colleagues because DRAMA but I also work remotely so we have a call every few weeks.\nWork vents are part of the parcel, we get stressed, we get angry, we cry and we laugh. Hell I had a call today from someone to rant about their Mrs spending his entire bonus on a handbag, I told him I was jealous because I wanted to do that but had to be an adult and pay solicitor fees. (I am the only female senior in my team and one of very few in my company as it's a male dominated field so I am seen as the safe space to rant)\nI stopped emailing my team about 5 months ago when the last other female senior left. I organised a leaving present for her and asked my team for a donation as it was via Amazon (remote working). She was so happy she got her gift so I didn't mind but then realised I probably earn £5-10k less than these guys and I footed the bill, only one donated. So I stopped. No birthday cards, no Christmas etc. they did comment on it but then I thought, well no one sent me anything for my birthday...\nOP, Stand your ground. This isn't your responsibility to pick up.', a user said: 'Yes.  Only do extras because you want to.  Never because you think it’s expected.  And don’t expect people to say thank you or even care.  Many won’t.'"
    ]
}