{
    "username": "teddyoctober",
    "contributions": [
        "In response to 'Burnt out, yes. Considering a completely different career path. Monthly quota is wearing me down — especially not hitting it these past few months — the pressure looms outside of work and the dread coming back on a Monday isn’t healthy.\nI’m still relatively young (4 years out of uni) but as an introvert I don’t know if I can mentally handle being a full cycle rep of making 50 calls a day plus doing demos and closing deals.\nI love being rewarded for your performance unlike other jobs, and I get to build trust with people and help solve their problems, and I enjoy the grind. But with so many things out of my control (DMs pushing deals months out) it’s freaking tough to keep level headed. I realize why the drinking culture is so rampant in sales.\nI honestly don’t know what to do — been in my role 6 months, I’m building better habits around sleep, mental health, eating, and exercise but I haven’t seen a lasting change. I’m normally an anxious person so I’ll admit maybe I’m just not cut out for the constant pressure sales brings when you’re not doing well.', a user said: 'and the dread coming back on a Monday isn’t healthy\nYour dread has the courtesy to wait until Monday?  Mine starts on Sunday.  Every Sunday.'",
        "In response to 'It’s 100% there for me too every Sunday, the later in the day the greater the anxiety. But nothing compared to waking up on a Monday morning thinking here we go again.', a user said: 'And while we’re at it, isn’t the brain wonderful at ensuring you can’t sleep to your alarm goes!  I’m always up an hour before the alarm goes off because…Sunday anxiety leaned to Monday early morning brain “HEY!  Weren’t we stressing about today yesterday?  Well today is here fucko!  No more sleep for you!!”'",
        "In response to 'I’m not trying to be an ass, but four years ago I decided Monday was going to be my favorite day of the week.  While there was a few months of faking it until you make it, it literally IS my favorite day of the week now. I feel Monday morning holds 100% potential for what you can accomplish this week, and I fucking love that feeling now.\nHowever, also, I’m 48 and have had a quota for like 86 consecutive quotas as a account exec, and yeah, that sucks. If anyone is under 5 years in and feels like they’re burning out, you should probably jump. I’m so far in I’m probably not qualified for anything else. Not anything that pays a few hundred a year standard anyhow.', a user said: 'I’m 52, and this is similar to my copium.'"
    ]
}