{
    "username": "Teldori",
    "contributions": [
        "In response to 'Original Post: I just spent two months in China. Don't believe the CCP reporting 21% youth unemployment, it is definitely way, way higher. [So I'm a Mandarin-speaking Asian dude from Texas.\nThis is all anecdotal, so this is only my first-hand observations. Feelings are useless in trading. You are a moron if you trade off a story versus hard facts\n.] I was in Beijing for a wedding, then was a tourist through Chengdu and Harbin and various villages in between.\nFirst, locals are freaked out the CCP is so embarrassed youth unemployment is over 21% that they will stop reporting the number starting the next month.\nFor reference, places like Japan, South Korea and the US are at 5 to 7% youth unemployment, UK at 10%, EU at 14%. Twenty one puts China in the same territory as fucking Lebanon. Heard many an angry rant against the government by middle-age and older parents behind closed doors talking about how their adult kids are unemployed even with a C9 university degree. I met many, many food cart vendors and Meituan (food delivery app) dudes on ebikes who just graduated from a top school. This on top of all the quiet quitting and \"lying flat\" people I met who are just giving up and not looking for steady work. Several parents told me how the old cushy government jobs for grads are drying up because cities are all teetering on bankruptcy due to the growth-at-all-costs spending and debt of the past 20 years.\nSecond, these shady fucks are not reporting unemployed migrant workers from rural areas. There's got to be millions of these people.\nI thought migrants were reported after the CCP revamped their labor reporting standards in 2019, but the business owners and university faculty I met and talked to said it is all bullshit, there is no way to track them. I stayed at a friend's flat near central Chengdu and every morning there were hundreds of migrant day laborers at the truck depot across the street waiting for trucks and vans to drive up looking for cheap labor. Shit was wild, there would be literally fistfights over who would pile into each truck. Reminded me of the Honduran, Mexican and Salvadorian migrants back in Dallas who line up near Home Depots looking for day work, sans violence. The day labor dudes I talked to in those mobs in Chengdu and Beijing were almost all former construction workers who are now doing day work or gig jobs because all the construction jobs are gone thanks to the imploding real estate market (see Evergrande bankruptcy). They told me the day labor crowds were easily 3x bigger right after COVID but the work was so rare that folks packed up and returned to their villages when they ran out of money. Multiple that a couple hundred times, who knows how many unemployed ppl aren't being counted.\nAnother big problem no one is talking about that I noticed - China made working construction over 50 illegal.\nSo now there's millions up on millions of people over that age trying to fill other service jobs even before COVID. Thanks to the One Child Policy and non-existent government benefits, there aren't the large family safety nets that other Asian countries have so I could see with my own eyes many older folks with no savings already falling through the cracks.\nShit is fucked.\nI've been to China a few times since 2000 and this is the first time I could see and hear deep structural stress on the economy and society.\nChina has always felt like the Wild West to me because there's just so many people there living on top of each other that everyone just looks out for themselves. Even before COVID, I rarely saw common courtesies like the waiting in line and not being rude to strangers. That selfishness still exists but is now on hyperdrive since people don't have easy access to jobs anymore. I'm curious how Xi is going to keep people in line when the wheels come off completely. Thank you for coming to my TED talk.\nedit. LOL someone referred me to Reddit Cares for this post. Don't worry, I don't plan on ever travelling back to China, I decided awhile ago this would be my last trip. I have zero family there and the friend I stayed with in Chengdu is a non-Chinese expat. I love Chinese people and culture, that is why I kept going back. But you don't need to be in China to exclusively experience it.', a user said: 'Very interesting comment about the lack of a family safety net due to the one child policy. I used to think China implemented that policy to curb their population growth. Years ago, I read a comment on a thread that challenged that. The commenter said the large nuclear family is a threat to a communist regime. You’re less needy on the government if you have family that can feed you, house you, and care for you when you can no longer care for yourself. That is a way to look at it.'"
    ]
}