{
    "username": "temotodochi",
    "contributions": [
        "In response to 'Totta, huutikset tälle!\nOlen todistanut useita tapauksia työelämässä sekä muilla että myös jopa omalla kohdallani nuorempana ja hölmömpänä, että hyvin hoidetusta hommasta on saanut \"palkaksi\" lisää vastuuta ja vaikeampia hommia ilman asiaan kuuluvaa palkankorotusta ja mahdollista työnimikkeen muutosta.', a user said: 'Heh juu omalla kohdalla 15v sitten kun pyysin loppuunpalaneena eri osastolle töihin (ja pois vuorotyöstä) niin vastaus oli aika naurettava \"no sun tehot on ollu sen verran huonot nyt että emmä voi tämmöistä palkintoa sulle antaa\".'",
        "In response to 'Original Post: Quiet quitting eli tämän syksyn yksi ärsyttävimmistä uusista termeistä on saanut vastaparin: quiet firing Quiet quitting (\nHesarin maksumuurilinkki\n) josta suomeksi käytetään termiä hiljaiset loparit. Termi on määritelty niin, että se tarkoittaa työn tekemistä niin, että suoritus on tarkalleen juuri se mitä on vaadittu. Tämä taas on markkinoitu meille jonkinlaisena alisuoriutumisena vaikka se tarkoittaa vain normaalia työntekoa.\nNyt ilmeisesti samasta koneistosta on putkahtanut uusi termi: quiet firing eli hiljaiset potkut (\nHesarin maksumuurilinkki\n). Hiljaiset loparit tarkoittavat työntekijän savustamista firmasta ulos estämällä tältä ammattitaidon kehittäminen, eteneminen uralla ja muilla tavoilla kiusaamalla.\nHiljaiset potkut ovat puhdasta kiusaa ja täysin epäasiallista kohtelua. Ilmiö ei ole uusi, firmasta ulos savustamiselle on vain keksitty pöhisevämpi termi. Jos työntekijän työsuorite ei miellytä, tulee työnantajan ottaa aihe kahden kesken puheeksi työntekijän kanssa rakentavassa hengessä ja pohtia yhdessä siitä mikä estää suoriutumisen ja miten siitä päästäisiin yhdessä yli eikä millään lapsellisella kiusanteolla.\nJos olette uusia työelämässä niin älkää langetko tällaisiin riistokapitalistisiin kusetuksiin. On täysin ok tehdä töissä juuri se mitä siellä kuuluu tehdä, tämähän on aivan normaalia. Palkkakin on neuvoteltu sen työtehtävän mukaan ja jos se normaali taso ylitetään niin pitää siitä silloin maksaakin enemmän. Ei ole mitään järkeä venyä äärimmilleen joidenkin katteettomien lupausten toivossa. Joustaa voi tietenkin kunhan se tapahtuu molempiin suuntiin. Kohteliasta on olla se joka joustaa ensin ja aika nopeasti se tulee ilmi, että toimiiko se molempiin suuntiin vai ei, ja joustamisen voi nopeasti lopettaa, jos se paljastuukin yksipuoliseksi ja resurssitappio jää pieneksi.\nJos koet töissä hiljaisia potkuja eli ulos savustamista niin ota se pikimmiten puheeksi luottamushenkilön ja mahdollisesti työsuojelun kanssa.\nPäivän vitutusannoksen tarjoili tänään Helsingin Sanomat.', a user said: 'Quiet quitting on siis jenkkifirmoista lähtöisin oleva termi jolla firmat kauhistelevat kun työntekijöillä ei ole mitään lojaliteettia firmoja kohtaan enää eikä niitä voi enää kiristää ylennyksillä tekemään ilmaista työtä.\nQuiet quittingia ei siis oikeasti ole olemassa, se on vain ulinaa että \"meiän paskafirma ei löydä ilmaisia työntekijöitä enää kun ihmiset voikin tehdä etänä kelle vaan joka kohtelee paremmin, help\".\nHesarin väännös tästä termistä ontuu pahasti, se on kahdesti kustu ja ilmeisen tahallisesti.'"
    ]
}