{
    "username": "Temporary_Second3290",
    "contributions": [
        "In response to 'That's a fallacy spread to keep us fighting with each other. I'm a Gen x dropout whose parents abandoned me at 16, worked the service industry for 25 years then worked in a mailroom, then reception, then a support Admin. I'm 53 and have no retirement, live paycheck to paycheck and never had kids bc I can't afford it. I'm a lifelong renter who has never owned a house, and the majority of my peers are in the same boat. Don't believe the hype.', a user said: '51 and yeah pretty much the same.'",
        "In response to 'Just turned 50 (f), left home at 17, lived with flatmates until I was 34, then I lived on my own in a tiny studio flat, quite often could not afford rent and food. Walked everywhere as I did not have a car (lived in London). Did not get married until I was 40, never wanted children. The boomers NEVER let us in to good jobs, we are the cynical generation for a reason, and where I work now the 70+ year olds are still gripping tightly to shit. Not that I want their jobs, have no interest in that, it looks fucking awful. I am good at what I do, do just enough to earn my wages and do what I enjoy the rest of the time. Don't go on vacations, don't waste money on stupid shit, enjoy my friends.', a user said: 'Left home at 19.  Lived with grandparents for a bit then moved in with boyfriend and got pregnant at 20.  Left after 13 years of domestic abuse.  For 13 years worked more than my fair share of dead end jobs sometimes 2 or 3 at the same time because he hardly ever worked.  And now almost 20 years later and another shitty long term relationship and finally landed a decent job as a bookkeeper.  Which after record breaking inflation it might as well be a welfare check.  All I can say is FML. And FTW!'",
        "In response to 'I am sorry that you went through all of that. I hope that you are able to find some space to heal. From one Gen x female to another, sending love..........', a user said: 'Thank you.  And right back to you.'",
        "In response to 'Yes, I lived with my Gram too! I feel your pain', a user said: 'I miss them.  I was young and naive and thought I had the world by the ass!\nI have to laugh at that saying.  I remember a conversation with my grandpa and he was telling me about the first job he had when he left home.  He worked on a farm and made ten bucks a month.  He laughed and said, \"I thought I had the world by the ass.\"'"
    ]
}