{
    "username": "thatGIANToutside",
    "contributions": [
        "In response to 'Thats what cracks me up. All these people going about wanting the govt to run shit, saying capitalism is horrible, america is horrible etc etc, holding their hands out thinking the govt will “take care of them” once their freedoms gone, but fail to realize most of the big bad evil “capitalist” companies are owned by their precious commies. Who squeeze the life from them, because thats, well, what commies DO.', a user said: 'Nah capitalism isn't horrible but people are. Most of the people that run these companies these days have forgotten what it was like or never experienced what it was like to struggle. To be broke. To be pushed to your breaking point every single day. Gone are the days of starting at the bottom and working your way up to the ladder to ceo or owner. Most of the higher ups at companies these days are college educated and come from money so they never struggled or made an honest dollar in their life. The easiest way to turn it around is to walk away but people won't do that. And that fact is exactly why they keep taking advantage of their workers. They know even if people leave more will be lined up to tale the position. I quit walmart a year ago for a new company. They did me good at first. Made management within 30 days. Then all progress stopped and I found out that I was making $4 an hour less than everyone else in the same position. When I asked for the pay raise I was told district manager wouldn't allow it. I asked him personally. He told me that if I didn't like the pay I was free to go to another company. Put in apps and my two week notice and found a job making $4 an hour more and I'm starting at the bottom again so way more room for growth. Now he wants to offer me what I asked for because I'm the best worker they got. Even offered me more than the new company. When I explained that once I make it to the same position at the new company I would be making $4 an hour more than the new offer all talks stopped again. I have a week left and I fully expect a new offer again. They already offered me my own store 3 months after starting here. If you are honestly willing to walk away and they believe it they will fight to keep you if you are a good worker but you have to show them you seriously don't need them.'",
        "In response to 'Capitalism as a system encourages and rewards people for being terrible. Which is why it needs to be waaaay more restricted than it is right now.', a user said: 'Restrictions doesn't serve the purpose you think though. The problem with putting restrictions on capitalism is that a company is only going to do the bare minimum that it has to in order to stay profitable. Meanwhile of all the employees walk out citing low pay of course the company will increase pay to bring people back. That's not even taking into account that with every restriction aka laws there are loopholes. These loopholes companies pay a great deal of money to lobbyist to put into the laws. They do the same thing with taxes. The only people these things ever hurt are those that can't afford high paid accountants to take advantage of them for them. Mom and pop stores. Small business is the life blood of America. They almost always pay better than the bigger companies because they know their employees are a vital part of their company.'"
    ]
}