{
    "username": "ThatVoiceDude",
    "contributions": [
        "In response to 'Nothing.\nThe world we live in has normalised the idea that workplaces should expect employees to \"go the extra mile\", i.e. do work beyond what's described in their contract without any form of compensation for that extra work.\nUpon recognising this phenomenon, there are two responses.\nThere are those who believe that not complying with this normalised concept is a \"quiet quitting\". Unsurprisingly the people of this opinion are typically managers/supervisors of min. wage workplaces.\nThen there are the rest of us who view this normalised concept as a form of passive exploitation.\nPersonally I'm of the opinion that it's exploitative because there's often subtext to requests to do work beyond your contract that suggests you will inevitably be compensated in the form of promotion when in fact the opposite is true.\nThe ones who work hardest, more often than not, miss out on promotions because they're more valuable on their hands and knees scrubbing than they are supervising the rest of the staff.', a user said: '“Go the extra mile” bruh a mile is a long way for my fat ass to go, they can run that shit themselves lol'",
        "In response to 'Original Post: What is the difference between \"quiet quitting\" and working exactly/only according to your contract? [External Link]: /r/TooAfraidToAsk/comments/yr6tin/what_is_the_difference_between_quiet_quitting_and/', a user said: 'I’m a GM at a Japanese restaurant in Texas and I work 90-100 hours a week. I start work at 9:45am and rarely leave before midnight. USD $4500/month salary, no overtime, no bonuses. I didn’t get my first day off until my 9th week. The owner regularly calls me at odd hours (read: 3am) for work conversations so my sleep is perpetually fucked. 2 energy drinks a day, RIP my liver.\nI was assured my salary would be equivalent to $18/hour. He told me upfront that he doesn’t pay overtime because he thinks it’s stupid. Kind of a shitty deal but it’s the best I had available to me at the time and I didn’t have the savings to keep looking for something better.\nNow, I get\nscheduled\nfor 81.5 hours a week, but my actual hours typically average to about 95. That makes my effective pay rate just $11.84/hr.\nBut wait, there’s more! Just for fun, let’s include overtime. 95 hours = 55 hours of overtime, and my effective pay comes down to about $9.18/hr. If I actually got paid what I’m legally required to be, I’d be making around $6750/month.\nSide note: before you say, “You’re a manager, that means you’re an executive so you’re exempt from overtime” know that making food and doing manual labor is easily 90% or more of my daily work. That means my managerial duties are not my\nprimary\nduties, and that is a key distinction. Any law office will tell you that simply having a title doesn’t circumvent FLSA requirements.\nThe owner makes a lot of promises. He claims he’s training me to be an owner some day, that I’ll be able to buy into new restaurants when he opens them, that eventually I can have more time off and even come in as little as I want once we’ve hired and trained the perfect team, and he\nconstantly\ninsists “I want you to trust me.” I’ve been in the workforce for 16 years, I don’t trust anything that’s not in writing. I want to look for a different job but I spend every waking moment at work, there’s just no time.\nIf I started working my wage, this place would have to either shut down or hire some extra people. Can’t exactly threaten to quit though since there’s always someone else willing to take the job.\nOn the plus side, I spend so much time carrying heavy tubs and pots that I’ve lost a ton of weight and my arms look pretty good now.'"
    ]
}