{
    "username": "The_Chorizo_Bandit",
    "contributions": [
        "In response to 'Closing your laptop at 5 p.m. Doing only your assigned tasks. Spending more time with family. These are just some of the common examples used to define the latest workplace trend of \"quiet quitting.\"\nSome experts say it's a misnomer and should really be defined as carving out time to take care of yourself.\nI suspect a lot of us do this from time to time. Pick a slow week and just put in your 40 and turn work off in the evenings and weekends. Seems healthy to me.', a user said: 'Pretty much every office job I ever had I spent more time and energy trying to look busy than actually being busy, to the point where it had become almost an art form - and that is way more tiring! Some jobs barely had enough work for me to do half a day, so I’d just end up surfing the internet for the rest of the day. Not only does that become mind numbingly boring, but it is also soul destroying to know how many hours, days and weeks of your life you’re wasting, just so you can make a few pennies.'",
        "In response to 'What a terrible term. How about it’s called working hard and living up to your contract, then going home?\nThe French have this down perfectly and actually regulate when the worker is expected to view emails.', a user said: 'A better phrase is simply “fulfilling the terms of your contract.” An employment contract is just a deal between two parties - one side offers services in exchange for money. You wouldn’t go and buy a car from a dealership and then get home to find that the sales exec who sold you the car is there washing your dishes. That would be ridiculous, so why should anyone be expected to do more than was agreed in the contract in this situation too?'",
        "In response to 'Aren’t these companies the first ones out here preaching work life balance?? Multiple companies I’ve worked for always harped on this shit… and now that employees are actually creating work life balance some corporate shill has come up with “quiet quitting” to make employees look bad… this is some corporate propaganda bullshit.', a user said: 'BuT wE’rE a FaMiLy!!1!'",
        "In response to 'Original Post: What is 'quiet quitting,' and how it may be a misnomer for setting boundaries at work [External Link]: https://www.npr.org/2022/08/19/1117753535/quiet-quitting-work-tiktok', a user said: 'This comment section shows two things:\n1) Most people don’t bother to read the article before commenting.\n2) Most people don’t know what the word ‘misnomer’ means.'"
    ]
}