{
    "username": "the-A-team1",
    "contributions": [
        "In response to 'Original Post: I realized I'm in the \"quiet quitting\" phase of my relationship. I watched a YouTube video last night called \"Are Women Quit Quitting Their Marriages?\" by Frankly. It's essentially a curated compilation of TikToks of women talking about themselves and others quiet quitting their relationships, the signs, and why.\nIt was very eye-opening because it made me realize that's the stage of my relationship I'm in. I'm tired of the conversations that never result in change, I'm tired of the defensiveness when bringing up a concern, I'm tired of the dismissiveness when trying to help, and tired of feeling required to react a certain way to things he says. The straw that broke the camel's back was a text conversation I had with my boyfriend a few weeks back, which I previously posted about if anyone wants to go read it. It really solidified how little he cares about my responsibilities and thinks his wants should supercede them and will never show the slightest interest in anything I care about.\nA lot of the TikToks in the video mention how men are usually \"blindsided\" when their partners just up and leave, when the reality is they didn't care to notice the signs since their partner's unhappiness wasn't directly affecting them. I've been emotionally and physically pulling back from my own relationship by being less physically and emotionally present: Not calling him in my free time, not going to his place as often, choosing to hang out with friends and family instead, not engaging with his playful banter (which I find annoying), slowly moving anything of mine out of his apartment, giving minimal effort in the conversations we do have, etc. I'm basically treating him like a friend at this point. And not even a close one.\nA lot of people will probably read this and ask \"Why not just break up?\" Well, the comments of the video explained that perfectly! Quiet quitting the relationship is an exit strategy for women so they can physically, emotionally, financially etc. prepare for the end of the relationship, then leave when it's safe and will have minimal impact on them. I feel if I broke up with him today, I would feel nothing. The only thing I would miss is our mutual friend who I met through him, and the Palworld base I built in a server he owns.\nThe relationship is already dead as far as I'm concerned. I just need to pull the trigger and make it official.', a user said: 'It sounds like you've been doing some deep reflection on your relationship, and that's a big step in itself. Sometimes we find ourselves in that \"quiet quitting\" phase, where we start to emotionally distance ourselves before making a final decision.\nThat video you watched seems to have struck a chord with you, shedding light on the signs and feelings you've been experiencing. It's tough when conversations don't lead to change, and when you feel like your concerns aren't being heard or valued.\nAs they say, actions speak louder than words. Your actions, like pulling back emotionally and physically, are speaking volumes about where you're at in this relationship. It's like you're preparing yourself for what's to come, taking those steps to protect yourself and your well-being.\nIt's understandable why you might be hesitant to pull the trigger on ending things right away. Taking the time to prepare yourself mentally, emotionally, and even practically can be a way to ensure a smoother transition when the time comes.\nRemember, it's okay to prioritize your own happiness and well-being. If the relationship feels like it's run its course and you're no longer feeling fulfilled, it might be time to have that honest conversation or make that decision for yourself.\nTake your time, trust your instincts, and know that you deserve to be in a relationship where you feel valued and respected. You've got this.'"
    ]
}