{
    "username": "TheBattyWitch",
    "contributions": [
        "In response to 'Original Post: what's up with quiet quitting? I've heard this term \"quiet quitting\" over the last year, indicating that people doing their jobs are somehow not doing enough. If the minimum requirement isn't enough, shouldn't the minimum be reset?  I feel like I'm misunderstanding the meaning of this term.\nhttps://www.investopedia.com/what-is-quiet-quitting-6743910', a user said: 'Answer: Like the top comment says, it's propaganda.\nI'm my grandparents days, working your butt off for a company got you benefits. Better jobs, promotion, better pay, better retirement, etc. So people busted their ass to be the best because being the best wear actually rewarded, it meant something.\nIt doesn't mean anything now.\nCompanies don't encourage longevity, why would they when longevity means they have to pay you for your experience when they can train someone with half your time and cut costs?\nI'm a nurse, I've seen it in my field too. I was overlooked for 4 separate promotions for people that I had trained. People with 8 months-2 years experience for my, at the time, 13 years experience. People that stayed maybe a year or two before leaving, only to get overlooked for someone else with bare minimum experience. Why pay someone with over a decade of experience to do a job that they\nthink\nsomeone with a year can handle?\nI watched people barely going above the norm getting 5 star ratings and reviews while I voluntarily did all of these extra things, extra classes, extra job duties, to get a \"satisfactory\".\nSo I stopped going above and beyond. I stopped doing all these extra things. Stopped volunteering to be a team lead or educator for all these new things. They weren't paying me to do it, and I wasn't being rewarded work so much as a \"thanks a bunch\", so why continue to do it while others did the minimum and got the same or better reviews than I did?\nI go to work. I do my job. I go home.\nThey want you to work harder for less, and want to micromanage you into doing all of these things that aren't just part of the job, because people are realizing that going the extra mile just wears out your shoes.'"
    ]
}