{
    "username": "theflower10",
    "contributions": [
        "In response to 'Original Post: 'They're in a state of fear': CEOs are worried about quiet quitting [External Link]: https://www.bnnbloomberg.ca/they-re-in-a-state-of-fear-ceos-are-worried-about-quiet-quitting-1.1822866', a user said: 'Let me see now, why could this be? Having worked for a large multi-national form for 20+ years lets see if I can put 2 and 2 together for these poor suffering CEOs.\nIn my industry for the last 20 years, its been layoff after layoff. First they cut the fat. Then they started to hack off pieces of muscle and then finally, pre-covid they were looking into how to get rid of the bone marrow. To go along with this was the constant year after year of minimal to no raise, all the while being fed a line of bullshit about working hard to perform better and get rewarded. Overtime pay? Gone. Bonuses? Gone unless you're an exec. Benefits? Cut to the bone. Pensions? Bye-bye Defined benefit plans, here's a couple thousand in RRSPs each year now fuck off. Longer work weeks to go along with no OT pay.\nThen Covid rolled around. People started examining their lives. Asking if they really wanted to keep doing what they're doing. Many quit, retired early or as the CEO's called it, started to quietly quit. To make matters worse, when these same companies started run short of people, especially in IT where I work, they started handed out money like they had their own printing press. Meanwhile they turned to the regs who hung on despite all the bull shit and shrugged their shoulders. This is why people are quitting, quiet quitting, fucking the dog, goldbricking whatever you want to call it, and I say God love ya. I've moved on for more money elsewhere but if you think the best way to stick it to these lecherous, money grubbing, selfish CEOs is by sitting on yer arse surfing reddit all day - go for it.\nI can't imagine any legitimate leader not seeing the obvious and wanting to do something about it other than whine and bitch about it. Fuck 'em.'"
    ]
}