{
    "username": "Therenegadegamer",
    "contributions": [
        "Found out this is a real quote today (Quiet quitting is just doing your job to it's minimum requirements and not putting in extra effort or hours) [External Link]: https://i.redd.it/2otpsc4g3nrb1.jpg",
        "In response to 'The greatest lie told was that Burning yourself out over a job would make you rich and successful', a user said: 'I had a work ethic at first until I realized having one just gets you exploited more and you're given fuck all in return except for hollow thanks'",
        "In response to 'Worked at a gas station for four years. I worked afternoons and if the midnight shifter no call no showed, I’d have to stay over and work 16hrs. I’d do this many times a week because we couldn’t keep midnight shifters. And at this company if you no call no show then the company takes that as your resignation. I’d call my manager, who was supposed to come in at least early, wouldn’t come in and people on first would be “drunk already” so they couldn’t come in. I’d see my manager twice. What did I get? NOTHING. A sympathetic look and a thanks. I was a team leader too. FUCK YOU SUNRISE AND TOM FOSTER.', a user said: 'Sounds like a similar experience with Circle K with a manager tried to guilt trip me into going in on my day off because there were call offs and if I didn't then she'd have the person who already worked a double work a triple shift 24 hours straight I quit that hellhole and they've been struggling since'",
        "In response to 'It’s kind of ironic. Guy I work with now is on probation for robing a circle k 😂', a user said: 'Tell him He's a hero lmfao'",
        "In response to 'I will 😂 were you in Indian by chance?', a user said: 'Nope lol I'm white'",
        "In response to '“Doing your job to its minimum requirements”\nSo doing your job?', a user said: 'Yeah and for some reason it's now a \"big problem\"'",
        "In response to 'Nobody wants to work anymore... FOR YOU\nAnd it should be called\n\"acting my wage\"\ninstead', a user said: 'Hard agree I thought Quiet quitting was just no notice quitting'",
        "In response to 'The worse than covid part doesn't make sense', a user said: 'It's a real quote the people at the top are thar delusional and self centered'",
        "In response to 'https://m.youtube.com/watch?v=Fy50nUYyTKM&pp=ygUddGhlIHNpbXBzb25zIGN1dCBldmVyeSBjb3JuZXI%3D', a user said: 'Lol that's gold'",
        "In response to 'Original Post: Found out this is a real quote today (Quiet quitting is just doing your job to it's minimum requirements and not putting in extra effort or hours) [External Link]: https://i.redd.it/2otpsc4g3nrb1.jpg', a user said: 'Clip for context'",
        "In response to 'How does this old fart expect anyone to work longer than the time they get paid? If the schedule is 9-5 then you work from 9-5 and leave asap. Not even working at 5:01 anymore', a user said: 'Idk I just find the clip funny that someone could be that deluded but also scary since people like that old fart are the ones who have a stranglehold over the working class'",
        "In response to 'Quiet quitting is kind of a jerk move to your coworkers though (source: I now realize some people in my job may be “quiet quitters”)', a user said: 'There's a difference between Quiet quitting and being lazy if you quit quit it shouldn't affect your co workers because you're still meeting the minimum requirements of your job'"
    ]
}