{
    "username": "TheThoughtmaker",
    "contributions": [
        "In response to 'I have heard of and used take 5. But take 10? Like for our of combat delayed checks maybe?', a user said: '3e balanced DCs around DC10 being what an average completely untrained IRL human can do reliably when they're not rushed or distracted.\nAs people go about their day-to-day business, they're taking 10 on everything, from sitting up in bed to walking down the street to perceiving the people 5ft from them. Everything is a check, even if the DC is -20 (listen to hear an adjacent lion roar, or the sounds of an active battle around you) or 160 (diplomacy to use 25 words or less to convert someone actively hostile toward you into a frothing fanatic who will throw themselves in front of a dragon if they think it'll help you).\nRolling is the outlier. If you attempt to craft a really fancy custom chair unlike your usual orders, you're gonna have to risk botching it to do abnormally good work. If you're trying to pick a lock while the room is flooding and everyone's panicking, there's a good chance you'll do a lot worse than you would if the task has your full attention.\nAfter 5e copypasted a lot of 3e, they reduced the scaling in certain ways. Instead of good saves being 2+lv/2 (including lv1), they're 2+lv/4 (not including lv1). Instead of the skill cap/Expertise being 4+lv (not including lv1), it's 4+lv/2 (not including lv1). And for DCs, everything above 10 was halved -- e.g. DC20 (10+10) became DC15 (10+5) -- which matches the same-base half-scaling of the things you roll against DCs. (Note: Martial attack bonus was lowered to 1/4 instead of 1/2, while AC was largely unchanged outside huge+ beasties.)\nAll this to say that DC10 is still set at what a normal person should be able to take10 on to pass without incident, that 5e is balanced around the take10 mechanic.\nWotC has been bulldozing Chesterton's Fences for something like 17 years now.'",
        "In response to 'That's wrong DC 10 would be what a average person would only succeed at 55% of the time. It would be a difficult thing.\nTake 5 would describe what you are saying.', a user said: 'In what way is DC5 what I described?\nI gave a history lesson, not an opinion.'",
        "In response to 'A 55% chance of success is in no way a reliable result.\nDC 5 would be a 75% of success which is quite reliable.', a user said: 'Which is why take10 is a vital rule for D&D, a system balanced around DC10 being a normal thing people can do 100% of the time without fail (except when heavily distracted, such as while people are trying to kill them).'",
        "In response to 'That's not how it's balanced at all.....\nYour an average human can you correctly call a coin flip 100% of the time?\nIt's balanced around you succeeding 55% of the time. That's why DCs go up as you level and your stats increase.\nFailure makes you use resources and end of the day it's a war simulator with resource management.', a user said: '3e made a system where DC10 is a 100% success rate. These are normal, everyday things that average IRL people can do under normal conditions without fail.\n5e largely copypasted that system, including DC10 being normal everyday things that average IRL people can do under normal conditions without fail. But they did NOT copypaste the rule that made DC10 a 100% success rate.\nThe fact that DC10 is a 55% success rate, and that normal everyday things that average IRL people can do under normal conditions without fail should not have a 45% chance of failure, is something we both agree on. What you fail to grasp is that 5e is, in fact, that stupid.'"
    ]
}