{
    "username": "thetasigma_1355",
    "contributions": [
        "In response to 'The problem is broadly that it just doesn't work for every company.  10% of the companies in this trial abandoned it being unable to make it work.  30% are fully switched over and will be keeping it long term.  Roughly the remaining 60% haven't fully changed over and aren't finding any efficiency gains yet but are going to continue to try and make it work.\nLike this is companies over one year.  And only 3 out of 10 of them were able to make it work.', a user said: 'That doesn't support the narrative though...\nThe unfortunate reality is that for it to be doable for most companies it would require other companies to also be doing it because responding to customer needs is not only good business, it's likely a contractual requirement.\nI say this coming from a large public company which offers permanent \"flex Fridays\". If you have your work in a good spot and no meetings you can sign off early. And most people follow it. Even if they are working they don't schedule meetings so others can take it. I don't think I've had a single friday afternoon meeting (after 1pm for my time zone) in at least the last 6 months and regularly shut down myself between 1-2pm.'",
        "In response to 'No one said that they have to give everyone the SAME 4 days.  Your argument is a non-starter.  You're asserting that the company would only be open/responsive 4 days week.  A company could easily distribute the days off for individual employees across all 5 weekdays.\nThe only thing that would require would be potentially hiring more 4 days employees to fill in the 20% attendance drop.', a user said: 'Yes… 20% more employees is a non-starter for any economic plan. The US is at 3.4% unemployment and you think forcing companies to hire 20% more people is going to be reasonable? It doesn’t even make sense just on basic math.'",
        "In response to 'That's why i said attendance, not productivity.\nThe likely need to hire more people is going to be significantly less than 20%.\nIf I'm managing a team of 5 people for example, having one of them off every day and everyone else covering the communication needs probably isn't going to require another hire.  Depending on the workload redisribution you might need to hire only 1 extra worker. Each case is obviously unique, but in this hypothetical growing a team from 6 people (including me) to 7 people is a 15% increase.  The more people on the team, the smaller that number becomes and the need for more employees lessens.\n​\nEven at 3.4% unemployment that's still hundreds of thousands of people looking for jobs.', a user said: 'If you only need 4 people per day, why do you have 5?\nAnd yes… you literally just effectively described why a 20% increase in employment would be required. I don’t know what else to say besides you made my point perfectly.\nYou seem to be lost on your specific example of a small team and the math not being exactly 20% to prove it wouldn’t be a 20% increase. What if you had a team of 12? You would need 3 more people and then it’d be 25%!\nDon’t think in terms of headcount, think in terms of hours. If you cut available hours by 20%, you will need to fill those hours by others if you are still going to require the same level of availability.\nAnd if you don’t need to fill those hours, it means you are currently over staffed. Not necessarily a bad thing, if often happens on small teams where you badly need 30 extra hours a week so hiring a FTE makes sense.'",
        "In response to 'What about 6 hour work days? It would be a 30 hour work week. There could be four shifts for a work day. You get two extra hours a day for the same pay. Our societies are already set up for a five day work week. This makes more sense to me. For a four day work week, which day to you take off? Monday? Friday? Maybe Wednesday and split up the week?', a user said: 'This would be so much more consumable to the public as it aligns with school schedules. And for the jobs that require 24/7, it still divides easily in to 4 shifts, though I can understand those jobs still needing to have unique hours to stay staffed.'"
    ]
}