{
    "username": "TheUnfreeMan",
    "contributions": [
        "In response to 'Original Post: How many of you have \"quiet quit\" and when did it start for you? I got to say for me I quiet quit my last job 5-6 years into it after realizing I didn't have a future with that company, but I never left because I was at least getting paid and now have a decent savings account because of it. I legit started my new job early this year and I've already quiet quitted. I hardly do the bare minimum since I gave them a whole summer of hard work and not a single fucking praise. Or even any kind of \"hey keep it up you've been doing an awesome job\". The moment I make a mistake I feel like it destroys everything i worked hard for so what's the point anymore? I'm just going to keep working enough so I don't get fired, but if I do I doubt I'll be upset over it. It also just seems the way 2023 has went if the economy and housing market continues to stay awful next year I can already see people quiet quitting for 2024 and it hasn't even started yet!', a user said: 'I worked at a Walgreens.  At first I busted my ass because I wanted more hours, then when I had the hours I kept busting my ass because I took pride in my work making the store successful.\nOne day, there was an all-hands meeting for all non-pharmacy staff.  Management gave what they thought was a motivating speech.  Thing is, in that speech, they included the fact that on a good month, the store was costing the company about $15k more than the store brought in.\nAfter that, the only times I busted my ass were for the regulars that I was on a first-name basis with, and the other customers that treated me like a human being.  Otherwise, it was only what was required'",
        "In response to 'What was your reasoning based on the speech? Not picking at you just curious where your head was at. Was it like, “oh geeze I do all this work and we lose money? Not worth it.”', a user said: 'Kinda.  Even during the busiest time of year, we were losing money, and it just clicked that the store was only there because there was a CVS about 100 yards away, kinda like it was just there to say \"Look, see?  We exist too!\"'"
    ]
}