{
    "username": "ThinRefrigerator114",
    "contributions": [
        "In response to 'This makes me laugh…always always head down on phone…is that allowed?', a user said: 'No'",
        "In response to '....stop donating!', a user said: 'I stopped donating when they started building their multimedia movie building…..or should I say village. The place will be huge. Ent be done for another 3 years. The end is near but I guess we have at least another 3 years.'",
        "In response to 'I wholeheartedly agree to that last statement. My whole congregation seems so empty, with almost everyone on zoom. The contributions amounted to 45$ last month.', a user said: 'Probably why they want everyone to return. If you’re not there one is less likely to donate.'",
        "In response to 'That's right. Just tell your service group overseer you witnessed, but just a couple of minutes.', a user said: 'Actually they tried telling me that. They wanted me to put down time. I told them 0, nothing, zip. He then said he wanted to put me down for 15 minutes. I said no, I had zero.'",
        "In response to 'I think you may be right. As an example, the circuit assembly for my old congregation was just last weekend. I didn’t attend but my wife did. She said the amount of guys with beards was abnormally high. People just don’t care anymore. And if everyone just starts growing beards because they don’t care, the masses can’t be stopped and eventually it will become the norm. I realize this is a relatively insignificant example but it proves the point on a small scale.\nI’ve said before that pimos may not realize how much power they have collectively. If they all just stopped going at the same time, it would be like kicking the leg out from under a chair. The chair may not fall immediately but it’s very unstable.', a user said: 'I can’t grow a beard but every book or article ever published has Jesus and his disciples with beards. I wonder will Jesus comes back if they will take away his privileges for having a beard.'",
        "In response to 'What I don’t understand is that they say they are growing. But in my area they are shutting down and combining kingdom halls, because congregations are so small.', a user said: 'They not growing. Now they are encouraging kids to become un baptized publishers. I think they’re doing that to show there numbers are still growing. Most of the hall I attended where all old and dying off. If we averaged a new person a year that would be a lot.'"
    ]
}