{
    "username": "Thinks_Like_A_Man",
    "contributions": [
        "In response to 'I didn’t quiet quit.  After multiple awards without a pay increase that at least met inflation, I decided to only “meet expectations.”\nThen I quit to give myself a promotion.\nEdit: This was at Apple btw.', a user said: 'I have a remote job where I literally work maybe ten minutes an hour. It’s fucking glorious. I don’t live for weekends. I don’t dread going into work.\nThis has been the best job of my life and not because I am happy and fulfilled, but because there is zero stress.'",
        "In response to 'I have a remote job where I literally work maybe ten minutes an hour. It’s fucking glorious. I don’t live for weekends. I don’t dread going into work.\nThis has been the best job of my life and not because I am happy and fulfilled, but because there is zero stress.', a user said: 'I structured my workdays to do exercise and chores\nonly\nduring work hours. Off hours are for relaxing and hobbies.\nMy previous two years was a similar job that gave me a lot of downtime. I am sort of used to it.'",
        "In response to 'They can probably find out about your employment history in the background check so I’m not sure if it would work I’m afraid', a user said: 'Not if you set up an LLC and freelance under it. I get an extra $500 a week from my freelance gig.'",
        "In response to 'Same. My current job is practically permanent WFH (tbf I work in tech, there\nis\nno reason we need to be at the office every day). The pay's not great, but it's not bad either, I've shopped around.\nShit, even if you doubled my pay I would seriously doubt I'd be willing to go back to commuting everyday. Not to mention my office isn't even that far, a new job would almost certainly be much further away.', a user said: 'It would take a $7 an hour raise to get me to consider going to another WFH job and doubtful you could get me in an office for less than triple the pay.'",
        "In response to 'I've automated my full-time position down to about 15h/week tops. many weeks are fewer hours than that...\nI sleep a lot now.', a user said: 'I take naps at lunch and cook and eat while I am working.'",
        "In response to 'Get another WFH job part time to supplement your income', a user said: 'I have one.'",
        "In response to 'i want at least one remote job, what do you do and how are you doing multi jobs of it?  care to spread a little wisdom?  i am struggling to survive over here:(', a user said: 'I do freelance stuff on the side. I got contacted by a company that hired me to work about 10 hours a week for $500. So I double dip on my job.'",
        "In response to 'This has been my husband since March 2020. In a senior level IT position, usually works an hour or so a day, some days has meetings so that take sup more time. Occasionally he's busier than usual but still nothing like it would be in the office. Best part is we had a kid in Oct and he hasn't had to miss anything. He gets to hang out with him during the day, goes to every doctor visit, I can sleep in a bit if his morning is slow, it's glorious.', a user said: 'Ok so here is what I think. Most jobs don’t require you grind for 8 hours 5 days a week. If left to do the actual job, 28 hours would suffice but corporations are more about control and making their staff miserable.'",
        "In response to 'Tell us your secret.', a user said: 'Find a work from home job. This is my third one and I have yet to actually work a full 8 hours.'",
        "In response to 'I do work from home. I work every second of it taking calls back to back. If you had to measure my time talking to people it would be about 7.5/8 hours.', a user said: 'I don’t take jobs that require talking to customers on the phone. Does your job have an email support area?'"
    ]
}