{
    "username": "thoffman2018",
    "contributions": [
        "In response to 'Original Post: I think my remote team mate is quiet quitting And it's ticking me off. Need advice if I should say something?\nMy team is fully remote,  spread  across the US. Our individual and team metrics are tracked by the amount of tickets we process on a weekly basis. This is a FULL time job and I've found that a member of our team is only logging about 4 hours a day - if that! Meanwhile, the rest of the team is putting in 9 hr days just to keep up with the volume.  We've also had to log in and work the last two Saturdays just to clear the backlog.  If this person would just work a normal day,  it would lighten the load on each of us. Our manager hasn't seemed to notice that this  person's \"numbers\" are half of what the other team members are producing. Do I speak up or keep my trap shut,  silently seething all day?\n**Thank you everyone for your input! I'm not going to do my managers job for them,  if they don't care,  I won't care either.  I'll hit my targets and focus on my career advancement in 2025.', a user said: 'If they're within their schedule and meeting their hourly goals, then who cares.\nIf they're not, well, that's an issue the manager should be involved in.\nSounds like there's plenty of work regardless. You're getting your 40 plus some in, so what's the problem?\nIn short, it's not your role. It's best to stay out.\nYou do your job, they do theirs.\nIf there is something missing, the manager will or should figure it out. It's not on you.'",
        "In response to 'Can you see your stats, like in Zendesk? Do you have SLAs? If they are doing the same amount of work as the rest of the team just in 1/2 the time don't hate the player, hate the game.', a user said: 'Exactly. If there is a quota to hit and they hit it in half the time and there are no errors or rework, it's not a them problem. It's a management problem. Saying something may fix the problem, but then it will definitely cause issues. Because from a managerial standpoint, if someone came to me and explained the situation, then the only real reasonable solution would be to raise the quota or that even if your quota is met you have to stay online until all work for the day is done.\nEither way, it's going to cause resentment towards you it's a losing situation. If you attempt to address it, then it will most likely backfire on you. If management doesn't see it as a problem, then either it's not a problem or it's a problem they won't fix. So it comes back to how you want to handle it. Which is either reframe your outlook, play the game the same, or look elsewhere for employment.'",
        "In response to 'Yes,  can see stats, we have SLA's , and all activity within our specific platform is visible if you know where to look.  Their production has significantly decreased,  only logging about half the tickets that they used to and less than anyone else on the team.  They aren't even hitting the minimum daily target.', a user said: 'There’s easily a number of reasons or justifications why. \nIf you can do your 8 and logoff, then do it. All you’ll be doing is your bosses job and there is zero upside. You got to look out for you. If the boss isn’t noticing, it’s time to get out. Because they don’t want to address anything, because they don’t want  to do anything. Now they’ll have to and they’ll be more upset about the situation because of you, than the other person.'"
    ]
}