{
    "username": "throwitawaypo",
    "contributions": [
        "In response to 'Original Post: I think my remote team mate is quiet quitting And it's ticking me off. Need advice if I should say something?\nMy team is fully remote,  spread  across the US. Our individual and team metrics are tracked by the amount of tickets we process on a weekly basis. This is a FULL time job and I've found that a member of our team is only logging about 4 hours a day - if that! Meanwhile, the rest of the team is putting in 9 hr days just to keep up with the volume.  We've also had to log in and work the last two Saturdays just to clear the backlog.  If this person would just work a normal day,  it would lighten the load on each of us. Our manager hasn't seemed to notice that this  person's \"numbers\" are half of what the other team members are producing. Do I speak up or keep my trap shut,  silently seething all day?\n**Thank you everyone for your input! I'm not going to do my managers job for them,  if they don't care,  I won't care either.  I'll hit my targets and focus on my career advancement in 2025.', a user said: 'Stay in your lane. Do you work day. Work OT if you’re paid for it. If you’re not, they can’t make you.\nThrowing your coworker under the bus isn’t the way to approach this. It’s your managers job to work out who is performing, and for all you know they are fully aware and putting appropriate things in place to address it.\nYou also don’t know what your coworker is going through personally. Is this new for them or have they been doing ‘half the work’ since they started? You say quiet quitting, so I assume this person has previously done their job fine and all of a sudden has dropped efficiency for a period of time… now ok you might be right and they’re slacking off. You might also not be aware that person could be dealing with personal concerns with their health, family, whatever that’s causing a dip in their ability to do their duty to their full potential and it’s none of your business. If that’s the case the manager is likely aware.\nFocus on your own work and just log off on time. If the team performance drops overall the manager will surely step in.'",
        "In response to 'Thank you for that insight. Yes,  this person's performance has dropped significantly in the last month.  They used to be a top performer.\nI'll keep my mouth shut and let the numbers do the talking.', a user said: 'I completely get your frustration with the situation, but yeah I think it will only reflect poorly on you if you put in a complaint about this person without knowing all the details. Also depending on your managers ego and your relationship with them, they might feel you’re overstepping and questioning their management (I’ve had some toxic bosses in corporate who 100% would take something like this out on me if I raised it - sadly).  It’s tricky to approach for sure.\nTry to remember work is just work, deadlines and metrics are made up, and no one dies if you miss them. Hope the workload starts to lessen!'"
    ]
}