{
    "username": "ThrowAwayAcct0000",
    "contributions": [
        "In response to 'I was a nurse at a doctor’s office, and we had a routine of things to do as we walked in the door (open the patient rooms, checking the gloves/soap/etc) and then sign in. They were these old school doctors and wanted things done in a specific way. Well, they used to get pissed off that I’d sign in to my computer at 8:10 because it was supposed to be 8:00, but they also were adamant that the rooms were opened first. Ok, so I’ll come in for 7:45 and start getting paid from that point or leave 15 minutes early to make up for it? No. I was told people were supposed to come in 15 minutes early, and coming in at 8 meant I was late because I’d be signing in at 8:10. Opening patient rooms “wasn’t really work because I was walking by them anyway”  so it shouldn’t take 10-15 minutes (except that I always had to replenish gloves or sanitizer or whatever, I wasn’t just literally opening doors) That was bullshit, so I complained that they were asking me to work without pay, and everyone acted like I was being ridiculous because it was “just 15 minutes” but the worst is that they’d tell me that my co-worker was so great, she gets there a half hour early and works through lunch!!!! She’d get there at 7:30, sign in, make a bagel and coffee, and read the paper. She wasn’t working! Who cares when she got there to eat breakfast? She’d do the same thing at lunch. Eat at her desk with a bunch of charts stacked up near her and maybe enter one or two over the half hour at the most? I bet she charged for that extra hour per day. Meanwhile, number-wise, I typically entered twice the amount of charts each day just doing it in between patients. But that didn’t matter, she came in early and worked through lunch. I ended up leaving when I heard through the grapevine that I was about to be fired for being consistently late (even though I was always in my first patient room by 8!!!!) even though It killed me to let them get away with it on principle. This was 15 years ago and I still get annoyed thinking about it.', a user said: 'We might have possibly worked for the same person.'"
    ]
}