{
    "username": "thrOEaway_",
    "contributions": [
        "In response to 'Original Post: You’ve Heard of Quiet Quitting. Now Companies Are Quiet Cutting Layoffs are down, but employers are still finding ways to cut jobs -  Is this normal or economy tanking? More problems expected in late 2023 or 2024?\nWorkers are waking up to emails and team-meeting requests with a jarring message: They aren’t fired but their jobs are gone.\nPeople on the receiving end of these memos describe running through a range of emotions, from relief that they’re still employed to a sense of dread that their bosses secretly want them to leave.\nhttps://archive.ph/cYXyk\nhttps://www.wsj.com/lifestyle/careers/youve-heard-of-quiet-quitting-now-companies-are-quiet-cutting-ba2c326d', a user said: 'Yeah, no OE here but my company is quiet cutting right now (allegedly close to 2k jobs in the past month with more to come in the coming weeks/months).\nNational company, strategically laying off in waves as to not trigger a WARN violation. Letting FTEs go without severance, but telling them they have until x date to find another job within the company (all while making sure their soon-to-be previous duties are handled by someone else) and they have to sign an NDA to make it to that date.\nNot trying to be anti-work, but it's a fucking dirty game.'",
        "In response to 'Eliminating jobs solely for the illusion of an increase in profitability is pretty anti-work IMO', a user said: 'I'm trying not to be the guy who lands on \"fuck corporations\" , \"worker bee GOOD, company BAD\" ... But it's getting more and more difficult to not land there.'",
        "In response to 'I wish I could remember the correct wording but I saw another post where someone mentioned companies don’t want high performers they want several mediocre performers. High performers will want more money, somehow it’s better to have several mediocre performers and pay them all less. Even though the company will still likely be paying more than just paying the high performers more.', a user said: 'I cant speak for all depts/orgs but in mine (tech), you're VERY much carried by your top performers.  I could accept the above logic if your top performers weren't worth a 2x+ multiple of your mediocre performers.'",
        "In response to 'Tech is 100% this.  Get one senior lead dev, who has no life and works until 1am everyday, and pair him with 5 juniors with under 3 years experience, you have an all star team.  They will outperform a group of 10+ mid developers.  Every. single. time.\nCompanies really don't like this though because that one dev has so much power, and if they take their ball and go home, it can absolutely wreck an entire department.  My company has really been pushing this \"swarm\" mentality.  Where they don't want leads or anything anymore.  They want tasks to just be worked on simultaneously by all so that knowledge is always shared so there is never a knowledge gap because they are absolutely terrified of the lead dev power dynamic.  Every task is a paired task.  It's terrible and simple tasks take entire weeks.', a user said: 'Jesus that is brutal. They attempted to implement paired programming when we first started making the transition to Agile, but it ultimately got overwhelmed by \"push as much work as possible\".\nWe had a Lead Dev who did the 1am thing. We have a Jr Dev who does the 1am/weekend thing because this is really all he has (who should be a Sr by now, but we exist in an org that won't promote unless youre worth AND audibly complain).'"
    ]
}