{
    "username": "Throwawooobenis",
    "contributions": [
        "In response to 'Yea to beat cancer. Pretty much my only focus while knowing it will probably kill me in the next few years.', a user said: 'I was almost killed off by a brain infection(?) a few years ago. still no idea what happened. I couldn't walk or even speak properly, basically became dumb and my muscles wasted from extreme weakness. But yeah, my GF, who wanted to move and and wanted kids one day with, just left immediately at the first whiff of weakness, and played victim. My job where I was the star employee, I got bullied and my career got sabotaged by a manager who turned out to be sociopathic. Long time friendships faded\nSome things I wanna say, as a fellow person who almost died and reached a palliative state for a long period of time\n0) your job now is to be selfish. Eat what you need, get meal delivery service if possible. Do what you can to not lose all muscle mass. Nothing crazy. Sleep 8 hours a day. Don't commit suicide. Pursue treatment. That's about all the fighting you can do as far as I can tell.\nyou are not a failure if you can't \"fight\" and win it. If you enter a death spiral you can't get out of, that's not\non you\n. Don't pretend you're getting better (if you're not) to appease the crowd that expects constant recovery porn.\nwestern culture is absolutely, and utterly broken on it's ability to deal and process death. That's not your fault. It's likely that if you get more sick, people will distance themselves even more. Some will stick thru. But if those things happen to you, you are not alone. Even when you\nare\nalone. You are sharing an experience with every person that ever existed.\nNobody makes it out of here alive. Your time may be sooner. I don't have       kids, I don't know what's best. All I can say is live to be an example. They will remember everything about you and live your example if you come to pass.\nif you survive, AWESOME. It can happen for sure. don't give up hope.'"
    ]
}