{
    "username": "throwitoutwhendone2",
    "contributions": [
        "In response to 'Exactly I been delivering for almost 5 years and never once got the urge to take my anger out for Amazon at a customer. The customer is not the reason for your shitty route my dudes.', a user said: 'This is in the same vein as linecooks and servers that get mad when they close at 12:00 and an order comes in at 11:45. Yes, it is annoying as fuck. However where do you think your wages come from, sky daddie?\nIt’s super annoying and at the end of the day I never did like it but at the same time those people spending their money is how you are paid and that person isn’t technically doing anything wrong. If a restaurant says it’s open till 12 that means food can and will be served right up until 12. This won’t happen every single day but it will happen. Some people get outta work late and just want a meal when they get home. Others maybe were late getting there, you never really know.\nBeing mad you hate your job and taking it out on someone that has nothing to do with your job or your life chooses in general other than buying something and your the one picked to deliver it isn’t the way to go about this.'",
        "In response to 'Yeah, my coworkers on the line were always less annoyed at the order coming in 15 minutes before close, but the fact that we worked at a sit down restaurant, and that table will now be here an hour past close.\nAnd the kitchen gets none of the tips despite doing all the work.\nAnd we can't leave until the check is dropped off, in case they want to order more food/dessert.\nAnd we now have to reclean all of the equipment we already shut down and had to fire back up for the table that\nhad\nto come in 15 minutes before close.\nAnd then tomorrow we're going to be bitched out by management/the owners for going into overtime and costing them more than they made from the table, but only the kitchen gets yelled at, the wait staff are praised for taking on that final table, we should\nnever\nturn a table away.\nThis Karen-level \"wElL iT's ThEiR jOb\" mentality needs to fucking die. We're human beings, not robots, we deserve common courtesy and respect just like customers expect from us. And we deserve a livable wage for our labor too, but we don't get that either, all while being told our jobs aren't \"skilled\" in any way.\nY'all are paying the absolute cheapest amount you can for literally every service, a cost that is borne by the underpaid and overworked employees, and then expect white glove personal service.\nIt's never fucking enough for y'all. I had a guy when I worked for USPS who lived less than 1/4 mile from the Post Office, had three cars, and worked from home. His front porch was a revolving door of packages every day: I'd drop 20 off, he'd have 20 sitting there for me to take. Every. Fucking. Day. Never a thank you, never an offer of water on a hot day, absolutely\nnothing\ndespite USPS not charging him (or anyone) for us to pick up their packages like that.\nThen a bin appeared: he wanted the packages put in the bin, to make it easier for him to carry them all inside... Then a sign telling me if it's raining, I need to bring the packages from the covered front porch to the covered back porch where there was more room... When I refused to do that, he added another sign telling me I need to put them all under the plastic bin if it's raining or going to rain... All while he's sitting on his ass inside in his pajama pants doing fuck all, or walking by the door eating potato chips while I'm unloading 40 fucking packages and picking up 40 more.\nWe're not your personal fucking servants, you want Express level delivery service, then pay Express shipping prices. You don't get Express service for Ground pricing, and y'all shouldn't be shaming delivery drivers for not going above and beyond when they're not being paid to.\nI constantly see posts on Reddit about people saying you should only give 80% or less at a job so you don't burn out, etc, and it's\nalways\nabout office jobs and how unreasonable it is for boss A to expect B for the pay, and so malicious compliance is warranted and you should slow down your work and blah blah blah, and everyone on Reddit praises them for not just rolling over and taking it.\nBut blue collar workers have enough and start to phone it in, well that's just unacceptable. Fucking hypocrites, all of you, you only care because it affects\nyou.', a user said: 'So I stopped at Karen level mentality lol. I’m not reading that rant. If you dislike that a place stays open till a certain time and customers come in before that certain time then talk to owners or management about a last call for kitchen. Or ya know, stop closing everything down a hour early.\nThere’s absolutely no way you cannot figure out how to close down partially or close down at least half the place while still being able to operate. Or communicate with your bar or servers. Hey all we have for the last hour is “most popular 3 items” and then close down the rest. Pick a different profession if your skins so thin a customer coming in to order food at a place that makes food makes you that upset.\nAnd as far as pay, simply because I seen “you all pay the lowest” as I skimmed trying to find the bottom of that long winded rant/story: I don’t control what wage you make and agreed to make when you took the job. I didn’t pay less than $20 a hour starting out with full free benefits, family meals, take home meals, PTO, 75% off drinks and my staff could order whatever from US foods and just pay out what the product cost them. So yeah, if I asked my crew to stay open and take orders up until the final minute they would without question. 9 times outta 5 I was right there with them or releasing them early myself and closing solo so they could go home.\nNot every manager is absolute dog shit. And if that’s what your use to well then the common factor there is you buddy.'",
        "In response to 'Doing a good service for cheeked up pay is only enabling the system of customers and the company\nTake it out on the product and even the most settled in customers will reconsider ordering their nail polish, toilet paper, and the tried and true kitty litter', a user said: 'See the thing is, no it won’t. That’s not how people work. Know what’s actually gonna happen? You’re likely going to be fired. The customer is going to call and complain and likely get a refund and/or another product which in turn has to be delivered just like the other one had to be delivered. And what did you, the driver, get outta this? You likely got fired, that’s what you got. Now you get to start the rat race all over again until you’ve burned enough bridges that it’s  good luck to ya.\nThere will ALWAYS be people that are MORE THAN happy to be slightly inconvenienced if it means a full or partial refund. If that means you have a bad day and pitch a package and get caught/recorded they have no issue disrupting your livelihood so they can get $10 back.\nThis multi-billion dollar company isn’t gonna go under or get hurt because a few thousand drivers throw packages. They aren’t gonna change shit except make it harder on yall and just just out those DSP centers or have them cut you out.\nThis is the sad reality of the situation. Lobbying and unionizing is basically all I can think that would heel in a company the size of Amazon, and good luck with that. I worked for Wally World like a decade and a half ago and they were trying to unionize then, like they had been for the last 15 or so years and like they still are today.\nAnd no, this ain’t me shilling for Amazon. This is just the actual reality of the human race. Most are happy to fuck you over and fuck your whole life up if it means they got a free product. All you are to most is a means to get what they want delivered, nothing more nothing less.'",
        "In response to 'Been destroying packages for my entire career both accidentally and on purpose with two separate DSPs and three different warehouses, someone is losing money and if its the customer they will reconsider their ways... Or just continue to use a suboptimal service', a user said: 'Maybe so. I’m guessing you got a system to do it. What I can bet money on is that no one has sat and recorded you intentionally destroying a package and then took that footage to your DSP or Amazon as a whole. Regardless of whether or not your career has been 2 years or 20 I’d bet that if you were filmed intentionally destroying someone’s packages you would be fired at worst at reprimanded at best.\nAgain, I’m not saying I’m for the shit work conditions of Amazon. All I’m saying is eventually you and others doing this is gonna be like smashing your head on a wall over and over then Asking everyone else why your head hurts.\nThe point of what I was saying is at the end of the day people do not give a shit. They WILL keep using a subpar service. All it takes is a few clicks and voila they have another product on the way, a refund or both. You’re trying to empty the world’s oceans with a spoon bud. It\nmay\nwork but not without monumental effort.'"
    ]
}