{
    "username": "TimLikesPi",
    "contributions": [
        "In response to 'Original Post: Is anyone in the process of “quiet quitting”? I’ve been at my job for 9 years. I work in a department where I get swamped daily and have been under staffed since covid. I’m burned the fuck out. I’ve asked management and HR for help to no avail. I dread every day I wake up knowing I have to go to work.\nI’ve tried to pare back my work load myself but my work ethic is too strong to just go in and dog it but now I’m to point where I don’t care. I make great money and the benefits are probably some of the best in the country but I’m not happy at all. I’ve looked at applying other places and have had call backs but I couldn’t pull the trigger and leave.\nI’ve heard of quiet quitting where you just go in and do the bare minimum. Knowing my employer they either won’t bat an eye or they will come to me and wonder why I’m not laying waste to any and all tasks like I used to which would be a mistake on their part as that would piss me off lol. Has anyone done quiet quitting or currently doing that?', a user said: 'I found slowing down at work to be awesome! I just started doing what I felt I could at my old job and let the rest pile up. If my boss ever asked about anything, I would ask what they wanted me to prioritize in an email. If they tried to give me new duties, I would ask if they wanted the new duties or old duties to take priority because I could not do them all. At 5 I clocked out and went home. I was just very open about not being to do everything for them. I did this in office and WFH.\nJust ease into it. Slowly decrease what you can get done and always ask for them to prioritize what they want you to do if they ask. If they get rid of you they will have nobody to do the work.'",
        "In response to 'Original Post: Had a fight with my parents over this “quiet quitting” trend. Somehow refusing to answer emails/phones outside of work hours is a trend and my parents think it’s just us being lazy. I can’t seem to make them see the reality. When they were young and working you could leave work behind by walking out of a building, not so anymore.\narticle', a user said: 'I have always done that. Over 20 years at my first job. I worked two days of OT in that time, Saturdays. I got to work at 8 and walked out at 4:30. I walked out of the building for lunch, or into the break room. I refused to have my emails come to my phone. I refused a laptop. When I was not in the building, I was not working.\nI do this at my new job, which is WFH. I will flex my time and have kept my computer on to run code a few times, but no real OT. I give them 40 hours a week, but then I am done. Establish that early!'"
    ]
}