{
    "username": "tiny_office02",
    "contributions": [
        "I think my remote team mate is quiet quitting And it's ticking me off. Need advice if I should say something?\nMy team is fully remote,  spread  across the US. Our individual and team metrics are tracked by the amount of tickets we process on a weekly basis. This is a FULL time job and I've found that a member of our team is only logging about 4 hours a day - if that! Meanwhile, the rest of the team is putting in 9 hr days just to keep up with the volume.  We've also had to log in and work the last two Saturdays just to clear the backlog.  If this person would just work a normal day,  it would lighten the load on each of us. Our manager hasn't seemed to notice that this  person's \"numbers\" are half of what the other team members are producing. Do I speak up or keep my trap shut,  silently seething all day?\n**Thank you everyone for your input! I'm not going to do my managers job for them,  if they don't care,  I won't care either.  I'll hit my targets and focus on my career advancement in 2025.",
        "In response to 'Does that team member do the same amount of tickets in 4 hours as someone who does it in 8? The reason I ask is because I too only work like MAYBE 6 hours a day. On a good day. But I get paid by the hour so I just don’t charge the hours I don’t work. But I also get my more work done, faster, and with less reworks than most members of our team. So yeah, I could work a full 8 hours and get 1.5x to 2x the amount of tickets than most people but I stop at what I’ve been assigned.', a user said: 'Definitely not,  only completing about half of what everyone else is doing'",
        "In response to 'If they're within their schedule and meeting their hourly goals, then who cares.\nIf they're not, well, that's an issue the manager should be involved in.\nSounds like there's plenty of work regardless. You're getting your 40 plus some in, so what's the problem?\nIn short, it's not your role. It's best to stay out.\nYou do your job, they do theirs.\nIf there is something missing, the manager will or should figure it out. It's not on you.', a user said: 'Just irritated that the whole team has to work Saturdays because one person doesn't pull their weight.  It's not like we're getting OT either. We're salaried.'",
        "In response to 'Can you see your stats, like in Zendesk? Do you have SLAs? If they are doing the same amount of work as the rest of the team just in 1/2 the time don't hate the player, hate the game.', a user said: 'Yes,  can see stats, we have SLA's , and all activity within our specific platform is visible if you know where to look.  Their production has significantly decreased,  only logging about half the tickets that they used to and less than anyone else on the team.  They aren't even hitting the minimum daily target.'",
        "In response to 'There’s easily a number of reasons or justifications why. \nIf you can do your 8 and logoff, then do it. All you’ll be doing is your bosses job and there is zero upside. You got to look out for you. If the boss isn’t noticing, it’s time to get out. Because they don’t want to address anything, because they don’t want  to do anything. Now they’ll have to and they’ll be more upset about the situation because of you, than the other person.', a user said: 'Great advice! I'm going to turn my focus in 2025 to advancing my career. Hopefully, within the same company - overall it's actually pretty great. Until then,  I'll put in my 8, take a lunch and not be available outside of regular working hours.'",
        "In response to 'Pull a report with counts and names/logins that shows what has been done. Send it to the whole team, including manager. “WAY TO GO EVERYONE LOOK WHAT WE ALL DID!”\nManager might ask how you did that.\nManager can then clearly see counts.\nI’m all in for passive aggression. lol', a user said: 'Coincidentally enough,  my boss pulls a weekly report that is sent to executives with this exact info. No one seems to notice (or care?)'",
        "In response to 'Stay in your lane. Do you work day. Work OT if you’re paid for it. If you’re not, they can’t make you.\nThrowing your coworker under the bus isn’t the way to approach this. It’s your managers job to work out who is performing, and for all you know they are fully aware and putting appropriate things in place to address it.\nYou also don’t know what your coworker is going through personally. Is this new for them or have they been doing ‘half the work’ since they started? You say quiet quitting, so I assume this person has previously done their job fine and all of a sudden has dropped efficiency for a period of time… now ok you might be right and they’re slacking off. You might also not be aware that person could be dealing with personal concerns with their health, family, whatever that’s causing a dip in their ability to do their duty to their full potential and it’s none of your business. If that’s the case the manager is likely aware.\nFocus on your own work and just log off on time. If the team performance drops overall the manager will surely step in.', a user said: 'Thank you for that insight. Yes,  this person's performance has dropped significantly in the last month.  They used to be a top performer.\nI'll keep my mouth shut and let the numbers do the talking.'",
        "In response to 'I completely get your frustration with the situation, but yeah I think it will only reflect poorly on you if you put in a complaint about this person without knowing all the details. Also depending on your managers ego and your relationship with them, they might feel you’re overstepping and questioning their management (I’ve had some toxic bosses in corporate who 100% would take something like this out on me if I raised it - sadly).  It’s tricky to approach for sure.\nTry to remember work is just work, deadlines and metrics are made up, and no one dies if you miss them. Hope the workload starts to lessen!', a user said: 'Thank you,  needed to hear this!'",
        "In response to 'How is it you became aware of the low hours logged and your manager has not? That’s difficult to comprehend considering weekend OT was mandated.', a user said: 'My manager isn't as versed in our software system as I am. Our manager doesn't realize that there is a place where you can see all activity.  An employee from another department actually alerted me to it,  they were trying to get in touch with said team member,  their status was green but they were not responding to an urgent request'",
        "In response to 'If you've been in a similar situation, it totally adds up.  I feel for OP and am in the same boat.  Management seems clueless that my coworker isn't pulling their weight, working barely 30 hrs/week while the rest of us are closer to 55 or 60.  Coworker holds a certification/license none of the rest of us have, so he thinks he's untouchable.  And an arrogant know it all on top of that.  I'm friends with the supervisor who keeps saying \"just be patient\", as if to imply they are working on it, but for fuck sake, just replace him already.', a user said: 'So sorry you are dealing with this!'"
    ]
}