{
    "username": "TinyTurnips",
    "contributions": [
        "In response to 'Quiet quitting shouldn't be work to rule, but way less than that:\nRiding the edge of almost being fired.\nWork starts at 9? Come in as late as still tolerable.\nColleague calls? Only pick up when he calls a second time. Some problems solve themselves. Don't even think about calling back.\nCall in sick if you need to chill after an exhausting weekend. Calling right before  work starts is soon enough.\nGood things take their time. Never respond quicker than 24h to an email. Preferably 48h.\nEating healthy and diverse is important. Heat up your fish in the microwave.\nNeed to estimate duration of workload? Estimate generously and multiply by two. You never know what unexpected things come up. If you deliver earlier, you may even get a pat on the shoulder.\nEducation and training is key. Learn something new that has nothing to do with your job on worktime.\nIf need you to go somewhere, always pretend to be in a hurry. You're less likely to be bothered if you're making a stressed out impression.\nPensions alone are too little to depend on. Learn to invest and trade during work hours.\nCasually sprinkle some complaints about your hardware here and there. Blaming your hardware when you need an excuse one day becomes more believable.\nIsn't losing hours of work to a blue screen just horrible? I told you something is wrong with my machine.\nAn organized worker is a good worker. Meticulously plan your bowel movements in advance, so you never have to drop a deuce at home.\nDon't get caught with your pants down. Always have some plausible excuses prepared and at the top of your head why you\nabsolutely\ncan't cover a shift this weekend.', a user said: 'As IT, don't you go blaming me.  I am all for doing the bare minimum, that's what I try to do, but yet yall want it for you but not me in IT.  I bust my fucking ass to keep you all afloat and all you do is bitch and whine about me all day long.  They don't give me money to improve, and when they finally do, it's \"DO IT RIGHT FUCKING NOW AS FAST AS POSSIBLE!\" Despite a world wide shortage of chips and shit.  Don't go making someone else life harder to make yours easier.  That's complete and utter bullshit.\nAlso just a fun fact.  I can see everything you do all day long.  I can watch your screen without you knowing, I can look at logs. I can prove you are lying about your blue screen or any other bullshit you try to pull.\nDon't fuck with IT.  I have your back on everything else, but the second you make ME look bad for doing my part, I will throw you to the fucking wolves.'"
    ]
}