{
    "username": "tlovik",
    "contributions": [
        "In response to 'Belønningen for å yte ekstra er at arbeidsgiver gir deg ekstra arbeid innenfor samme arbeidstid.', a user said: 'Dette er litt av det jeg oppfatter som problemet med de som \"støtter\" quiet quitting.\nDet er ingen ting som heter ekstra arbeid innenfor samme arbeidstid. Man får betalt for tiden man er disponibel for arbeidgiver og skal levere en eller annen form for arbeid i det tidsrommet. Hva bedriften anser som riktig menge arbeid kan i mange tilfeller diskuteres, men det er ikke som at man har rett til å bremse opp mot slutten av dagen fordi man synes man har produsert nok.'",
        "In response to 'Om vi syns alle minutt skal telle like mykje uavhengig av arbeidsoppgåver/ansvar, må vi innrette oss deretter ved å lønne alle likt. Slik det er no har vi bestemt oss for å verdsette somme oppgåver, og ansvaret det medfører, meir enn andre. Derfor tjener legar meir enn sjukepleiarar, sjefen min meir enn meg, og Gahr Støre meir enn Guri i kommunen. Og derfor tar ikkje folk på seg ekstra arbeid innanfor samme arbeidstid.', a user said: 'Her blander du sammen forskjellige ting. Arbeidsavtalen sier noe om hvor mye du skal få betalt for en viss type arbeid innen et gitt (fag)område. Hva andre tjener er fullstendig irrellevant.'",
        "In response to 'det er absolutt noe som heter ekstra arbeid jo.\nom man har kontrakt som sier en skal være på jobb 7,5t hver dag så skal det jobbes disse 7,5 timene.\nLikevel er ikke dette så enkelt. Dersom noen viser seg å klare å la oss si, servere kaffe i 7,5 timer uten problem, kan det være at arbeidsgiver ønsker å forsøke med litt ekstra ansvar.\nDet kan være f.eks. låseansvar og oppgjør. Dersom du nå klarer å servere kaffe, ta oppgjøret og låse før du går, innenfor de samme 7,5 timene har du fått flere oppgaver men ikke minst, mer ansvar. En ekstra ting du må ha i hodet mens du smiler pent, prater hyggelig, lager kaffe, tar betalt og holder rent under veis.\nvidere får denne personen ansvaret for å vaske kaffemaskinen og bestille varer, sjekke at alt er på stell før stenging o.s.v.\nDet som skjer er at nå må denne personen jobbe med hodet og hendene, både strukturert ift. rutiner og improvisert ovenfor forskjellige kunder.\npå et eller annet tidspunkt burde denne personen kvalifisere for mer lønn hvis det er slik at alle kollegaene kan stå å dagdrømme på jobb mens de serverer kopp etter kopp med kaffe og ikke trenger bekymre seg for noen ting.\nDa må arbeidsgiver ta stilling til hvor lenge en skal jobbe OG hvilke oppgaver en skal utføre når en likevel er på jobb.\nom ikke, blir det egentlig om å gjøre å ikke være i stand til å ta ansvar for da slipper du den ekstra belastningen men får likevel samme lønn.', a user said: 'Hvis det viser seg at denne personen klarer disse oppgavene i løpet av 7,5 timer er det helt tydelig at man hadde for få oppgaver i utgangspunktet. Sett bort fra det, så har arbeidsgiver styringsrett på hvem som gjør hva og når så lenge det ikke er en vesentlig endring av stillingen man har. Det er sjelden en stillingsinnstruks er 100% konkret i hva som skal gjøres. I ditt (tenkte) tilfellet vil stillingsbeskrivelsen mest sannsynlig inneholde noe om forefallende arbeid.'",
        "In response to 'Hvis det viser seg at kun EN av de ansatte klarer dette er jo spørsmålet om han burde bli bedre kompensert for å yte ekstra.\nSom oftest blir han ikke det og derav \"work your wage\"', a user said: 'Som tidligere nevnt kan det i mange tilfeller diskuteres om bedriften har urealistiske forventninger til hva som er passelig mengde arbeidsoppgaver for en stilling, men det er likevel ikke riktig å snakke om \"ekstra arbeid i arbeidstiden\". Har man mer kapasitet enn andre, og det er det mange som har, må det forventes at man produserer mer. Etterhvert som vi blir voksne nytter det ikke lenger å skrike \"det er urettferdig\" som en annen 5-åring bare fordi noe ikke er identisk med alle andre.\nBelønningen alle er så redd for å gå glipp av kommer. Kanskje ikke samme måned, eller år, men dersom man produserer eller står på mer enn andre vil det lønne seg på sikt. Enten i form av bedre lønn, annen stilling eller bedre tilbud i en annen bedrift.\nMerk at jeg ikke har noe i mot at man ikke jobber utover det arbeidsavtalen sier noe om.'",
        "In response to 'Quiet quitting handler om å ikke ta på seg mer enn det man er ansatt til å gjøre, ikke om å la være å gjøre det man skal. Det er\ndefinitivt\nnoe som heter \"ekstra arbeid\" - alt som ikke står i kontrakten er ekstra arbeid, og er derfor ikke noe arbeidsgiver kan forvente at du gjør, eller holde mot deg at du ikke gjør.', a user said: 'Der tar du feil. Arbeidsgivers styringsrett går ut på at arbeidsgiver kan gi deg andre oppgaver enn det som står i arbeidskontrakten din så lenge det ikke går utover avtalens grunnpreg, også kalt en vesentlig endring.\nI praksis betyr det at arbeidsgiver fint kan tillegge deg tilleggsoppgaver som ikke er nevnt i arbeidskontrakten din.\nEdit: Skrivefeil'",
        "In response to 'Skjønner ikke hvorfor du blir nedstemt. Det du skriver stemmer jo. Dvs, hvis du mente arbeids\ngiver\ni siste setning.', a user said: 'hvis du mente arbeidsgiver\nDet har du selvsagt helt rett i. Takk!\nSkjønner ikke hvorfor du blir nedstemt. Det du skriver stemmer jo.\nNei, det kan du si. Sier vel noe om kunnskapsnivået, kanskje? Kun spekulasjon, selvsagt, men jeg tror mange av de som er unge voksne har blitt pakket inn i bomull siden de var små. Virkeligheten treffer deg knallhardt hvis du har vokst opp uten å møte motstand.'",
        "In response to 'Nå er begrepet brukt for å ikke gjøre mer enn hva stillingen tilsier. Ønsker arbeidsgiver at en ansatt skal gjøre oppgaver utover arbeidskontrakten, ja da skal en ny og oppdatert kontrakt signeres med desto høyere lønn. Jeg støtter begrepet fullt ut.', a user said: 'Ønsker arbeidsgiver at en ansatt skal gjøre oppgaver utover arbeidskontrakten, ja da skal en ny og oppdatert kontrakt signeres med desto høyere lønn.\nDet stemmer hvis vi snakker om oppgaver som er vesentlig annerledes enn det som normalt sett ligger i stillingen. En bartender må f.eks forventes å vaske baren etter stengetid selv om man er ansatt for å \"tappe øl og blande drinker\".'",
        "In response to 'Tja, lite grunn å gjøre mer per time om du ikke får mer per time da.', a user said: 'Hvorfor skal du få mer betalt for på gjøre jobben din? Hvis du får x kr/time for å flippe burgere på McD, og ikke pr burger, skal du flippe så mange du klarer i løpet av en time. Det er det du ble ansatt for, og det er det du signerte på når du inngikk arbeidskontrakten. Hvis du bevisst leverer mindre enn det du har kapasitet til oppfyller du ikke arbeidskontrakten med de følger det kan føre til.'",
        "In response to 'Haha, det er ikke alle jobber her i verden som er McDonald’s, så det der er ett verdiløst eksempel.\nHvorfor skal jeg gidde å jobbe for å bli mer effektiv eller produktiv, når det ikke fører til noe annet enn at jeg blir mer utslitt?\nDet er ingen som har sagt noe om å bevisst holde igjen, det er bare en stråmann du lager for å klandre arbeidere.\nOg hvorfor i alle dager skulle jeg bry meg om jeg fikk beholde en jobb med dårlig lønn og dårlige arbeidsforhold?\nSpesielt når noen andre som tjener det samme, og leverer mindre, siden det er alt de karer å levere.\nDu blir ansatt for å levere ett minimum, ikke forskjellige ytelsesnivåer.', a user said: 'Vet virkelig ikke hvor jeg skal begynne - tror dette må være noe av det minst innsiktsfulle innlegget jeg har sett på lenge.\nHvorfor skal jeg gidde å jobbe for å bli mer effektiv eller produktiv, når det ikke fører til noe annet enn at jeg blir mer utslitt?\nFor å snu litt på det - Hvorfor skal noen gidde å ha deg ansatt hvis dette er holdningen?'"
    ]
}