{
    "username": "tomatopotatotomato",
    "contributions": [
        "In response to 'YES. I was just thinking that! \"Leaving on time\" is quitting? Since when?\nI don't get paid overtime. I get paid a flat 40 hour week. It doesn't make sense that I'd work more than that for air!', a user said: 'It shouldn’t be radical. Yet I was one of the few teachers that got up and left on contract time when the staff meeting ran late. After being discriminated against for attending my fertility appointments I stopped coming in early. I sat in my car listening to music and timed my entrance exactly to the minute. I decided after how they treated me they would never get  second of free labor from me again. But that’s not how most people function at least at my school. Leaving and arriving exactly on time and still having a smooth day requires a lot of planning. Many people just come in early to avoid any last minute hiccups.'",
        "In response to 'It was ridiculous how often I was expected to work for free and take no breaks when I was a Special Ed IA. They wanted me to never take bathroom breaks/lunch and stay late to do crossing guard duty but somehow magically clock out in the middle of it but you are legally not allowed to leave young kids in the crosswalk… I suggested they have parent volunteers do it and they were furious. I left the school and made 2x as much as a private nanny. I would have worked an entire hour for free every day, and all the paras were expected to but I was the only one who stuck up for myself…', a user said: 'That is ridiculous. Good for you for finding a better gig. My school treats our paras like garbage. One para basically taught herself calculus to help tutor kids in the academic center and clocked in early and stayed late every day and the schools response was to hold a big meeting giving her a plaque and telling the other paras to be like her. Instead of giving her a raise. She was doing the work of a teacher for minimum wage; it was exploitation. Oh yeah and the assembly was during covid so it was super unsafe.'"
    ]
}