{
    "username": "tommy_b_777",
    "contributions": [
        "In response to 'Quiet quitting isn't a thing. It's called you get what you pay for.\nI'm a boomer and I TOTALLY APPROVE!\nThank God for a generation that won't lick the boots and suck the corporate teat and push back. I've cringed many, many years watching fellow boomers and some Gen X lick that corporate boot leather and just sacrifice themselves for no good reason.\nThere's an active movement it seems by companies and staffing firms to reject the long-term unemployed from consideration. This is something I never did when I owned my own IT Staffing firm.\nI always considered the individual when looking at their skills and experience vs the date they last worked, especially with IT. Now, according to my industry contacts, long-term unemployment is being leveraged as a discriminatory tool to keep the people who quit and resigned out of the market until their savings are decimated.\nAt that point, they'll low-ball you back into the 9th circle of hell, apparently.\nI am ashamed of what my fellow Boomers did with their vile gatekeeping. I was even affected by that gatekeeping and that made me form my own business as I was fucking fed up with being held back for no good reason other than their selfish greed.\nI feel sorry for my two daughters, especially now in a state where their reproductive systems are subject to state control. I have endeavored to teach them how to screw the system back, surreptitiously and with much gusto.\nBut honestly, as I grow older, I just wish the whole system would collapse. Having grown up in the Cold War I often prayed we never had a nuclear war. Now I'm praying for one to end this shitty rule of the 1%.', a user said: 'I might be one of those people that they are trying to wait out until I have no savings, but I also have a hugely desirable skill set that not a lot of people have so recruiters keep bugging me every fucking day... And like you I'm really done with watching this whole shit show since Reagan and I could take it or leave it if it all collapsed tomorrow,\nso I'm doing things like asking them about wage transparency and institutional sexism anyway :)  I actually hope to never go back to to the IT cubicle hellhole, I think I'd rather just bang chairs at a ski resort until I'm too old to move even though it's relatively poverty...'"
    ]
}