{
    "username": "Tom-o-matic",
    "contributions": [
        "In response to 'Dette er litt av det jeg oppfatter som problemet med de som \"støtter\" quiet quitting.\nDet er ingen ting som heter ekstra arbeid innenfor samme arbeidstid. Man får betalt for tiden man er disponibel for arbeidgiver og skal levere en eller annen form for arbeid i det tidsrommet. Hva bedriften anser som riktig menge arbeid kan i mange tilfeller diskuteres, men det er ikke som at man har rett til å bremse opp mot slutten av dagen fordi man synes man har produsert nok.', a user said: 'det er absolutt noe som heter ekstra arbeid jo.\nom man har kontrakt som sier en skal være på jobb 7,5t hver dag så skal det jobbes disse 7,5 timene.\nLikevel er ikke dette så enkelt. Dersom noen viser seg å klare å la oss si, servere kaffe i 7,5 timer uten problem, kan det være at arbeidsgiver ønsker å forsøke med litt ekstra ansvar.\nDet kan være f.eks. låseansvar og oppgjør. Dersom du nå klarer å servere kaffe, ta oppgjøret og låse før du går, innenfor de samme 7,5 timene har du fått flere oppgaver men ikke minst, mer ansvar. En ekstra ting du må ha i hodet mens du smiler pent, prater hyggelig, lager kaffe, tar betalt og holder rent under veis.\nvidere får denne personen ansvaret for å vaske kaffemaskinen og bestille varer, sjekke at alt er på stell før stenging o.s.v.\nDet som skjer er at nå må denne personen jobbe med hodet og hendene, både strukturert ift. rutiner og improvisert ovenfor forskjellige kunder.\npå et eller annet tidspunkt burde denne personen kvalifisere for mer lønn hvis det er slik at alle kollegaene kan stå å dagdrømme på jobb mens de serverer kopp etter kopp med kaffe og ikke trenger bekymre seg for noen ting.\nDa må arbeidsgiver ta stilling til hvor lenge en skal jobbe OG hvilke oppgaver en skal utføre når en likevel er på jobb.\nom ikke, blir det egentlig om å gjøre å ikke være i stand til å ta ansvar for da slipper du den ekstra belastningen men får likevel samme lønn.'",
        "In response to 'Hvis det viser seg at denne personen klarer disse oppgavene i løpet av 7,5 timer er det helt tydelig at man hadde for få oppgaver i utgangspunktet. Sett bort fra det, så har arbeidsgiver styringsrett på hvem som gjør hva og når så lenge det ikke er en vesentlig endring av stillingen man har. Det er sjelden en stillingsinnstruks er 100% konkret i hva som skal gjøres. I ditt (tenkte) tilfellet vil stillingsbeskrivelsen mest sannsynlig inneholde noe om forefallende arbeid.', a user said: 'Hvis det viser seg at kun EN av de ansatte klarer dette er jo spørsmålet om han burde bli bedre kompensert for å yte ekstra.\nSom oftest blir han ikke det og derav \"work your wage\"'"
    ]
}