{
    "username": "ToneSenior7156",
    "contributions": [
        "In response to 'Thank you!\nI am interested to know more about your second paragraph. I was also advised to be “pleasant” and not act like a protester, remaining normal and well adjusted. Why is this important? And any examples of bad protester behaviors you’ve seen?', a user said: 'It’s important because you want to “fly low on the radar” - you don’t want people to notice that you’re suddenly showing up angry and working 30% less. You just want to work less and live your life in peace! (Or maybe put that energy into job searching)'",
        "In response to 'Original Post: How to quiet quit without being detected after being known to be an extra-mile person at work? Firstly, I know - quiet quitting is just doing your job and nothing extra. Stop repeating the chant.\nSecond, I was known to be THAT person, who goes out of his way to help. I guess I associated my self worth with how company values me.\nIt took a couple of a years and being passed over a promotion to wake up.\nI cannot quit at the moment, or change jobs, I have been looking and nothing suitable on the horizon yet.\nThe question is how do I make the shift in attitude without getting so much attention especially that I am known to be a hard worker.\nEdit: Thank you everyone! Very useful tips! Read every single one! 🙏', a user said: 'How much is being asked and how much is actually raising your hand for more work? I realized…I kept volunteering. I can do that, I can fix that, I can run that - I can do a lot of things quickly and accurately.\nAlso be mindful of where the extra work comes from, if you are really engaged in a meeting and make a million suggestions it makes sense you run the project, you make those changes. No, no, no. Let someone else have the brilliant ideas and do all the work.\nNow I don’t volunteer. Good strategies if you are asked is to bring up one of your core responsibilities that is a big priority now, so no. Suggest someone else to do it instead of you.\nAnd of course - all of this is after you have been going above and beyond for years with no reward but more work. If you are getting promoted and raises and bonuses - then the contract is being honored! When it’s not - they get 9-5 and no more. and you take your lunch and all your vacation days.'"
    ]
}