{
    "username": "tonos468",
    "contributions": [
        "In response to 'Original Post: “Quiet quitting” academia Due to the current funding environment, my research career is in the tank. My university says they will continue to pay me for 6-12 months (I’m in a soft money faculty position but they are finding money to pay those of us with terminated grants), and they want me to continue to submit grant proposals. In no way do I want to waste my energy writing grants that will not get funded, and for so many reasons I am ready to put this part of my life behind me and get out. Is it unethical to let my university continue to pay me while I build out my exit plan? What do I say to them when they press me to keep submitting grants and I know I am not going to?', a user said: 'You should be looking out for yourself first and foremost because your employer does not care about you beyond the money you can provide. I’d be actively looking for another job. Personally, I’d be looking beyond just traditional industry R&D as the job market is terrible. There are jobs out there if you are willing to focus on transferable skills rather than technical skills.'",
        "In response to 'Yes, I’m definitely interested in using my transferable skills rather than technical. Any industries in particular you think are accessible to academics right now?', a user said: 'This is a great question! So unfortunately I do think the job market is flooded with PhDs (at least in the US) due to the current administration’s decisions on funding (or lack of funding) so the overall job market is not what it was when I left academia after my post-doc in 2018. And that in itself is already a huge issue. For example, I work in academic publishing. When I left academia in 2018 there was a push to hire STEM PHDs since that industry was heavily dominated by English or Publishing specific degrees. So there is still a push for PhDs but now the number of qualified candidates is way higher than it was previously. That’s why I don’t want to give you any false hope. I think lots of these adjacent industries are in similar situation, where PhDs are still valued but the amount of quality of applicants has jumped significantly. So “accessible” in this context mostly means that PhDs are valued. Given all those caveats, the following industries still value PhDs: Medical Writing, medical science liaisons/medical affairs, scientific Journalism, medical education, academic editing, academic publishing, UX research, Scientific Sales (for example, selling microscopes or other scientific machines). I think the first step is to figure out what you like and don’t like and then hone in on jobs that allow you to do things you like, as an example, I knew I did not want to write grants or work at a bench, but I did like reading papers, going to conferences, talking about science. So I specifically targeted jobs that allowed me to do that. Academic publishing hits those things as I still read papers, go to conferences, talk about science but I don’t have to do a Western blot ever again. So my career happens to be a fit for what I liked.'"
    ]
}