{
    "username": "TootsNYC",
    "contributions": [
        "In response to 'My abusive ex doubled down and tried to propose 4 months before I finally left him lol. I don’t know on what planet someone realizes their partner is checked out and thinks that a flashy ring will somehow fix the problems that lead to them wanting to leave in the first place. Solid logic.', a user said: 'there are women (and men) who have a baby to save their marriage.\nYou’re right; it’s delusional. But it’s happening on this planet.'",
        "In response to 'We should be doing this every week, as it is what we were hired to do (in most jobs).  I put my hours in and call it a day, every day, unless there is an emergency and have to work late. Even when I work late, I take off early the next day or start later than normal.\nI understand not all jobs have this flexibility, however it shouldn’t be a standard for people to overwork themselves.  This work culture and busy culture is causing so many health issues, and I wish it would improve. I hate to see friends burning out because they dedicate themselves to their job more than their personal lives.', a user said: 'Awesome so bad for our country. Our country needs us to have time for strong families, strong neighborhoods and communities, strong social  groups.\n.'",
        "In response to 'Original Post: I didn't get the promotion. Should I quit or quiet quit? A few months ago everyone in my team was let go apart from me. I was then told I could apply for my old manager's role. I applied but have now been told I didn't get the role and they are going with an external candidate.\nFor these past few months I have basically been doing this promotion role (and have received really good feedback from lots of senior people). I have not gotten a payrise to do all this extra work.\nI want to leave before this candidate starts because I'm tired of giving them essentially cheap labour. I was told if I didn't get this promotion, another role would be made available for me (in the same team), so I would probably have lots of leverage to negotiate a payrise. But I really don't want to have to essentially train this new external candidate who will be making more than double what I earn in the role I didn't get.\nShould I hand in my notice now, do a shitty handover and let the new person flounder? Or should I stay in my role with more money, but be looking for jobs on the side (it could be months and months before I find a good job). If I do immediately quit, I do have savings I could live on for 6+ months (took me years to save this amount).\nWhat would you do? Any advice?', a user said: 'Don’t mess up your reputation with this company.\nDo your job well, negotiate for as much money as you can get, and quietly job hunt.'"
    ]
}