{
    "username": "toronto_programmer",
    "contributions": [
        "In response to 'This genX is proud of the younger generation.\nI talked about exploitation of the working class when Reagan was busting unions.  Finally, it's improving', a user said: 'I am a middle manager and when I am hiring young people and they ask me for advice I straight up tell them \"don't expect to work here forever, always do what is best for you\" and most of them have this shocked look on their face.\nListen up kids, I have been at this company for 15+ years, they will fuck you over just like everyone else here.   Stay as long as you are getting the bag otherwise look elsewhere\nIn reality this is just late stage capitalism taking hold.  For years companies have pushed the envelope to hold hand over employees.   Uncertain hours, low wages, no benefits etc and employees are pushing back.  A lot of status quo companies (banks in particular) are hemorrhaging talent to the tech giants and not just in the dev space, but also HR, finance etc.  Companies don't know how to react to employees holding power since it is such a foreign concept to them'",
        "In response to 'I work in manufacturing and same thing, we are a stepping stone for hourly employees to go get better paying jobs elsewhere. We have a wealth of experience in the long term employees but we can’t keep anyone new who’s good for more than a couple years. Many of the long term employees are nearing retirement and once they are gone I don’t think we’ll have enough competent people to keep the place running unless things drastically change soon', a user said: 'Look at Amazon, they have long treated employees as disposable commodities but now they have all sorts of internal alarms going off from HR that they have poisoned the well around all of their warehouses and nobody in that community wants to work there anymore'",
        "In response to 'I think employers are having a hard time with the fact that younger generations now hitting their prime in the workforce have way less tolerance for current working conditions.\nThis isn't the 1950s anymore. Wages have stagnated for too long, the cost of living keeps going up, and I'm expected to work harder and faster to make your shareholders more $$$$ while I take a pay cut every year.\nI saw my parents struggle and get sh*t on for their loyalty and hard work. I know what to expect.\nSo yeah, no thanks. You're getting what you pay for.\nI dunno what the solution is, but I don't care. I value my time way more than I value the literal pittance thats provided.\nBetter start getting more TFWs Canadian businesses :p', a user said: 'There was a time where loyalty and hard work meant promotions, raises and a great pension staying with a company\nYoung people realize there is no loyalty on the employer side anymore so they don’t need to be loyal either'"
    ]
}