{
    "username": "toxichaste12",
    "contributions": [
        "In response to 'Use ChatGPT to give you some generic slop.', a user said: 'This sums up most people’s work outlook.'",
        "In response to 'Quiet quiting means you don't care.  If you really are quiet quiting, that is the way you approach the review..  You don't care about anything except having met the minimum requirements.\nIf you are doing the quiet quiting thing, go in there with a flat affect.  Show his all metrics were met.  If boss asks about \"extras\", you just look puzzled Nx say all metrics were met.  We had. A successful year.  When asked about goals for next year, it is all about meeting the metrics for next year. Ask about the metrics for next year, ensure they are reasonable and move on.  Make the meeting be as short as possible.\nHowever, is this the best approach for you?   If you are happy with quiet quiting, then go for it.  The undertone I get here is that you aren't happy with it.  Waiting out for someone to retire is rarely a strategy for happiness.  Just because someone is retirement aged, doesn't mean they will leave soon.  And if they are planning on leaving soon, you usually have an idea. Is your boss in \"countdown mode\"?   If not, this could be like the story of the beautiful woman who married the old man for his money, but the old man outlived the woman's boyfriend.\nIf your boss does retire, do you plan on just turning on again?  Will you be competitive for your bosses position just because you are present?  Will you be a good boss for others at that point in time?  Or will you be perpetuating your boss's legacy because of your attitude?   And do you really think that a new boss will come in, the clouds will clear up and the world will go from black and white to color?  Probably not\nWhat can you do?  Option 1 is to continue to not care.  Think long-term happiness.  Option 2 is to get over it and work appropriately.  Not all in,  but a true contributor.    Prepare yourself to take over and go over your boss's head when needed.  Option 3 is to leave .  Either internally or externally.  But I do understand about staying to achieve retirement benefits.\nWhere do I come from with this advice?  I have a very good direct boss, but assholes above that.  I was scapegoated for some things that went on which I wasn't involved in (like I had documents sig ned by the  higher ups showing they were directly responsible).  I explored leaving even though I had less than your 5 years before achieving a bonus, but the numbers and my family situation didn't work.  I tried quiet quiting, but that wasn't for me.  I partially accepted my situation and started working reasonably and discovered that I was nearly bulletproof.  No one in the chain wantd to dredge up the old events and I can mostly free-run with projects I want to work and avoid most of what I don't want to work.  I would say that most of my job is now things that I actually like doing.  I am very responsive to my boss who I know defended me and has been as good to me as he can be with the constraints placed by assholes above.  And I watch the calendar as months go by with a date circled on my calendar comes closer and closer.', a user said: 'Quiet Quitting with a 5 year horizon is some crazy shit. 18 months maybe but the point of quite quitting is to have a shorter term outlook.'"
    ]
}