{
    "username": "Traditional_Way1052",
    "contributions": [
        "In response to 'Or by a double part time income. Most of the times, depending on country, it's far more benificial (economically) to have 2 part time salaries than having only one full time salary. Ideally parents should both be able to both work part time to be able to support their family financially and have time to spend raising their kids.', a user said: 'But then insurance would have to come from somewhere else....'",
        "In response to 'Yup but those it can just not answer. Beepers were also a thing but expensive and not everyone got one. Plus they were a pain to use.\nCellphones are ubiquitous and its extremely easy to send a text.  Social media is too and some people are silly enough to have their bosses as freinds on it.\nIt is a hell of a lot easier to get a hold of people nowadays.  If a person called you back in the day and someone was on their dial up modem the person calling got a busy signal. That's it no contact. If someone was on the phone busy signal means no contact. Back in the day you used to have freaking cassette tapes to record on your answering machine.\nNow you can text, email, call ,whatsapp, and msg through social media to a device that people have on their person almost all the time. All with low effort.\nIt's not even close to what it used to be like.', a user said: 'And are\nexpected\nto have on their person at all times. Like when I don't answer for hours because I'm just at home and I don't want to be glued to my phone on a day off, even if it's a friend or whatever, it's still considered weird to not answer immediately. Just ugh.'",
        "In response to 'Joining this sub has made me appreciate my Union here in Philly- all those “extras” that you described would be at a hourly rate and not out of the kindest of my heart - good for you !!!!! Reclaim your time', a user said: 'Same in NYC'",
        "In response to 'Got any proof of corporations inventing the term quiet quitting? I definitely saw it on tiktok early on where people were using the term to mean \"doing nothing at your job until someone notices and fires you\".', a user said: 'They may not have invented it but it's definitely taken on a new meaning...'",
        "In response to 'Why would it take on a new meaning that is less intuitive considering its name?', a user said: 'I'm not pretending a grand conspiracy but I will say that, I mean, when I read articles about it they aren't using your definition...\nNo, I'm not going to Google articles to prove it to you. It's the weekend. Do your own research.'",
        "In response to 'We're doing something like that next week; optional and paid by the hour!', a user said: 'Same were having a Halloween dance. I forget the hour it starts but ends at 10pm but it's paid per hour at per session rate. So no one is volunteering...\nThey still call it volunteering when they ask for help because it's our free time.... As in, \"we're looking for volunteers to chaperone or set up the Halloween dance, per session is available.\"'"
    ]
}