{
    "username": "TrashbatLondon",
    "contributions": [
        "In response to 'The phrase “quiet quitting” needs to go.\nBeing paid to do what you do and not letting yourself get exploited isn’t quiet quitting.\nEdit: I appreciate the awards but rather than wasting your money on fake internet points I’d much rather you donate it to a charity which helps people still caught in the industry trap that I’ve talked about below.\nDonate or go any buy some gear from\nThe Burnt Chef Project\n.', a user said: 'This. It feels like propaganda to make people who are doing their jobs feel guilty about not going beyond what they’re paid to do.'",
        "In response to 'Remember Carbon Footprint? This is that', a user said: 'No, its nothing like that.'",
        "In response to 'There is a nuanced balance between ambition and workplace exploitation that gets lost when it's all bundled together under a single phrase of \"quiet quitting\". And much like a lot of things on the internet, the nuance and complexities are lost by people taking a strong extreme stance on it all backed up by confirmation bias examples.\nThe conversation in most UK office environments is pretty sensible now when it comes to additional responsibilities, it's asking the employees what their ambitions are rather than expecting them to do more work or more hours under the threat of being fired or held back. And then you work with them to  provide additional challenge, you give them the old \"exciting development opportunity\" pieces of work, you give them opportunities to grow and demonstrate they can work at another level.', a user said: 'I guess the point is that quiet quitting is being promoted as a phrase created/adopted/championed by the worker, when in fact it is a tool of the management to make the language of doing your job to the level your paid to seem negative.\nI do somewhat disagree about UK office environments being sensible. Lot’s of sectors absolutely glorify the exploitation of their staff.\nBBC even produced this monstrosity that glamourised horrendous working practices\n.'"
    ]
}