{
    "username": "TrashPandaLJTAR",
    "contributions": [
        "In response to 'Got axed but nice payment. Got a better job that does WFH and tells people that they have to clock off at 5pm. Feels like I got out of jail.', a user said: 'I had a similar experience in 2020. Had been quiet quitting for 12 months, ended up taking a new job that gave me a pay rise, lower expectations by a long shot, and a boss who's said to our entire team 'I don't mind if you want to take an hour long nap in your day, as long as your work is done come reporting time'.\nIt's like stepping out of the shade into the light!'",
        "In response to 'Original Post: Quiet quitting, how many people are actually doing this ? I keep hearing this term, just wonder if people are actually doing it.', a user said: ''Quiet quitting' doesn't exist. It's just a term that people use to evoke a narrative response. Either positive or negative.\nIf you're disillusioned and upset with your workplace and workload, quiet quitting has a positive connotation. If you're a boss and you expect your employees to constantly strive and push for more without an expectation of benefit, it's a negative connotation.\nI don't call it quiet quitting, or acting my wage. I call it fulfilling my contractual obligations to the standard required BY those contractual obligations. If it's not in my contract, I'm not under obligation to do it. That doesn't mean I\nwon't\n, but it also doesn't mean I have to. If I want to I'll absolutely go above and beyond. Especially if it's going to help out a colleague. But I don't have to.\nAnd there's that narrative piece. It only really has import if you ascribe to it. I don't either way. It's a lot simpler to be unbothered by that kind of thing when you know you're doing your work to the best of your ability. You either meet expectations or you don't.\nNow if that puts me in the firing line because there are other people who're burning themselves out to bend over backwards for free, well... In the firing line go I. But I'm getting too old and grumpy to worry about that now. I spent years of my life burning the candle at both ends for very little benefit. At the end of the day they'll just replace me with another warm body if my performance isn't what they expect even though they're the ones that wrote the contract haha.'"
    ]
}