{
    "username": "trojan34",
    "contributions": [
        "In response to 'Original Post: Noem quiet quitting social media? Just read this and I see the same thing...', a user said: 'Imagine the outrage if they found out she was a prostitute like the pics of Kamala street walking in the early 90's'",
        "In response to 'One can always tell a MAGAt by the repulsive insults they think are OK.\nBe a better human.', a user said: 'Cope harder soy man'",
        "In response to 'Cope harder soy man', a user said: 'Learn to handle the truth it will keep you off SSRI's'",
        "In response to 'One can always tell a MAGAt by the repulsive insults they think are OK.\nBe a better human.', a user said: 'Your double speak is only impressive to the folks who think like you.\nI posted a fact and you call me a MAGaT.\nAn insult and I'm the horrible person.\nWe support the Constitution of the United States and the Bill of Rights nothing more.\nIt just so happens the fear porn demented pedophile criminals that you support do not.'",
        "In response to 'You referred to the Vice President as a street walker. That's pretty damn awful in a lot of people's books. \"...Fear porn demented pedophile criminals\"?\nWhat does that word salad even mean? Go touch some grass, my dude. The internet has not been kind to your brain.', a user said: 'I spoke the truth and you can't handle it what seems to be the problem.\nBiden is demented, you will find out that he took inappropriate showers with his own daughter, she said under oath that the diary was hers.\nJoe is also a treasonous criminal it's a fact, Ukraine is home to human trafficking and the Biden crime family cashed in.\nThe reason your tax money goes to The dancing homo Zelinski. Your president is the true criminal'",
        "In response to 'If there was any truth tobyour statements, I would have no problem accepting them.\nYou seem to be living in an echo chamber of ugliness. Seriously....go touch grass.', a user said: 'Ok bye now! back to your video game reality.\nOh and make sure to focus on the new Project 25 fear porn. Or maybe some fake Racist cop bullshit to get your attention.'"
    ]
}