{
    "username": "trplclick",
    "contributions": [
        "In response to 'Original Post: Guys, did you realize quiet quitting was over?! [External Link]: https://i.redd.it/6357ek17i7w91.png', a user said: 'Here's the content of it for those with a paywall.\nhttps://www.businessinsider.com/quiet-quitting-already-over-layoffs-jobs-recession-economy-2022-10?r=US&IR=T\nOne of the first documented cases of quiet quitting was a recruiter I'll call Justin. Deep into the coronavirus pandemic, after working 10- to 12-hour days for much of his career, Justin had decided to dial it back on the job. When I spoke with him in February, he had whittled his workweek down to 40 hours. In the ensuing months, he went even further, working as little as 30. Every week he worked a little bit less, freeing him up to spend more time with his wife and their newborn baby.\nIt was Justin, in fact, who helped spark the national debate that's been raging over quiet quitting. After speaking with him and other recovering overachievers, I wrote about how hustle culture, thanks to the job security granted by the roaring economy, was giving way to coasting culture. When a popular career coach on TikTok riffed on my story, the phrase \"quiet quitting\" became something of a new cultural dividing line. You either loved the Justins of the world for striking a reasonable work-life balance, or condemned them as slackers and cheats.\nBut by the time the US was furiously debating his new approach to work, Justin was already shifting gears. Over the summer, as the economy began to slow, he noticed his clients were scaling back their hiring plans. Performance reviews seemed to be getting tougher. Some of his colleagues were let go. \"It made me nervous,\" he told me. \"It hit me that I'm the only one who works in my family.\" So he decided to \"play it a little more safe.\" Today Justin, the OG Quiet Quitter, is back to going above and beyond. He's working 50 hours a week.\nAt the moment, the job market is still strong. But with job openings down by 15% since March's record high, it's clear that the frenzy of the Great Resignation is beginning to moderate. After a year of scrambling to accommodate their restless employees, employers are regaining the upper hand. Workers are sensing the shift in the mounting headlines about company layoffs, the budget cuts that are limiting their raises, and the heightened scrutiny of their productivity. The smart ones, like Justin, are adjusting their behavior accordingly.\n\"Reading the tea leaves, we could be in for a difficult 2023,\" Bryan Creely, the career coach who coined the term quiet quitting, told me. \"I wouldn't just quiet-quit and kick your feet up and go, 'OK, I'm good.' It's not the best time to scale back if you have no intention of leaving your company.\"\nCompelled to work harder\nIt's not surprising that coasting culture turns out to be sensitive to the fluctuations of the labor market, given that its predecessor, hustle culture, was born in an age of economic insecurity. In the 1980s, the rise of globalization and a wave of mergers and acquisitions led to a spate of white-collar layoffs. The postwar promise of stable, lifetime employment was over. \"Because of this risk, people felt compelled to work harder and become indispensable,\" says Mary Blair-Loy, a professor of sociology at the University of California at San Diego who has spent her career documenting what she calls the \"work devotion schema.\"\nMillennials like me, who graduated into the Great Recession, devoted ourselves to our jobs even more fiercely. We were grateful to have jobs at all, even if we were underpaid and overqualified to do them. We worked nights and weekends to make sure our bosses didn't swap us out with the many, many millions who stood on the sidelines. Even worse, we convinced ourselves that we wanted to overwork — that we toiled long hours not out of necessity but of passion. We were working ourselves to death because we were changing the world.\nIt took something as big as the pandemic to shake us out of that mindset, and to imagine how our lives might change if we stopped putting work at the center of them. But it was the red-hot job market that emerged in the spring of 2021 that really gave workers the chance to live out their liberating new philosophy. Desperate to attract job candidates and retain their existing staff, companies were suddenly crowing about work-life balance and showering employees with paid time off and flexible work schedules. You look burned out, Susan. Take a mental-health day!\nCompanies were also hanging on to every employee, no matter how bad they were at their jobs. At the end of 2021, human-resources managers reported that they were going to \"manage out\" fewer than 2% of low performers, compared with the usual 5%. The national layoff rate plunged to a two-decade low. When I spoke with Justin in February, he exuded the confidence that many employees were feeling about their job security. \"Companies have a vice grip on even their moderately good employees,\" he told me. \"I was like, look, they're not going to fire me. It would take them months to find someone new and train them up. My lessened productivity is better than zero productivity.\" Employees were doing the math — and it added up to less work for the same pay.\n'Turning up the heat'\nThings today look very different. For starters, consider what's going on at the company formerly known as Facebook. As my colleague Kali Hays reported, executives at Meta have instructed managers to bucket 15% of their employees as \"needs improvement\" — HRspeak for \"shape up or ship out.\" CEO Mark Zuckerberg informed his staff that he would be \"turning up the heat\" on performance goals to shed employees who couldn't meet those standards. \"Some of you might decide that this place isn't for you,\" he said. \"That self-selection is OK with me.\" In a telling observation, one employee noted that Meta's moves amounted to \"quiet layoffs.\"\nThe same pattern is playing out elsewhere in the tech industry. Over the summer, managers at Snap were told to put at least 10% of their workers on performance improvement. A few weeks later, the company cut its full-time workforce by 20%. At Google, CEO Sundar Pichai — complaining that the company has become \"slower\" as its headcount has grown — declared that he wanted to increase efficiency by 20%. At Oracle, which let go of hundreds of employees in August and again this month, employees worry that more cuts are coming.\nNationwide, the unemployment rate remains at 3.5%, matching its lowest level since 1969. But that won't last. The Federal Reserve expects unemployment to climb to 4.4% by the end of next year, and Bloomberg's economists now project a 100% probability that the country will face a recession within the next 12 months. Gone are the days of sky-high salary offers from desperate employers. Sensing that they have the upper hand, companies are cracking down on remote work. They're also cutting travel budgets, scaling back year-end parties, and quietly sunsetting the mental-health days they've been lavishing on employees. Not the kind of environment, in other words, in which you want to be seen as giving less than 1,000%.'",
        "In response to 'Here's the content of it for those with a paywall.\nhttps://www.businessinsider.com/quiet-quitting-already-over-layoffs-jobs-recession-economy-2022-10?r=US&IR=T\nOne of the first documented cases of quiet quitting was a recruiter I'll call Justin. Deep into the coronavirus pandemic, after working 10- to 12-hour days for much of his career, Justin had decided to dial it back on the job. When I spoke with him in February, he had whittled his workweek down to 40 hours. In the ensuing months, he went even further, working as little as 30. Every week he worked a little bit less, freeing him up to spend more time with his wife and their newborn baby.\nIt was Justin, in fact, who helped spark the national debate that's been raging over quiet quitting. After speaking with him and other recovering overachievers, I wrote about how hustle culture, thanks to the job security granted by the roaring economy, was giving way to coasting culture. When a popular career coach on TikTok riffed on my story, the phrase \"quiet quitting\" became something of a new cultural dividing line. You either loved the Justins of the world for striking a reasonable work-life balance, or condemned them as slackers and cheats.\nBut by the time the US was furiously debating his new approach to work, Justin was already shifting gears. Over the summer, as the economy began to slow, he noticed his clients were scaling back their hiring plans. Performance reviews seemed to be getting tougher. Some of his colleagues were let go. \"It made me nervous,\" he told me. \"It hit me that I'm the only one who works in my family.\" So he decided to \"play it a little more safe.\" Today Justin, the OG Quiet Quitter, is back to going above and beyond. He's working 50 hours a week.\nAt the moment, the job market is still strong. But with job openings down by 15% since March's record high, it's clear that the frenzy of the Great Resignation is beginning to moderate. After a year of scrambling to accommodate their restless employees, employers are regaining the upper hand. Workers are sensing the shift in the mounting headlines about company layoffs, the budget cuts that are limiting their raises, and the heightened scrutiny of their productivity. The smart ones, like Justin, are adjusting their behavior accordingly.\n\"Reading the tea leaves, we could be in for a difficult 2023,\" Bryan Creely, the career coach who coined the term quiet quitting, told me. \"I wouldn't just quiet-quit and kick your feet up and go, 'OK, I'm good.' It's not the best time to scale back if you have no intention of leaving your company.\"\nCompelled to work harder\nIt's not surprising that coasting culture turns out to be sensitive to the fluctuations of the labor market, given that its predecessor, hustle culture, was born in an age of economic insecurity. In the 1980s, the rise of globalization and a wave of mergers and acquisitions led to a spate of white-collar layoffs. The postwar promise of stable, lifetime employment was over. \"Because of this risk, people felt compelled to work harder and become indispensable,\" says Mary Blair-Loy, a professor of sociology at the University of California at San Diego who has spent her career documenting what she calls the \"work devotion schema.\"\nMillennials like me, who graduated into the Great Recession, devoted ourselves to our jobs even more fiercely. We were grateful to have jobs at all, even if we were underpaid and overqualified to do them. We worked nights and weekends to make sure our bosses didn't swap us out with the many, many millions who stood on the sidelines. Even worse, we convinced ourselves that we wanted to overwork — that we toiled long hours not out of necessity but of passion. We were working ourselves to death because we were changing the world.\nIt took something as big as the pandemic to shake us out of that mindset, and to imagine how our lives might change if we stopped putting work at the center of them. But it was the red-hot job market that emerged in the spring of 2021 that really gave workers the chance to live out their liberating new philosophy. Desperate to attract job candidates and retain their existing staff, companies were suddenly crowing about work-life balance and showering employees with paid time off and flexible work schedules. You look burned out, Susan. Take a mental-health day!\nCompanies were also hanging on to every employee, no matter how bad they were at their jobs. At the end of 2021, human-resources managers reported that they were going to \"manage out\" fewer than 2% of low performers, compared with the usual 5%. The national layoff rate plunged to a two-decade low. When I spoke with Justin in February, he exuded the confidence that many employees were feeling about their job security. \"Companies have a vice grip on even their moderately good employees,\" he told me. \"I was like, look, they're not going to fire me. It would take them months to find someone new and train them up. My lessened productivity is better than zero productivity.\" Employees were doing the math — and it added up to less work for the same pay.\n'Turning up the heat'\nThings today look very different. For starters, consider what's going on at the company formerly known as Facebook. As my colleague Kali Hays reported, executives at Meta have instructed managers to bucket 15% of their employees as \"needs improvement\" — HRspeak for \"shape up or ship out.\" CEO Mark Zuckerberg informed his staff that he would be \"turning up the heat\" on performance goals to shed employees who couldn't meet those standards. \"Some of you might decide that this place isn't for you,\" he said. \"That self-selection is OK with me.\" In a telling observation, one employee noted that Meta's moves amounted to \"quiet layoffs.\"\nThe same pattern is playing out elsewhere in the tech industry. Over the summer, managers at Snap were told to put at least 10% of their workers on performance improvement. A few weeks later, the company cut its full-time workforce by 20%. At Google, CEO Sundar Pichai — complaining that the company has become \"slower\" as its headcount has grown — declared that he wanted to increase efficiency by 20%. At Oracle, which let go of hundreds of employees in August and again this month, employees worry that more cuts are coming.\nNationwide, the unemployment rate remains at 3.5%, matching its lowest level since 1969. But that won't last. The Federal Reserve expects unemployment to climb to 4.4% by the end of next year, and Bloomberg's economists now project a 100% probability that the country will face a recession within the next 12 months. Gone are the days of sky-high salary offers from desperate employers. Sensing that they have the upper hand, companies are cracking down on remote work. They're also cutting travel budgets, scaling back year-end parties, and quietly sunsetting the mental-health days they've been lavishing on employees. Not the kind of environment, in other words, in which you want to be seen as giving less than 1,000%.', a user said: 'But even as the Great Resignation turns into plain old resignation, I don't think hustle culture is ever coming back. America's addiction to overwork wasn't just about the hours we put into our jobs — it was about looking to our careers to provide our lives with meaning and define our identities. Freed temporarily from the shackles of hustle culture, millions of Americans have glimpsed a new way of ordering their lives. \"I don't think that people can forget this reevaluation that they've done,\" Jessica Kriegel, chief scientist of workplace culture at the consultancy Culture Partners, told me. \"We're never going back to pre-pandemic norms.\"\nThat's certainly true for Justin. Even though he's back to working 50 hours, the way he thinks about his job has permanently changed. He no longer talks about work when he sees his friends. He's stopped obsessing over his company's internal rankings to make sure he's at the top. He laughs about Old Justin, who liked to boast about how hard he worked and how busy he was. New Justin may be devoting more hours to his employer, but he's no longer relinquishing his soul.\n\"I learned that too much of my identity and my life was wrapped up in work,\" he told me. \"Even if I am working more hours again, I don't feel that way anymore. It's a relief to have learned those lessons, to have had that wake-up call.\"\nAs soon as the economy bounces back, Justin is determined to return to coasting mode. He doesn't like working 50-hour weeks. He knows he's missing out on the moments he used to have with his wife and his daughter — the mornings together, the swim classes, the late-afternoon strolls. For him, the economic recovery can't come soon enough.'",
        "In response to 'They can't wait to put us all back in 2008 when employers used to gloat about how picky they could be. Fuck that.', a user said: 'It's such transparent scaremongering to try and coerce people into giving their life to corporate overlords. Just disgusting.'"
    ]
}