{
    "username": "True-Maladi",
    "contributions": [
        "In response to 'It's not just a Walmart thing. It's not just an American thing. Look up Chinese \"laying flat\". Happening in western Europe as well. Kinda makes sense too (this is a tangent, you have been warned). Gen x was the first generation to be completely screwed by conglomerates and corporatism. Off shore manufacturing, chain retailers and restaurants, factory farms, etc all exploded in the 70s onward upending the local economies of the 60s and prior. Gen z was raised by gen x and know what they're walking into before they walk into it. Their parents aren't going to hound them for work ethic, they've learned that hard work isn't the cure all solution it used to be.\nTldr; The international corporate economy has taken advantage of a cornered labor market for three generations and are now reaping what they sow.', a user said: 'Man I wish that were true in my case. My dad was just at the tail end of the baby boomers and still hounds me to be the one who gives 110%, be the worker they have to hire two people to replace, nobody notices the mediocre, etc.'",
        "In response to 'I am a tail end boomer like your dad. He is right, in that used to be the best way to get ahead. You are correct in that it doesn't work any more. People don't work for the same company for 40 years anymore either.', a user said: 'Yep. It worked for my dad while I was growing up, heck, even now. He works as hard as he can at his company and when he had major heart surgery his boss paid him through all of it so that we didn't have to worry about how bills were getting paid (he vastly out-earns my mom) and has talked about \"selling\" to him when he retires. It feels like a fantasy just writing it out 'cause I know exactly 0 of any businesses I've ever worked for would be so generous to give full-pay sick leave, let alone anything else my dad's boss has done for him or the family. He used to sponsor me in fundraising events so I could go on trips, and I've met the guy maybe twice in the 10 or so years my dad's worked for him.'"
    ]
}