{
    "username": "trunkNotNose",
    "contributions": [
        "Can we talk about quiet quitting again? Hi,\nI’m a middle-aged associate professor in the humanities at a private university that is thriving as far as these things go. I used to be quite active on this sub, and it helped me both through and past a long period of burnout in 2021–23. Due to some poor thinking and carelessness on the part of administrators, my salary declined last year because I didn’t get as much summer teaching. Downloading my W2 this past week and seeing the impact has kinda wrecked me. I can’t believe at my career stage I earned less in 2024 than in 2023.\nMy immediate reaction is “they pretend to pay me and I’ll pretend to work.” So I’d like to stop saying “yes” to service requests, pushing scholarship through conference presentations to publications, and freeze development on my pedagogy. The issue is that if I pull back from giving a full effort, none of the people who caused this—my unit-level head, staff and admin in the budget office, the senior leadership of the school, and the finance-bro board of trustees—will even notice. But people who have done me no wrong—my students, my colleagues, my department chair—would be impacted. They’d have to pick up my slack, rope others into doing what I currently volunteer to do, get less interaction with their instructor, etc.\nI know this issue has been raised a million times, but please indulge me: what’s the appropriate response to falling salary when for personal and profession reasons switching institutions isn’t an option? How do you frame a decision to pull back to colleagues or chairs you respect?",
        "In response to 'it doesn't really sound like a pay cut just bc you had less summer teaching and presumably more free time..is getting summer teaching an expectation where you are?', a user said: 'Because I did it for 8 years, I did expect to continue doing it. I never counted on it for the household budget, but it was lots of savings and extras.'",
        "In response to 'What was the \"poor thinking\" that led to the loss of the summer class?\nWas it just fewer summer classes taught overall? Or did they assign summer teaching differently?', a user said: 'The asinine way they do accounting meant that for summer teaching the salaries are listed in one place and the revenue is listed in another place, so it was argued that paying me x to bring in revenue that is 12x minus a bit of overhead was not fiscally sound. So we teach far fewer classes in the summer even though demand is still there. Like I said, poor thinking.'",
        "In response to 'You don’t mention your broader financial picture.\nIt sounds as if they didn't fully realize they made less money until they saw their tax form. So the actual money amount didn't matter so much. Plenty of people are in much worse shape.', a user said: 'I hear you on this. The change in income did not take food from my children's mouths. The impacts are in college savings, retirement savings, and feeling that I can buy stuff we don't need. So it is more a question of dignity, and there's definitely some \"breadwinner\" issues here that I have to work through. I know you can't eat dignity but that doesn't make it worthless.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'No, I of course knew that I hadn't earned as much last summer, but it just really stung to see the evidence of it again, and it's going to be bad again this summer.\nIs it lucrative? I'm still teaching in the summer, but not as much, and that \"not as much\" is about 7% of what I earn in a year.'",
        "In response to 'Is going up for Full Prof out of the question?', a user said: 'It's a few years off.'"
    ]
}