{
    "username": "Turdulator",
    "contributions": [
        "In response to 'Yes but many managers do use it as a guiding principal. you know, the sane ones. we do exist.', a user said: 'Yes we do, but guess what? we don’t control the budget for raises, nor do we control the existence of positions available to promote people into.       When the finance department tells you 3% is the highest raise allowed in a year where inflation was over 10%, you are just forced to fuck your team right in ass no matter how “good” they are.     And when there’s no open positions there’s no way to promote someone.\nThe problem often isn’t individual managers, it’s structural. The whole entire corporation is built to fuck it’s employees for profit.'",
        "In response to '\"I'm not going to go above and beyond, I'll do my job and that's all\"\nYeah, and that's exactly what they were hired for. Their job. People who go above and beyond are the people who get promoted to the next position. This has always and will forever be the case.', a user said: 'People who go above and beyond are the people who get promoted to the next position.\nThe problem is how often this just isn’t true, why would a manager promote their highest performer off their team?  I’ve seen way more often that the people who get promoted are the ones who do slightly above average work who are also really good at schmoozing and office politics…. The ones who blow away everyone else’s workloads are the ones who just end up doing more work than other people for the same salary.\nI’ve seen this at many different companies…. I’ve moved up 10 times in my career, 8 of those times I got “promoted” by quitting and going to a different company at a higher level position. At one job I was promoted twice, and then laid off because they replaced the entire department with workers in Central America… who had half the performance, but for less than a third of the cost.\nThe most common reward in corporate America for doing more work is just having more work assigned to you. And the fastest way to grow your career and/or salary is to quit for a new company every few years. (This is entirely the fault of employers, who are almost all willing to pay new hires significantly more than they willing give current employees raises)\nThere’s no reason to be more than 1% better than your coworkers.    Cuz you are still the best on your team…. Being 20% better doesn’t get you anything more other than burn out.   (The only exception here of course is commission or piecemeal work, where your pay is directly tied to output….. but even commission jobs, once you hit the commission cap for the month, there’s no reason to do even 20 minutes more work until the next month starts)'"
    ]
}