{
    "username": "TurtleDive1234",
    "contributions": [
        "In response to 'I call it \"pretirement\"', a user said: 'I’m stealing this. Thank you!'",
        "In response to 'Original Post: Quietly quitting When I first heard the term 'quiet quitting' I needed to understand more of what that meant. Now that I know, I think that's me right now.\nI've been working the same job for 10 years at a major global electronics company, a name all of you would know instantly. It's a good job, it pays well, it's low stress with great benefits. I am good at what I do and my co workers are cool.\nAnd I don't give a fuck anymore.\nI stopped trying to advance. I stopped going the extra mile. I stopped being the one offering input at the weekly meetings. It just doesn't get me anywhere after all these promises of working your way up the ladder.\nI realized I hit a peak a few years ago and no matter what I do, or how hard I work, it doesn't matter. Upper management are mostly ambitious borderline sociopath MBA career climbers who are all young enough to be my children. They all give a creepy vibe almost like a politician who acts like they care about you, then they talk shit behind your back.\nSo I still do my job but I do the minimum amount required not to be noticed. I don't report errors on our website, I don't correct people when they are wrong. I just don't, period. The biggest thing that put a target on your back here is attendance, like even clocking in 1 minute late gets you on the tardy report that goes out once a week but I never have a problem with that, and quite honestly it blows me away how many co-workers just can't seem to get here on time because we aren't in a giant metropolis with lots of traffic. Usually the younger co-workers are the late one.\nI am in my early 50s and I've spoken with my immediate supervisor who is two years older than me about this, and we're both in agreement that we're too old and lazy to want to start over, so we'll just coast here as long as we can.\nAnyone else feeling this?', a user said: 'Oh…oh YEAH. This comment really resonated with me. My idea of self used to be very tied into my profession. It just isn’t any more. I still care about the population I work with but my threshold for fuckery is on the floor. I can truthfully say that I have had a very real, solid, positive impact on quite a few people in my professional life and I’m satisfied.\nNot only do I NOT want to advance (mind you, I was only in the corporate world for a blip), I’ve realized that I don’t have the energy to even push back when upper management does something I think can be done better or is in conflict with organizational ideals. I simply don’t have the energy for it.\nI have my limit, and thankfully, I don’t have to be a slave to my job. I don’t need a McMansion to be happy and this is incredibly freeing. So, much like with relationships, if a job damages my calm too much, I’ll just bounce. No muss, no fuss, and no hard feelings.\nI’m good with coasting until retirement. Fuck, I’m good with coasting the rest of my life. There are creative things I’d like to do, and I’ll likely do them at some point, but being a wage slave is not one of them.'"
    ]
}