{
    "username": "TurtleneckTrump",
    "contributions": [
        "In response to 'Sometimes the opposite is true. You have a skillset they don't have. In my opinion it's easier to hire a manager than it is to find senior -insert job role-. You are too valuable in the role your in, promoting you to a manager means they lose you in the job you were doing and now have to backfill. Of course if your valuable to them they need to figure out how to show it.', a user said: 'And in that case, you obviously need to be paid more than said manager'",
        "In response to 'Original Post: I didn't get the promotion. Should I quit or quiet quit? A few months ago everyone in my team was let go apart from me. I was then told I could apply for my old manager's role. I applied but have now been told I didn't get the role and they are going with an external candidate.\nFor these past few months I have basically been doing this promotion role (and have received really good feedback from lots of senior people). I have not gotten a payrise to do all this extra work.\nI want to leave before this candidate starts because I'm tired of giving them essentially cheap labour. I was told if I didn't get this promotion, another role would be made available for me (in the same team), so I would probably have lots of leverage to negotiate a payrise. But I really don't want to have to essentially train this new external candidate who will be making more than double what I earn in the role I didn't get.\nShould I hand in my notice now, do a shitty handover and let the new person flounder? Or should I stay in my role with more money, but be looking for jobs on the side (it could be months and months before I find a good job). If I do immediately quit, I do have savings I could live on for 6+ months (took me years to save this amount).\nWhat would you do? Any advice?', a user said: 'If they didn't find you fit for the role, you are obviously not fit to train the new candidate for said role either. I don't see how they can argue against that. Don't train the hire in anything involving the new role. When the training is done, you document how much they have to come to you for help doing their job. Either they won't ask for your help because they actually were a better fit for the job, or you can go demand a big fat raise, maybe even to get their position also'"
    ]
}