{
    "username": "twistedlimb",
    "contributions": [
        "In response to 'Original Post: funny that quiet quitting is even a term... [External Link]: https://i.redd.it/7tpkh1cisgj91.jpg', a user said: 'this phrase needs to be banned from this sub...\"doing your job\" or \"working as directed\" are the only descriptions workers should give.'",
        "In response to 'I read a nice alternative recently; \"acting your wage\".', a user said: 'i still think it is bullshit- \"you're the boss, you give me tasks to do.  if you want me to do something else, we can renegotiate.\"\nacting your wage is just another cutesy bullshit term to once again place blame on the worker, as if they aren't trying hard enough to maximize their owner's wealth.  you wanna be the boss, be the boss.  don't blame somebody else because you're not a good enough leader.'",
        "In response to 'Maybe I'm mistaken in my interpretation of it. I worked for a big supermarket chain for years and there was a definite environment of pushing the idea we all work for the \"team\" and missing breaks, working for free beyond your shift, going out of your way to help the company look good etc. I was young and naive, gave up so many hours of my life stressing to help out a corporation that would replace me in a heartbeat and not gaf. So when I see \"act your wage\" to me it means \"don't cave in to pressure to work beyond what you're being paid for.\"', a user said: 'nobody ever even heard this term a month ago.  it is complete bullshit being pushed by the ownership class to make workers feel like they should be responsible.\nthe boss pays, they describe the job, the worker does it.  any deviation that somehow puts the responsibility on the worker to decide how to run the business while the owner keeps all the profit is complete propaganda, and engaging with it seeks to legitimize it.'",
        "In response to 'I posted this as a reply in a different thread. In Canada we (at least myself and people I know) call it work-to-rule:\nhttps://www.theglobeandmail.com/canada/article-ontario-teachers-unions-prepare-for-challenging-round-of-negotiations/\neducation unions had been engaged in job action – ranging from work-to-rule to one-day strikes\nhttps://www.cbc.ca/news/politics/border-workers-work-to-rule-begins-1.6131898\nBorder service officers have begun work-to-rule action while unions and the government continue to negotiate a new contract.\nhttps://www.cbc.ca/news/canada/manitoba/nurses-voting-possible-strike-1.6055533\nA vote does not mean a strike will happen, and nurses must still provide care since they're deemed essential service providers, even if they choose to strike.\nInstead nurses will begin refusing to do non-essential tasks, like answering phones or transcribing doctors' orders that day, Jackson said.\n\"It's going to be very, very low-key, it's going to be minimal disruption for patient care and for nurses,\" Jackson said.\nAll of these sources pre-date Quiet Quitting.', a user said: 'working to the rules is used in the US as well.\ni'm not a fan of cute nick-names that blame employees for failures of business owners.  they want to be the boss, so take responsibility for being the boss.\nthere is another term i am forgetting right now which was fairly popular at the beginning of the pandemic...something where your boss tells you to do something but you know it will break/ruin something, but you're liable for the results.'",
        "In response to 'Malicious compliance.', a user said: 'right yeah- there is an entire sub dedicated to that term.  thank you.'",
        "In response to 'In general (at least from a Canadian perspective) the cute names seem to be so dumb people can remember them. My first reaction to 'quiet quitting' was 'why are they changing the name?'.\nI'm also convinced they're trying to add in 'quiet firing' to keep people from Googling 'constructive dismissal' instead. lol\nEdit: I'm blanking on that term you mentioned but it rings a bell.', a user said: 'my opinion on the strategy here is if people actually quit, they'll get higher pay increases.  if they stick around, they'll stay at the same wage and the boss will slowly extract more work from them.  it is a way to maintain the status quo.'",
        "In response to 'Yeah i only heard it in the last week or so myself, I obviously interpreted it wrong lol no need to be so defensive', a user said: 'no i'm not saying it is your fault- corporate media is a $100 billion dollar behemoth, so we need to be wary about, \"this new thing EVERYONE is doing\" when really a PR team came up with it to make encourage workers to stop asking for increased salary and going to different companies.\ni just want to remind people who maybe are new to the labor movement that terms EVERYBODY is using, are bullshit corporate speak to re frame the narrative.  it is just as reasonable to call a state \"free fire\" state rather than at-will.  it is normal to say \"anti-union\" rather than right-to-work.  (politicians name these bullshit things into laws, we're chumps for using the same terms.)'",
        "In response to 'doesnt \"act your wage\" mean  don't do anything outside of your job description ,  otherwise the boss/ wonder is getting free work ?\n​\nlike if im a shelf stocker.  and im asked to work on scheduling or  running the forklift.  things that get paid more ,  I should only do the things im paid for ?', a user said: 'just wondering why we need a cute term for it that blames the employees, rather than saying, \"the boss doesn't hire enough people\" or \"management under staffs\"?'",
        "In response to 'I don't see where it blames the employees at all.  I've only seen it used in a context of workers pushing back against the \"quiet quitting\" term, like it means the worker saying, I'm not going to be doing any more than what we agreed unless you pay me more.  You seem to have a different interpretation from what I've seen.', a user said: 'both of these terms were made up in like the last two weeks.\ndo you think it is from the labor movement, or from something else?  if it is from something else, my guess is it seeks to undermine the labor movement, using a cute term.\ni really want to encourage everyone on this sub to stop using terms the ownership class chooses for the labor movement.'",
        "In response to 'I think the bigger implication with \"acting your wage\" is \"You pay me next to nothing, I do next to nothing\", or to replace it with another cutesy term \"slacking will continue until wages improve\". Not just changing the term, but putting the onus on the business for not giving proper compensation instead of acting like it's the employees choosing to step out of line.\nI don't think it necessarily works from this angle of \"the company is falsely advertising by making me do work they didn't put in the job listing\", but I don't think it was intended to.', a user said: 'to me it seems like a very clear way to blame the employee while maintaining the status quo.\nactually quit, get a higher paying job, and all employers are pissed off.'",
        "In response to 'actually quit, get a higher paying job, and all employers are pissed off.\nTo me, that sounds like much more like putting the blame on the employee than any term for doing less work on the job.\n\"If you don't like it, just leave and find a better job\"? Well what if those jobs don't exist? What if every company is paying garbage and overworking their employees? What if the boss just has such a large pool of potential workers that they don't care if you quit? What if you're in a specialized industry and it's hard to find another job that uses the same skills as your current one?\nIn the real world, one that's not a capitalist fantasy land, that's the reason Unions exist. It's why picketing, strikes, and slowdowns (the actual term for \"quiet quitting\" that didn't come from TikTok) are a thing: because sometimes workers need to be able to directly hit their boss in the wallet to make change happen and get the compensation and treatment they deserve.', a user said: 'for sure- work to the rules or work slow downs are fine.  i think \"quiet quitting\" has nefarious intentions and i dont think we should endorse using that term.'",
        "In response to 'On that we're in agreement, though I'd also point out that it's extremely misleading as a term. \"Quiet quitting\" sounds like a term for deserting your post, not doing less work while on the clock, so I wouldn't be surprised if this is part of an effort to paint this as a new \"labor shortage\" crisis so companies can widen their recruiting pool and/or slash wages and thus lower labor costs.', a user said: 'exactly.  work to rule is fine by me, but employers trying to blame the employees for not extorting themselves is bullshit.'",
        "In response to 'Nah let’s talk about quiet firing. When your employer doesn’t give out bonuses, regular pay raises, improved benefits, extra days off. It your job is just doing the minimum they agreed to when you took the job they are quiet firing you.', a user said: 'yeah that works.  that is a conversation to have for sure- every month inflation goes up and you make the same, you're getting paid lower and lower.'",
        "In response to 'It would be nice if people stopped promoting the current attempt to redefine the term.\nQuiet quitting had been used to describe giving up on your job without resigning. It usually accompanies the search for a new job.', a user said: 'check here- doesnt seem to be literally anywhere in the world as of 2019?\nhttps://books.google.com/ngrams'"
    ]
}