{
    "username": "Tyranothesaurus",
    "contributions": [
        "In response to 'We're already doing cable again. At one time the big problem was cable companies bundling the one chanel you wanted with 23 junk channels (and usually 2 or 3 yet another shopping channels) and charging for all 23 rather than offering alacarte.\nThen streaming services came about offering everything for less than the cable company charged and without commercials.\nNow we have an ever growing number of streaming services offering an ever shrinking catalog of shows (as a bundle). And commercials have gotten back in as well though (for now) you can pay extra to avoid them.\nSo the big change is that now instead of adding package XYZ for that one channel you want it's adding streaming service XYZ for that one show you want.', a user said: 'I used to have Cable, then dropped it for Netflix and Hulu. This was damn near 10 years ago now. I ended up with Amazon Prime also during the Pandemic, but now have no subscriptions. I just watch what I want for free, no commercials on streaming sites.\nUntil this country gets its shit together and stops penalizing the consumer for every little thing, I'm not supporting any of the services beyond internet.'",
        "In response to 'It amazes me that people spend money on cable, Netflix, or Hulu. There's so much free stuff. It's not like the old days where everyone watched a show together and you wanted to be able to talk about it (with rare exceptions). I find so much fantastic stuff just on YouTube (though I like comedy, cooking, and true crime, of which there is an abundance).', a user said: 'Right?\nWay I see it, if companies only want to pursue profits, then I can pursue not adding to their profit margin.'",
        "In response to 'Quiet-firing must be allowing employees to go for years with hardly a bump in compensation.', a user said: 'The last kitchen I was at pulled this one on me, and it took too long to realize it. I started in 2013 at $10 as a cook. I quit in 2017, still a cook, and making $11.\nReason for quitting? New hires were coming it at $13-$14 depending on experience. My pay? Still $11. When I brought it up to management, met with \"not in the budget\".\nThey asked if I was putting in my two weeks. I told them I was putting in my two minutes, went to the timeclock, signed out, grabbed my shit and never looked back. My next job was fabrication and I started at $16, so it was a great choice.'"
    ]
}