{
    "username": "Tyrilean",
    "contributions": [
        "In response to 'What's interesting about this sub is that you can really watch the coordinated response of the capital class in real time. First we saw articles about the \"problem\": wages are up, workers are at home. Then we saw the response happen in waves. Employers tried to force workers back but people just started quitting for other jobs. Now we see a new response. WFH is actually bad for workers. It ruins your health and mental state, etc.. Then people like Elon came out vehemently against wfh which was yet another signal to the capital class that it was safe to come out against wfh (especially as the pandemic got better). Now they are attacking the main wfh pillar ('productivity was unaffected') with this quiet quitting bs. Employees have always done the minimum whether they were in the office or not. I've seen employees not even do their jobs and just wait to be fired in a few weeks while collecting a paycheck. This isn't new but what I've seen is that there are fewer wfh tech jobs being posted.\nI hope most people on here took advantage of the last year to upgrade their position and their salaries (I certainly did). Frankly this sub is great for understanding the labour market and constantly position yourself to take the most advantage of your situation.', a user said: 'The thing that drives me crazy is that I could almost understand if the data showed working in the office lead to more productivity or profitability. The problem is that I don't really see why the capitalist class doesn't want us working from home. Other than the executives that own corporate real estate so they can legally embezzle money from the company, but you wouldn't think they'd be organized to this degree.'",
        "In response to 'Original Post: The corporate owned media the last few days is losing it over \"quiet quitting\". just remember - do the absolute minimum required by your job. they cant do shit. [External Link]: https://i.redd.it/hqym09xm89j91.jpg', a user said: 'It's ridiculous to me that \"doing your job to the letter of your duties\" is called \"quiet quitting.\" Doing tons of unpaid labor is so commonplace that doing your actual job is a form of quitting, apparently.\nIt's weird that it's a new \"trend.\" I've been doing this for years. Learned a long time ago that doing 2x the work of your colleagues just gets you more work, no extra pay, and locked into your position so hard that you can't be promoted. Now, I just finish my work in half the time, and spend the rest of the time doing whatever I want.\nAlso, \"shamming\" is a time honored tradition that's been around since shift work has existed.'"
    ]
}