{
    "username": "Tzokal",
    "contributions": [
        "In response to 'Why is there an expectation to go above and beyond? Because that's what a lot of us were taught, by parents, grandparents, what have you. You bust your ass, go above and beyond, bend over backwards and you'll be rewarded for it, which was great... decades ago when it actually worked. For four years I've busted my ass for a small grocery store, and it's gotten me nowhere. The way things used to work is dead and gone, along with any hope us younger folks have of living a life our parents did. There's no houses in our futures, no benefits, no retirement, and for a lot us, no health/dental insurance.\nIt surprised my manager to learn that the only reason I show up now is a paycheck and that's it. I don't care about how neat and tidy the shelves are stocked, how straight the rows of carriages are, or how clean the store is. If it isn't in my job description, I'm not doing it. Don't like it? You can try and write me up, but I'll walk out the door so fast it'll make your head spin and never return because I have nothing to lose. That's one of the best things about getting no insurance through my employer, no 401k, or benefits at all. Firing me would be doing me a favor because I could go somewhere else, and get all the shit they were too greedy to give me.', a user said: 'Exactly, I learned the hard way over decades of working that being a doing extra work meant I got more of it.  Being the \"go-to\" or the \"lead\" or whatever always meant more and more kept coming my way.  And my reward?  When and if I got a raise...1-2%.  Which was virtually the same as those who barely showed up or disappeared for hours in the middle of the day doing who-knows-what.  Hard work doesn't mean anything anymore when all you are is a \"full-time equivalency\" (i.e. a number in a \"Human Capital Management\" system.  You're not a person, not even an \"employee\"...you are \"human capital\".  That's it.  Your job should be nothing more than a paycheck.  Ever.  You are NOT your job, stop acting like it.'"
    ]
}