{
    "username": "Ugly_Eric",
    "contributions": [
        "In response to 'Tuosta savuttamista oma näkökulmani:\nPuhut pelkästään työntekijästä, jonka\ntyönsuorite\nei miellytä. Tosiaan näitä tapauksia on, en tiedä missä määrin, mutta rohkenen arvaamaan, että siihen verrattuna  mistä aion puhua, niitä on vähemmän.\nVähän taustaa:\nOlen ollut osallisena saavuttamiseen, enkä kadu sitä yhtään. Olen yksikön johtajien sekä HRn kanssa yhteistyössä tahallisesti ja tarkoituksella yrittänyt saada 4 eri henkilöä omasta tiimistäni lopettamaan tai vähintään lähtemään toiseen yksikköön, jossa he saattaisivat \"pärjätä paremmin\".\nKolme neljästä onnistui, ja tämän neljännen hankaluudet loppuivat, kun viimeinen muista siirtyi muualle. Viidenteen en suostunut, sillä näin hänessä potentiaalia parantaa tapansa ja pystyin keskustelemaan hänen kanssaan järkevällä tasolla. Hän kuitenkin otti loparit elämänmuutoksesta johtuen, joten johto lakkasi minun painostamisen.\nPointti:\nMainitsemani työntekijät suoriutuivat työstään enemmän tai vähemmän hyvin, osa jopa toisinaan erinomaisesti. En kuitenkaan voinut panostaa liikaa heidän kehitykseen tai suositella heitä korkeampiin asemiin, sillä he olivat erittäin toksisia ihmisiä. He ns. myrkyttivät osastoamme ja sitä kautta koko yksikön hyvinvointia. En mene tarkempiin detaljeihin, mutta kyse oli useammasta menetelmästä kuinka he käänsivät toisia tosiaan vastaan, saivat jotkut jopa itkemään työpaikalla, levittivät vihaa, epäluuloa, kateutta, jne. Ei edes yritystä kohtaan, vaan ihmisten välistä.\nToki eräs oli vain aivan tajuttoman ilkeä kaikkia kohtaan.\nOlimme kaikkien kanssa keskustelleet näistä asioista, sen verran mitä työantajan on laillista puhua toisen henkilökohtaisia asioita/puolista lipovista asioista. Monta vuotta yritimme kaiken moisia eri tapoja, mm. työympäristön, työtehtävän, vastuun määrän, työkavereiden jne.jne. muuttamalla.\nLopulta ainoa tapa miten näimme voivamme parantaa koko muun toimiston hyvinvointia oli päästä heistä eroon.\nVihatkaa minua tai mitä vain, mutta meidän toimistosta ja koko yksiköstä tuli aivan erilainen maailma, kun viimeinen lähti talosta. Kyllä se vain on, että yhden henkilön hetkellinen hyvinvointi ei mitenkään ole tärkeämpää, kuin sen 100+ muun.\nTLDR:\nSavustamiseen on muitakin, ehkä painavempia, syitä, kuin tyosuoritus. Mm. se, että he vain ovat paskoja ihmisiä, eivätkä suostu parantamaan tapojaan. Savustaminen voi olla monen muun ihmisen hyvinvoinnin suojelua.', a user said: 'Tämä!\nNäissä keskusteluissa asia usein ajatellaan vaan työssä suoriutumusen kautta ja unohdetaan sosiaaliset aspektit. Esimiehet vastaa koko TIIMIN tehokkuudesta. Siinä yksi myrkkyperse saattaa helposti tuhota kymmenien ihmisten työt. Siksi savustamista tehdään.\nItse olen pari kertaa tylysti ostanut ulos porukkaa. Toisessa tapauksessa oli rikkeitä, joihin oli helppo vedota. Toisessa tapauksessa monien keskusteluiden jälkeen (hr ja luottari oli messissä) ilmoitin työntekijälle, että hän ei ole enää huonenna tervetullut työpaikalle. Tarjosin kolmen kk liksan, normi irtisanomisajan palkat jne ja työvelvoitteen välittömän loppumisen. Sai keskustella luottarin kanssa. Jos halusi, niin oltais voitu heittää käräjäkierros, jonka oisin hävinnyt lopulta, mutta hänen saama summa ei olisi merkittävästi muuten muuttunut, kun että käräjöontikierros kestää äkkiä pari vuotta, joka olisi pidentänyt maksuaikaa.\nMuutenkin vituttaa, kun työnantaja ja työntekijä asetetaan ay-liikkeen lobbauksesta vastakkain. Vaikka kaikki voittaa, jos kaikki pelaa samaan maaliin.'"
    ]
}