{
    "username": "Uncooled",
    "contributions": [
        "[The Philippine Star] \"Quiet quitting\" is taking over the workplace – what exactly does it mean? [External Link]: https://i.redd.it/0rs7ss5twrj91.png",
        "In response to 'I'm not sure about the \"taking over\" but the government and some of their employees have been \"quiet quitting\" for a long time now.', a user said: 'Yeah there's a lot to be said about our government but I find the performance and morale of government workers a complicated topic. Marami sa kanila ilang taon nang contractual tapos walang benefits. Minsan underpaid pa. Matagal bago taasan ang sahod. Kapit na lang for the job security.\nETA: Not saying government incompetence should be tolerated. I'm just pointing out that government workers can be victims of unfair labor practices, too.'",
        "In response to 'To be fair, maraming di maregular kasi maraming di qualified gaya ng pagpasa sa Civil Service Exam.', a user said: 'True. There's a lot to unpack there tbh. 😅'",
        "In response to 'Quiet quitting is such a corpo bs term. When you buy 1kg of rice, you pay 1kg peso worth of money. If the vendor decides to give you extra kg, then that's called a promo. Now when employees give services for what they're paid for, they call it quiet quitting?\nEh, just call it \"quielty doing your job\". Any extra is just a promo and should not be expected as a norm.', a user said: 'I completely agree. We should all be \"quiet quitting,\" to be honest. I know people that perform a lot of tasks outside their JD but do not get anything in return. Literal na recognition lang. Ang convenient pa ngayon for most companies to use the pandemic card to justify laughable or non-existent salary increases.'",
        "In response to 'it simple. they get what they pay for.\ntas pag nag resign to pursue higher pay, bigla sila mag counter offer with higher pay.\nif they can give it you now now you're resigning, why not give it before.', a user said: 'This reminds me of so many people haha. The problem with this is the possibility that, after you accept the higher pay they offered during your attempted resignation, it will take them a couple of years again to give you another salary increase. Kasi ang dahilan nila, pinagbigyan ka na nila dati (kahit ilang years na rin yung lumipas). Tapos ikaw naman, magaattempt na ulit magresign (or baka hindi ka na magresign because of age, for example). Parang toxic relationship haha.'",
        "In response to 'yep, been doing this for a long time actually, now it has a term. glad to know, lol.', a user said: 'I saw plenty of commenters in other platforms argue that it is just a term for going against unfair treatment and compensation. Others suggested the term \"acting your wage.\" Witty haha.'",
        "In response to 'Original Post: [The Philippine Star] \"Quiet quitting\" is taking over the workplace – what exactly does it mean? [External Link]: https://i.redd.it/0rs7ss5twrj91.png', a user said: 'Full story at\nhttps://philstarlife.com/news-and-views/483698-quiet-quitting-at-work-feature?fbclid=IwAR1DP9-aZAGBq-akVKYWZzHOkG-HMgb\\_RIcbGBqkI4kGr404JpbxqztTyu0'",
        "In response to 'This stupid forking term has now invaded here as well. I'd rather not have this be spread, sorry OP.', a user said: 'Yeah it's a stupid term. Fortunately, Pinoy socmed seems to feel the same, based sa mga nabasa ko, and it's starting a conversation about current labor practices.'",
        "In response to 'I think they just rehashed the usa story of quiet quitting, pero different work culture nila from us, hahaha really hate the media or personality echoing mga western problem without even thinking if applicable ba sa atin', a user said: 'Feeling ko actually applicable naman sa atin. It is common here for employees to do tasks outside their JD simply because \"inutos ni boss\" or dahil ayaw nila mapag-initan or masabihan na kj (e.g. pagoorganize ng team building at year-end parties). Yung isa kong naaalala sa previous company ko ay yung madalas ipinapasa nung boss yung managerial duties niya sa isa niyang empleyado kasi madalas siya magleave nang matagal for vacation (leisure). Afaik, that employee got absolutely nothing.'"
    ]
}