{
    "username": "UniqueUsername82D",
    "contributions": [
        "In response to 'You're not quiet quitting, you're Working To Rule, which means you are abiding to agreed upon terms. Our employers are trying to extract more out of us than we signed up for and not compensate us. There's nothing wrong with you not letting them exploit you.', a user said: 'Came here to say this. Idk how people don't see the negative connotation of \"quiet quitting\" against the person using the term.\nIt's \"doing my job.\"'",
        "It's NOT \"quiet quitting!!!\" \"Working your contract,\" \"working to rule\" and \"acting your wage\" are all MUCH better terms. Why would you use the word \"quit\" to describe you adhering to your contract and doing your job? It has nothing but negative connotations AND denotation.\nI highly encourage everyone here to lose that term. We're working our contracts. We're not quitting anything. Some may STOP giving away their physical and/or emotional labor, but that's not the same as quitting!\nEdit: For those of you saying \"It's called 'doing our job'\" The implications of teachers \"just doing our job\" are:  volunteering for events, grading/planning at home, taking over other  peoples' responsibilities, adding more to your plate every year, etc...  Admin considers this \"just doing your job.\"",
        "In response to 'I agree that quiet quitting and sticking to your hours are two very different things.\nWorking under your contract hours is just... working. 🤭', a user said: 'Proudly \"getting by\" lol'",
        "In response to 'Quiet quiting is a propaganda campaign by PR departments to make people who work a normal amount seem lazy.', a user said: 'Yep, and they love to see employees put it on social media.'",
        "In response to 'I prefer to call it “doing my job.”', a user said: 'See my edit'",
        "In response to 'I’m so sick of all this nonsense. Just work what you feel you’re capable of and don’t burn yourself out? Like. Be a reasonable person.\nSome people are fine doing some work on Sundays and that makes them happy. Some won’t work a minute past contract and that makes them happy. BOTH CAN EXIST you ding dongs.', a user said: 'BUT, admin points towards the people who work outside their contract hours as the \"baseline\" expectation.'",
        "In response to 'I used to plan when kids were doing independent work. I would grade when kids were doing independent work. And if I got behind on grading everybody got a hundred for turning it in. It is what it is. We changed the world by being there for kids and showing kids that we care. We Don't change the world by grading every single answer.', a user said: 'Oh yea. If I'm getting behind, sometimes I'll blanket 100 as a completion grade. The kids deserve timely grades and if I don't have the time for them to be accurate, they'll at least be complete.'",
        "In response to 'I always looked at it as you are quitting working outside of your job description/contract. You are not quitting your actual job (that would be \"loud\")  you are quitting the quiet part (the part that isn't actually stated).', a user said: 'The problem is the word \"quitting.\" Both in connotation and denotation. It does not come across well in any form.'",
        "In response to 'While I understand your points, I am just not understanding why some people are so very triggered by this phrasing?', a user said: 'It has the word \"quit\" in it. If you can't see how others can use that against you, I don't know that I can scaffold it.'",
        "In response to '…or just working.', a user said: 'But for our profession the implications of \"just working\" are: volunteering for events, grading/planning at home, taking over other peoples' responsibilities, adding more to your plate every year, etc... Admin considers this \"working.\"'",
        "In response to 'Whose profession? Not mine.', a user said: 'You are very fortunate to not even be aware of this. Where do you teach?'",
        "In response to 'How about just 'work'.\nYou guys overcomplicate everything.\nIf someone is doing extra, that's extra. You're doing yourself a disservice by creating another name for what should be normal/baseline.', a user said: 'Where... do you teach? \"Just work\" is never the baseline in ed.'",
        "In response to 'Anti-Work people are all over it\nI’m a bit confused by your phrasing, are you saying they’re using the phrase a lot, or that they’re “over it” as in not falling for it?\nIf anything they were the first to call it out as a manufactured phrase used to shame workers\n, I haven’t seen many people actually latching onto it as a regular terminology beyond calling it out.', a user said: '\"anti-work\" itself is one of the worst names that movement could have chosen. It goes hand in hand with \"quiet quitting.\"'",
        "In response to 'The subreddit started as being legit \"anti-work,\" but has shifted now to a more pro-employee, work reform mindset, but too late-- the branding was already done.', a user said: 'I didn't hear about it back then, but now they have to start every statement with, \"We're not really anti-work, we just want...\" Like re-brand my guy!'",
        "In response to '/r/workreform\nis better IMO', a user said: 'Muchhhhhhh!'",
        "In response to 'You're not \"\"quiet quitting,\"\" you're working your contract. Good on you.', a user said: '\"Working your wage\" or \"working to rule.\"\n\"Quiet quitting\" is a complete misnomer and needs to be taken out of our vocabulary. It is a phrase loaded with negative connotation. No one is doing any kind of quitting.'",
        "In response to 'I have this problem, too (in year 17). Part of the problem is four preps. All are grading -heavy ELA. I just can't seem to get the groove where I'm not spending 10 - 12 hours outside of school to keep up. I do leave the building and say no to anything new, but I have to take work home or it doesn't get done. And I don't grade everything, participation and spot checking for as much as I can. There just aren't enough hours.', a user said: 'The most preps I've had so far is three. But if I was assigning a grading-heavy piece (project or essay) for one prep, I'd make sure that the two days after the due date I had another class doing something work-intensive so I could spend most my time in class grading.'"
    ]
}