{
    "username": "unknown_lamer",
    "contributions": [
        "In response to 'What about 6 hour work days? It would be a 30 hour work week. There could be four shifts for a work day. You get two extra hours a day for the same pay. Our societies are already set up for a five day work week. This makes more sense to me. For a four day work week, which day to you take off? Monday? Friday? Maybe Wednesday and split up the week?', a user said: 'A six hour work day would be great (and an hour lunch should be folded into that instead of weirdly tacked on as if you were actually free to use it as your own time and not just refreshing yourself to work the second half of the day). A six hour day and a four day work week would be even better. I think there have been very small studies showing that is ideal and most workers aren't actually putting in more than that, they're just trapped at their desks or in an office for the rest of the 45h instead of living their lives (and their output suffers because of it, although I suspect the capitalist overlords are less interested in a marginal increase in output to skim profits from than keeping people tired so they don't organize new social structures and realize the capital class serves no purpose).\nI think most office work could be done M-Th and businesses could largely be closed on Fridays. For service and support and retail jobs, those businesses are already used to managing multiple shifts and you could have some people off on Mondays and others off on Fridays, maybe with a rotating schedule for fairness.\nWhat is clear at least is that the current standardized nine hour, five day work week combined with the extreme productivity expected from each worker is destroying lives. It's amazing to think how little output was expected from the typical worker when comparing today with even just 30 years ago (and that's 20 years after wages and productivity stopped being correlated).'",
        "In response to 'Can you go for a walk or something? Local gym? Read a book?', a user said: 'For me personally, a walk might be doable. But then it's above 90°F and extremely humid here for 4+ months a year, and spending the last half of the day drenched in sweat isn't ideal (could try to change and shower, but fitting in food + a reasonable length walk + hygiene really needs 90 minutes). A gym has the same problem only with the added time to get there and back. Reading during an hour break seems difficult/pointless too -- there's insufficient time to unwind work from the brain and switch to reading mode and then unwind that reading to get back into work mode. Might be able to get 10 minutes done, a few pages, and forget them by the end of the day anyway (or read more and end up distracted when back at work).\nWe're all humans and our brains aren't perfect and need to rest for a bit mid-day and eat and let some of the unresolved problems from the earlier half of the day percolate so we can come back and have a productive afternoon. But that time should still count as part of the work day -- so we either stop pretending it's a 8 hour day and 40 hour work week and admit most people are working 45 hour work weeks, or we try to claw those five hours back (I feel like for some jobs lunch used to be part of the day, I mean until recently no one said \"working the old 8-5\" or \"9-6\", full time work was usually a \"9-5 job.\")'"
    ]
}