{
    "username": "Unlikely-Name-4555",
    "contributions": [
        "In response to '“It’s on my advisor to think about what I can do to still get this degree”.\nI’m going by to plainly tell you that you are responsible and accountable for your own outcomes. If your words are true, your advisor is not only completely absolved, but also every future relationship where you blame your outcome on them. Professional and personal.\nIt’s fair to quit. It’s fair to decide something’s not for you. It’s morally reprehensible to blame that on someone else.', a user said: 'Yeah, the only exception to that would be if their advisor is intentionally preventing them from graduating due to the experiment failing. In principle, if you complete the experiments in your agreed upon proposal, you should be able to write up the results regardless of what they are. If it \"fails,\" then it becomes, \"Well, we thought x would happen, but actually y happened, and here's some hypotheses for why.\" But even if that's the case, unfortunately, you have to be your own advocate in arguing for that.'",
        "In response to 'I don’t know this is always the case. A PhD is granted because of novel results, not because of a contract, at least where I am at.\nNegative results can be novel and add the the scientific knowledge, but obviously not always.  A committee shouldn’t give a PhD to a student who tried to prove gorillas and giraffes could mate, only to have negative results, even if the advisor didn’t shoot down the idea.', a user said: 'I do agree that many PIs see it this way, but I think it's completely wrong. If a committee approved the dissertation proposal, then the student's job is to fulfill it. The project itself should be novel. The goal of a PhD imo should be to ask important questions, create novel but relevant experiments to answer them, and demonstrate the ability to carry out scientific experiments of rigor. The gorillas and giraffes example would not fulfill that criteria and should fail the dissertation proposal.\nThe idea that a PhD is only successful if results are statistically significant feeds into the problem of academia that only significant results are publishable. Null results matter, and if we really want to talk about the problems with the pressure to publish, that has to be addressed at the student level too.'",
        "In response to 'You just switched from advisor telling to a thesis committee approving, which is a higher bar. Once again though it’s not a contract.\nThe goal isn’t to ask important questions or just conduct experiments. To get a PhD, you have to have contributed in a meaningful way the overall body of knowledge. The word “meaningful” is subjective and what the committee decides during a defense.\nTo out another way, there is no point to a defense if the committee approving a proposal results in a PhD 100% of the time. The proposal is a rejection criteria: if the proposal sucks, you reject it as implying a PhD. It’s not an acceptance criteria, where a successful proposal means a PhD if the experiments are done.\nAnd yet another way, more bluntly, is no one is entitled to a PhD.\nThe pressure to publish is a straw man argument. The whole point of publishing is to make sure you don’t have a self contained world. I reflect on the current us Supreme Court, and note that since there is no actual way to push back against a justice that they lose perspective.  Peer review is that feedback mechanism in science, because someone just deciding a null result is meaningful doesn’t make it so any more than a Supreme Court justice having a particular world view make it so either.', a user said: 'I don't think ONLY completing the experiments of the proposal should equal a degree. You still have to write an adequate dissertation from those experiments, and you have to successfully defend it.\nMy point was merely, I am personally aware of cases where PIs have prevented students from writing up their results and continuing towards a defense PURELY because the results were null. Null results do not mean there isn't any meaningful contribution to the greater knowledge, and again IMO part of a dissertation proposal defense should involve assessing the meaningful-ness of the project with significant results and with null results.'"
    ]
}