{
    "username": "Unlikely-Pizza2796",
    "contributions": [
        "In response to 'This is how I know this isn't a fake. Because it's ALWAYS what you wish you had said later, and very rarely the perfect quote at the perfect time the way Reddit stories are 😅', a user said: 'This is a great point. I got shafted over a promotion. I was doing the role for months and was finally given an offer for a dollar more an hour and no title. . . My predecessor made salary and had a managerial title. I asked about the title and got a noncommittal answer. I played it cool and didn’t make any cool comments that would have played well on Reddit.\nI thought about it over a weekend and decided it was better to part ways with the company. I ended up resigning and finishing out my notice. I declined a counter, but never made a single remark about my dissatisfaction with the whole thing. Sometimes I wish I had, but I didn’t want to give them the satisfaction of knowing it bothered me. My resignation said enough.'",
        "In response to 'Original Post: It’s Down to Managers to Stop Quiet Quitting, Davos Leaders Say [External Link]: https://www.bloomberg.com/news/articles/2023-01-17/it-s-down-to-managers-to-stop-quiet-quitting-davos-leaders-say?srnd=premium', a user said: 'This hits home. The Army said something similar, with regards to soldier suicide. Leaders at the top shape the force and implement policy. Time and again, they lay the responsibility on low level Squad Leaders. Institutional blame shifting is alive and well.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'Same but different, regarding sitreps. It was no different in Iraq. Partnering and training Iraq National Police was a mess. The publicly facing message was that it was going great! . . . That assessment flew directly in the face of what happened at ground level.'",
        "In response to 'Top leaders often aren't told the truth.  There are a lot of O-4 to O-6s bucking for promotion, so they tweak things to paint a rosier picture.  By the time the information gets to someone who could actually influence policy, it's been watered down and filtered to the point of being useless.\nWhile I still think the generals and admirals have a responsibility to set proper policy and strategy based on facts, it's difficult for them to get the unfiltered truth.', a user said: 'I got to learn this the hard way. Our Brigade Commander and Sergeant Major showed up and conducted a sensing session, in theater. My dumb ass asked actual questions regarding subpar toilets and shower facilities and asked what they planned to do about our supply convoys not getting through with food. You can only eat so many effin’ hot pockets and c-rats. It was a great moment to air it out, before the realization that I would get absolutely crushed once they left. . . Things got better for everyone, but a little worse for me too, lol. Apparently l, nobody wants actual opinions.'"
    ]
}