{
    "username": "upfromashes",
    "contributions": [
        "In response to 'All this uproar around “quiet quitting” is a distraction. “Workers performing only their required job duties and no more.” Exactly. If you want me to do more, pay me more—I’m not “quietly quitting”, I’m doing what you paid me to do. Maybe employees need to pay people more if they want them to perform more? I know, it’s a new idea—maybe even RAdiCaL!!! But hell!\nIt’s all just noise stirred up to distract workers from continuing to fight for what they are actually worth. Nobody should be profiting astronomically off the backs of their workers yet that has been happening forever and even more so in the last 40 years.', a user said: 'Work to rule.'",
        "In response to 'No, just work. Work to rule is a different thing.', a user said: 'Its work to rule not working to the amount agreed to in the hiring contact?'",
        "In response to 'Work to rule is more like adhering slavishly to the rules and regulations in order to cause a slowdown.\nIn every workplace there are a lot of rules that \"should\" be followed but everyone actually cuts corners because the rules are stupid. It could be that you're required to document everything you do, but most people just give a very general overview of what they did. Or it might be that people need approval to buy office equipment, but in reality this is only ever used for expensive things like copiers or computers.\nWork to rule would then to write extensive documentation about\neverything\nyou do, including writing documentation about the time you spent writing the documentation. Or getting approval for every single expense, even if it's just a pen or paperclip.\nThat's work to rule. It's used as a way to protest without giving management a reason to fire you; after all, you're just following the rules as written.\nWorking your agreed upon hours for your agreed upon pay is not work to rule, it's just work. That's what an employment\nis.', a user said: 'Interesting.'",
        "In response to 'Original Post: Quiet quitting: Employees suffering pandemic burnout say they've just stopped working as hard [External Link]: https://www.usatoday.com/story/money/2022/08/14/what-is-quiet-quitting/10304956002/', a user said: 'Decades of increased worker productivity (read: working harder than ever before) with no increase in wages generally... as we all watch our government sitting on their thumbs in the name of corporate profits while humanity tears Itself apart and corps raze and poison the planet. Seems inevitable.'"
    ]
}