{
    "username": "Urnotonmyplanet",
    "contributions": [
        "In response to 'And if you don't take the promotion you can be fired too.', a user said: 'You’re both right. I felt compelled to take the promotion that I didn’t want. You can read what happened to me.'",
        "In response to 'Cool bro. Thanks for playing.\nI can see you're still new to this game.', a user said: 'Yes I learned what you said the hard way. People don’t know until it happens to them. So I can back up what you say.'",
        "In response to 'Sorry to hear that\nWishing you the best', a user said: 'Thank you. No things are much better now at another company. 😊'",
        "In response to 'It all depends on the company\nWe don't have enough information', a user said: 'No you’re correct in my situation it actually happened to me in my previous job.  My dad who was a HR manager told me this happens. My previous job in the same company I performed very well. Got promoted and was being great reviews, then they started giving me things to do that was out of my job description and then I couldn’t do anything right. Then I was let go after 10 years.  I was so stressed that year. I literally had 3 attorneys I worked for. Now I work for a smaller company doing HR work and most days barely lift a finger. I don’t earn nearly as much as I did for that big company, but I’m permanently remote and i love it. No micromanagement and I’m perceived to be a high performer. Not bragging because it took me a lot to get here. Unfortunately, many are right. In this current company I had to learn the hard way. I was underpaid more than anyone, but I worked the hardest. I even worked two departments and I was not appreciated. It became toxic for me, then Covid happened, they removed the manager that was giving me problems, they sold the office building we commuted to, I asked to go back to my old department in this new job and now I get to walk a few steps to my job every morning at home lol. I get all my work done by 10 every morning and bs the rest of the day lol. I been at this current job for 7 years. The last 2 have been bliss.'",
        "In response to 'Congratulations on getting to a great spot', a user said: 'Thank you'",
        "In response to 'I didn't say place them on PIP.\nI said one of the three.\nI have no idea about OP's situation.\nI don't know his company or manager or their culture or any of that.\nBut in some companies you have to do some BS to get rid of an employee and keep budget.\nOr you have to play games to promote someone so that you can let them go later when it's time to give up one of your staff to budget cuts.\nThe person asked for clarification on why a promotion could be a set up by management to let them go. So I gave them just a lot of random ideas.\nWithout any more information, I couldn't tell what's happening in OP's situation. But it is odd that he gets a random promotion without doing anything. Not saying it isn't possible, but at most companies it isn't probable. And giving someone more responsibility is an easy way to get them out on performance rather than cutting a headcount or position.', a user said: 'This literally happened to me. I got promoted to a senior position for a big company (which I honestly didn’t want). They sent me packing with a decent severance package. They started to giving me impossible demands things that only mechanical engineer attorneys know to do. I was just a senior secretary. Weeks before I heard the head general counsel agonizing over the budget for the legal department.'"
    ]
}