{
    "username": "uselessartist",
    "contributions": [
        "In response to 'Not very good analysis or conclusion. Considering labor is a huge portion of expenses, that businesses are run by people and the current labor shortage, it amazes me that business leaders still have no idea how to\neffectively\nmanage their workforces.\nWorkers started to realize that many companies have awful work cultures, and that many jobs have a lack of benefits, advancement and job security. And then add a lot of inflation and financial anxiety. If the quality of worklife decreases, so will effort (because people intuitively understand diminishing returns of effort vs progress), and that effort then is applied elsewhere in travelling, moving, going to the gym, working on a new hobby, or getting a new job or degree.\nPeople who write articles like this have no idea how much the world has changed. When they say things like \"it’s up for debate whether the phenomenon is condemnable slacking\" it reveals the reason why people quiet quit - managers/higher ups who think like this constantly nagging employees under the assumption of bad faith laziness when they may just need extra time to process everything, like stress from rising rents, health, etc. Workplace culture is super important.\nThe way to alleviate quiet quitting is to provide workers better pay, a better culture, and the hope for advancement.', a user said: 'I manage teams and recently HR became centralized. Any more discussions of advancement for members became like pulling teeth. The HR portal has plenty of content on exits but guess how many on promotion: 0. I see demoralized team members aren’t showing as much hard work and I don’t blame them, I’m demoralized and working on other stuff too.'",
        "In response to 'I really appreciate this response.  Some people come in and do their job, reliably, and go home.  So what?  Not everyone is a go-getter or apostle of their employer.\nIt’s the quit and stay crowd, just like you wrote.\nIt’s unfortunate that these terms are being conflated.', a user said: 'Unfortunate that the ones with work life balance are seen as less worthy of promotion.'"
    ]
}