{
    "username": "uWu_commando",
    "contributions": [
        "In response to 'I know you'll think of me as an old dinosaur but that's the way the world works.\nMid-30's here. No, that's the way\nyour\nworld work\ned\n. That statement is about as valid as telling people to get a job by walking into the lobby with a resume and asking to speak to the manager. Doesn't work like that anymore, times change, companies have consolidated more than ever, and these companies are run by very, very short-sighted people that have no vision for the future, other than doing whatever everybody else is doing to make the stock price go up for the next quarter. I have never seen the highest performers in my line of work be promoted, I have seen the ass-kissers and nepotists advance, and external candidates preferred over promoting from within time and time and time again. The days of \"do your very best and you'll reap the rewards\" are over, now you're lucky if your benefits don't get slashed every year, regardless of performance. Companies have stopped rewarding employees, and employees have reacted accordingly. You'd be a fool to put in a ton of extra work, knowing that the chances of being rewarded for it are next to none, when you can jump to a new job and get a raise / promotion much more easily that way.\nThe world has changed, and not for the better.\nWhen times are tough, who do you think they save?\nWhen times are tough they're cutting any expensive high-performers just as much as the low-performing cheap guys, if you've been paying attention to any of the layoff waves this year. Being a high-performer doesn't mean squat if the board wants to see a reduction in payroll expenditure this quarter.\nEDIT: and before anybody accuses me of being a basement-dwelling\nr/antiwork\nbum, I've been an engineer for over 10 years. I am very good at what I do and am a high performer. I have not once been rewarded for it, I've always had to look for advancement opportunities on my own.', a user said: 'Yup. The most work I've ever done was at my first job. Every single day I was coding, and the problems were more technical.\nDoubled my pay after moving jobs. Doubled. The work ebbs and flows at this company, but I have received nice bonuses. One promotion, but not a \"real\" promotion (hard to explain).\nLayoffs hit twice. Definitely at random, as I've made connections with management who don't simply repeat the corporate line to me. They don't get to pick, they are told the day before and I've definitely seen high performers let go.\nThis last round of layoffs is seeing the highest paid getting cut. Same shit as last time, they just hope that the underlings can absorb the work. So being too hard working and getting raises just puts a target on your back. What other message am I supposed to take from this behavior?\nI'd love to work at one place, make decent money and get reasonable raises and promotions. It doesn't have to be gobs of money if I'm just treated with basic decency. Doesn't work that way though.'"
    ]
}