{
    "username": "v1rojon",
    "contributions": [
        "In response to 'Yeah I’m sure they peruse the “Antiwork” subreddit and are shocked by people working the system. There’s NO way these companies would want people to RTO without Reddit posts. /s', a user said: 'You would be surprised.  My wife is an HR director for her company.  Only about 250 people.  The owner is an undiagnosed ADHD narcissist that despises WFH.  They had some top sales guys that demanded to WFH or they were leaving for a competitor.  He agreed to it because he knew they would lose a ton of money if they walked.\nLike literally a couple of times a month, the owner sends my wife articles and posts on Antiwork telling her, these guys aren’t working and to get them back here ASAP.\nShe has to talk him down every time reminding him that they are obviously working as their sales jobs are commissioned based, and there has been no drop off in their sales or earnings.  He still is pissy for several days and says “well, their sales would be even higher if they were here!”  She ignores it and he forgets a day or two later until he happens to see a new article or post that sets him off again.'",
        "In response to 'Spoiler alert for that dude: they aren’t working when they are in the office either.', a user said: 'Oh we know that.  That is what cracks me up.  I worked in an office for 20+ years.  I, without a doubt, spent more time trying to look busy than actually working.\nI have been working from home for close to 7 years now.  I would get way more done than I did in the office and I only worked maybe two hours a day, tops.\nRather than measuring how much time an ass is in a seat, they should be paying for work done.  I am in the United States and am fortunate enough that my current employer understands that and doesn’t care what we do as long as the work gets done.'",
        "In response to 'Original Post: New type of quitting discovered \"Quiet quitting is easy to identify; employees who are quiet quitters visibly reduce their effort and avoid going the extra mile. Soft quitting, on the other hand, happens quietly over time. Employees don’t necessarily reduce their work output, but their enthusiasm fades, their curiosity dwindles, and their emotional connection to their work diminishes.\"\nThe cure is to lick the boot harder.', a user said: 'Still waiting for the article on quiet promoting.  Where you are given duties beyond your own role or the company lays off half of the staff and spreads that work across everyone else with no additional compensation.'"
    ]
}