{
    "username": "varietyjones24",
    "contributions": [
        "In response to 'All depends on your job and skill set, qualifications, etc. Majority of minimum wage jobs there's absolutely no need to put the extra in as your wage isn't gonna go up much. If you're working in a job that requires a degree then yeah sure but the majority of people don't', a user said: 'Agreed. I grafted for fucking YEARS in a minimum wage job only to be ‘promoted’ with a disgusting amount of extra responsibilities all for an extra £45 a month. Lucky me!'",
        "In response to '[Deleted or Empty Comment]', a user said: 'I was at uni whilst I did it but it was a job I\nthought\nwould help advance me once I’d completed my degree. How foolish I was.'",
        "In response to 'Spent the last 20 plus years working really hard, putting in loads of effort, having no lunch break consistently, doing loads of overtime and got bugger all appreciation. Just watched whilst young lads got promoted and given pay rises and I’ve not had one since 2017. Couple weeks ago, worked until 10.30pm and I’m only paid til 5. They won’t pay overtime either.\nSo fuck them.\nI’ve handed in my notice and going to another place who i have a feeling are going to treat me better.\nI don’t mind working hard, IF you’re appreciated and it gets you somewhere but I’m sick of putting in loads of effort and getting nothing back, getting so stressed I’ve not slept properly in months. It’s just not worth it.', a user said: 'Yeah I feel this. I worked for a company for 4 years, consistently doing extra hours, going above and beyond for four fucking years only to be ‘promoted’ with a fuck ton of extra responsibility for an extra £45 ish every month. Now i’ve left I cannot believe I was mugged off for so long. Glad you handed your notice in, there is nothing better than knowing you don’t ever have to go back to a workplace that drains you. I genuinely used to cry on the way to work, now I’m quite happy to wake up. I left for a much better paying job with much less stress'"
    ]
}