{
    "username": "vashthestampede121",
    "contributions": [
        "Why is “quiet quitting” even a thing? Quiet quitting is defined as someone only doing what’s in their job description and nothing more. My question is: why the fuck is there even a term for this, and why does said term involve “quitting?” Why is it apparently an expectation that someone should do more than what they have been hired to do? This is something that has always appalled me, ever since my very first job.\nIn one of my first jobs, my boss would give serious side eye whenever I refused to do something that pretty clearly wasn’t part of the job I was hired to do. I wasn’t particularly successful in that job and quickly realized that part of doing the corporate dance is doing whatever people ask you to do at all times no matter what.\nThe thing is, doesn’t the term “quiet quitting” imply that you’re inherently not doing part of your job? Shouldn’t that be the proper definition? Not “not doing things that already aren’t part of your job?” What the fuck is happening lol",
        "In response to '[Deleted or Empty Comment]', a user said: 'Makes sense. I guess I’m definitely QQ’ing by that definition'",
        "In response to 'I worked at a college where we had to write \"annual goals\"  ever year and submite them to our supervisors. This was a trick to make people willingly add things to our job descriptions.  I was burned out and stopped caring, so I submitted this as my (last) annual goals, \"Keep doing exactly what my job description says is my job.\"', a user said: 'My company has a very similar system. It’s absolute bullshit.'",
        "In response to 'Quiet quitting is another term for doing your job description and nothing else.\nNo training new employees, no staying late to cover shifts.\nComing in, clocking in on time, doing the minimum required work to not be fired.\nClocking out on time and leaving at the end of the work day.\nNo staying late, no \"help zzz with yyy, rrr with iii, and make sure ttt is done\". No socializing with managers to get \"buddy buddy\" for a promotion that's never going to be yours.', a user said: 'Exactly. Which is how all jobs should be anyway. So it’s pretty fucked up that the media has created this label to suggest that not doing extra is the same as quitting. So absurd.'",
        "In response to ''Quiet quitting' is truly an awful phrase - it's basically criticising people for just doing their jobs rather than hours of unpaid overtime.\nOr to put it another way, this should be the norm, not the exception. People should only be working their contracted hours; if employers want more work done, they can either pay more people, or negotiate additional pay for their existing staff in exchange for extra hours worked.', a user said: 'Yes, this answer is common sense. It amazes me that the media has normalized this term as if the thought of someone just sticking to their defined job description is some unprecedented slight to employers.'",
        "In response to 'You're not doing everything you were hired to do. Only the things that can be checked up on easily.\nFor instance, if I did this to my network engineer job. No more maintenance, software udates, document revisions, planning for future forklifts, resource utilization projections, optimizing, organizing, or monitoring. I will only respond to outages, and even then only those that I really have to. I have basically stopped working and am soaking a paycheck until I'm fired.\nIt is absolutely a painful thing to do to your employer. If you want to shiv them on your way out, leave a fucking rat's nest with everything mere days away from bursting into flames. All documentation is out of date and irrelevant so the next guy has to figure it all out from scratch. Byyyeeee! Woob woob woob woob!', a user said: 'Re: your last paragraph, that actually sounds like it would be pretty funny, thanks for the idea.\nBtw I’m not against doing things that aren’t literal bullet points in your JD if they are still a common sense part of your job. I’m against having to engage in parts of the business that have nothing to do with your job, e.g. a marketing manager spending two hours troubleshooting a customer service request.'",
        "In response to 'Well , you kind of get out of something what you put into it. You can’t expect to get much from your job if you don’t put anything into except for the bare minimum.', a user said: 'All most people need out of their job is money, I’m not buying this response lol'",
        "In response to 'If you ever want a promotion, though, it's pretty much guaranteed you need to do more than your job description.', a user said: 'Correct. My point is that’s bullshit. Getting promoted should be contingent on doing your job well, not doing your job plus a bunch of other random bullshit.\nEDIT: most of the time, job-hopping seems to be the more profitable option than aiming for a promotion anyway.'",
        "In response to 'Guess that depends what your goals are.', a user said: 'True.'"
    ]
}