{
    "username": "vestigial66",
    "contributions": [
        "In response to 'Also if your boss is giving you more work load, ask for a raise. Don't be a sucker and let them take advantage of you. Make sure you get compensated for the workload you get. If they don't give you a raise, stop doing more work than him.\nEdit: Btw, I'm like 99% sure this post is made up by the boss or a corporate shill trying to sell the idea how \"quiet quitting\" hurt your colleagues and using that to guilt trip people to do more than what they are paid for. I notice how the blame is directed towards the colleague instead of the boss who is too much of a coward to confront him but have the gall to dumped the work load on you instead. And the solution is pretty obvious that you could have just asked for more money or stop doing more work load, but you decide to blame the colleague instead. I see you. You ain't slick.', a user said: 'Not sure about state jobs, and I worked for the federal government a long time ago, but when I was a civilian you couldn't really \"ask for a raise\" the way you would any other job.  I was on the GS scale.  You got paid a certain amount.  Steps in pay were automatically given at prescribed times.  You could possibly get a merit increase but they were done in the normal review cycle.  You couldn't just go in and ask for a 5% increase or whatever.  It didn't work that way.'",
        "In response to 'If you can't ask for a raise, then stop doing more than what you are paid for. If they can't fire the slacker, what are they gonna do? Fire you for not doing the slacker's work? Now they would get even less work done.', a user said: 'I agree but some people are conscientious and alot of government work is very important.  People need services, for instance.   You feel bad letting work go undone because you know it may be impacting someone who really needs whatever that thing is.  We had rueful jokes when I worked there about 50% of the employees doing 100% of the work.  Known poor workers still got raises and still got bonuses.  It was extremely frustrating and demoralizing.   It's one of the reasons I left federal service.'",
        "In response to 'This is the other side of all this talk about standing up to worker exploitation. It's one thing to assertively refuse to kill yourself so your employer can make new doodads to sell at an outrageous pace--the world won't be a worse place if Apple takes a little more time to sell its next iPhone, for instance--but there's lots of organizations such as government departments that actively lose money, so employers' demands are inherently coming from a much less malicious place.\nOn the other hand\n, government workers are still individuals with stresses, desires, hopes, dreams, etc. I don't care if you're solving world hunger or curing every disease on the planet, you still deserve to have a life outside of work and to live in relative comfort. If workers have to crunch to help people in need, that's still on the agency for being understaffed. Yes, they're likely underfunded, but\nthat's\nthe problem, not workers' inability or unwillingness to work outrageously hard.\nSo in short people need to pay taxes so that agencies don't have any individuals doing \"100% of the work.\"', a user said: 'They aren't understaffed in many cases.  They are staffed with a not insignificant number of people who know they can't be fired and choose not to work.  This is also something that humans have shown a tendency to do since the dawn of the species.  Some people take advantage.   The federal government has made it so difficult to fire people that when I worked for them we had someone who would go to the local bar every day at lunch, get drunk, and come back to work.  He was promoted - PROMOTED - to a department head and retired after 30+ years.  Every single time he was written up he'd say I have a problem, spend a few weeks going to AA meetings, and then start drinking again.  Lather, rinse, repeat.  He knew how to work the system.  He was the most egregious example but we had plenty of people who came in every day, did nothing, got bonuses and pay increases, and made life difficult for the people who did work.  The organization I work for now had a man who used to sleep in his office every afternoon.  When confronted, he said no one every told him he couldn't sleep at work.  He came from another department where he worked for 10 years and no one knew what he done in all that time.  They were just happy to shift him to another department.   I agree government departments need adequate funding and adequate staff but when you have to pay for people who do nothing and you can't get rid of them, that's a big problem.'"
    ]
}