{
    "username": "Viva_Divine",
    "contributions": [
        "In response to 'Reddit api changes = comment spaghetti. facebook youtube amazon weather walmart google wordle gmail target home depot google translate yahoo mail yahoo costco fox news starbucks food near me translate instagram google maps walgreens best buy nba mcdonalds restaurants near me nfl amazon prime cnn traductor weather tomorrow espn lowes chick fil a news food zillow craigslist cvs ebay twitter wells fargo usps tracking bank of america calculator indeed nfl scores google docs etsy netflix taco bell shein astronaut macys kohls youtube tv dollar tree gas station coffee nba scores roblox restaurants autozone pizza hut usps gmail login dominos chipotle google classroom tiempo hotmail aol mail burger king facebook login google flights sqm club maps subway dow jones sam’s club motel breakfast english to spanish gas fedex walmart near me old navy fedex tracking southwest airlines ikea linkedin airbnb omegle planet fitness pizza spanish to english google drive msn dunkin donuts capital one dollar general -- mass edited with redact.dev', a user said: '*Spits out coffee*\nI heard your voice in my head. LOL'",
        "In response to 'Reddit api changes = comment spaghetti. facebook youtube amazon weather walmart google wordle gmail target home depot google translate yahoo mail yahoo costco fox news starbucks food near me translate instagram google maps walgreens best buy nba mcdonalds restaurants near me nfl amazon prime cnn traductor weather tomorrow espn lowes chick fil a news food zillow craigslist cvs ebay twitter wells fargo usps tracking bank of america calculator indeed nfl scores google docs etsy netflix taco bell shein astronaut macys kohls youtube tv dollar tree gas station coffee nba scores roblox restaurants autozone pizza hut usps gmail login dominos chipotle google classroom tiempo hotmail aol mail burger king facebook login google flights sqm club maps subway dow jones sam’s club motel breakfast english to spanish gas fedex walmart near me old navy fedex tracking southwest airlines ikea linkedin airbnb omegle planet fitness pizza spanish to english google drive msn dunkin donuts capital one dollar general -- mass edited with redact.dev', a user said: 'Okay...so it wasn't just me....whew.'",
        "In response to '....stop donating!', a user said: 'I have to admit that I used to struggle with a bit of shame/guilt over barely contributing when I was active. Even when they would have resolutions (oh gawd! I remember the word!!!) about needing extra funds for something, I'd never give any.\nBut then I leave and stumble across a spiritual community that had such a different energy.  I felt very differently about supporting them financially. It was the first time I actually *tithed* and it felt joyful and easy. I gave more money to this group than I EVER gave to JWs.\nI have been trying to figure out why I never *wanted* to give *currency* to the entity. Maybe sub-consciously I was aware they were crooked and did not want to support it.'",
        "In response to 'I suffered depression and anxiety eversince i came off the servant team in the early 1980s ,on antidepressants, tried to carry  on thinking it was my fault i failed ,took the field service mid week group for 6 years after the elder died ,no elders helped , eventually one morning i had a total panic attack because of the bickering over who would work with who and one sister went to another part of town ,it was all too much i just said to my wife \"im done with this \" we went home and just left them on the territory,  i refused to take the group after that ,at the convention when they showed that video of the parents refusing to answer the phone call from their own daughter  i realised that i no longer wanted to be a part of this unchristian organisation ,i woke up properly about 7 years ago and started to fade ,covid helped me finish my fade ,i have not been in a kingdom hall for 3 years, my depression  has gone i am off medication, i now go to a proper Christian church and love it ,im a much happier person ,', a user said: 'my depression  has gone i am off medication....\nSame here! Ours brain recalibrate naturally once we are not longer oppressive/depressive thinking. And we never clue into it while we are in. I think stuff like this is good for lurkers to see so that they can connect the dots.'",
        "In response to 'This. So much! I have very few friends because the jw’s that I did try to befriend always ended up stabbing me in the back. It was always for stupid things and they’d twist my words around and then gossip, which would in turn get back to an elder.\n99% of the time, it was their fault for misunderstanding and jumping to conclusions because they only got a small portion of the full picture. So now, all I do is smile and rarely ever say anything personal, about myself or anyone else. I’m too old for that kind of drama. All I want at this point in my life is peace, which I have plenty of now that I’ve stepped back from JW Land. I just cannot tell you how much happier and less stressed I am since I’ve stopped attending meetings and service. It’s amazing!\nLooking back, I used to be one of those gossiping PIMI’s, so glad I woke up and decided to change. I no longer judge any of the friends either. I see them for them, and many of them struggle to keep up the PIMI game but just can’t admit it. My heart hurts for them and I always try to be very sympathetic towards their struggles.', a user said: 'I just cannot tell you how much happier and less stressed I am since I’ve stopped attending meetings and service. It’s amazing!\nI am happy you can finally *breathe*! We don't realize how much that environment affects your psyche until to step away from it. You'd never have thought it was the org causing the stress, because *Jehovah's people are happy people*. It is NOT authentic happiness, but you are made to *think* it is.\nI don't often use the term spiritual bypassing, but that's exactly what is happening when you are in it.'",
        "In response to 'Oh my gosh, yes! I was telling a friend that the other day. For the first time in a long time, I do feel like I can finally breathe!\nAll this time I thought there was something wrong with me for feeling that way… it’s nice to know I’m not alone.', a user said: 'Nope... you are definitely not alone.  My 20 years of progressive depression, exhaustion and suicide ideation vanished a year after leaving. I looked like a whole different person in under two years. It's the indoctrination we ingested, piled on with more of it that weighs us down. It is NOT normal!'",
        "In response to 'My elder body is losing its mind trying to push people back to in person activity.  It's pretty interesting to see.  I genuinely don't see this religion ever going back to what it was pre covid.', a user said: 'Well, as much they say they are *no part of the world*, they are experiencing what shifted in the world.\nOh well.....'",
        "In response to 'I wrote a post on that some time ago, as PIMO I heard this terminology and immediately click within me, but it took me weeks to really understand why... And it was connected with my way to just do the bare minimum within the cult, just to be under the radar... It is exactly the same terminology or mindset', a user said: 'I LOVE quiet quitting! It's cool that there's a term that defines something so many of us have been doing most of our lives in secular work. It's a personal power move done in a very non-obvious way. Secular work is a whole other *cult* in it's own way.\nI love that it's becoming a huge movement born out of the lockdown and people getting a break from \"the grind\". It is in response to work environments where (just like JW) employees being forced to come back full steam. People just said, okay, you want me to come back? Cool, but I am working my way! LOL'"
    ]
}