{
    "username": "Walshcav",
    "contributions": [
        "In response to 'You know, I’ve struggled at most of my jobs with the social aspect. There are always groups of coworkers going out to lunch together or walking the loop on break, and I just… don’t want to make small talk for 45 minutes in a setting where I need to watch out for over-sharing or anything like that  My work is social enough (meeting clients, leading meetings, etc) that I don’t want to share my down time with anyone. Then I feel like I’m perceived as distant or a loner or something (I am).', a user said: 'Dude, I'm the same way, I avoid MFT (Mandatory Fun Time) at all costs.  When they make us do stupid lunches together I just bring my laptop and do work.  I genuinely belive all the people I work with are nice people, but that's where our relationship ends.  I get asked to go on all these staff outings and I'm just like, \"Nah, I just want to be with my wife and kids and my dog.\"\nI've been pulled aside a few times and my response is always the same, \"Is it a requirement for this job to spend time outside work hours to go to these things?  Because if so are you going to be paying me for them?\"\nAnd it's always some response of, \"Well it really would be nice, you are valued here.\"'",
        "In response to 'My boss and coworkers seem to be gearing up to a work vacation somewhere. I've made my desire to never ever fly again known, but I certainly feels like I'm the one spoiling things for them.\nI just don't like airplanes and I'm not going to make up a lie, or worse, suck it up and go with them to make them feel better.', a user said: '\"Work Vacation\" ... ugh ... this would make me demand around the clock pay with all expenses paid if I was forced to go.\nMy last job had a lot of work trips, and I'll never do that again unless I am VERY handsomly compensated.\nWhen I bucked a trip to Houston one time just make sure you get EVERYTHING in writing about how you don't feel comfortable doing this and you have an intense fear of flying and you're being mandated into doing this.  Do a read receipt so they know it, copy HR on it if that exists ... that will either get you out of it or set you up for a wrongful termination suit at a future date.\nMFT needs to end forever.'"
    ]
}