{
    "username": "Weak_Director1554",
    "contributions": [
        "In response to 'No im faded out and have not been to hall for 3 years,  my jw wife does zoom,  i somtimes sit in for 30 min public talk just to keep her happy ,', a user said: 'When did public talk become 30 minutes, when I was a JW it was an hour and then an hour of watchtower. Is the watchtower study still an hour long?'",
        "In response to 'Public talk 30 min WT about an hour. Been like that for years.', a user said: 'Thanks, I left in late 1970s.'",
        "In response to 'Its a different religion now ,what you remembered has long gone .i recommend a look at the book \" my beloved religion and the governing body \" writers  name is Rolf  cant remember second name it like Fiorly.its available on pdf', a user said: 'Only started to look into JW on YouTube a few years ago and I can see that they've changed. I remember having lots of debates with elders and others, but in 74/75 when WT were screaming 1975 from assemblies and written in the WT, one elder kept saying remember it is written no man knows the day or hour, thank you Bob he's probably dead now. Then WT blamed the rank and file, well that was my first reg flag. Between the watchtower study and going out in service we'd sit in back room having lunch and great arguments aka discussions in those days and now we'll it's no more, and that Kingdom hall is no more - sold. You have to refer to the book of acceptable questions to ask if you don't want to be disfellowshiped.'",
        "In response to 'Reddit api changes = comment spaghetti. facebook youtube amazon weather walmart google wordle gmail target home depot google translate yahoo mail yahoo costco fox news starbucks food near me translate instagram google maps walgreens best buy nba mcdonalds restaurants near me nfl amazon prime cnn traductor weather tomorrow espn lowes chick fil a news food zillow craigslist cvs ebay twitter wells fargo usps tracking bank of america calculator indeed nfl scores google docs etsy netflix taco bell shein astronaut macys kohls youtube tv dollar tree gas station coffee nba scores roblox restaurants autozone pizza hut usps gmail login dominos chipotle google classroom tiempo hotmail aol mail burger king facebook login google flights sqm club maps subway dow jones sam’s club motel breakfast english to spanish gas fedex walmart near me old navy fedex tracking southwest airlines ikea linkedin airbnb omegle planet fitness pizza spanish to english google drive msn dunkin donuts capital one dollar general -- mass edited with redact.dev', a user said: 'I've never given money either, left when 22 ish can't remember exactly what age, in 1970s there was no compulsion to give and they were proud that the plate wasn't sent round.'",
        "In response to 'stop donating!\nI agree! I stopped long ago.\nI say stop volunteering or giving your time as the quickest way to make an impact since this is immediate. A lack of willing volunteers to provide free labor would crush the Jehovah's Witness organization. A lack of volunteers (especially males) is kryptonite for JWs as they would not be able to operate congregations.\nI believe that even if 100% of donations stopped tomorrow.....the Watchtower Corporations have a large enough war chest of funds to keep things running for years.\nBut at some point....an organization with no people working.....is no longer an organization.', a user said: 'Totally agree, plus it would use up a lot of their energy trying to get volunteers and the harder they try the more desperate they'll get and that will eventually show in more coercive methods.'"
    ]
}