{
    "username": "whatever32657",
    "contributions": [
        "In response to 'Original Post: Quiet Quitting: What is it Really? Quiet quitting is a confusing term to me, but maybe I just don’t understand it. I have rarely ever given 120% to a job… maybe when I was fresh out of college when I had that mindset. But the years have jaded me. What people call “quiet quitting” (doing the minimum) is what I just call doing my job lol. It’s not like I refuse when they ask me to do more work (tho rarely do they ask), but I don’t SEEK more work out unless I’m just bored. For example, in my work, we work in Sprints and get assigned stories to do for those sprints. I just do those stories — not more or less — unless I’m just bored and have finished my stories weeks in advance, then I may grab a story for the next Sprint. I get paid by the hour so no work means no pay. But it’s not like I can ADD more stories to the current Sprint because someone else still needs to test them and THEY may not have capacity. So, a lot of times I just do things around the house since there always seems to be something to do at home. Have I been quiet quitting for years and just didn’t know it or is doing the minimum not really what quiet quitting is all about?', a user said: 'doing the minimum is not \"quiet quitting\", it's just being a slacker.\nunfortunately, op's attitude is becoming more the norm: \"i'll do whatever i'm asked, but i'm not gonna take any initiative to do anything that i know perfectly well needs to be done.\"\nthe net result of this is that the people who actually DO give a shit about the company's success (and therefore, ultimately, their own) end up picking up all the slack. this only serves to enable the slackers more. round and round it goes.'",
        "In response to '\"the company's success (and therefore ultimately their own)\"\nThis has got to be a joke, the punchline of which is mass layoffs and executive bonuses with record investor profits.', a user said: 'well it's not such a big joke to me because i get some of those bonuses and profit sharing, so yeah'",
        "In response to 'Ah so you're pissed that people beneath you in the corporate ladder are not pulling your weight on top of theirs.', a user said: 'i love how you people here twist everything a person says in order to meet your own agenda. it's not even worth trying to have a dialog.\nsure, if that's what you want to think, go ahead. it makes no difference to me.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'your theory is only valid if said employee is diligently working for the entire 40 hours a week.\nmost job descriptions include other tasks that are expected to be completed in slow work times. yet a lot of workers use the rationalization that \"i was hired as a salesperson [for example], so i'm not gonna do any cleaning or stocking or customer service etc when there are no customers present.\"\nthe employer has a right to expect that an employee will be busy for the entire time for which they are being paid, and so those \"other\" tasks are likely included in the job description. when they are in the job description, the employee is expected to take the\ninitiative\nto take up those tasks when they have capacity. the employer should not have to babysit their employees to see who is not busy and assign work. the employee should not even need to go \"ask\" what needs to be done.\nyet often, if those tasks do not align with the employee's \"title\", the employee feels perfectly justified scrolling reddit or some nonsense during what they perceive to be their \"downtime\". THAT is a problem.'",
        "In response to 'This is a weird take, especially compared to stocking and cleaning. Those are simple physical tasks the majority of people could do on autopilot, and not the sort of thing that relates to WFH.\nMuch of work is mental, not physical, and both mental load and capacity are variable values. One day’s 100% could be another day’s 70%.\nI don’t think the discussion has anything to do with refusing or neglecting specific duties. Then again, I dunno, my job is not at all physical and just 100% mentally taxing. Some days you’re on, other days you don’t have it.\nMy attitude is if you’re paying me, I’m working. But I’m also only human. I can’t put out a consistent output to exact spec every day.', a user said: 'i get that the example i used was not the best in the context of the op, but it was what i had in the moment, so i went with it.\nmy point was that while on the clock, an employee should be doing something (whether mentally or physically) to advance the mission of the company. sometimes that may be sitting back and pondering the pros and cons of a developing marketing plan. that's fine. but watching reels and swapping them with your fb friends is not productive work, and there's likely something more productive that the person doing so could be engaged in when in downtime from their \"main\" work.\nthat's all i was saying.'",
        "In response to 'I get you. And yeah, much as downtime matters mentally, you’re not paid to watch TikTok. Work hours are for work.\nI guess I think more task oriented these days since I’m salary in recent years. The hours matter less, some days are longer, some shorter, it’s more flexible.', a user said: 'i totally get it. and in the interest of full disclosure, i'm currently struggling with a lame co-worker who is on the internet all day, leaving the work to me because he knows i actually care about it while he doesn't. and yeah, it's sticking in my craw and bleeding over into my commentary.\ni'm glad we understand each other 😊'"
    ]
}