{
    "username": "Wiendeer",
    "contributions": [
        "In response to 'It kind of reminds me of one of the things mentioned at a PLC meeting. Tiktok has rewired their brains to be ADD and unable to focus without constant stimulus.\nThey then say we need to adjust our teaching to this. My rebuttal is that we need to help fix this. We shouldn’t be caving to their craven need for entertainment at every moment, we should be helping fix their brains the rot has produced.', a user said: 'Tiktok has rewired their brains to be ADD and unable to focus without constant stimulus.\nJust a pet peeve of mine, but I'm sure you were just being hyperbolic; ADHD is not a personality description, it's a hereditary neurobiological disorder of the prefrontal lobe. It can be tricky to diagnose and our understanding of it has evolved over the decades, but it's not something you can just \"catch\" or develop yourself. I know this seems like a pedantic response--and I guess it technically is--but I just feel like it's important to stick up for ADHD kids because they already constantly deal with the pressures from others to \"just try harder\" when it's really more complicated than simply having discipline.\nWhat's happening with TikTok (and has been ramping up since the dawn of the internet)\nis\nclearly impacting peoples' ability to focus and show restraint, but it's a problem with a solution that will be different from treatment of ADHD. Though of course I don't necessarily blame the students themselves for the effect this all has on their development, of course, no matter how obnoxious they may be in the moment.'",
        "In response to 'I really wish we would call it executive dysfunction disorder or something because the current name is very misleading. The inability to focus is problematic, but it’s far from the most debilitating aspect of ADHD. The time blindness, forgetfulness, emotional swings, and increased activation energy for literally every task are so much worse.', a user said: 'Same issue as people thinking clinical depression is just \"being sad\" and general anxiety disorder is \"being nervous/worried\", unfortunately.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'Oh, I absolutely would agree with you there. There's this drug-like dependency on immediate emotional/intellectual gratification. It's why many teachers just laugh at the idea that they should \"just take the devices away\". Have you ever tried that? Lol. The reactions from the younger children in particular can be\ninsane\nand ultimately more disruptive than the inattention itself. We're literally taking away their \"drugs\". Things are definitely going to be more... interesting in the near future.'"
    ]
}