{
    "username": "WillowWorker",
    "contributions": [
        "In response to 'Why are people (Khanna and Favs) still doing “when they go low, we go high” in December 2024?', a user said: 'They care more about the dems being 'the good guys' than they do about the dems winning.'",
        "In response to 'Original Post: [Discussion] Pod Save America - \"Is Biden Quiet Quitting?\" (12/17/24) [External Link]: https://crooked.com/podcast/is-biden-quiet-quitting/', a user said: 'Is there any better evidence that these people cannot meet the moment than their discussion on daylight savings time?\nNow I have actually, like I used to think, yes, of course we should switch to permanent daylight saving time. That used to be my position. I really dug into it for a while. I did a lot of interviews, did a lot of, did a lot of reading about it, and I have a more nuanced view on it\n...\nIf you pass the Rubio Marquee Murray bill, then everybody's gonna be on permanent daylight saving time. But if you pass a law that just allowed states to choose between, just add the third option, letting them choose permanent daylight saving time about 20 states, their their laws would go into effect. And then some states would either choose to keep switching or stay on permanent standard time.\n...\nBut no, this is the compromise. The whole country doesn't have to switch and the whole country doesn't have to have one policy. It won't be complicated because you go through a period of transition over a year or two, which people can choose which time zone they want. And then basically you just end up with a new time zone map. And we never have to deal with this again.\nBro, you've found the nuance to the daylight savings time discussion? Instead of 1 national discussion and fix we need to have 50 discussions and 50 different fixes? Instead of just doing something about it, we need to have a period of transition? And what we're transitioning into is a country which is a patchwork quilt of timezones?\nIt's so emblematic of the problem with Dems that our opponent says \"You know how you hate leaping forward? I'm going to get rid of that\" and we respond with something like this'"
    ]
}