{
    "username": "Witchy_Abundance",
    "contributions": [
        "In response to '[Deleted or Empty Comment]', a user said: 'Hind-sight is 20-20.  I wish I had the courage to leave after the first time he cheated.  And the lack of intimacy.  But I didn’t want to be part of the statistic that literally my whole family was…divorced.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'Been there done that.  It’s hard to feel like no matter what you do, they just have zero desire.'",
        "In response to 'Original Post: Quiet quitting Me male HL wife LL Have you reached that stage ? Quiet quitting not leaving because of kids or what not but just quitting on the idea of romance in your head letting go of the resentment for your own mental health  and accepting that she’s just a roommate now ? We had yet another talk yesterday about it which she acknowledged the situation made promises again and that night it was just heavy snoring, told her today that I’m disappointed that our discussion led to no improvement even after her promises she said but we both agreed to make efforts ( because yeah I turned LL4U after all this time) I told her it’s ok I don’t even want to talk about it, I’m not even pissed as usual , she’s snoring as I’m typing this next to me and i don’t even care i don’t want her anymore and the sad part is the idea of getting to this point used to scare me but now I just don’t care, I don’t even think I love her anymore just that I’m used to her.', a user said: 'It’s so hard to keep loving someone when you lose all intimacy.  But even harder when you do continue to love them, hoping anything you do will at least get a hug from it.  DB’s suck after investing so many years with someone.  Sorry you’re going through it.'",
        "In response to 'And that’s the thing, I have no hope\n Anymore after today. I guess we all know where\n This is going to end', a user said: 'I’m sorry ☹️'",
        "In response to '[Deleted or Empty Comment]', a user said: 'I said intimacy, not sex.  While yes they coincide, all intimacy is not all sex.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'Yes, this!!'"
    ]
}