{
    "username": "Witetrashman",
    "contributions": [
        "In response to 'Aw thank you.', a user said: 'Love the wholesomeness in this labor empowerment thread. Love for all my fellow proletariat!'",
        "In response to 'Answer: to add to already great answers there is another aspect of \"quiet quitting\". Employers now are crying because they used to dump more responsibilities (quite often way more than the employee contract specifies) on their workers and workers had to oblige due to fear of losing the job or being passed on the promotion if they don't.\nNow the workers fight this back by saying \"not my job\" and refuse to accept additional work without compensation. Which is fair enough, but employers are now crapping their pants because employees are not afraid of being fired if they don't take more work on their shoulders. Workers have long realized that going above and beyond does not give a single benefit. No raise, no bonus, no appreciation. So why would they \"exceed expectations\" if there is literally no reward for it? Employers are always happy when someone is doing more than they are paid for, because that's means they get more from an employee than they are paying for. It surely helps that the job market is now favouring the workers, so if a worker feels they are not appreciated or are being threatened with firing they can just quit and change job or workplace.\nIn short, the\ncake\ncarrot is a lie and the stick is broken.\nSo the employers came up with this utter nonsense called \"quiet quitting\" to basically complain that the workers are not giving the job more than they are paid for. It's propaganda to make workers feel bad for refusing to be abused.', a user said: 'You make a great point. Until recently, the pervasive narrative was “going above and beyond is how you get ahead.” One could call it hustle culture. But the veil has been lifted from many workers’ eyes. Promotions are few and far between, and companies are all too happy to offer go-getters a fancy new title with a rash of new responsibilities without providing competitive salary increases. The result is that if workers want to improve their earning potential, they’re better off seeking new roles with other employers.  So there’s no benefit to busting your butt for your current employee because they have no intention of fairly compensating their employees unless they are trying to attract new talent. Employers have abandoned retention and development incentives and focused solely on investing in recruitment. The result is that workers see no benefit to being loyal to their employer, let alone going above and beyond the job they’ve been hired to do.'"
    ]
}