{
    "username": "Wobblestones",
    "contributions": [
        "In response to 'Because I operate an agricultural corporation where I am HR, the manager, the CEO, and a 60 hr a week line employee.  I can measure daily how much someone harvests relative to how much they are paid in wages, benefits, housing, etc.  agricultural employees are difficult to replace mid season because the competent ones are employed.  We pay substantially more than the highest minimum wages in the US and we provide raises commensurate with increases in wholesale produce prices.  It’s obvious when someone is producing less value than they are being compensated for.', a user said: 'I operate an agricultural corporation\nJust say you're a farmer. No need to fluff yourself.'",
        "In response to 'I think in pointing out the weaknesses in overgeneralizing about the relationship between employee compensation and employee production of value, it’s important to use examples from situations that reflect the actual makeup of the corporate world.  Most corporations are small businesses, almost all have fewer than 100 employees, most of these are lean enough to exclude having HR or layers of management.  Most of the other farms, nurseries, wholesale suppliers and purchasers that I deal with also operate as S or C corps.  Makes sense to discuss the issue  of whether employees routinely deliver labor value greater than their payroll costs enough to justify pay increases beyond the annual ratcheting of wages that follows inflation from a business sector that I’m involved in.  If these generalizations are only valid for a certain segment of corporate work, it might be better to specify and not tar everyone with the same brush.', a user said: 'it’s important to use examples from situations that reflect the actual makeup of the corporate world\nHe says, while inventing some scenario where an employee is somehow not bringing in as much money as they are paying said employee and the corporation doesn't fire them. That isn't a thing.\nMakes sense to discuss the issue of whether employees routinely deliver labor value greater than their payroll costs enough to justify pay increases\nNo, it doesn't. Employees deliver significantly greater value than their labor costs by the very nature of the arrangement.\nfrom a business sector that I’m involved in\nFarming, not \"the corporate world.\"\nIf these generalizations are only valid for a certain segment of corporate work, it might be better to specify and not tar everyone with the same brush.\nLet me fix this for you:\nIf\nMY GENERALIZATIONS\nare only valid for\nFARMING\n...\nAnd they aren't valid either way. Your scenario doesn't happen, and your attempts to apologize for not giving employees wage increases are sad.'"
    ]
}