{
    "username": "Woodie626",
    "contributions": [
        "In response to 'The years on the chart line up with covid.\nNotice however that in other countries - their life expectancy has rebounded while ours continues to decline.', a user said: '\"Other countries\" and the data was cherry picked from over five sources. This is anything but complete.'",
        "In response to '\"Other countries\" and the data was cherry picked from over five sources. This is anything but complete.\nThat's a strong claim. Can you point to me what you find cherry picked here? Here is the full study:\nHow does U.S. life expectancy compare to other countries?', a user said: 'For comparable country average health spending in 2021, we used 2020 data points for the following countries due to missing 2021 data: Australia, Belgium, France, Japan, Netherlands, and Switzerland.\nThe methods section covers a lot just like this, if they didn't get what they wanted, it was omitted, if the data wasn't complete or didn't meet what they were looking for they seemed to switch the country on a whim.\nThe lines behind the blue one are representing countries, right? Why aren't they labeled? The blue line is an average, but an average of what? Just a set of countries, or a set of countries mixed up together when it suits them to make this \"average\" line?'",
        "In response to 'The methods section covers a lot just like this, if they didn't get what they wanted, it was omitted if the data wasn't complete or didn't meet what they were looking for they seemed to switch the country on a whim.\nIncomplete data is a fact of life when doing studies - this isn't a reason to assign bad intentions to the authors.\nThe lines behind the blue one are representing countries, right? Why aren't they labeled? The blue line is an average, but an average of what? Just a set of countries, or a set of countries mixed up together when it suits them to make this \"average\" line?\nThey are labeled,\nas indicated in this image I uploaded pointing to Switzerland's line.\n.', a user said: 'The second time you had to link something else to explain your original post, and you're acting like it's normal to just add things. For all I know, you just made that.'",
        "In response to 'The second time you had to link something else to explain your original post\nThey are all the same source.\nThe first link was the study that the original post graph came from. The second link is an image I uploaded myself from the first link where I highlighted Switzerland. Thus debunking your nonsensical claim here:\nThe lines behind the blue one are representing countries, right? Why aren't they labeled?\nMoving on...\nand you're acting like it's normal to just add things. For all I know, you just made that.\nYou seem eager to malign my intentions when I'm being straightforward about my sources.', a user said: 'Eager? This is the fourth attempt at clarity, and your initial post is just a graphic.'",
        "In response to 'Isn’t life expectancy calculated by using death probabilities and averages? So anti vaxxers dying en masse in their 40s will bring down the number. Is there any methodology for life expectancy by political affiliation or region\nIt's not just anti vaxxers:\nStudy: More Than 335,000 Lives Could Have Been Saved During Pandemic if U.S. Had Universal Health Care\nOverall, including both COVID and non-COVID patients, 211,897 lives would have been saved in 2020 with universal care. From the start of the pandemic in the U.S. to March 2022, those preventable deaths mount to 338,594.', a user said: 'Objection, speculation. \"If the world were different we'd be different.\" Isn't an argument.'",
        "In response to 'That is some speculation. Objectively how things are now sucks overall for the American people. The only logical course of action is to try something different, not buckle down drown holding our bootstraps.', a user said: 'Trying something different, I'm all for. That's not what was said. It was said if the past were changed for the better, we'd be better off. What you're saying here is we need to do better, and that's a better statement.'"
    ]
}