{
    "username": "Wooow675",
    "contributions": [
        "In response to 'Quiet quitting is so commercialized now it sounds like the right way to quit', a user said: 'Never heard this term ever. Wtf is this? Like just disappearing? Bc in my industry I would lose my license. This would spell career death 😂\nWhy is quiet quitting ok? Like retail etc yeah ok I get it, high emotions etc. But are people\nreally\nquiet quitting from Financial, or is it tellers and support staff quitting and they’re technically in Financial?\nI’m big anti work, I have my work laptop auto set to sleep at exactly 8 hours. I trade my time and expertise for money, and bosses get no freebies. But quiet quitting seems like bullshit.'",
        "In response to 'You're doing it already :) It's the same as\nwork-to-rule\n, just a negative phrase to make it seem like a bad thing.\nEdit: Apparently we're calling it \"act your wage\" now?', a user said: 'I think this term is an\nr/antiwork\nthing. Never heard this and it doesn’t make you think of work life balance, it makes you think people are Irish goodbye-ing their jobs lol'",
        "In response to 'Quiet quitting is a corporate propaganda phrase in response to /antiwork to cast standing up against their abuses in a negative light. Basically an extension of the victim blaming mentality.', a user said: 'Never heard it. I’m too corporate for my own liking and I don’t even see it on LinkedIn. Seems like a buzzword.\nSome people say it’s a positive term workers adopted, or appropriated or whatever, and others are telling me it’s anti worker corporate bullshit speak.\nWhich is it? Genuinely I have no fucking clue and that’s my whole point 😂'",
        "In response to 'Do you even know what it means? It stands for doing what you were hired to do, nothing more than that.', a user said: 'That’s my whole point, the term is bad messaging. It doesn’t make anyone hearing it the first time think of work life balance, it makes you think of ghosting which is a perceived negative to anyone in any situation. Not just boomers, I’m 32 and that was still my immediate first  thought.\nAgree with the movement, but the chants are terrible'",
        "In response to 'As someone who has been disillusioned from just about the very beginning of their working life with the idea of having to work two jobs and 60+ hours just to survive, hearing \"act your wage\" makes me feel the exact opposite of how I assume the ruling class is trying to use the term. I have always felt \"I'm not paid nearly enough to give even the concept of a shit about my employer or company\" so \"acting my wage\" means doing the absolute least I possibly can to avoid being fired since my employer is paying me the absolute least THEY possibly can to allow me to survive in this capitalist hell', a user said: 'Act $5.75 years old. Or whatever min wage is'"
    ]
}