{
    "username": "wordholes",
    "contributions": [
        "In response to 'Fucking greedy pigs are mad they pushed people too far.', a user said: 'Work harder peasants! Where are MY profits???'",
        "In response to 'DUDE!  WTF!\nYou should pay him a living wage for creating the intellectual property you want to utilize!', a user said: 'a living wage\nCOMMUNISMS!\n/s'",
        "In response to 'If you have a kid and its time for them to start eating foods google \"baby led weaning\". It's literally just giving your kid food, also known as feeding.\nIts such a sad state that if you're salaried, you're supposed to work 80 hour weeks for a 40 hour salary or else you're not doing your part.\nIs the company somehow giving you an extra 40 hours a week to live your life?', a user said: 'you're supposed to work 80 hour weeks for a 40 hour salary\nWorking 40 hour weeks for a 40 hour salary is somehow impossible but the profits keep rolling in and upper-level management keeps buying newer and fancier cars. If you work hard, you too can see your boss buy a new car.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'The term 'Quiet Quitting' drives me nuts. How is it 'quitting' to literally do your job, as per the job description? That's literally just 'employment'.\nWorkers need to go above and beyond, every day! Will they get paid above and beyond? Fuck no.'",
        "In response to 'Exactly, they will just pile on more work to do because you have shown you can go above and beyond your job description.', a user said: '\"This part of the production pipeline works very well, let's put more load here until this unit is at capacity. Worst case it breaks and we can get another one off the shelf. Check out this prospective unit, it has kids so it will naturally self-motivate to work harder and longer.\"'",
        "In response to 'So going to work, executing your job description, and going home at the end of your shift is \"quiet quitting\"? \nWell goly, I've been quiet quitting since the 90's and here I thought I was a dedicated and reliable employee. I've even been written up for NOT taking my breaks.', a user said: 'I thought I was a dedicated and reliable employee.\nYou need to go above and beyond. You won't get paid above and beyond. Your reward for a job well done is more work, not even some nice words to congratulate, just more work.'",
        "In response to 'Twenty-year-old here, and I’m glad to hear it. No one is “lazy”, they’re just being exploited, and it’s long past time we realized that.', a user said: 'As a Millennial, I'm happy to see the \"woke\" children stirring up shit and offending the upper caste. We need to try and fix this dumpster fire.'",
        "In response to 'I demanded a 20% raise for my annual review and I actually got it. Guess what? If you have a skill you have value. I straight up told my boss I'd go around the corner to pack the bananas if they didn't give me what I'm worth. I'm going to request an extra week of vacation this year.\nWe've been exploited by corporations for too long.', a user said: 'Corporations aren't people. Corporations are a parasitic \"mind\" that lives within the minds of management and employees. Even as employees and management are rotated out, the corporation continues to exist and has it's own needs, wants, desires.\nLook at a corporation like Shell, a fucking cancer on society. Every single one of it's employees, management, even owners has completely been replaced and yet it's been pretty much the same \"person\" since it was founded. It's a Ship of the Theseus.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'It'll never be enough for most corpocrats.\nBecause they are extremists. They have no balance, nothing is ever too much or too little. They will break people for maximum profits and still complain they didn't make enough money. They could own all of the world and still be unsatisfied.'",
        "In response to 'Yeah and depending on your job you can do the math and see how bad you’re getting squeezed. I just left a job, there were 5 employees and the owner was making 3-5mil in profit per year, I was making 19.50 hourly, but before last year it was 17. I did all of the production, it was a couple sales people and warehouse workers. Sales guys got paid, rest of us got raped.', a user said: 'I did all of the production, it was a couple sales people and warehouse workers. Sales guys got paid, rest of us got raped.\nWork harder peasants! Where's all my GODDAMNED profits!?\n-- Bossman'"
    ]
}