{
    "username": "worthy_usable",
    "contributions": [
        "In response to 'Original Post: You’ve Heard of Quiet Quitting. Now Companies Are Quiet Cutting Layoffs are down, but employers are still finding ways to cut jobs -  Is this normal or economy tanking? More problems expected in late 2023 or 2024?\nWorkers are waking up to emails and team-meeting requests with a jarring message: They aren’t fired but their jobs are gone.\nPeople on the receiving end of these memos describe running through a range of emotions, from relief that they’re still employed to a sense of dread that their bosses secretly want them to leave.\nhttps://archive.ph/cYXyk\nhttps://www.wsj.com/lifestyle/careers/youve-heard-of-quiet-quitting-now-companies-are-quiet-cutting-ba2c326d', a user said: 'Ok I'll take this click-baitish article at face value for a brief second because I notice something about the particular roles discussed in it:\nsenior sales-enablement specialist at IBM, senior sales-coach, global head of growth marketing.\nNow having worked for very large fortune 500's, both as an FTE and a contractor has admittedly made me very cynical, but these roles just reek of being \"cut-ready\". As in, when the company decides they need to \"re-align\" or \"shift priorities because of a challenging business climate\", these are going to be the first on the chopping block. Some outside consultants, taking a page from the movie Office Space, might look at these roles and say, \"So what do you actually do?\"\nThat's not to say these jobs aren't useful nor important. I would just view them as risky propositions. I also think that to succeed in these types of roles, you have to really buy in to the organization's \"vision\", trust what management tells you, and believe that you can make yourself layoff proof by showcasing your value for all to see.\nI possess none of these character traits. I don't even buy lottery tickets so fuck buying into corporate mission statements. I don't trust management. The only 20/20 vision I trust is my own. I would be ill-suited for any type of role such as this. I wouldn't even entertain something like this unless I had a 2nd job, or at a minimum always keep something to pivot too if shit hits the fan always in the pipeline.'",
        "In response to '100% - i work for an enablement company and a lot of customer advocates we have get shuffled around a lot', a user said: 'I worked at a place several years back that had a couple of people that were \"Customer Success Executive\" and \"Corporate Vision Specialists.\"\nI did not know two people that were more consistently nervous in my life. While most of us approached the quarterly company meeting with apathy and boredom, they approached them with dread. Fear that they would announce that the \"numbers didn't meet expectations\" and some reorganization would be necessary.\nI don't mind being completely anonymous and/or invisible at work. But I'd rather be demonstrably useful or critical to the organization than wake up every single day that a changing wind could have me eating Ramen.'"
    ]
}