{
    "username": "Wrong-Marsupial-9767",
    "contributions": [
        "In response to 'Original Post: Quiet Quitting is the only response acceptable to Quiet Firing [External Link]: https://i.redd.it/rhhn62s8a13e1.png', a user said: '\"Act your wage\" - I just lost 9 years of raises thanks to wage compression this year, so I'm only doing what's expected of an entry-level employee.'",
        "In response to 'The fuck is wage compression? Where they pay cut everyone to a static wage so it’s easier on payroll? I hope you’re looking for another job right now.', a user said: 'Wage compression:\nWhen companies offer higher starting salaries to attract new talent without adjusting the pay of current employees\nBasically, the minimum wage jumped in my state, and now they need to offer higher pay to attract new employees, but they didn't adjust the scale for existing workers. I started at this job making $12/hr, which was $3 over minimum wage at the time, and now, after 9 years, I'm making $19/hr - which looks good on paper, except the state minimum wage is now $16/hr, so I'm still making $3 over minimum wage.\nThe worst part is that I'm expected to train kids walking in the door, making as much or more than me, who were in middle school when I started here.'",
        "In response to 'Yeah, that’s a gtfo wage there. I’d be looking to leave asap if they don’t want to compensate. Other jobs will be looking for experience and will pay for it because they themselves fucked up and did the same thing. If minimum wage jumps up by $7 and they don’t give you at least a $3-4 raise, they literally only want to exploit you.', a user said: 'Yeah, unfortunately, I currently have a weird ass availability situation that was grandfathered in post Covid. Also, I'm on my fourth department manager, and even while doing the bare minimum, they treat me like the best worker they've ever seen.\nI was looking for new work up until a few weeks ago, but now it looks like we're heading for another recession, so I may end becoming \"essential\" again.'"
    ]
}