{
    "username": "Wyldfire2112",
    "contributions": [
        "In response to 'I agree with this 100%. Also, conflating \"quiet quitting\" and \"work to rule\" implies that fulfilling your contractual obligations without going above and beyond is some form of highly disruptive protest. It should not be called “quitting” either.  “Quiet quitting” is a perfectly reasonable way for a worker to achieve a work-life balance and not be complicit in their own exploitation, while still actually doing the job.', a user said: 'Exactly.\nQuite quitting is trying to demonize standing up for your rights by making normal fulfillment of your job expectations appear like Work to Rule or malicious compliance.'",
        "In response to 'The really dumb thing is that \"work to rule\" is literally just doing what you're paid for. I don't get why it is seen as a bad thing. Why is there an expectation you should go above and beyond? It's a straight contract of money for labour.', a user said: 'Actually, Work to Rule is also known as \"malicious compliance.\"\nIt's following every rule and regulation to the letter, regardless of common sense, and not taking any shortcuts at all even if those shortcuts do nothing but make your job easier and faster.\nWork to Rule is stuff like, if the policy says you have a tool you need many times a day that's supposed to live in a specific tool cabinet that's to be kept locked at all times when not in use, and the key to that cabinet is supposed to never leave the shift lead's posetion, then\neach and every time you need the tool\nyou go to the shift lead, inform them you need the cabinet unlocked, sign all paperwork to check the tool out, ensure the cabinet is re-locked, go do the work, go get the shift lead\nagain\n, check the tool back in, then go back to your station to continue working until you need the tool again.\nMost people would check it out at the start of your shift and returning it at the end, and nobody would say anything because you use it so often common sense indicates it's \"in use\" the whole shift... but that's not what the actual rules as written say to do, so you do exactly what the rules say.'"
    ]
}