{
    "username": "Xarthys",
    "contributions": [
        "In response to 'Wie viele Mails und Terminanfragen ich nach 21 Uhr bekomme ist unheilig. Das erzeugt einfach eine gewisse Erwartungshaltung, wenn alle anderen auf der Arbeit so etwas machen, aber ich sehe das auch nicht ein. Wenn ich frei habe, habe ich frei.\nFür (Ab-)Rufbereitschaft müsste ich ja auch bezahlt werden.', a user said: 'Wie viele Mails und Terminanfragen ich nach 21 Uhr bekomme ist unheilig.\nDas ist nicht nur unheilig sondern auch vollkommen unprofessionell und deutet auf extrem ineffiziente Strukturen hin.\nWenn in einem Unternehmen regelmäßig alles kurz vor knapp gehandhabt werden muss und die regulären Arbeitszeiten nicht ausreichen, dann ist das ein Symptom dafür dass grundlegende Prozese nicht richtig laufen.\nWoran das konkret liegt ist unterschiedlich, aber es gibt immer einen guten Grund dafür, und es liegt definitiv nicht daran dass der reguläre Arbeitnehmer zu wenig schuftet.\nDass hier dann auch keine Optimieriungsprozesse stattfinden, sondern man einfach nur versucht Leute zu Überstunden zu zwingen etc. zeigt auch dass die entsprechenden Führungsrollen nicht adäquat besetzt sind.\nKurz: wenn ich um halb 11 noch emails bekomme, dann ist das nicht unnötig, sondern peinlich. Es beudetet nämlich dass die Leute über mir ihren Job nicht machen, trotz Boni, Firmenwagen und Arschgekrieche.\nMan lässt sich eben nicht mehr verarschen. Wir sehen alle wer was leistet und wer nur so tut. Die Chefetagen müssen sich endlich mal am Riemen reißen und ihren Beitrag leisten, oder sich selbst aus der Misere ziehen. Es gibt genug Unternehmen die Menschen wertschätzen, die Sklavenzeiten (zumindest in D) neigen sich zum Glück dem Ende.'",
        "In response to 'Bei meinem Bruder in der Firma war auch die Verwunderung groß, hat monatelang Überstunden gesammelt und seinen Job übererfüllt. Außer Lob und auf die Schulter klopfen ist wenig bei rum gekommen außer noch mehr Stress. Als er nach Auszahlung der Überstunden und Gehaltserhöhung gefragt hat kamen erst die Ausreden - da sie ihn aber unbedingt für ein Auslandsprojekt brauchen bei dem er fest eingeplant ist hatte er halt alle Karten in der Hand. Was er verlangt hat war auch absolut nicht übertrieben sondern wirklich nur angemessen, auch auf meinen Rat hat er sich da nicht mit leeren Versprechen abspeisen lassen sonder hat es halt ausgesessen und dann einfach gesagt er unterschreibt die Erkärung für den Auslandseinsatz erst wenn das geklärt ist. Sein direkter Chef und Abteilungsleiter waren auch auf seiner Seite von daher weiß ich garnicht woran es dann so lange gescheitert ist.\nEnde vom Lied er kriegt die Überstunden ausgezahlt, wurde arbeitstechnisch etwas entlastet, kriegt mehr Gehalt und ist bald für 1.5-2 Jahre im Ausland und hat jetzt auch die Zeit sich darauf ordentlich vorzubereiten.\nWieso man manchmal wirklich bis kurz vor der Kündigung das was einem zusteht einfordern muss werd ich nie verstehen. Er hat sich vorher auch Jahre lang den Arsch aufgerissen und dann lässt man das bei einem der Leistungsträger wirklich so weit eskalieren. Naja gut jetzt ist langsam Gras über die Sache gewachsen und er ist zufrieden wie es läuft.\nEin anderer Kollege von ihm hat sich da vor mehreren Jahren mit leeren Versprechungen abspeisen lassen und wartet bis heute auf die versprochene Gehaltserhöhung - da gibts wohl alle 6 Monate einen anderen Grund wieso es jetzt gerade schlecht ist und er doch noch die ein oder andere Bedingung erfüllen müsse.', a user said: 'Wieso man manchmal wirklich bis kurz vor der Kündigung das was einem zusteht einfordern muss werd ich nie verstehen.\nWeil die alle hoffen dass man als Arbeitnehmer dann doch nen Rückzieher macht wenn Druck aufgebaut wird und die Aussichten auf eine Gehaltserhöhung etc. erstmal schlechter aussehen als gedacht.\nWenn in der Chefetage mal jemand mehr will, wird da gar nicht viel diskutiert, da klopft man sich noch gegenseitig auf die Schulter für ein Bombengehalt - aber wehe irgendjemand weiter unten möchte die tatsächliche Leistungen entsprechend belohnt sehen ...\nSind einfach alles egozentrische Arschgeigen, kann man leider nicht anders sagen.'"
    ]
}