{
    "username": "XavierMalory",
    "contributions": [
        "In response to 'Women whose career opportunities end with making coffee and men who stay so late they might not even go home between workdays:\nit's a mystery us lowly peons will never figure out.', a user said: 'Let's not forget wages so poor, they don't allow a couple to afford a house and car in this day and age, let alone\none\nperson.'",
        "In response to 'considering the context here is Japan, while wages are low, or rather haven't risen since the 80s or something, abandoned houses are all over the place, so that is less of an issue. and the biggest barrier to getting a car should you need one, is getting a parking space... Urban Japan is wild.\nfun fact: the yen has become so weak, Japanese people have mostly given up on the idea of going abroad, leading to further deterioration of their second language skills, which where terrible to begin with.\nit's a very strange dystopia, not gonna lie. but at least the food is nice.', a user said: 'I've long been saying Japan is the canary in the coal mine for the US (due to our influence on them since the end of WWII).  This in of itself (along with other cultural factors) is very disturbing.'",
        "In response to 'I’m a member of a Slack group with a bunch of fairly distinguished ex-colleagues. These people are all type-A, highly qualified, high performing, smart and creative, ambitious people including directors, VPs, senior principal individual contributors, even a few executives.\nHow companies treat people in the US has declined so rapidly over the past few years, that even this group of highly motivated and well paid professionals has mostly said “fuck it”. We were discussing the current state of affairs in the US and most of the people in this slack said something similar to “I don’t care anymore. If they are going to treat me this way, then I will put in the bare minimum to avoid being fired.”\nIt’s kind of astonishing to me to hear these ambitious, hardworking, type-a people say this, and I think companies vastly underestimate how much cost cutting and micromanagement disincentives their high performers.', a user said: 'Clearly these top-tier folks aren't getting appropriate top-tier compensation.\nCan't say I blame them for emptying their GAF bag. I would too.'",
        "In response to 'If everyone had an extra 1-2 hours per day to sleep, or exercise, or cook at home, how much healthier would we be?', a user said: 'Living proof of this.\nWhen COVID hit and I went to WFH status, I lost 100 pounds in a year.  Driving 2 hours a day, 5 days a week, is one of the worst things to impact one’s health. Having time to go to the gym and cook healthy meals for my family went a very long way.'"
    ]
}