{
    "username": "XfitRedPanda",
    "contributions": [
        "In response to 'Original Post: Minnesota among top 5 states for quiet quitting’ [External Link]: https://www.fox9.com/news/minnesota-quiet-quitting-jobs-2022', a user said: 'So there are mechanisms in place to prevent workers from being paid their value, but now people are vilified for just doing their job?\nIf a company does not inspire workers to go above and beyond then I would argue that management is ineffective in creating an engaging workspace.  And yes, that is a companies responsibility.\nI've worked for companies that say things like \"we expect you to find your own development opportunities.\"  That sort of language kills organizational commitment and engagement.'",
        "In response to 'i’ll go above and beyond when it means i’ll get recognized and compensated for it, not this thing that’s been happening for years where not doing extra work means you’re not meeting expectations. that just happened to my sister and she immediately started job hunting. she just…performed her job well, exactly as described, and was told that she’s not meeting expectations. of fuckin course you’re not gonna do more if it doesn’t mean you’ll get paid for doing more.', a user said: 'This is why around 50% of the workforce is considered dissatisfied.\nJob descriptions are purposefully vague to allow for garbage like this.'",
        "In response to 'I work for a branding agency that implemented a \"career path\" for your titles that came with compensation brackets for each title level. Once people started asking for the money they were entitled to under that system they threw it out and moved to a lateral \"shoulder to shoulder\" system where \"titles are only guidelines.\" The whole thing's a scam.', a user said: 'Yeah that's pure garbage'",
        "In response to 'If a company does not inspire workers to go above and beyond\nYou know what inspires me to go above and beyond? More money.', a user said: 'Studies show that's not a lasting effect actually.\nTrue engagement are things like managers that spend time developing employees, mentorship programs, recognition, etc.'",
        "In response to 'Recognition and career development is fine and good but with today’s inflation, more money is still the starting point before you look at those other things. There isn’t a substitute for being able to pay your bills and save a little extra.', a user said: 'Right, but consider the value of more money drops off once people can cover their expenses.  After that the other pieces are more significant in moving the needle for employees.\nIf a person is considering leaving a position making 110k but they get to work from home vs a similar position making 125k but they're in the office 3+ days a week.  The deciding point would probably be the cost of time (along with responsibilities and etc).\nA job making 40k vs 60k however, money is going to play more of a significant role.'",
        "In response to 'I really don't think the average American is anywhere near making over six figures; the 40-60k range is significantly more common.', a user said: 'I don't disagree, but the point is that at some point money stops being one of if not the main driver.'"
    ]
}