{
    "username": "xithbaby",
    "contributions": [
        "In response to 'Yup, this is what happened and is still happening to me. I get to do the job of 4 people because I’m a good employee. At this point, I just do the bare minimum because I’m tired of it but then again if I don’t do the work of 4 people, then I get in trouble. Lose/Lose situation really.', a user said: 'They can’t fire you for doing your job. If you’re being punished then you need to open door it and explain your situation. Stop allowing them to take advantage of you. They are manipulating you because you’re allowing it. Do your job and that’s it. Tell them they need to hire more people if they want more done because you’re working yourself to death and cannot continue this.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'No…\nThey’re the generation that believes that hard work pays off, and that’s because back then it did. Our grandparents could buy a house on one income while having kids and saving for vacations every year. They could order a house off a sears catalog for under $3k and build it. They could take loans out whenever, there was no credit score back then. They were basically handed a 800 score when they came out and then they bought up all the cheap real estate and rent it back to us.\nBut they shut the door behind them and kicked all generations after them off the the ladder. We make less than they did in every aspect if you account for inflation. We pay x10 more than they did for our vehicles, median price for houses is almost half a million. They did this. They voted to make it like this and they’re the loudest to say we are lazy. They don’t comprehend inflation at all and they are all retiring and are reaching the age they will die off so they can no longer vote outdated ideology, and halt progression. People like Moscow Mitch can fuck off, soon very soon.'",
        "In response to 'Yall forget learning good hard work ethic is something you cant just turn the fuck off. Thats why alot of old people run circles around the youth. Its like a traumatized inherited skill exploited to hell.', a user said: 'Im wondering if someone my age even has a chance to work up in amazon. I’m a rehire but before I asked to do a lot of things, like problem solver. I’m 41 and I didn’t see anyone above probably 30 working in higher positions and most of the problem solvers were like 19. One of the kids on the AR floor looked 12. My AM was most likely 20 years old..\nI was always in the top 15 for stowing in the building, I had good work ethic but they passed me up for problem solving twice. I didn’t bring attention to myself and didn’t cause drama. I even got a shoutout during stand up in pack while I was cross training for doing such a good job my 3rd day. Still.. nothing. I signed up for every thing but was never picked. I’m going into outbound this time so hopefully it’ll be different.'"
    ]
}