{
    "username": "xte2",
    "contributions": [
        "In response to 'Someone owns the homes. Not being able to afford housing is a very real issue in Germany.\nHere’s another quality of life ranking with similar rankings. Feel free to adjust the sliders yourself as you see fit.\nhttps://www.worlddata.info/quality-of-life.php', a user said: 'Homes in Germany, France, Spain are another problem: with MINOR thresholds they have taxed on succession around 50%, so essentially no one invest in quality homes or in homes at all because money can be moved avoiding the state-made robbery but homes can't.\nUnfortunately most people fails to understand that so there are only little push to change.'",
        "In response to 'Hardly anyone actually pays 50% estate tax in France.\nFor children the tax-free amount is 100k and the rest is subject to a progressive tax with rates which go over 20% only for amounts >500k.\nAlso, there are ways of organising the succession to pay less.', a user said: 'Yes there are ways\nwise people\ndo use, not all, and there is still the robbery.\nBecause there is no interests in building something \"for the family\" if you loose so much from a generation to another, so homes should be disposable like cars.\nIt's the consideration of \"single individual in the society\" vs \"families in the society\" who ruin the social, economical development. If you are a human in the society you only work for you. If you are a family member you work in the society for your family and in that case you work for something that go beyond your life so you do much better.'",
        "In response to 'Original Post: Japan's historic work ethic is declining—45% of workers admit they're quiet quitting [External Link]: https://fortune.com/article/japan-work-ethic-declining-45-percent-of-workers-quiet-quitting/', a user said: 'IMVHO we are at a turning point in most societies of the world: IT is the nervous system of any modern society but MOST people, not only but specially not so young cohort, oppose such evolution creating a social fracture between those who want evolving and those who want stop the train of history.\nSince the latter are mostly in higher social positions i.e. they \"rule\", hence we witness such phenomenon.\nIt's not much tied to a specific culture but to a mere technological shift some embrace and some oppose in various cultures with similar social effects.'"
    ]
}