{
    "username": "Xyldarran",
    "contributions": [
        "In response to 'same deal with China. while they've certainly been up to some hijinks since Tiananmen Square, they've at the very least put a bunch of money into modernizing the country and bringing a shitload of people out of poverty. their dedication to having a physically fit and educated population also seems to be paying out dividends.\nmeanwhile, in that same time, we've seen public trust erode, the transfer of wealth to the 1% at the cost of quality of life for nearly everyone else, and something like half the population of our country is one ER visit away from absolute financial doom with a government that doesn't seem all too concerned  with people losing their livelihoods or their kids getting murdered at school. how do we remain competitive when we just keep taking and taking from the working class with no accompanying plan to enrich their lives?\naround the time of the TikTok Ban threat, my wife was on RedNote and a pretty consistent thing that kept happening was that Chinese folks would be asking about the propaganda they'd been told about the US by their government, and asking Americans to clarify something they saw as being clear bullshit - and, nope, all the things other countries get told about how shitty things are for people here is just a truth that people from those countries find very confusing for the \"richest country in the world.\"\nand, yeah, sure, it's easy to say that all those interactions are also just Chinese propaganda, but, \"America #1\" is a major cornerstone of our own propaganda, but, it turns out being #1 means you should have extremely low expectations unless you were born rich. I'd rather have the kind of propaganda backed by things making my life better that I can easily show people, rather than just believing in it while hoping to god nothing goes wrong in my daily life.', a user said: 'China has a bunch of problems of their own to deal with.  They're aging out at an incredible rate that combined with one child means a demographic bomb going off relatively soon.  They simply won't have enough people to work in factories.\nAnd the worst thing about Trump's tarrifs isn't just it's gonna suck for us.  He's right they will very much do deep damage to China.  He's just going to burn us all with it.'"
    ]
}