{
    "username": "yazalama",
    "contributions": [
        "In response to 'It boils down to greed.  Investors and executives are demanding more and more profit.  There's only so much pie to go around.  There's two main ways to generate more profit (short term), either increase revenue, which is hard to do, or reduce costs, which is easy to do (again ... short term).\nIf only one company did this, they would simply go out of business due to high turnover and bad product.  The issue we have now is that most companies are jumping on the \"cut costs\" train because it makes short term numbers look good.  CEOs are making SOOO much money these days, they only need to work a few years at that level to be set for life, so they don't care about the long term.  Workers can't go to a different company because they're all doing the same thing.\nSince US politics is based on\nbribes\ncampaign donations from rich \"donors\", workers have no legal representation or a way to change the system other than to form unions.  Unchecked late-stage capitalism allows all this corruption and greed to take place, and there are many types of\neconomic systems\nthat would fix these issues, but the first step is to get money out of politics.  Without that, we're all slaves.', a user said: 'It boils down to greed.\nEverybody is greedy.\nYou're greedy when you want your company to pay you more, and the company is greedy when they want to pay you less. Eventually the market finds an equilibrium because people prefer exchanging value.\nSince US politics is based on bribes campaign donations from rich \"donors\", workers have no legal representation or a way to change the system other than to form unions. Unchecked late-stage capitalism allows all this corruption and greed to take place, and there are many types of economic systems that would fix these issues, but the first step is to get money out of politics.\nAgree with your premise, but not your conclusion. We need to get politics out of money, not the other way around. If the politicians have no power to tilt the scales one way or the other, then the person making the bribe has no incentive to bribe anymore, cutting off the problem at its roots.'"
    ]
}