{
    "username": "YoungZM",
    "contributions": [
        "In response to 'I think employers are having a hard time with the fact that younger generations now hitting their prime in the workforce have way less tolerance for current working conditions.\nThis isn't the 1950s anymore. Wages have stagnated for too long, the cost of living keeps going up, and I'm expected to work harder and faster to make your shareholders more $$$$ while I take a pay cut every year.\nI saw my parents struggle and get sh*t on for their loyalty and hard work. I know what to expect.\nSo yeah, no thanks. You're getting what you pay for.\nI dunno what the solution is, but I don't care. I value my time way more than I value the literal pittance thats provided.\nBetter start getting more TFWs Canadian businesses :p', a user said: 'I think employers are having a hard time with the fact that younger generations now hitting their prime in the workforce have way less tolerance for current working conditions.\nI have this conversation with my mom too often. She's not an employer but seems to take severe offense to the fact that everyone junior to her in age \"doesn't work as hard\" -- which, to be fair, they don't. She takes a sadistic satisfaction from working herself to the bone for very little and has all her life. I keep asking her not why others aren't working as hard, but why she is. There's a difference between being a hard worker putting in an honest day's work and generating value and then sacrificing your person for someone who will dispose of you easier than the gum on their shoe should they want to on a whim while calling you family to your face.\nReally, what this is, is a magnificent display of Stockholm syndrome.'",
        "In response to 'Exactly, trying to paint these things in a negative fashion.\nTruth is that both of these things are positives for the worker. If companies are starting to get scared, good.', a user said: '...and this morning I read an article naming quiet applying as the saviour for workplaces and employees alike.\nAs you may imagine, it was the most tone-deaf masturbatory article from corporate about how employees should be grateful to be given new opportunities by being shuffled within an organization via borderline intimidation and promises of pay discussions later -- ie.: also the norm. The article even had the gal to put the onus on employees enduring this madness to be the ones to bring up pay and the benefits to their person.'"
    ]
}