{
    "username": "zephyrdark",
    "contributions": [
        "In response to 'Working and exchanging one's time and energy for money/currency is actually quite a new concept in the grand scheme of human history.\nThink back and think bigger, what do humans do back then before the invention and proliferation of currency? They spend most of their time finding food, processing food (I have always wondered how humans of different regions stumbled upon variations of cooking and accidentally created so many kinds of cuisines, it's almost miraculous), building shelters, exchanging stories (creating myths, folklores, and in turn cultures/identities/religions etc), playing music, wonder about/observe nature (thus deriving the marvel that is natural sciences and mathematics).\nMaybe those who have a proclivity towards taking it easy and tang-ping just so happens to think things in the grander scheme of things and what life is, or rather, what more life can be. Some people are lawyers, some people are doctors, some people are business owners and so there is a possibility some people are more spiritually gifted who strives on different things that aren't so obvious in our money-minded society... No right and no wrong.\nMaybe, by inadvertently engaging in capitalist societies, we humans are so tunnel-vision'ed in this so-called default mode of existence, thus depriving ourselves of so much more explorations that could have made humanity so much more vibrant and healthy than just facing excel sheets all day, replying to emails, sitting around in cubicles all day for 5 ludicrous straight days (with only 2 paltry days to be yourself and do your own things), shiny skyscrapers, fancy cars, vacuous job titles and etc.\nWhy is capitalism the default, why everyone just accepted it as it is and why can't there be something else?\nHahahaha, irony as I type these at my desk at work.\ndreams', a user said: 'Thus the issue lies with what are we working for.\nWork for an organisation that strives to improve meaningful things & share them to others for replicating (healthcare, sustainability, safety, etc.) = good & beneficial to humanity.\nWork for an organisation whose sole purpose is to maximise profits = only benefits the greedy people who will not necessarily pass the benefits along.'"
    ]
}