{
    "username": "Zerly",
    "contributions": [
        "In response to 'The youngs at work have made it EXTREMELY clear that they don't care about anybody's input if you're over 40. We are the enemy as far as they are concerned. Fine, make stupid, expensive mistakes because you don't want to listen to the olds tell about the four other times we tried the same thing. Don't care anymore, I guess they they can figure it out for themselves. Or not. Whatever.', a user said: 'I switched jobs but in the same area. All the people I worked with left after they got a new, terrible, manager. I tried to help, I offered up training, I pointed out errors before they went live, but I was ignored. I recently got a talking to about an email I sent pointing out some egregious errors that went live that were brought to my attention by clients. I was told my tone was aggressive.i pointed out that it wasn’t my tone, it was the person receiving it reading tone into it because they were tired of me pointing out mistakes.  I was then told that it’s been a long time since I have done the job and a lot has changed (it hasn’t, as we are heavily regulated and regulations have been the same for at least a decade) and that processes have moved on. So I stopped. Our reputation within our organization has already tanked since this manager joined, so fuck it, let it leak out into the open. Not my houses, not my rodeo. But when we get audited my ass is covered and I do not give a single fuck.  But hey, what do I know? I just invented half the processes they follow.'",
        "In response to 'That is infuriating. You're right, fuck it all, let it burn. The important thing is that you CYAed yourself. Let the others swing in the breeze if they're not smart enough to either listen or CYA themselves.', a user said: 'It’s been fun watching them make the mistakes I put systems in place to mitigate or eliminate. But hey, I’m just a middle aged lady, what do I know? I am just going to keep sweeping my side of the street.'",
        "In response to 'Thank you! When I first heard it I legitimately thought it was just people actually quitting their jobs without notice. People being outraged over everyone just doing the job they’re paid for is fucking stupid.\nHonestly though, it almost makes me think that that’s what it is. Media companies trying to act like this is some huge thing to stir up shit and keep us fighting each other and not large corporations and the wealthy like we should be.', a user said: 'I thought it was when you slowly start taking all your personal stuff home and slowly start extracting yourself and then you bounce.'"
    ]
}