{
    "username": "zgehring",
    "contributions": [
        "In response to 'Original Post: [Discussion] Pod Save America - \"Is Biden Quiet Quitting?\" (12/17/24) [External Link]: https://crooked.com/podcast/is-biden-quiet-quitting/', a user said: 'Reflection post incoming.....\nThere's something very disorienting and unsettling about the delivery of this content and the hard juxtapositions between what's being communicated (i.e., strong indicators of the coming administration's authoritarian intentions) and the obligations of podcast performance (i.e., commercial breaks, segue ways, personality, and general strategies implemented to maintain listeners and subscribers). It reminds me of Neil Postman's \"And now...this\" type of thing. And I'm not saying this to suggest that the pod bros need to \"do better\" (although I do share many of your concerns and frustrations with their content lately). And yeah, I know I'm being, perhaps, a little too reflective here. However, one of the reasons I've stopped listening as much is because it intensifies my feeling of hopelessness and loss of control (to whatever degree I've had it before). It's just weird to have Lovett making false claims about Trump as a joke, and then Favs and Tommy have to make some qualifications to distance themselves from Lovett. Yes, it's performed as a joke (I think?), but based on what they were reporting on (Trump's suit against ABC and potentially the Iowa Register), it also is very plausible that they felt the need to do so before making a quick transition into the next awful story about potential developments of the new administration. Anyway, that was just a small example of what triggered me when listening to this episode.\nI don't know..I realize we all are dealing in our own ways. I'm a PhD student with a wife and daughter in public school. I'm trying to find ways to fight back in whatever way I possibly can (financially, calling reps, attending protests when available, joining my local DSA chapter, etc.) - but constantly hearing about RFK Jr., Patel, Musk, Trump against the apparent absence of any Dem strategy to fight...ugh.'"
    ]
}