{
    "username": "Zomburai",
    "contributions": [
        "In response to '\"I'm not going to go above and beyond, I'll do my job and that's all\"\nYeah, and that's exactly what they were hired for. Their job. People who go above and beyond are the people who get promoted to the next position. This has always and will forever be the case.', a user said: 'People who go above and beyond are the people who get promoted to the next position.\nThat's the myth, and to be fair it's a compelling one.\nThe reality more often is that you get to a position and then stop advancing, either from too-stiff competition at the positions you're applying for or because you're perceived as\ntoo\nvaluable in that position. At that point, it becomes more beneficial to go to a different company for better pay, or a perceived chance at upward mobility.\nAnd all of that ignores that some jobs don't\nhave\nupward mobility (small businesses) or people get promoted for reasons other hard work (kissing ass, nepotism, favoritism).\n\"The hardest workers get promotions\" sure looks good on a coffee mug, though.'",
        "In response to 'The reality more often is that you get to a position and then stop advancing, either from too-stiff competition at the positions you're applying for or because you're perceived as too valuable in that position. At that point, it becomes more beneficial to go to a different company for better pay, or a perceived chance at upward mobility.\nI think your last sentence answered your question. The companies that don't care losing their best workers probably do what you describe, but those who want to retain talent know that they need to increase the pay as the competence of the worker improves or they will lose him/her.\n\"The hardest workers get promotions\" sure looks good on a coffee mug, though.\nIt's not just a slogan. It should be the guiding principle for a manager who wants to maximize productivity that he/she gets out the employees.', a user said: 'I think your last sentence answered your question. The companies that don't care losing their best workers probably do what you describe, but those who want to retain talent know that they need to increase the pay as the competence of the worker improves or they will lose him/her.\nSure. But my point was, it's not a given. Even in an industry requiring highly in-demand trained skills, it's not a given.\nIt's not just a slogan. It should be the guiding principle for a manager who wants to maximize productivity that he/she gets out the employees.\nGiven how many managers don't use this as a guiding principle and how often companies take their people for granted, me saying it's just a slogan is already giving it a lot of credit.'",
        "In response to '[Deleted or Empty Comment]', a user said: 'I mean, I've seen those things in\nevery\ncompany I've worked for.\nI've worked small business restaurants where there's literally no promotions to be had.\nI've worked chain restaurants where managers were hired over the people killing themselves night-in-night-out.\nI've worked for a distributor where one salesman trained in near every aspect of the business to make himself as indispensable as possible, left for greener pastures when they wouldn't give him a raise. The distributor we worked together at replaced him and the distributor he left for still had him as a salesman, the last time I talked to him.\nI worked for large, international corporation where several of my\nextremely\ncompetent teammates (and me, for that matter) interviewed for our open manager position, and the company ended up hiring someone from outside the business.\nSo, like... I'm super glad that the companies that you've worked for reward loyalty with promotions, I guess? But that's\nnot\nuniversal. I'm not even sure how it could be, with so many people in companies and so few positions at the top of the ladder.'",
        "In response to 'I'm talking about software engineering because that's what I do. I completely agree that when I used to work for small companies, especially in the restaurant industry, that didn't apply.', a user said: 'So you would agree that \"hardest worker gets the promotion\" is actually incorrect advice for a lot of the people reading this conversation?'",
        "In response to '[Deleted or Empty Comment]', a user said: 'I'm not claiming my anecdotal experience is universal, I brought it up to show other guy that\nhis\nexperience isn't, either. Do try to keep up.'"
    ]
}