{
    "username": "zvive",
    "contributions": [
        "In response to 'Has anyone here ever worked somewhere, had a supervisor quit, then had to do the supervisor's job, but while being told they can't actually make you officially the supervisor yet, just so they don't have to give you a pay rise? I've known several people who have had this happen to them, and they get strung along with the promise that\neventually\nthey will have the title and pay rise. No one should fall for it.\nEdit to avoid angry mods: Yes. I wholeheartedly support Silent Quitting and Acting Your Wage.', a user said: 'Kinda happened to me but it was more like they brought an idiot fast talker who claimed to understand tech stuff to be my manager after I'd shown my grit. The CEO claimed I didn't do anything.\nI was making 10 dollars an hour working for a satellite company. I was given a manual And told my job is to know everything about these receivers so I did just that. I ran broadcasts for churches and hospital education systems and I was the best at finding techs to go instead a satellite.\nHell I got someone to fly a puddle jumper to the Yukon for a satellite install ON BUDGET!\nI added up all the installs I did and how much they made just from those not even the broadcast fees just installation .. They paid 150, charged 600.\nIn one year I'd earned them 130k.\nI made under 30k. I was asking for a 2 dollar raise since I didn't get the management thing.\nThey said fuck off, I was nice and gave two weeks notice after my strongly worded email. One of the nicer execs begged me to stay and write a SOP book on my job.\nThat's all I did wrote 45 page pdf. My wife worked there too which was awkward but whatever.\nAfter I left there first broadcast was so bad my wife called and said they were begging I said I'd come in for 30 an hour consulting fee. They said GTFO.\nThe client was worth 6 million per year, and basically said without me they're out.\nThis was their number one client. I left in September the company folded before November.\nTell me again how valueless me job was... Is what I'd say to that CEO if I ever saw him again. Kinda got some PTSD from that job getting walked all over but the vindication in the end felt nice.\nOh, btw:\nF\nU\nC\nK\nT\nS\nR\nP\nU\nE\nM\nZ\nP\n!\nSave 3rd Party Apps!'"
    ]
}